{
  "episode_number": "185",
  "episode_title": "How to Build and Sell Apps with No Code with Billy Howell",
  "guest_name": "Billy Howell",
  "business_name": "Stupid Simple Apps",
  "transcript": "﻿Nikolas Hulewsky (00:01.078)\r\nBilly, I'm so stoked to have you back. For those of you who didn't catch my episode with Billy, Billy is a prolific entrepreneur. He doesn't have any tech quote unquote background, but he's been building. He's been five coding. He's built. I'm going to correct myself because I messed up last time. You've built more than 60 apps. I don't know how many you've sold. I accidentally said Billy's sold, you know, 55 apps, but he's you've built a ton and now you have an agency around helping entrepreneurs either finish or even build their own custom.\r\n\r\n\r\napps using AI, correct? Okay.\r\n\r\n\r\nBilly Howell (00:32.878)\r\nCorrect, yeah, I probably officially sold maybe 10 of those 70, which isn't a bad hit rate, I guess.\r\n\r\n\r\nNikolas Hulewsky (00:36.822)\r\nAll right. That's still a lot. Yeah. It's an amazing hit, right, dude? so I reached out to you cause I wanted you to come back on so you could teach me how to build a chat bot. It's something that I've been messing around with. There's a couple of use cases for it. The biggest use case that I was thinking of about is for my podcast. Cause like I've had a bunch of interviews. It'd be nice to go query and say like, Hey, who did I talk to about X, Y, and Z or which companies were the largest that I spoke to? Whatever.\r\n\r\n\r\nBilly Howell (00:41.58)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (01:06.144)\r\nBut I think there's also lot of small business use cases for chatbots like onboarding, orientation, HR questions, the sales process, just internal SOPs, et cetera. So I'm excited to learn from you today on how to build a chatbot.\r\n\r\n\r\nBilly Howell (01:21.602)\r\nYeah, that's great. There's so much SaaS out there for getting custom chatbots and it can get expensive. I think you could pay 30, 50 bucks a month for one that slaps into your site. And it's really trivial to just kind of spin one up in Replet. All you need is like a Replet account and an open AI key. Yeah. So I think this is a good project because anyone could do it. And once you've done one,\r\n\r\n\r\nNikolas Hulewsky (01:40.075)\r\nReally?\r\n\r\n\r\nBilly Howell (01:51.275)\r\nYou could go show it to like a local business and say like, Hey, can I build this for your site? And then charge them monthly to use it or don't, or just charge them the one-time fee and get them set up because that could be part of your sale. It's like no monthly.\r\n\r\n\r\nNikolas Hulewsky (01:59.244)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (02:06.07)\r\nI think the thing for me that's been the hardest thing to try to figure out, and we'll dive into this, is the context window is limited and I have a ton of transcripts and documents. So I'm trying to figure out how do I get all of the pertinent information that I want to within whatever the parameters that are necessary in order for the chat bot to be successful.\r\n\r\n\r\nBilly Howell (02:27.938)\r\nYeah, that's definitely a hard one. There's a couple different ways you can kind of expand that. Actually, maybe let's jump into, let me open a screen to share.\r\n\r\n\r\nNikolas Hulewsky (02:46.772)\r\nthe software that you're talking about, like that there are already software tools? Are those tools that kind of already have a plug-in to like say Slack or your email? Or are those tools that I've got to go out, train it on, and then it becomes a chatbot?\r\n\r\n\r\nBilly Howell (03:06.614)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (03:07.958)\r\nProbably both.\r\n\r\n\r\nBilly Howell (03:10.872)\r\nCan't go to the other tab. I was, here we are. Nope, let me open a tab. What, this is so weird. Okay, this is what I was thinking of and this is a pretty solid plug and play solution.\r\n\r\n\r\nNikolas Hulewsky (03:25.942)\r\nEw, can you get me off the screen? Why am I on the screen? Get me out of there. Just a minute. Perfect. I'm so glad I don't have to look at my stupid face anymore.\r\n\r\n\r\nBilly Howell (03:29.294)\r\nIs it? Dude, everything's misfiring today.\r\n\r\n\r\nBilly Howell (03:35.81)\r\nOkay, how about now? Okay, so...\r\n\r\n\r\nThis is ChatBase. This is one of those plug and play solutions I mentioned. So I haven't used this, but someone on my team has used it and kind of recommended it for a project. ChatBase. And like I said, I think you can get started for zero bucks and then go up to 40 for more messages, more agents, more models. We're gonna have 10 links to train on.\r\n\r\n\r\nNikolas Hulewsky (03:45.78)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (03:51.296)\r\nWhat's it called? Okay.\r\n\r\n\r\nBilly Howell (04:10.827)\r\nAnd I don't know the difference between\r\n\r\n\r\nNikolas Hulewsky (04:13.428)\r\nIt looks like you're adding your sources. I'm just like scrolling down on the website. It looks like you have to go in and add the sources that you want. yeah. And sync it with what it, which if you're a company that you're like, our CRM is HubSpot. Cool. Maybe it goes and trains on HubSpot. then you have a, an agent that you can go and query for specific deals with an HubSpot as opposed to having to go to HubSpot and pull stuff.\r\n\r\n\r\nBilly Howell (04:38.796)\r\nYeah.\r\n\r\n\r\nBilly Howell (04:42.455)\r\nSo I'm exactly, let's see, I'm not exactly sure on how we can do the context window thing. My instinct is to use OpenAI assistance. so this is like, so think of like there's two different like types of endpoints you can do on OpenAI. There's more, but like there's the main one that's like chat, like you send it and it just takes the prompt and it responds.\r\n\r\n\r\nNikolas Hulewsky (04:42.646)\r\nThat makes sense.\r\n\r\n\r\nBilly Howell (05:09.671)\r\nThe assistant is like you get a unique ID and it just creates a new assistant as if you'd open a chat GPT window and it will remember context. And so I use that when I need context, but I don't know when that window evaporates and how big it can get and how we can kind of figure that out.\r\n\r\n\r\nNikolas Hulewsky (05:30.103)\r\nThat's a really interesting question because I know that like chat TPT upgraded their memory, so to speak. So it's like, it remembers other chats, but it doesn't remember everything. And obviously there's a fundamental tension between speed and accuracy. many times it opt, it optimizes for speed over accuracy. So it's not always pulling the correct information. What I've actually started doing with some of my chats is after a long chat in particular, I'll be like,\r\n\r\n\r\nplease create me a context document that I can upload to a project that will allow me to pick up where I left off, essentially, is the prompt. So that's been good, but for these larger, like I have 200 transcripts, right? And each transcript is like 45 minutes. And even if I clean it to the place where, hey, get rid of filler words, get rid of ums and ahs and likes, it's still going to be far more than a million tokens. So I don't...\r\n\r\n\r\nBilly Howell (06:12.727)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (06:28.106)\r\nI don't know if that's where then you get into a situation where it's, what's that called? It's like not RSA, RAF, R-A-F, with an AI? No, I don't know. Okay. There's something where you can kind of have like multiple databases and then the AI effectively, RAG. Thank you, RAG. What is that?\r\n\r\n\r\nBilly Howell (06:37.996)\r\nI don't know.\r\n\r\n\r\nBilly Howell (06:47.039)\r\nrag.\r\n\r\n\r\nYeah. Yeah. So.\r\n\r\n\r\nI'm just gonna Google it real quick because I'm gonna mess it up.\r\n\r\n\r\nNikolas Hulewsky (06:57.504)\r\nNo, you're good.\r\n\r\n\r\nI'll make sure Mohammed edits the Google part out and he'll just be like, his is exactly what rag is. Billy's so smart.\r\n\r\n\r\nBilly Howell (07:08.457)\r\nI'm not sure if this is what it is, but the solution that you're talking about, there's something called embeddings in OpenAI. It'll take in a bunch of text and kind of condense it down, I think, into that AI language that they can parse quicker. Do know what I mean? Where it's like the weird symbols.\r\n\r\n\r\nNikolas Hulewsky (07:32.566)\r\nMm-hmm, totally, yeah, yeah,\r\n\r\n\r\nBilly Howell (07:38.326)\r\nit can query that faster and use less memory. Open AIs text embeddings measure the relatedness of text strings. Embeddings are commonly used for search, clustering, recommendations. So this is a possibility we could use embeddings. that's like, you got like your assistant that we talked about, and then it'll have kind of these embeddings where it stores kind of this data on Open AI.\r\n\r\n\r\nNikolas Hulewsky (07:56.371)\r\nOkay.\r\n\r\n\r\nBilly Howell (08:04.365)\r\nAnd the first time I used this, I used it for one where it was querying a bunch of SKUs from a CSV for e-comm, for store to write SEO articles about them. And I ran it and it's kind of slow and I was like, huh, and there's like 60,000 SKUs. And I went and I looked at my usage and just like one run blasted like $10, $20 worth of tokens because yeah, because I had uploaded on accident, there's just so many.\r\n\r\n\r\nNikolas Hulewsky (08:27.317)\r\nWhat?\r\n\r\n\r\nHoly crap.\r\n\r\n\r\nNikolas Hulewsky (08:34.132)\r\nYeah.\r\n\r\n\r\nBilly Howell (08:34.302)\r\nembedded skews. So I think you just got to be careful about it. I definitely wasn't doing it correctly.\r\n\r\n\r\nNikolas Hulewsky (08:40.126)\r\nOkay, let's not do anything super complicated, I do want to dig in. okay, I like this.\r\n\r\n\r\nBilly Howell (08:42.583)\r\nYeah, I think we're gonna ask chat GPT. I want to make, cause it'll know better than us. I want to make, let me dictate real quick. I want to make an app where I can upload transcripts from my podcasts and then have an AI chat bot on top that can answer questions about those chat scripts. I have about 200 transcripts they're all pretty long. What's the most efficient way using OpenAI's documentation to give the chat bot context of all those documents?\r\n\r\n\r\nSo we're gonna ask a Chet Chippity and hopefully it'll tell us.\r\n\r\n\r\nNikolas Hulewsky (09:19.476)\r\nlove hearing how people do prompts. I feel like I learn something every time I hear something. Because everybody does it different. At least for me, it's not like you hear everybody else how they do their prompts. So it's just nice to hear. Anyways, it's cool.\r\n\r\n\r\nBilly Howell (09:32.145)\r\nI've noticed lately, think about when chatGBT first came out and how we would all start with, you're a marketing expert, you're a software developer, and now we all just kind of defer to it as the expert on everything. We don't say that anymore. Isn't that strange?\r\n\r\n\r\nNikolas Hulewsky (09:40.075)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (09:46.911)\r\nYeah, that is interesting. I do still use it if I want it to act a certain way, not necessarily have a certain knowledge base. Yeah, if I'm like, hey, I want you to be a no-nonsense evaluator of business processes. Don't sugarcoat things, but don't be rude, right? It's like, because many times when I ask it a question, it'll be like, what a thoughtful question. That's a great idea. I'm like, I don't want you to be happy for me. I just want you to give me the freaking best answer.\r\n\r\n\r\nBilly Howell (09:53.271)\r\nSure.\r\n\r\n\r\nGotcha.\r\n\r\n\r\nBilly Howell (10:16.394)\r\nOkay, so it pretty much gave us the answers we talked about. So it's talking about chunking. So just pulling out important chunks of the transcript. I was actually thinking a shorthand way to do it would be have OpenAI summarize the documents and just put the important information. So you could be like, hey, my episode was so-and-so, and then it would know to go in there and then query that.\r\n\r\n\r\nNikolas Hulewsky (10:16.767)\r\nAhem.\r\n\r\n\r\nNikolas Hulewsky (10:44.662)\r\nOkay. Can I show you something that I actually did before? It's not up to date. I wish it was up to date, but...\r\n\r\n\r\nNikolas Hulewsky (11:02.262)\r\nmy chat GPTB normal walk.\r\n\r\n\r\nNikolas Hulewsky (11:06.656)\r\nCome on, Chad, GPT.\r\n\r\n\r\nNikolas Hulewsky (11:11.68)\r\nCrap out on me now. Have you ever had to go through and delete things from your chat GBT?\r\n\r\n\r\nBilly Howell (11:19.604)\r\nI delete chats every once in a while, just to get out of the way. you ran out of storage?\r\n\r\n\r\nNikolas Hulewsky (11:22.312)\r\nIt forced me one time.\r\n\r\n\r\nNikolas Hulewsky (11:26.582)\r\nApparently. Which I didn't think was possible.\r\n\r\n\r\nNikolas Hulewsky (11:33.044)\r\nBut it is,\r\n\r\n\r\nNikolas Hulewsky (11:38.23)\r\nNikolas Hulewsky (11:42.932)\r\nto edit some of this so that we don't have as much dead space.\r\n\r\n\r\nNikolas Hulewsky (11:52.823)\r\nAll right, I found it. So this is what I did originally. And like I said, I probably did this a month ago, so it doesn't have my most recent podcasts. But...\r\n\r\n\r\nNikolas Hulewsky (12:10.794)\r\nSo what I did was I have all my podcasts in a folder, transcripts, and then I went to Google app scripts and I ran a script essentially that went and populated this spreadsheet with OpenAI's summary of my podcast. And so I asked it to find guest name, business name, industry, business type, whether they started or bought it, location, revenue, employees, funding type.\r\n\r\n\r\nBilly Howell (12:38.016)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (12:39.55)\r\nAll these things, what was the key tactical advice? What was the best quote? What's a one-line summary? Just everything that I thought it would need in order to have the context necessary to answer good questions. I think this might be the easiest way to do it is to just create this podcast database spreadsheet and then a chat bot that goes and queries this. What do think of that?\r\n\r\n\r\nBilly Howell (13:06.102)\r\nYeah, yeah, I mean, I think we are gonna need something like this anyway, so that it could be like, so if you ask like, hey, what do we talk about on Sam Thompson? Like you could do that quickly versus kind of, yeah, all right, let's do that.\r\n\r\n\r\nNikolas Hulewsky (13:16.458)\r\nYeah, let's just try that. I'm gonna give it to you in this chat. How do I do it?\r\n\r\n\r\nNikolas Hulewsky (13:27.414)\r\nThere's the link.\r\n\r\n\r\nNikolas Hulewsky (13:32.63)\r\nBecause this is where I get tripped up where it's like, okay, cool, I have the data, but how do I actually build a chatbot?\r\n\r\n\r\nBilly Howell (13:40.685)\r\nYeah, I think what we'll end up doing is because the vector embedding stuff, the rag stuff is a little complex. And you have to do it in a custom database. And I'm sure it's easy, I've just never done it, but you can't do it in Replet to my note. I mean, you could, but not natively with their database. So yeah, let's do the spreadsheet and have it look at the titles and stuff.\r\n\r\n\r\nNikolas Hulewsky (13:46.87)\r\nYeah, that's totally fine. Let's not do that.\r\n\r\n\r\nNikolas Hulewsky (14:04.096)\r\nCool. I just sent you the link to the spreadsheet in Twitter and...\r\n\r\n\r\nNikolas Hulewsky (14:16.15)\r\nas well.\r\n\r\n\r\nBilly Howell (14:22.348)\r\nSo I'm gonna download, yeah.\r\n\r\n\r\nNikolas Hulewsky (14:22.486)\r\nWhile you're that up, give me one second.\r\n\r\n\r\nNikolas Hulewsky (15:09.586)\r\nfor him so he can edit this. Peace out.\r\n\r\n\r\nNikolas Hulewsky (15:20.214)\r\nDude, podcasting, I'm like 100%, that unintended consequences that I love is that it records all my conversations. It's just so cool. Well, now have like a transcript, I can go and query it and I learned so much from these conversations.\r\n\r\n\r\nBilly Howell (15:28.608)\r\nYeah?\r\n\r\n\r\nBilly Howell (15:35.734)\r\nThis spreadsheet's legit, dude. You've got a lot to work with here.\r\n\r\n\r\nNikolas Hulewsky (15:39.478)\r\nI it's the first thing I ever built where I had to use What's it called code? And my chat you yeah, well chat you be to told me what to do and then I went to Google Apps scripts Which I'd never heard of and I was like, okay cool. I guess I'll run a script. I felt like such a coder\r\n\r\n\r\nBilly Howell (15:57.6)\r\nThis is sweet. The only thing that's missing is, I'm gonna just pull out a couple, but I want the transcript text in its own column so we can just upload this whole CSV, you know?\r\n\r\n\r\nNikolas Hulewsky (16:09.27)\r\nMm.\r\n\r\n\r\nBilly Howell (16:14.507)\r\nSo I'm just gonna do a couple of these. But I mean, actually what you have is like pretty good already.\r\n\r\n\r\nNikolas Hulewsky (16:23.414)\r\nWell, if what we're trying to do is just...\r\n\r\n\r\nBilly Howell (16:27.829)\r\nYeah.\r\n\r\n\r\nBilly Howell (16:42.676)\r\nalso, I added a column and I'm editing this, so sorry if I mess it up.\r\n\r\n\r\nNikolas Hulewsky (16:47.115)\r\nyou're good. I mean, I know how to run it now, so... It's not a big deal.\r\n\r\n\r\nBilly Howell (16:52.233)\r\nAlright, so let's download the CSV of this transcript. And then I'm going to share my screen.\r\n\r\n\r\nNikolas Hulewsky (17:01.11)\r\nOkay.\r\n\r\n\r\nBilly Howell (17:08.395)\r\nOkay, so I've already talked with ChatGPT about how we're gonna do this. I'm gonna give it this download. Okay, here's what our database of podcast info and transcripts looks like.\r\n\r\n\r\nBilly Howell (17:30.603)\r\nContinue. Walk me through.\r\n\r\n\r\na web app.\r\n\r\n\r\nthat has a chatbot look at the title and the date and the.\r\n\r\n\r\nthe snippets and the summaries that I have in there and then finds the relevant episode and then looks either in those snippets and then into the transcript if it doesn't find what it needs in the snippets or the episode information to answer my questions. Let's see.\r\n\r\n\r\nNikolas Hulewsky (18:13.59)\r\nI see you talk to text a lot, which is cool. Do you use the, I don't even know what to call it, where you're like talking to the AI function?\r\n\r\n\r\nBilly Howell (18:23.523)\r\nThe chat GPT has just a straight to audio. I do that a lot. I do that when I'm driving and I'm trying to work through an idea. It's pretty cool.\r\n\r\n\r\nNikolas Hulewsky (18:31.53)\r\nYeah.\r\n\r\n\r\nThe only problem with this for me is the latency.\r\n\r\n\r\nIt's too fast. I'm serious, because I'll be talking and then I'll pause like I just did there, right? And it'll jump in and kind of cut me off. So many times mid idea. What I need to do is like at the beginning.\r\n\r\n\r\nBilly Howell (18:52.915)\r\nI just, can't you just like hold your finger down or no?\r\n\r\n\r\nNikolas Hulewsky (18:57.3)\r\nNo, that's the talk to text, but you can actually, you can actually be talking with it.\r\n\r\n\r\nBilly Howell (19:04.755)\r\nYeah, on the iPhone.\r\n\r\n\r\nNikolas Hulewsky (19:06.418)\r\nmaybe. I don't know. What I need to do is just say, hey, I'm gonna talk to you. Don't answer me until I say, okay, chat GPT, it's your turn. You know what mean? That's what I need to do. I just haven't done it.\r\n\r\n\r\nBilly Howell (19:16.063)\r\nMust be user error, mine works pretty well.\r\n\r\n\r\nNikolas Hulewsky (19:18.248)\r\nI'm an idiot, Billy. I never said it wasn't user error. I'm just telling you why I don't like it, okay? All right, so what did you just ask it?\r\n\r\n\r\nBilly Howell (19:28.509)\r\nSo I asked it, can you walk me through a plan for building this web app? And it kind of responded with a goal. The data fields that we have, it looked at that CSV and read it. And then it's giving a stack here of what we should use. And it's giving us like some example code. I'm going to tell it, okay, now write me a PRD, product requirements document, outlining this plan for our AI developer in Replet.\r\n\r\n\r\nNikolas Hulewsky (19:32.884)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (19:42.852)\r\ncool.\r\n\r\n\r\nBilly Howell (19:57.013)\r\nDon't be opinionated about what stack to use except open AI for the AI. And don't put any code snippets. Just outline a plan on how to build.\r\n\r\n\r\nNikolas Hulewsky (20:08.694)\r\nOkay, I've never heard PRD, what is that?\r\n\r\n\r\nBilly Howell (20:12.138)\r\nproduct, I think it's product requirements document or project, but it's basically what you like hand an engineer to have them build a feature or an app.\r\n\r\n\r\nNikolas Hulewsky (20:22.254)\r\nAnd so telling it telling chat GBT like I'm trying to build a PRD it knows that there's certain things associated with a PRD That it needs to include in there. That's cool\r\n\r\n\r\nBilly Howell (20:30.92)\r\nYes, and I've just kind of stolen this term. I've never worked as an engineer. I don't think I've ever seen one of these in a real workplace. So it's pretty much just like a planning document. But you could see it does user flow, technical requirements, success metrics. So it's templated based on something. OK, so we're going to take this. Yeah.\r\n\r\n\r\nNikolas Hulewsky (20:37.428)\r\nRight?\r\n\r\n\r\nNikolas Hulewsky (20:49.11)\r\nOkay. Yeah.\r\n\r\n\r\nNo, because I'm always like that. I'm just like, there has to be a template for it. I don't want to reinvent the wheel. Like what needs to be included in this? So that's PRD. I love it.\r\n\r\n\r\nBilly Howell (21:01.066)\r\nAnd then I have this funny thing, I've had it up for as long as I've had OpenAI, where in the prompt I say, like, ask me three questions at the end of every response about, like, something I might need to know more about, and it's helpful sometimes.\r\n\r\n\r\nNikolas Hulewsky (21:14.218)\r\nI'd never thought of that until I started doing a lot of deep research. And deep research is the only thing that actually asks you questions. And I was like, that's nice to have. So I started doing it. But I think that's freaking genius. You've been doing it for way longer.\r\n\r\n\r\nBilly Howell (21:28.554)\r\nCan you see Replet? All right, we're getting to the fun stuff now. I've pasted this PRD in and I'm gonna say build a web app based on the attached PRD.\r\n\r\n\r\nNikolas Hulewsky (21:30.47)\r\nI Hi Billy.\r\n\r\n\r\nBilly Howell (21:44.778)\r\nWe'll need a database. I don't even know, that might confuse it. We can add that in after we start. I'm gonna let it do auto. It'll probably just choose modern web app, but just not gonna touch it.\r\n\r\n\r\nBilly Howell (22:01.608)\r\nAnd it's going to have this PRD in the file tree. It's going to be saved so that it can refer back to it. So if you're ever talking with like the replica agent or assistant, you can add the file that you pasted in and say, Hey, go back and look at that plan that we made.\r\n\r\n\r\nNikolas Hulewsky (22:01.91)\r\nSo repl...\r\n\r\n\r\nNikolas Hulewsky (22:18.198)\r\nDude, can you do that in chat GPT?\r\n\r\n\r\nBilly Howell (22:22.694)\r\nNo, I don't know. That would be sweet.\r\n\r\n\r\nNikolas Hulewsky (22:25.696)\r\nBecause I've uploaded so many documents and then later in the thread I'm like, can you actually look at this language of this contract? And it'll be like, I don't have access to that anymore. Obviously if you upload a project.\r\n\r\n\r\nBilly Howell (22:35.55)\r\nYou would think because chat jpt is local, you'd be able to, you know, make it work. Huh.\r\n\r\n\r\nNikolas Hulewsky (22:40.735)\r\nYeah.\r\n\r\n\r\nI mean, it works for projects, Like, I have a chat with GPT projects, like go refer to the project docs, but if it's just a chat, it doesn't, I love how, that's freaking cool, man.\r\n\r\n\r\nBilly Howell (22:54.674)\r\nOkay, we're looking at Replet's kind of going through the planning process of the app we just told it to build. And this is kind of a newer feature in Replet, but we've got kind of like this plan and approval screen where it's saying this is what the initial version is gonna be. Here are all the features and we can get rid of ones that we don't want. So I think we could go through them. Yeah, we need CSV upload. Yeah.\r\n\r\n\r\nNikolas Hulewsky (23:15.584)\r\nThat's really cool. So instead of waiting for it to spit out the version and you're like, I don't like this, this, and this, you're able to approve before him.\r\n\r\n\r\nBilly Howell (23:25.788)\r\nYeah, right, so you don't have to go back and remove bad code. It's going to go ahead and do a visual preview, but it's just the front end.\r\n\r\n\r\nSo we want the first two, we want the third. This is good, this will save us tokens. Attempts to answer using summaries. We'll see. This works.\r\n\r\n\r\nThat works. Like ideally like future state, would be like, yeah, you talked about this on this episode, here's a link to it and then pull up like a nice card that shows all the episode information. You can like click to expand and see the transcript.\r\n\r\n\r\nNikolas Hulewsky (24:05.334)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (24:10.614)\r\nI really like this approval thing because so many times I've tried to play it, I do lovable but replete and lovable obviously are similar. It'll spit something out and then I'm like, oh, I don't like this, change it. And then it'll change it, but it'll also change something else. Or now it's in the code and the fix is like a fix, but it should have just, you should have just gone back and recoded it the right way the first time, you know what I mean? So I think that's a really cool feature.\r\n\r\n\r\nBilly Howell (24:23.529)\r\nMeh.\r\n\r\n\r\nBilly Howell (24:31.39)\r\nYeah.\r\n\r\n\r\nBilly Howell (24:36.49)\r\nAnd then I haven't really touched these later ones. I don't know how much it really matters. I think it'll just give this as like, hey, do this after it's done all of these. But then the other thing I don't really know, someone from Replit tell me, how would I even, like say I wanna remove this and then add a new one. How would I do that? Because all I see is the only input is approve or delete, right? So it's a mystery.\r\n\r\n\r\nNikolas Hulewsky (25:04.596)\r\nI have no idea. Come on, Replet.\r\n\r\n\r\nBilly Howell (25:06.332)\r\nApprove. Yeah, come on, replicate it together.\r\n\r\n\r\nNikolas Hulewsky (25:08.662)\r\nWhy isn't this perfect yet?\r\n\r\n\r\nBilly Howell (25:11.857)\r\nWhy isn't it perfect?\r\n\r\n\r\nAll right, so now we're in Replet and we've got our preview of the app here. This isn't like a real live preview. It's just like basically showing us like HTML, like the front end code. Like it's not attached to anything. It's not interactable yet. And then this is the agent. So it popped in that stuff that we saw earlier and he's gonna work right here and tell us what he's doing. And in the meantime, what else? I think I'm gonna go ahead and just create a database.\r\n\r\n\r\nLook, it's kinda, it's doing some CSS stuff.\r\n\r\n\r\nNikolas Hulewsky (25:49.494)\r\nI know what CSS means, for people who are listening that don't, because I do, what exactly is CSS?\r\n\r\n\r\nBilly Howell (25:53.62)\r\nPray.\r\n\r\n\r\nBilly Howell (25:57.328)\r\nIt's cascading style sheets. So first there is HTML, which is what you're looking at here. This is like what websites look like in the nineties. And then CSS came along and it's like an extra file that makes rules for, like make everything as a header blue, like make every button styled like this. So it's styling in like a global sheet. And we've kind of evolved past it. Like most people use Tailwind now, which actually is just like,\r\n\r\n\r\nNikolas Hulewsky (26:18.31)\r\nBilly Howell (26:26.365)\r\nThey write those little rules, like make this blue and make this 30 pixels. They just write it in the name of the element. And I think it's easier for AI to do it that way. But that's kinda how it goes now.\r\n\r\n\r\nNikolas Hulewsky (26:42.304)\r\nSo it's essentially a style guide.\r\n\r\n\r\nBilly Howell (26:44.307)\r\nYeah, it's a style guide to make everything cohesive.\r\n\r\n\r\nNikolas Hulewsky (26:50.07)\r\nThat's the way my Neanderthal brain needs to understand what it is.\r\n\r\n\r\nBilly Howell (26:55.401)\r\nAnd well, I saw this guy make like a inflammatory site that was like this, like it was like effing HTML.com and he dropped it and it was like, this is like an HTML site. Like you don't need like JavaScript and all these complex stylings and animations for your simple informational landing page. Like this is a button. Look how good it looks. It's just HTML. And I kind of love that. So I want to try to build.\r\n\r\n\r\nlike an app or like a landing page that's just HTML. I think it fits really well with like the ethos of my agency, which is stupid, simple apps. I really like that because I don't care. I don't care about like perfect UI that much because most of the apps I build are internal tools for businesses and they just want it to work, right? It's not, yeah, it's not, it's not Flappy Bird or\r\n\r\n\r\nNikolas Hulewsky (27:33.261)\r\nfor sure. Yeah, that's beautiful. That's a great idea.\r\n\r\n\r\nNikolas Hulewsky (27:44.502)\r\nLike this chatbot. I don't care how cool it looks.\r\n\r\n\r\nBilly Howell (27:51.99)\r\nI can't think of an app with like amazing UX. That was the first one that came to mind, but you know, it's not an iPhone app, right? Table one, that'll be my example. My buddy's company, Table One, has really good UI, and it's a mobile app. But back to the task at hand here, I'm gonna save us some time, and I'm gonna come in here and create a database, because I know we're gonna need to store the CSV information. I'm just gonna click Create Manually, because\r\n\r\n\r\nNikolas Hulewsky (27:57.351)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (28:06.294)\r\nSounds amazing.\r\n\r\n\r\nBilly Howell (28:21.445)\r\nOftentimes, the agent won't, it won't create one for you unless you tell it to. So I'm just gonna have it here and now it'll just see like, an open port to a database and it should know that it has something that it can build in. Yeah.\r\n\r\n\r\nNikolas Hulewsky (28:35.702)\r\nWait, so, sorry, do that one more time. Where did you add the database?\r\n\r\n\r\nBilly Howell (28:41.171)\r\nI went down here and I clicked on database and then there was a big create button. There's a create manually, which I clicked and there's an ask agent to set up for me. And I just didn't do that.\r\n\r\n\r\nNikolas Hulewsky (28:44.822)\r\nJust create. Okay, okay, okay.\r\n\r\n\r\nNikolas Hulewsky (28:49.558)\r\nYou said that the nicest way anyone has ever called me an idiot and I appreciate it. You were like, I just went here, obviously you weren't looking, and clicked this button that says database and then the big button that says create new database. So that's how I did it.\r\n\r\n\r\nBilly Howell (29:05.129)\r\nWell, I mean, I'm just so used to this workflow now that I need to slow down sometimes because even if someone's really good at AI coding, like, they may be used to like the lovable interface and everything's slightly different.\r\n\r\n\r\nNikolas Hulewsky (29:18.358)\r\nWell, because I would have, I would have me using it because I'm not as skilled as you. would have been like, okay, well now I got to do the API call to my Google sheet. Right. but you can just add the database here, which is awesome.\r\n\r\n\r\nBilly Howell (29:28.84)\r\nRight.\r\n\r\n\r\nBilly Howell (29:32.647)\r\nYeah, and I just don't, whenever we do these quick builds, I wanna stay away from Google Cloud integrations, because it takes five, 10 minutes every time. Go create a new cloud project, set up a redirect URL. It's very frustrating, and I know there's probably better ways to do that quicker.\r\n\r\n\r\nNikolas Hulewsky (29:52.872)\r\nIf you were building this long term though, would you have done it the other way?\r\n\r\n\r\nBilly Howell (30:00.288)\r\nMaybe, but-\r\n\r\n\r\nNikolas Hulewsky (30:02.752)\r\nLike is it better to have a local database like you're doing here building within Replet or have it go call out to wherever the database.\r\n\r\n\r\nBilly Howell (30:07.753)\r\nA real computer engineer would probably say a database because you have more control over the structure. You can't go into a bunch of emojis like you could into Google Sheets and break the whole app. And to me, it's less complex, which I guess would be the word simple. It's simple to just input a CSV each time as you need it. I think there's less things that can break. But yeah, guess long-term, like consumer internal app, I would do it.\r\n\r\n\r\nto do a Google Sheet.\r\n\r\n\r\nBilly Howell (30:42.279)\r\nAnd it's still going. It takes a decent bit to get these initial apps built, but it does such a good job. And it's using Claude's on it for under the hood. Well, I don't know what for, because the way Replet works is a cocktail of different AI's. it may be like, okay, Claude's the best at databases. We'll have him do the database task.\r\n\r\n\r\nOpenAI is the best at generating interfaces. We're gonna use that. Gemini is best for this, right? But I just know that they added Claude for whatever recently, which is like the hot new one.\r\n\r\n\r\nNikolas Hulewsky (31:25.334)\r\nSo when you created the database, did you like copy and paste or did you put the CSV in? You haven't done anything? Okay, cool.\r\n\r\n\r\nBilly Howell (31:30.761)\r\nI haven't done anything yet. It's literally an empty database right now.\r\n\r\n\r\nIt's not an empty database. It's already migrated in. So it's matched at CSV. Okay.\r\n\r\n\r\nNikolas Hulewsky (31:41.354)\r\nDid you have to tell it to match the CSV?\r\n\r\n\r\nBilly Howell (31:46.417)\r\nNo, and you know what? I should have at the beginning in that prompt uploaded the CSV so it had it to look at. But I believe the PRD probably did a good enough job describing it. And so this is nice, so I won't have to go expose in OpenAI key. But if you're doing this at home, you would go OpenAI API dashboard. And it's like so many clicks to get to. I need to bookmark it. So here, platform.openai.com.\r\n\r\n\r\nAnd then you'll go into API keys and create a new one and paste it in. And then Replit's nice. It'll ask you, do you want to save this as a global variable? So I've just got one API key that's stored that I can use for demos like this. But it's important, like if you're building on a real app, to get your own unique keys so that in OpenAI you can monitor, like, this app's using this many credits, right? So you can kind of tell.\r\n\r\n\r\nBilly Howell (32:44.562)\r\nSo, gonna add it.\r\n\r\n\r\nNikolas Hulewsky (32:44.768)\r\nHow much money do you spend a month right now on just personal apps, not for your dev shop where you've created things for people, but in either open AI or just token spend?\r\n\r\n\r\nBilly Howell (32:50.471)\r\nYeah.\r\n\r\n\r\nBilly Howell (32:58.546)\r\nHmm. I probably, probably like 50, 60 bucks on replet just like kind of running the agent. And then the apps themselves don't use a ton, except I have one like internal app that my team uses set.com one that uses like a decent amount of replet database storage because it's, I did it super inefficiently and there's so much data. and then, so, okay, so say 50 bucks on Reddit, replet tokens.\r\n\r\n\r\n20 bucks or whatever for the membership, so it's 70. Then, I mean, like the open AI, you could see.\r\n\r\n\r\nNikolas Hulewsky (33:39.127)\r\nCan I tell you a cool tool that I think you should build for people who are vibe coding? I think you should build a dashboard that tells them how much spend they're at either that day or per month or whatever. Because every single person I've spoken to who vibe codes has been like, dude, I lost 500 bucks that day. Everybody has had like a mistake just because they didn't go and look and see what the usage was. So I think that would be a cool tool.\r\n\r\n\r\nBilly Howell (33:51.314)\r\nHuh?\r\n\r\n\r\nBilly Howell (34:03.047)\r\nYeah?\r\n\r\n\r\nThat's a great idea. So I think the tally is 70 bucks on Replet, looks like 10 bucks on OpenAI calls, and then 15 bucks on Windsurf, which is what I use when I'm editing code locally. But that would be really great and probably easy to build to just make a usage dashboard for all of them. I mean, so it would be really great. I know there's like solutions like Rocket Money that will look at like your credit card statements and tell you like your SaaS expenses.\r\n\r\n\r\nNikolas Hulewsky (34:22.518)\r\nshould be, right?\r\n\r\n\r\nBilly Howell (34:35.462)\r\nbut I would love to pull in all my business costs, like SaaS, and then API costs, right, into one dashboard. And even, it would be cool to segment it by client or project, that would be sweet.\r\n\r\n\r\nNikolas Hulewsky (34:44.95)\r\nIt would\r\n\r\n\r\nNikolas Hulewsky (34:49.568)\r\nWell, and it would be nice because you can go into your credit card and that's a backward looking statement of like what you've already paid for usage. It would just be nice. You could set it for like every three hours or at the end of every day where it just goes pulls the usage and then like populates it in your dashboard. Just so you know, like, today was way. Why such a big spike today? So you can cut it off early as opposed to wasting a couple hundred dollars.\r\n\r\n\r\nBilly Howell (35:11.388)\r\nYeah, yeah. And I think most of them have this, like Replet and an OpenAI, you can set a threshold to like send you an email and then like a threshold to like cut off. So you're not gonna accidentally run up a $100,000 bill.\r\n\r\n\r\nNikolas Hulewsky (35:22.144)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (35:26.038)\r\nYeah, agreed.\r\n\r\n\r\nBilly Howell (35:28.392)\r\nOkay.\r\n\r\n\r\nOkay, so it says, built podcast Q &A web application, created chat interface, added CSV upload functionality, implemented smart search, set up episode transcript viewing system. Okay, let's give it a shot.\r\n\r\n\r\nNikolas Hulewsky (35:46.294)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (35:50.39)\r\nthink it goes to like 150.\r\n\r\n\r\nEpisodes, I'll see. 152, yeah, just ask it like a random, what?\r\n\r\n\r\nBilly Howell (35:57.608)\r\nLook at this. Zero episodes uploaded successfully, 137 errors. So, I'm pretty sure I know what it is though, okay. The upload failed. Take a look at our CSV and make sure the app is expecting the correct header columns.\r\n\r\n\r\nNikolas Hulewsky (36:03.702)\r\nOh, go, go, go, go, go, go, go, go,\r\n\r\n\r\nBilly Howell (36:24.231)\r\nthe database schema as needed to. So I just think it was guessing on what the columns would be called. It didn't know because we didn't feed it at the beginning.\r\n\r\n\r\nNikolas Hulewsky (36:37.984)\r\nDid you add the transcript text in here?\r\n\r\n\r\nBilly Howell (36:42.151)\r\nI added a column and I went in manually and pasted in transcript text to like three of them. Because it just, it gets sticky with, okay, I don't even know how to get OpenAI to go open a Google doc, right?\r\n\r\n\r\nBilly Howell (37:04.135)\r\nIt's like ridiculously good, like to the point where like I've got like a couple projects or like apps that I've been kind of slowly chipping away at for a month or two in Replet. And I almost want to just blow them up and start from scratch because this agent is just so good from the get go. It's improved a lot.\r\n\r\n\r\nNikolas Hulewsky (37:26.91)\r\nReally? Just in this, just in the like, how long have you been doing this? Eight months? Jeez Louise.\r\n\r\n\r\nBilly Howell (37:28.283)\r\nYeah, last month or two, yeah, I would say this agent's gotten a lot more powerful. I mean, just as the open AI and Thropic improve their models, then it's gonna raise the tide of all of these AI builders. It's incredible. we're pretty much like, anytime like, the start is like anytime like a Nvidia chips get more efficient or whatever in three months, Billy's gonna be able to make a Replet app better, right?\r\n\r\n\r\nNikolas Hulewsky (37:56.596)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (38:04.918)\r\nOkay, so you went in and tried to fix the database, essentially.\r\n\r\n\r\nBilly Howell (38:08.539)\r\nYeah, the agent's doing it for me right now.\r\n\r\n\r\nBilly Howell (38:16.169)\r\nI do have something cool I want to show you at some point.\r\n\r\n\r\nsomething I'm working on.\r\n\r\n\r\nThis is so bizarre, but I was thinking about this game that I used to play with my family on vacation a lot called Ultimate Werewolf or something, and it's like cards, and it's like that game where there's one or two werewolves, everyone else is a villager, and the werewolves kill people at night, and then you argue, and you vote someone out, and you try to get rid of the werewolves. Yeah, no, exactly, it's like mafia. I was thinking how...\r\n\r\n\r\nNikolas Hulewsky (38:45.758)\r\nAnother game is like Mafia. Mafia was that game growing up with kids. Yeah, yeah.\r\n\r\n\r\nBilly Howell (38:54.075)\r\nhow fun would it be to make like an online version of that with AI as players, but you don't know who's AI and who's people. And that way you can just keep having games going because AI will fill it in. So I made it in Replet and it's like, I think I'm gonna launch it soon. It's like, it's very funny.\r\n\r\n\r\nNikolas Hulewsky (39:12.054)\r\nDude, well, I wanna, did I talk to about the game that my son and I play every Sunday? It's a geography game. It's so stupid. It's like, I shouldn't even call it a game, but I've just got a prompt in chat GPT and I'm like, hey, my son is a fifth grader. I'm a 39 year old man. Create a quiz for us on geography that makes it equally as difficult for both of us. Keep score. We're gonna do three rounds and it does the rounds and like,\r\n\r\n\r\nBilly Howell (39:18.331)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (39:40.853)\r\nIt's awesome, it's so fun because it asks him a question first and then me a question and it's like 10 questions per round. The best part is at the end, I've got this prompt where it's like, all right, write a victory speech for me. And so it'll be like, in the victory speech, it'll call out all the stuff that he missed that should have been super easy. And then, yeah, then I'm like, write a concession speech for the runner up. And so then it writes a speech for him, it's like.\r\n\r\n\r\nBilly Howell (39:59.944)\r\nThat's so good\r\n\r\n\r\nBilly Howell (40:09.664)\r\nthat's so good.\r\n\r\n\r\nNikolas Hulewsky (40:09.972)\r\nWell, dad, you've lived for almost 40 years. I'd be surprised if you didn't know the answer to these questions. It's just a roast. Anyways, it's fun and we play it every Sunday night.\r\n\r\n\r\nBilly Howell (40:19.355)\r\nThat's the, so I'm thinking about how to turn this into an app and literally if we took like that recording, 40 seconds of you describing the app, we could throw it into ChatGPT and say, turn this into a PRD, then throw that in Replet and it would have the functioning app exactly as you described it in like five minutes, yeah.\r\n\r\n\r\nNikolas Hulewsky (40:38.326)\r\nI need to do it, I need to do it. I'm gonna do it now.\r\n\r\n\r\nBilly Howell (40:40.561)\r\nThat's really cool. I like the speeches.\r\n\r\n\r\nNikolas Hulewsky (40:44.252)\r\nYeah, at the end of it, it's so, anyways, we always call mom in and we're like, mom, we know who won tonight and she can hear the roast at the end of it. you know, usually she just rolls her eyes because we're idiots, but it's a fun conversation.\r\n\r\n\r\nBilly Howell (41:00.679)\r\nOkay, so I think we let our little engineer get too far away from his desk here.\r\n\r\n\r\nkind of spinning its wheels and I think what happened was we didn't restart the app so that the changes it made weren't implemented and so I think it's freaking out thinking it was breaking. Which is super avoidable if I just flipped, there's like a setting that I turned off that's like let the agent restart your app at the end and I turned it off because it was annoying me while I was like playing with the app. So most people probably won't have this self-inflicted problem.\r\n\r\n\r\nNikolas Hulewsky (41:18.12)\r\nMmm, that's not as good.\r\n\r\n\r\nBilly Howell (41:36.615)\r\nOkay, perfect, it's working.\r\n\r\n\r\nWait, how did it? It didn't really do that.\r\n\r\n\r\nBilly Howell (41:48.069)\r\nNo, it's lying to me.\r\n\r\n\r\nNikolas Hulewsky (41:51.268)\r\nthat's a big problem. Let's become self-aware and is not lying.\r\n\r\n\r\nBilly Howell (41:58.247)\r\nDude, okay, this is another weird thing that happened to me. I was using Grok. I don't know, do people use Grok? Do you use Grok? I always hear that it's super useful, so I've been trying to experiment with it more, and I was having it do research for me on some real estate data for an app idea this guy came to me with, and I was asking for the data, and it's saying, you can get the data here, here, and then mid-sentence it stopped, and it said.\r\n\r\n\r\nAn email has been sent to the XI developer team with the subject line request for real estate data. And then it kept going like nothing happened. And I was like, dude, like what was that? And it said, it's just, it's an old feature. no email was sent. Don't worry. But I wonder if they're just like spying on us and like, I don't know if they're mining us for ideas or it, it wasn't like an illegal request. It was the weirdest thing. Very weird.\r\n\r\n\r\nNikolas Hulewsky (42:51.956)\r\nthem dude. I wouldn't I mean I wouldn't be surprised. don't worry about that!\r\n\r\n\r\nBilly Howell (43:00.656)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (43:00.712)\r\nIs your name Sarah O'Connor? No? Don't worry about that question. Ew, it was a dumb question.\r\n\r\n\r\nBilly Howell (43:03.142)\r\nHa\r\n\r\n\r\nBilly Howell (43:09.67)\r\nOkay, we have a preview of this app.\r\n\r\n\r\nBilly Howell (43:15.462)\r\nOkay, uploaded successfully.\r\n\r\n\r\nAnd I'm going to go cheat real quick and try to give it a layup. So I'm looking at your spreadsheet. Let's say, what did Raphael say about.\r\n\r\n\r\nBilly Howell (43:33.478)\r\nsmall businesses.\r\n\r\n\r\nNikolas Hulewsky (43:39.765)\r\nAngel Reese.\r\n\r\n\r\nBilly Howell (43:41.286)\r\nHa\r\n\r\n\r\nNikolas Hulewsky (43:45.29)\r\nI had to. mean watching her try to make a layup is...\r\n\r\n\r\nBilly Howell (43:51.717)\r\nI'm going here into Replet real quick and checking in the console because you can see logs of what's going on. I don't know why they're getting kind of cut off like this, that's annoying.\r\n\r\n\r\nOkay, we got an error, so we're gonna copy that in. I got an error.\r\n\r\n\r\nBilly Howell (44:12.582)\r\nPlease? Okay.\r\n\r\n\r\nNikolas Hulewsky (44:12.95)\r\nthought it was just supposed to work.\r\n\r\n\r\nBilly Howell (44:15.462)\r\nPlease find the problem and come back to me when you're 95 % confident you have the solution.\r\n\r\n\r\nBilly Howell (44:25.478)\r\nThis was user error because I didn't give it the CSV to start and then I did the thing where I didn't restart the app after change the code. So this is my fault.\r\n\r\n\r\nNikolas Hulewsky (44:37.076)\r\nI wasn't gonna blame you, but I knew it was your fault.\r\n\r\n\r\nBilly Howell (44:44.774)\r\nSo I have a really cool one. I don't know if I've mentioned this yet, but it connects to Gmail. I'm building this for a client and it pulls in your emails and your spreadsheet, not your spreadsheet, your calendar and it'll pull all the contacts from there and then zip it off to like Hunter IO, enrich the data with like the business information.\r\n\r\n\r\nand then it'll tell you like, hey, you've emailed this person five times in the last month, and it'll kind of give you a green if you're really warm with them, or a red that's like, you haven't been to an event with this guy in two months. So it's kind of business relationship manager.\r\n\r\n\r\nNikolas Hulewsky (45:23.072)\r\nHmm, Claude does, well Claude doesn't do that, but Claude's the only one that I know that actually integrates with your email.\r\n\r\n\r\nBilly Howell (45:30.711)\r\nI had no idea.\r\n\r\n\r\nNikolas Hulewsky (45:32.618)\r\nI literally, like two days ago, did it for the first time. I wish the Chat GPT did it though, that's the only thing. Because Chat GPT has all of my chat history, so it knows me super well, whereas Claude doesn't. So to make it useful, I have to train it.\r\n\r\n\r\nBilly Howell (45:36.708)\r\nI bet that's incredible.\r\n\r\n\r\nBilly Howell (45:48.635)\r\nI forgot that chat GPT like learns about you because I like opened a new chat and asked it to do something for me and it like filled in my name and my fiance's name and like our city. And I was like, whoa, how did you know that?\r\n\r\n\r\nNikolas Hulewsky (45:53.771)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (46:04.138)\r\nDude, go do this. Wait, which one's your main chat or your main LLM? Chat GPT? Okay, go in there, new chat and just be like, hey, what are all the things that I need to do tomorrow? And I'm curious to see what it says to you. I did that for the first time and I was like, holy crap, 90 % of this is accurate.\r\n\r\n\r\nBilly Howell (46:09.824)\r\nchat GPT.\r\n\r\n\r\nBilly Howell (46:24.218)\r\nLet's test the app real quick and see what happens.\r\n\r\n\r\nNikolas Hulewsky (46:27.072)\r\nOkay.\r\n\r\n\r\nBilly Howell (46:31.8)\r\nIs this correct? John Matzner, Darnia Coolia?\r\n\r\n\r\nNikolas Hulewsky (46:33.556)\r\nI can't read it. It's too small for me.\r\n\r\n\r\nNikolas Hulewsky (46:38.462)\r\nMm-hmm. There are two of my guests. Yep. What was the question you asked?\r\n\r\n\r\nBilly Howell (46:42.468)\r\nI just said, what did Raphael say about small businesses?\r\n\r\n\r\nNikolas Hulewsky (46:45.256)\r\nnope, didn't know. He didn't talk about either of them.\r\n\r\n\r\nBilly Howell (46:48.058)\r\nBut so here's the thing, I don't actually see it being stored in the database. So it's doing something weird here. Okay, I was able to upload, but I don't see the.\r\n\r\n\r\nI don't see the CSV data uploaded into the actual database. Can you check the routes that store the data in the database? Troubleshoot, come back to me when you're 95 % sure you know how to solve this.\r\n\r\n\r\nBilly Howell (47:21.67)\r\nSo I think it's just uploading to our browser memory or the memory of the app and doing something funny. So let's make sure it gets in the database in the meantime, maybe. So what am I doing? Am I asking it? Yeah.\r\n\r\n\r\nNikolas Hulewsky (47:36.65)\r\nGo to a new chat and just say, what do I need to get done today? Just say today.\r\n\r\n\r\nNikolas Hulewsky (47:56.843)\r\nhow accurate is what it's spitting out right now.\r\n\r\n\r\nBilly Howell (48:03.493)\r\nPretty accurate, it's reminding me all of these little wedding tasks that I've forgotten. So thanks, chatgbt.\r\n\r\n\r\nNikolas Hulewsky (48:05.525)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (48:10.293)\r\nYeah\r\n\r\n\r\nI can't read it because my screen's too small, but I can tell it's telling you to do stuff. just don't know what it's saying.\r\n\r\n\r\nBilly Howell (48:18.565)\r\nIt's talking about the podcast AI app. It's talking about the werewolf game. It's talking about my agency Stupid Simple Apps. It's talking about my Beehive newsletter. It's name dropping some of my clients to follow up with and it's telling me that I need to design the seal for our wedding invites because I asked it to generate some for me yesterday.\r\n\r\n\r\nNikolas Hulewsky (48:40.278)\r\nThat's so rad. Isn't that cool? I mean, it's scary, but isn't that cool? It's like...\r\n\r\n\r\nBilly Howell (48:41.925)\r\nbizarre.\r\n\r\n\r\nNikolas Hulewsky (48:51.37)\r\nYeah, you're welcome.\r\n\r\n\r\nBilly Howell (48:54.829)\r\nThank you. Thank you, Nick.\r\n\r\n\r\nOkay, so we're doing some more debugging. Okay, says it fixed. Yeah, it was using in memory. I knew it. It was using in memory storage versus the Postgres storage, which is what this database is. It's SQL, which is basically like a programming language where you type in like to search tables, basically. I keep saying basically. Tables of data, so like searchable spreadsheets.\r\n\r\n\r\nNikolas Hulewsky (49:21.462)\r\ntables.\r\n\r\n\r\nIf you ever watch, think you should leave.\r\n\r\n\r\nBilly Howell (49:28.082)\r\nI gotcha. Yeah.\r\n\r\n\r\nNikolas Hulewsky (49:30.026)\r\nWhat's her job? Tables!\r\n\r\n\r\nBilly Howell (49:31.99)\r\nHa ha.\r\n\r\n\r\nNikolas Hulewsky (49:37.248)\r\nAll right, now I'm curious, let's see.\r\n\r\n\r\nBilly Howell (49:40.783)\r\nOkay, give me a different guest name.\r\n\r\n\r\nNikolas Hulewsky (49:43.382)\r\nWhat did I talk to John Matzner about?\r\n\r\n\r\nBilly Howell (49:54.178)\r\nI come on, this is a-\r\n\r\n\r\nslow pitch, what happened?\r\n\r\n\r\nBilly Howell (50:06.725)\r\nReady to go.\r\n\r\n\r\ngave a result and then it disappeared okay\r\n\r\n\r\nBilly Howell (50:20.645)\r\nDatabase, okay, so we have data. Great. When I asked it a question, it popped up a response, and then the response went away really quickly before I can read it. Can you please troubleshoot the chat interface and come back to me when you're 95 % confident you can fix it? Maybe check the database connection to stored messages to make sure that's working properly.\r\n\r\n\r\nBilly Howell (50:49.965)\r\nLook, yeah, it's storing our chat history.\r\n\r\n\r\nNikolas Hulewsky (50:55.447)\r\nOkay, I have to hop, because I have a 2.30 that's waiting for me. Could you send me a link to this when it works? And then I'll just record a like, oh hey, I had to jump, here's essentially what we made. Does that work? Cool. Alright, well, always good\r\n\r\n\r\nBilly Howell (51:11.801)\r\nYeah, can do. Yeah, man.",
  "metadata": {
    "duration": "",
    "date": "2025-06-10",
    "platform_source": "Google Drive"
  }
}