{
  "episode_number": "248",
  "episode_title": "From Middle School Teacher to $1.7M in 10 Months Launching a Drywall Business",
  "guest_name": "Jared Kotter",
  "business_name": "Canvas Drywall",
  "transcript": "﻿Nikolas Hulewsky (00:00.75)\r\nAll right, welcome to Nickonomics. I am with Jared Cotter and on today's episode you are going to hear how a middle school teacher went from no experience to 1.7 million dollars in 10 months launching a drywall business. In a space he had nothing to do with using kind of his secret method of closing at three times the average rate. It's pretty incredible. When I saw it on Twitter, I reached out to him and said, I have to know the entire story and you're going to hear it today.\r\n\r\n\r\nfor the next 30, 45 minutes. So strap in. So my first question, Jared, to you is, what the freak is your business? Like, what is a drywall business?\r\n\r\n\r\nJared Kotter (00:38.469)\r\nYeah, so we do drywall for custom homes. I mean, we can do drywall in anything, finishing a basement or you have a hole in wall, but like the golden sauce really is in custom homes. My business, I actually don't own the entire drywall business. I just am some contracted salesman for another guy who owns the drywall business. And so I just go out and find new jobs and we can get into kind how I do that. then.\r\n\r\n\r\nget a percentage of the profit on every job I bring in. It's great.\r\n\r\n\r\nNikolas Hulewsky (01:09.774)\r\nOkay, so a guy with zero experience, zero sales experience, other than being an LDS missionary, where did you get this idea from? Like how did this even pop into your head? Because you were a middle school teacher.\r\n\r\n\r\nJared Kotter (01:20.993)\r\nYeah. Yeah. As a middle school teacher. Um, yeah, well, I'll be honest. So my, my older brothers, uh, had done this same model previously, uh, for someone else and he'd done it for a few years. Um, had great success then different reasons broke off and started his own drywall business. And so, uh, he had just, um, he had kind of planted the idea in my head forever ago. And then as middle school teacher, I wanted.\r\n\r\n\r\nI really wanted to retire my wife and also own my schedule and so I had to do something. Had a bunch of different ideas and then this one just seemed like the highest probability chance of success in a relatively short amount of time. And so yeah, we dove in.\r\n\r\n\r\nNikolas Hulewsky (02:04.43)\r\nWere you looking at a bunch of different businesses? Were you looking at franchising or starting your own business, buying a business? What did that process look like for you?\r\n\r\n\r\nJared Kotter (02:10.594)\r\nTon of different ideas. Yeah, ton of different ideas. And I had actually dabbled in a couple others too. So like first business I started was a lacrosse training business. I played in college and did that. And that went relatively well. Made a few bucks here and there, but hard to scale and very seasonal, stuff like that. so needed something that would retire my wife. Basically it was the goal. So yeah, dabbled in a bunch of things.\r\n\r\n\r\nkind of like for a long time, just had my feet in too many, in too many ponds or whatever, know, like dabbling in too many things. And then like just had to come to Jesus moment like, I need to pick one thing, all in and just assess like what has the greatest likelihood of success and felt like this was it.\r\n\r\n\r\nNikolas Hulewsky (03:01.91)\r\nYou were launching a bunch of different things? You were trying to make money at a bunch of different Like what were you doing?\r\n\r\n\r\nJared Kotter (03:04.738)\r\nmean, launching is like probably too generous. was just like, it was just like a lot of like entrepreneur, like just I'm going to research this forever and then not do anything about it or like do the first step, you know, and just that like analysis paralysis, like, not this. And I'm going to try this and didn't really ever commit any one thing. Wasn't focusing this like a million women in red dress, you know?\r\n\r\n\r\nNikolas Hulewsky (03:10.346)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (03:31.006)\r\nYeah, no, no, that makes total sense. Why this then? Was it because you'd seen your brothers do it and be successful?\r\n\r\n\r\nJared Kotter (03:36.322)\r\nYeah, I'd seen it being done before and felt like it was the simple, like one of, if not the simplest of the options I was considering also. Just like the recipe for success and doing it is just very, very straightforward. And I could see the math, like, you know, if I contact this many people and I'll close this many and then generate this income. And so, you being a former athlete, like the steps.\r\n\r\n\r\nLike it was very clear to me, like if I do this work, I will get this outcome. And so yeah, that's kind of why I landed on this.\r\n\r\n\r\nNikolas Hulewsky (04:07.214)\r\nHmm.\r\n\r\n\r\nYou know, you have you have two of like my five my five favorite attributes, which are college athlete and LDS return missionary. Like there's something about college athletes because there's a lot of college athletes that don't go on to play professional sports, but they were disciplined and they had to. Of course they were competitive, but. When you become a college athlete, it's just about your skill. It's can you train? Can you be consistent? Can you eat right?\r\n\r\n\r\nCan you prep for those games? Can you be a team player? I think there's just a lot of really good attributes that you develop as a, as a college athlete. And then obviously as an LDS missionary, you just told no over and over and over. And so you've got to figure out how to talk to you, how to sell people, how to actually communicate well. So it's, it's good that you had that skill set, but you actually weren't using those. You're like as a middle school teacher, I mean, maybe trying to convince kids to shut up so they could listen to the lesson or something, but you weren't really using those skill sets.\r\n\r\n\r\nJared Kotter (05:04.194)\r\nSure. Yeah, mean, no, being a middle school teacher was awesome, like really meaningful, yeah, it was, yeah, it felt like there was, I could use my talents in other ways too. And, and especially for me, the number one thing is providing for my family. And so, you know, kind of said that like retiring my wife, you know, I two young kids and like they deserve a full-time mother, I think. And so was like, all right, I need to buckle up and make that happen for them.\r\n\r\n\r\nSo I was really kind of like, why?\r\n\r\n\r\nNikolas Hulewsky (05:34.072)\r\nSo, okay, so tell me, you were in the research phase, you finally landed on this, did you quit your job and go full time or was it kind of a side hustle until you realized, shoot, I can quit?\r\n\r\n\r\nJared Kotter (05:45.992)\r\nYeah, yeah, the timing was funny because I quit. so I could ended the school year, year and a half ago and then I didn't go back. So I ended in may, then I really launched drywall in the next January. So seven months later, whatever that is. And so kind of for that seven months period, like I'm just dabbling in much stuff. I had some other stuff on the side that I was doing too. but like not fully.\r\n\r\n\r\nNikolas Hulewsky (06:04.59)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:14.798)\r\nWhat was it?\r\n\r\n\r\nJared Kotter (06:15.842)\r\nLaunching to that. Like some of the families from the school that I worked at, the private school that I taught at was only K through nine. So once you hit high school, you like aged out. And so a bunch of the kids that I had worked with were in high school. And so those families like hired me to be like their private tutor, I guess. So that was kind of another business that was doing also. So I doing that and I was doing lacrosse coaching and did Christmas lights last year too. Just a bunch of.\r\n\r\n\r\nNikolas Hulewsky (06:45.08)\r\nYou did?\r\n\r\n\r\nJared Kotter (06:45.142)\r\nfunny little things. Yeah, yeah, I did a small number, like, it went well, like, I mean, you've had some guys that have crushed it in Christmas lights on here, and so I was not anywhere in that stratosphere. But it's part time. Sure.\r\n\r\n\r\nNikolas Hulewsky (06:47.694)\r\nHow did it go?\r\n\r\n\r\nNikolas Hulewsky (06:56.354)\r\nmean, they crushed it after like eight years, but year one is always the smallest, right? So you don't need to compare them.\r\n\r\n\r\nJared Kotter (07:03.394)\r\nYeah, I think year one I did like just shy of, I think just shy of 14,000 I think in revenue or something like that. I started super late. I started like mid November. in essentially like six weeks did that. No, I'm too busy now. I've been in this like trying to decide if I'm gonna do it, but I'm just so busy with drywall to be honest. Like I have like 10 houses going right now and so I just don't have the bandwidth. So.\r\n\r\n\r\nNikolas Hulewsky (07:12.142)\r\nDang.\r\n\r\n\r\nNikolas Hulewsky (07:18.478)\r\nAre you doing it this year?\r\n\r\n\r\nJared Kotter (07:31.586)\r\nI'm selling my list actually. Today I'm gonna finalize the sale of my list for like $2,000 just to pass off all my previous clients.\r\n\r\n\r\nNikolas Hulewsky (07:38.482)\r\nGood for you. That's awesome, tell us a little bit about the drywalling business because you're not actually outgoing putting up drywall, are you?\r\n\r\n\r\nJared Kotter (07:41.772)\r\nSo.\r\n\r\n\r\nJared Kotter (07:52.202)\r\nI am doing almost no labor. The goal is I do almost no labor. So my whole, yeah, yeah. Like I obviously work, but I'm not like with a drill gun, putting up the board. Everyone's fine, I see my hands dirty and help out, but pretty rare. Yeah, so like I said, we focus mostly on, mostly high-end custom homes for a couple of reasons. One is cause they just pay the best. It's like solve rich people's problems kind of thing.\r\n\r\n\r\nNikolas Hulewsky (07:54.67)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (07:58.988)\r\nphysical manual labor. Yeah.\r\n\r\n\r\nJared Kotter (08:22.082)\r\nIt's also funny enough, they're the paradoxes. They're probably the easiest client to land also. Like some people think that you want to go after like the big production builders who are doing it a whole neighborhood and you get a contract like 50 houses at once, whatever. Those are the hardest houses to get into because they just have like a long list that they blast out and it's a race to the bottom. Like they just go with the cheapest bidder, but then also, so it's the hardest to get into, but then they're also the lowest margin.\r\n\r\n\r\nby far. And so, you know, could do one neighborhood of 20 houses would probably do the same profit as just one big custom home. so my whole formula is just, it's pretty straightforward. I download a list of construction permits and you can, the software construction monitor that gives you all of, you can go as far back as you want to pay for it basically, but gives you all the current\r\n\r\n\r\nNikolas Hulewsky (08:52.524)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (09:01.902)\r\nJeez.\r\n\r\n\r\nJared Kotter (09:22.498)\r\nconstruction permits have been pulled in your geographic area. And then the golden sauce is if I can drive, kind of like filter out the projects based on the builders I know that do high-end homes, kind of the areas of code, stuff like that. And the gold sauce, if I can drive to all those houses and just like see where the build is at. Cause I get their patch drywall, then like, doesn't make sense for me to contract them, for example.\r\n\r\n\r\nNikolas Hulewsky (09:36.759)\r\nNikolas Hulewsky (09:47.882)\r\nWait, so you can go to the city and just see what permits have been pulled?\r\n\r\n\r\nJared Kotter (09:51.714)\r\nWell, going to the city, depends on, there's a couple of other records, depends on your state, your county, your state and your county really, is what it depends on. Here in Utah, you have to pay for, to pull permits. If you're doing it through the government and like the data you get, isn't fantastic. So I use this software called construction monitor and you just subscribe to it. It's like yearly, it's like 1500 bucks a year or something like that. And it's unlimited.\r\n\r\n\r\ndownloads of the permits and you can filter by single family homes or basements, whatever. So, you know, I just do single family home.\r\n\r\n\r\nNikolas Hulewsky (10:28.462)\r\nso you can see, okay, these people have pulled a permit. Let me go see where they are in the process. And it could be, it's not just a permit to, like there's no permit to just frame and drywall. It's probably a permit to what, like expand or redo the kitchen or.\r\n\r\n\r\nJared Kotter (10:41.524)\r\nNo.\r\n\r\n\r\nJared Kotter (10:45.122)\r\nAnd you can filter all of that. Yeah, so it's just like a remodel. That's a different permit than a new build. So like I just download only the new build permits for single family homes, because that's the category that like custom homes will fall under. And then yeah, just you have to clean up the data a lot, because if I were to pull the permits just in my area today, there's going to be like 2000 permits or something. There's not that many custom homes. there's all the every like.\r\n\r\n\r\nNikolas Hulewsky (10:47.982)\r\nHmm\r\n\r\n\r\nJared Kotter (11:12.962)\r\nthe production homes, every one of those houses is a different permit. So you have to filter quite a bit and then I'll get down to a list of, you know, I don't know, 200, let's say, depending on the time window I'm looking at. then yeah, drive for the bill, just see where they're at in the process. And if they don't have drywall already, then I just call them, so I will have the builder name and number. Most of the time it will have the builder name and number. Not every city reports it the same way, but most cities will, and Utah at least, will have the builder name and number. So I just cold call them.\r\n\r\n\r\nThey're like, I was in the area, I saw you building the house at 123 Maple Street. Do you have drywall line up on it already? If not, can I give you a bid? And inevitably, they always ask the same exact question. Well, they'll say one of two things. If they answer the phone, they'll say one of two things. They'll say, you know what, thanks, I already have a guy that I'm loyal to, but good luck, whatever. And if that's the case, I just say, well, you know, I totally get that. Can I just give you my name and contact in case anything changes,\r\n\r\n\r\nSo that's one of two things they'll say. The second thing they'll say, if that's not the case, they'll say, oh, well, I mean, I don't know, who else do you work with? What other builders do you work with? And in construction, it's all just about, like, show me, don't tell me. And the best way to do that is to say, like, we built for these guys. And so, you know, lucky enough for me, the drywall company I'm selling for has done work for some of the best custom home builders here in the area.\r\n\r\n\r\nAnd so I can just, even when I was first starting out, even though I hadn't done any of my own houses, it's the same crew. So I can just say, no, we built for X, Y, and Z builders. And those are, you just name drop and we've worked with reputable enough builders that it gets put in the door pretty easy.\r\n\r\n\r\nNikolas Hulewsky (12:59.342)\r\nOkay, hold on, on. So let me get this straight. So you have one drywall company or there's multiple drywall companies that you have a relationship with? You sell for one, okay. And so you have relationship with that one and what you do is you then go to all these builders who are midstream or mid project and you say, hey, do you have a drywall company? And if they say no, you say, here's the company that I work with.\r\n\r\n\r\nJared Kotter (13:07.38)\r\nI just sell for one. I just sell for one. Yeah.\r\n\r\n\r\nJared Kotter (13:25.858)\r\nI just say I'm with Canvas drywall, can we give you a bid? And no one has any, there's no brand recognition at all with construction companies. Like they don't care what we're called. They just want to who we've worked for. So I say, yeah, we've worked for McEwen Custom Homes, which is one of the biggest ones here in Utah. And they're like, oh, well, if you work for them, then yeah, you can for sure give us a bit. Like they're great.\r\n\r\n\r\nNikolas Hulewsky (13:34.563)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (13:46.446)\r\nDude, okay, that's kind of blowing my mind. mean, Alex Hormozi talks about this. That's one of his strategies where he's like, yeah, if I was starting over today, what I would do is basically go to a company and say, what do you charge for this? Great, I'll go out and sell for you, but I want X percentage. Is that essentially what you're doing? Like, you just, are you, it is?\r\n\r\n\r\nJared Kotter (14:08.096)\r\nThat's exactly, that's exactly what do. Yeah. So the deal that I have is, sorry. Yeah. The deal I have with the travel companies that I keep 50 % of the net profit on every job that I sell. So yeah, that's exact. That's exact setup.\r\n\r\n\r\nNikolas Hulewsky (14:12.206)\r\nSo you. No, no, no, go, go.\r\n\r\n\r\nNikolas Hulewsky (14:24.684)\r\nJeez. And you trust them enough where you're like, they're not going to monkey around with a net profit. They're not going to be like, well, actually, this job, dude.\r\n\r\n\r\nJared Kotter (14:33.91)\r\nWell, I can see all that because I, in our setup, like I order the materials, I manage the job too. So I'm not just the salesman, I'm like an account manager. like I, like if you were the custom home builder and I were selling to you, like I'm going to work with you from A to Z through the build. And so I'm managing all the expenses too. So I'm incentivized to manage the job well, like to make it profitable. It's more profitable is the more I take home.\r\n\r\n\r\nNikolas Hulewsky (14:39.51)\r\nNikolas Hulewsky (14:44.959)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:56.494)\r\nOkay, so you go out, you quote, you do the bid, you manage the materials, you make sure that the crew's lined up, et cetera. You're effectively just leveraging the team that they already have to go out and perform the drywall services.\r\n\r\n\r\nJared Kotter (15:05.142)\r\nYep.\r\n\r\n\r\nJared Kotter (15:09.442)\r\nYeah, and they're capital too, because drywall is a cash flow heavy business. so we have to the bill on long labor and material long before we get paid, because we get paid on net 30 terms or longer sometimes. so if I were starting out on my own, the question is why don't you just do your own drywall business? It's like, if I had $200,000 to start the first house, then maybe I would. But yeah, it's a high bar to entry.\r\n\r\n\r\nNikolas Hulewsky (15:19.598)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (15:37.806)\r\nWell, I mean, so we have a tree trimming business. It's similar to this where when we started out, all we did was generate leads. So we'd go to thumbtack and Angie's lists and Google LSA. We generate leads. We also did some proprietary like off market lead sourcing. And then we would go out and find the crews and the crews would actually do the fulfillment. Cause if we had to buy all of the equipment necessary to go out and do these tree trimming jobs, that's, that's a lot of money. But effectively we were kind of just a lead gen.\r\n\r\n\r\ncompany that would then project manage very similar to what you're doing, you're going out, you're generating the lead, you're qualifying them, you're then managing the whole process. And then you're leveraging the infrastructure. Our plan and thesis had always been there will come a day where we bring this in house, right? Or, or it just generates enough cash for us. And we decide to go and do something else. Are you thinking of bringing this in house at some point? Or are you like, No, this is just a good spot for me to be in from a cashflow perspective, and then allow me to find my next business or how are you thinking about it?\r\n\r\n\r\nJared Kotter (16:11.607)\r\nYeah.\r\n\r\n\r\nJared Kotter (16:37.47)\r\nYeah, yeah, good question. I see this as a stepping stone to the next business, I think. The main reason is that with, I don't think a drywall, I've never seen one at least and maybe they exist, but in our area, there's not hardly another drywall business bigger than like doing bigger, more reputable houses than what we're doing. There might be some that are bigger in terms of volume or whatever, but.\r\n\r\n\r\nAnyways, my point is, like, I haven't seen a business, drywall business here that is a real, has any enterprise value to it. Like, I just don't think it's very sellable business. It's just all human risk, right? Like the builders don't care about the name on the shirt or whatever. They just care about who they're working with. And so, you know, let's say I were even to like take over the drywall business I sell for now.\r\n\r\n\r\nLike there's a lot of human risk and the owner of that business leaving all of his accounts might not want me or whatever. anyways, I see this as stepping stones to the next thing. I think it's like I've learned a lot just about business in general and how to manage and sell better. And so I think something analogous might be down the path, like maybe a painting business or something like that, but.\r\n\r\n\r\nNikolas Hulewsky (17:39.448)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:57.262)\r\nSo let's go back to the beginning. May of 2024, school year, let's out. Was your plan at that point, like I'm not going back to teaching? Okay.\r\n\r\n\r\nJared Kotter (18:06.314)\r\nYeah, yeah, it was like, I got a retirement.\r\n\r\n\r\nNikolas Hulewsky (18:10.35)\r\nOkay, so as you're going through that process, when did you decide on, all right, I'm gonna do drywall, and I'm gonna do it in this creative way where I don't have to get the capital to start a drywall company, I'm gonna go find a reputable company. Like, when did that idea kinda come to fruition?\r\n\r\n\r\nJared Kotter (18:24.564)\r\nYeah, I decided in October and then started in January. So from October to January, it was just kind of like nailing down what the deal would be with and getting all the logistics in place. And part of that was because the drywall business was going to sell for wanted to wait until like the new fiscal year for whatever their stuff.\r\n\r\n\r\nNikolas Hulewsky (18:44.718)\r\nWhy did you pick that company in particular?\r\n\r\n\r\nJared Kotter (18:50.217)\r\nOh, I guess I forgot to mention this. This is a little bit of a cheat code that I had was that I mentioned my brother did drywall forever and he started his own and so he's Long story short, I'm the youngest by a of years. So he's like 18 years older than me So I sell for my brother's drywall business So it's a little bit of a cheat code that I had like I didn't lie. Sorry. I didn't mean to do that And so it's for him now I know a lot of people who do it not for their like this exact model not for their brother like I have a buddy who does it for roofing for a random guy. So for me it was\r\n\r\n\r\nNikolas Hulewsky (18:55.48)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (19:04.878)\r\nBuried the lead! Yeah. No, you're good.\r\n\r\n\r\nJared Kotter (19:20.032)\r\nI kinda have my foot in the door easy enough to do it just for him.\r\n\r\n\r\nNikolas Hulewsky (19:23.406)\r\nOkay, so the reason I actually love that because when I'm talking to people about getting into entrepreneurship, I'm always like, what's your unfair advantage? That is an unfair advantage. Not everybody has a brother who owns a drywalling company that they can go and start a business with, right? And sometimes we kind of feel sheepish about it where you're like, well, I kind of cheated a little bit. But the truth is, when you cheat like that, quote, you're not actually cheating. But when you use that unfair advantage, it just increases the likelihood that you're going to be successful. So it's not a bad thing, dude.\r\n\r\n\r\nLike you looked around, you're trying to find your opportunity. You're not going back to the middle school. You needed to find something where, okay, where can I compete in a way that is unfair relative to other people? And obviously this, this is the space. Is that 50 % split normal? Like when did you guys start talking about that split?\r\n\r\n\r\nJared Kotter (20:14.686)\r\nYeah, that, mean, I guess normal would be, mean, I don't know, like all the other arrangements that was the arrangement that he had when he was doing it for another job or business 10 years ago. And so we just kind of brought over like, well, this is how he did it there. and, I I think it partly depends on just what the margins are. Like my buddy who does this for roofing margins on roofing a lot different. So I don't know that.\r\n\r\n\r\n50 % spread, he doesn't get 50%, and I don't think it probably makes sense on roofing. But for drywall, we try and run 20 % margins on every job, there's enough to split it and be meaningful for both parties.\r\n\r\n\r\nNikolas Hulewsky (20:54.062)\r\nSo if you've done 1.7 million in the first 10 months and you're at 20 % margins, 340, so let's just call it $340,000 net margins, and you're splitting 50%, you're somewhere in the ballpark of having made $150,000 to $170,000 in the last 10 months.\r\n\r\n\r\nJared Kotter (21:03.937)\r\nMm-hmm.\r\n\r\n\r\nJared Kotter (21:08.182)\r\nYep.\r\n\r\n\r\nJared Kotter (21:16.738)\r\nIt's like almost exactly 170,000, yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:20.28)\r\nDude, that's amazing. That's incredible. Okay, so in October, when you're thinking about doing this and you penciled it out, is this where you thought it would be? Or like, what were you thinking it might look like?\r\n\r\n\r\nJared Kotter (21:35.458)\r\nMy goal for year one was 150. So I obviously surpassed that. And that was would be by the end of like this calendar year of 2025. you hopefully I think by the end of 2025, it'll be closer to, you know, I think I would have brought in closer to probably 185, 200. Part of it is like, anyways, as winter comes, like deals slow a little bit, but yeah.\r\n\r\n\r\nNikolas Hulewsky (21:39.148)\r\nWow, okay.\r\n\r\n\r\nNikolas Hulewsky (22:00.59)\r\nYou'll slow down.\r\n\r\n\r\nWhen did you tell your wife you're doing this? Did she know in May? Was she like, okay, yep, we're quitting. What's the plan? were you like August rolls around and you're like, so I'm actually not going back to school.\r\n\r\n\r\nJared Kotter (22:09.866)\r\nYeah.\r\n\r\n\r\nAlright.\r\n\r\n\r\nYeah, we decided before the school year ended, we decided like March or April. And so we had been kind of like a slow build to this. And lucky enough, she's had a job that like, you know, I've had my own stuff and been making money, but very up and down and, and very grateful for my wife. She's had a very stable job that, you know, for those first few months. And frankly, even the first part of 2025 has slowed it down because, you know, I\r\n\r\n\r\nIt takes a long time for me to get paid. So I haven't in full transference, like about 170,000 that I have like an account with Sewell's. I've not yet, like it's not hit my bank account yet because of the payment terms of, of how construction flows. Yep. So it's like I, for example, like I sold a house in March that we are barely halfway through on right now. And then, you know, we'll invoice once we're done and we don't get paid for 30 days after that. So it's like.\r\n\r\n\r\nNikolas Hulewsky (22:55.672)\r\nCause you've got to go collect that too. that makes sense.\r\n\r\n\r\nJared Kotter (23:13.332)\r\nIt takes long time for the checks to actually start coming in, which luckily enough now we're rolling. But for the first five or six months of even 2025, it's like, well, I've sold this much and I know I'm going to get this much, but it's not in our bank account yet. so lucky enough, my wife's been awesome and made a float us that way.\r\n\r\n\r\nNikolas Hulewsky (23:34.04)\r\nStay here for 30 seconds, I'm gonna go to the bathroom. I drank way too much before I started here. Okay, stay here.\r\n\r\n\r\nJared Kotter (23:37.868)\r\nSure. Cool.\r\n\r\n\r\nNikolas Hulewsky (23:42.242)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (25:20.462)\r\ncamera.\r\n\r\n\r\nNikolas Hulewsky (25:31.629)\r\nBack Jack.\r\n\r\n\r\nJared Kotter (25:33.088)\r\nBy the way, sorry, I didn't mean to bury the lead on my brother thing, by the way.\r\n\r\n\r\nNikolas Hulewsky (25:36.942)\r\nDude, stop, stop, stop. That's not even a big deal. I said it as a joke. You're totally fine. I actually love that it's your brother because I think it illustrates the fact that you need to have a, like an unfair competitive advantage. And if you feel guilty about it, stop because like nobody's nice to you when you're out trying to compete on business. Anyways, it's good. Okay. So I love the fact that you identified the business. You knew what you were going to go and do. You identified the unfair competitive advantage and your brother, which is rad.\r\n\r\n\r\nbetween October though, in January was still two months. And I'm sure your wife was a new and new wife were both like, all right, this is seven months without income. What are we doing? What did you do between October and January? Were you like prepping to hit the ground running in January? Did you already start pulling those reports and start looking at, at bidding jobs? Or did you wait all the way until January to start looking at reports? Like what did January look like? Did you have revenue in January?\r\n\r\n\r\nJared Kotter (26:35.49)\r\nSure. Well, that's kind of actually why they had Christmas lights in that October to January is because I basically had, yeah, I was like, well, I have a couple months to kill. They didn't want me to start until January 1. so I'm like, I'm not going to start another business for two months or whatever. So yeah, and talk about unfair advantage. I have a buddy that has Christmas lights in Florida and has crushed it. So I just called him. It's like, hey, how do I do this in six weeks and make at least a little bit of change? And so the goal.\r\n\r\n\r\nNikolas Hulewsky (26:41.198)\r\nBridge the gap.\r\n\r\n\r\nNikolas Hulewsky (26:51.948)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (27:02.478)\r\nThat's RAD, man.\r\n\r\n\r\nJared Kotter (27:04.16)\r\nThe goal was, the one thing like capital expenditure I needed for drywall was needed to have a truck just to build a haul of material as needed and stuff. And so was like, all right, let's make enough in Christmas lights to pay for the truck. And lucky enough, that's what we did. I did that. And then January 1 was like, January was just kind of a slog. And then first sale was like February 1st or something like that.\r\n\r\n\r\nNikolas Hulewsky (27:28.92)\r\nOkay, so January, no revenue. No revenue coming in in January. Was January, and this is where we now get to talk about your secret sauce, how you closed three times more sales. Did you already know kind of what the process was? Like, did you know how to generate the leads, what the sales cycle would look like, how to close them? Or were you, like, was January your learning month, basically?\r\n\r\n\r\nJared Kotter (27:31.85)\r\nNo revenue in January.\r\n\r\n\r\nJared Kotter (27:49.418)\r\nYeah, well again, going back to like cheating off of my brother, he took me, he drove me around for like one or two days and was like, okay, this is how I do it. and then just kind of gave me like a rough place to start. And then I kind of took it from there and, and used a lot of like his methods, and then added on like my own SOPs and stuff that way to, to boost conversions and things like that.\r\n\r\n\r\nNikolas Hulewsky (28:14.574)\r\nOkay, so you were training, you're eating up to speed, probably, I'm assuming in January you started pulling those permits and were reaching out to contractors. So you probably had leads in the pipeline that you were starting to work.\r\n\r\n\r\nJared Kotter (28:22.113)\r\nYep.\r\n\r\n\r\nJared Kotter (28:26.772)\r\nYeah, because it will take, you know, from contact to like the sale closes sometimes can take several weeks because they're getting other bids. They're trying to decide or, whatever. And so it's almost always like whatever sale I make this month, I generated those leads the month prior. And so.\r\n\r\n\r\nNikolas Hulewsky (28:31.235)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (28:44.536)\r\nWas that your only lead source is going through, what was the name of that website?\r\n\r\n\r\nJared Kotter (28:49.014)\r\nconstruction monitor.\r\n\r\n\r\nNikolas Hulewsky (28:50.625)\r\nIs that your only lead source construction monitor?\r\n\r\n\r\nJared Kotter (28:53.736)\r\nThat or if you're in an area that's building a of houses and they happen to have a sign in front of the house that has the name and builder number, you can do that. Only certain neighborhoods require that more than others. so, let's say for example, I download the permits and it takes me to, you know, whatever, Heber City, and then I drive to that house and there's a house next door with a sign up with the builder's name. I'm going to call both of them.\r\n\r\n\r\nNikolas Hulewsky (29:17.998)\r\nyou\r\n\r\n\r\nJared Kotter (29:19.126)\r\nBut yeah, mean, essentially the only starting place with leads is just the, that I've used is just the construction permits.\r\n\r\n\r\nNikolas Hulewsky (29:25.278)\r\nThat's interesting because you could go and drive around. You could go and see who's working construction, but you don't necessarily know who the builder is. It's not like they're publicly advertised. Most of the time, they're not publicly advertising like, this is Johnson Building Company. I don't even know what's the name of your brother's company.\r\n\r\n\r\nJared Kotter (29:37.278)\r\nMm-hmm. Yeah. Canvas drywall, but you know, if it's whatever.\r\n\r\n\r\nNikolas Hulewsky (29:42.552)\r\nCanvas drywall, but they wouldn't even be like it would be the builder who's subbing out to Canvas drywall. Yeah, OK. So.\r\n\r\n\r\nJared Kotter (29:46.466)\r\nIt'd be the builder. Exactly. So it's like, yeah, Johnson building code or whatever would be the name of the actual builder.\r\n\r\n\r\nNikolas Hulewsky (29:53.506)\r\nYeah. How did you like track leads? Did you have a CRM? Did you use Google Sheets? Were you just like writing on every sticky note around the house? Was your wife helping you? Like, what did that pro- because that was, that's kind of the engine that gets everything else going. You're not doing anything else until you get some leads in.\r\n\r\n\r\nJared Kotter (30:05.984)\r\nYeah.\r\n\r\n\r\nJared Kotter (30:13.345)\r\nYeah.\r\n\r\n\r\nSo just download all the permits, put them in a spreadsheet, and then I just kind of built my own CRM and Google Sheets and kind of have like a column of like, okay, contacted them, they didn't answer, did, whatever. And then I tracked like different, so like about 50 % of the houses you call, the builder will not answer the phone, which is crazy. But that's also an unfair advantage, like if I just answer my phone when people call, because most construction people just don't. Anyways, so 50 % of the builders just won't answer the phone.\r\n\r\n\r\nNikolas Hulewsky (30:41.432)\r\nMm-hmm.\r\n\r\n\r\nJared Kotter (30:46.114)\r\nSo leave a voicemail, leave a text, whatever. And so I would even track like what text that I leave or what voicemail that I leave, like the script, and I would track like, okay, these are converting better than others, whatever. And then just in Google Sheets, yeah.\r\n\r\n\r\nNikolas Hulewsky (30:57.762)\r\nJust in Google Sheets. You weren't using like Go High Level, you weren't using like Outscraper, you weren't using Clavio or like any other texting or automation software. You were just using Google Sheets.\r\n\r\n\r\nJared Kotter (31:07.564)\r\nto.\r\n\r\n\r\nTo start, just Google Sheets now, where I'm actually trying to implement some like Ohio level automation, like lead nurture, follow-up stuff automated, because honestly, that's where I probably lose the most deals is just, it's not that I don't have enough leads, it's that I just can't follow up with enough of them, because it probably takes, if I don't get that person on the phone, the first call, it's gonna take five to 10 follow-ups before I can get them on the line. And.\r\n\r\n\r\nNikolas Hulewsky (31:36.952)\r\nReally.\r\n\r\n\r\nJared Kotter (31:37.602)\r\nI just, I'll just have too many. can't follow up that many times with all of them manually at least. so whether that's, you know, getting a VA or probably just automating it and go ahead or something that's kind of like next stage for me that I'm working on right now.\r\n\r\n\r\nNikolas Hulewsky (31:51.81)\r\nI wouldn't think in your geography there's that many builders. Is it like, I would think maybe 20, but there's that many builders that it's just really.\r\n\r\n\r\nJared Kotter (32:00.098)\r\nI mean, we go all over Northern Utah, essentially. so, you know, I'll draw, you know, it's probably like a two hour radius or something that we work in. So there's a lot of construction. I mean, I actually just did the other day, like, had ChatGBT do some deep research on like what CIF codes are doing the most, high-end custom home builds in the United States. And this area of Utah is like top three.\r\n\r\n\r\nSo there's a going on. And the others are actually by you and Boise. So it's like Boise, Austin, and Utah. So, yeah.\r\n\r\n\r\nNikolas Hulewsky (32:31.05)\r\nEagle baby, it's gotta be eagle. So when you were getting them on the like we talked about earlier, you have a, close at a three X higher rate. What's your secret? Like how are you closing these sales? How did you get that first sale closed?\r\n\r\n\r\nJared Kotter (32:46.06)\r\nSo you know, yeah, you don't close on the phone. So the phone pitch is just like, let me give you a bid. Like just let me send you numbers. And then from there you can tell me no. And it's like, it's funny that anyone would say no to that to me because there's no, like if you're the home builder, there's no risk to you in getting numbers from me. And there's all the downside for me. Cause it's gonna take me four to five hours to put together a good bid for you.\r\n\r\n\r\nNikolas Hulewsky (33:06.219)\r\ndown side.\r\n\r\n\r\nJared Kotter (33:14.396)\r\ncause have to go to the house and so this is actually the secret sauces. go to the house fit after you tell me, yes, you want to bid. I go to the house and physically measure it. Like I'm pulling out a tape measure and measuring every wall for drywall. Now there's softwares you could do stuff like that. They do it faster. but this is kind of a secret sauce of how I closed three times more is that, like I could bid a project just off of the construction plans, let's say, but\r\n\r\n\r\nNikolas Hulewsky (33:26.51)\r\nMm.\r\n\r\n\r\nJared Kotter (33:42.09)\r\nWhen I can get in person and measure the house, you'd all be at the house for two to three hours. And inevitably what happens when I'm there for that long is that more often than not, I'm going to run into either the home owner or the home builder. And if I can meet either of those two people, that's when my close rate just skyrockets three decks because like, like to think I'm fairly, fairly likable dude and personable and so many subcontractors and construction.\r\n\r\n\r\nNikolas Hulewsky (34:07.192)\r\nYeah.\r\n\r\n\r\nJared Kotter (34:11.645)\r\naren't that way, to be honest. And so if you just have any level of people skills in this industry, you can just crush it. And so like the other day, I went to measure this really small house that like, probably could have done it off of plans in 20 minutes, but instead, like I drive an hour there, I spent two hours there just measuring it. But in that time, I met both the homeowner and the home builder. And then the next day home builder texted me, he's like, Hey, we really like you. want to go with you. And so it's like, man, if I can meet you then.\r\n\r\n\r\nhook line sinker like deals done pretty much.\r\n\r\n\r\nNikolas Hulewsky (34:41.858)\r\nWell, like, okay, that's cool that you close them, but when I hear you driving one hour each way, I'm like, what a waste of time. But I have no idea how much a job like that could be. Like, how much would that job be?\r\n\r\n\r\nJared Kotter (34:56.77)\r\nSo that job is actually pretty small. It's like my cut on commission, like my commission will probably be at $2,000. But to put this in perspective, like today I have a house going also, the same exact process, nothing different that my commission on that house will be $25,000.\r\n\r\n\r\nNikolas Hulewsky (35:13.294)\r\nOh my gosh. What? Wait, wait, wait, wait, I'm just gonna I'm gonna back. I'm gonna back into it. All right, so 25, 50,000 20%. So you're talking about a $200,000 drywall job.\r\n\r\n\r\nJared Kotter (35:16.844)\r\nSo yeah, the process is not any different at all.\r\n\r\n\r\nJared Kotter (35:29.762)\r\nYeah, our margin on this house is actually a little bit better just because there's a lot of detail. So I think our, I think their revenue on this job will end up being, and it's still actually going up because they keep adding changes and stuff. But I think we'll round out probably around 170,000 was, is going to be our final, like gross.\r\n\r\n\r\nNikolas Hulewsky (35:40.471)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (35:45.71)\r\nThat just seems, for drywalling? Because you're not framing, you're just drywalling.\r\n\r\n\r\nJared Kotter (35:51.464)\r\nIt's a massive house. mean, that's a very large house. That's like abnormally huge, but yeah.\r\n\r\n\r\nNikolas Hulewsky (35:56.114)\r\nmy gosh, are you framing out the United Center? Like freaking massive. Temple Square?\r\n\r\n\r\nJared Kotter (35:59.906)\r\nThey have like a full basketball. Yeah, basically they have like a full basketball court. Like, yeah, no, it's a big house for sure. And that's that's abnormal. Right? Like that's, there's not many of those houses being built. But my point is, is like that house was literally the exact same process as the small $2,000. Like not anything different. And it takes a little bit more time to measure it, but like there's nothing more. So it's like, how'd you get this? Like, how'd you get this builder? It's like the exact same process as I got.\r\n\r\n\r\nNikolas Hulewsky (36:10.574)\r\nSure.\r\n\r\n\r\nJared Kotter (36:29.568)\r\nJoe down the street, know, just cold call show up be likable is the whole.\r\n\r\n\r\nNikolas Hulewsky (36:32.706)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (36:36.302)\r\nSo, all right, month one, nothing. Month two, you close your first job.\r\n\r\n\r\nHas there been any flywheel happening at this point? Are there word of mouth? Like, yeah, now I work with this builder and so I'm gonna send Jared more business. Is that starting to happen yet or is that just not a thing in this industry?\r\n\r\n\r\nJared Kotter (37:01.166)\r\nI mean the flywheel, I kind of already started with the flywall of flywheel of, like word of mouth because I could piggyback off of the builders that like my brother had already been working with. Right. And so I was kind of like my cheat code of, of how, if I had started like, let's imagine January one, I started my own drywall business. Even if I had the capital to do it, like I wouldn't have had any reputation. Right. the flywheel for me though.\r\n\r\n\r\nhas been like recurring revenue because the same builder will build multiple houses. And at this point, like, I don't really have to, certain builders still make you compete, but most of them, just like send it to your email and say, Hey, here's our next one go. And so, you know, like one builder this year, like I'm on house number eight with, something like that, you know,\r\n\r\n\r\nNikolas Hulewsky (37:36.014)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (37:53.39)\r\nSo basically the deal that you have is, any business that comes from that builder now that I brought on, I'm getting that 50 % split to that. So in year one, you're do 150, 170 years, two, three, four, and five. You could just have a solid base. Obviously, as long as the company that you're partnering with to do the fulfillment is doing a good job. That's, as Borat would say, a very nice, a great success. Dude, that's...\r\n\r\n\r\nJared Kotter (38:01.74)\r\nYeah.\r\n\r\n\r\nJared Kotter (38:11.852)\r\nYep.\r\n\r\n\r\nJared Kotter (38:15.425)\r\nYep.\r\n\r\n\r\nJared Kotter (38:21.645)\r\nYeah, so I don't have to prospect that much anymore like I don't like I still will if I'm a little slow like I'll still pull the permits but now like I'm staying honestly pretty busy just with the recurring stuff that\r\n\r\n\r\nNikolas Hulewsky (38:22.83)\r\nAmazing.\r\n\r\n\r\nNikolas Hulewsky (38:33.006)\r\nBut you could theoretically hire somebody. You could bring on a guy who's just like, I need you to go measure. just like you, no experience, but you know they're going to be good at sales so that they're there at the right time. Talk to the homeowner, talk to the builder, and then you start kind of branching out. Is that on the roadmap for you?\r\n\r\n\r\nJared Kotter (38:42.476)\r\nMm-hmm.\r\n\r\n\r\nJared Kotter (38:49.088)\r\nYeah. I've experimented with it a little bit. Like I have this college kid that I've used as like an SDR to do like pull permits and go drive someone and call and stuff. Sales development rep, that? I never actually worked in sales, I think that's what it is. But he's like basically booking, like he's worked at things like the SDR and I'm the account manager. So it's like, just book me like measurements essentially.\r\n\r\n\r\nNikolas Hulewsky (38:59.534)\r\nSure. Can you define what an SDR is?\r\n\r\n\r\nNikolas Hulewsky (39:05.518)\r\nThere we go. Yeah, yeah, yeah, yeah, yeah.\r\n\r\n\r\nJared Kotter (39:17.858)\r\nAnd I pay him like a hundred bucks per like booked measurement. then on the back end, I'll give him like a piece of the commission too. So it's a no brainer for him. like in one call, if they say yes, they're getting a bid then it's a hundred bucks for him. And for me, like a hundred dollars per lead is, you know, if I'm going to make $20,000 a pound, it's like a hundred bucks or even 2000, like a hundred bucks is, is easy. So I've done that a little bit. Um, to be honest, we got really just like our fulfillment capacity was kind of maxed out, especially.\r\n\r\n\r\nLike mid to end of summer. So I kind of actually had to like pump the brakes a little bit on, on selling because we, we can keep up. And I always say like my biggest philosophy in all this is the best sales is just good fulfillment because that's when you get the recurring stuff. Right. And so if, if we are so bogged, I can't do a good job in what I already have. Like I'm going to lose more sales by, I'm going to lose more sales by bringing on too much than I would not prospect prospecting. that makes sense.\r\n\r\n\r\nNikolas Hulewsky (39:47.022)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (40:02.883)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (40:16.174)\r\nYeah, that's a great point.\r\n\r\n\r\nJared Kotter (40:16.779)\r\nSo anyways, it's kind of like a, I think in any service business, you have to gauge the production with the sales and balance it right.\r\n\r\n\r\nNikolas Hulewsky (40:25.9)\r\nYeah, I mean, any business, especially as you're growing, there's always this tension between fulfillment and sales, fulfillment and sales. You know, the ops team is like, we're at capacity and the sales team's like, we can't say no, otherwise we're going to lose business. It's just, there's always that, that kind of tension. I do love the way that you're thinking about it though is like, all right, I'll bring on another guy and then I'll give them a percentage. they, know, we're kind of growing that way. It's like, you've got your downline and you're doing the most Utah Mormon thing ever, which is like,\r\n\r\n\r\nAll right, we got our MLM structure and we're just freaking cranking dude. Smell of Luca. I'm just kidding. What did your brother think? What did the builder think? Or the drywall company think? Are they stoked? Are they like, dude, $1.8 million in sales? The year's not even done yet? This is amazing? Or is it like, this is cool? Like I have no idea, no context.\r\n\r\n\r\nJared Kotter (40:58.146)\r\nYeah, pretty much. Yeah, pretty much.\r\n\r\n\r\nJared Kotter (41:08.876)\r\nDon't ever draw. Yeah. I mean...\r\n\r\n\r\nJared Kotter (41:22.914)\r\nYeah, no, mean for them it's sweet because like if I'm bringing home, let's say 180 by the end of the year, like that's 180 net profit for them too that they get to take home. know, it's like, I think that it's a win win. It has to be win win for both parties obviously. And like, even though it is my brother, it's like, I mean, yeah. It like not, yeah, I probably didn't double their business, but you know, probably just shy of.\r\n\r\n\r\nNikolas Hulewsky (41:38.936)\r\nBut I mean, was that significant for them? I guess the question is like, it is, okay.\r\n\r\n\r\nJared Kotter (41:52.444)\r\ndoubling it or something. yeah, it's definitely meaningful income for them too.\r\n\r\n\r\nNikolas Hulewsky (41:54.584)\r\nDude.\r\n\r\n\r\nNikolas Hulewsky (41:57.932)\r\nThat's dude, that is freaking. That's so cool. That is so cool. Okay, so I think my takeaways from this are number one, if you're going to do a business like well, let's back up. I just love businesses like this where you effectively become a lead gen company. And so you you play middleman. You get the leads, you generate the leads, you can go out, you bid the business and then you find the subcontractors to launch the business. I think that's probably one of the best ways to get into home services.\r\n\r\n\r\nbecause you don't have to buy the equipment. You don't have to get the crew and worry about all the logistics and the fulfillment side of things. You can just start running and gunning. And then later, if you're generating that much, you can make kind of make a decision like, okay, cool. I actually want to start this business. I'll bring it in house, but you don't even need to borrow that problem right now. So that's number one. I love this like lead gen fulfillment relationship in home services. Number two, if you're going to do it,\r\n\r\n\r\nfind someone who already does the fulfillment well and has some relationships that you can learn with. Don't necessarily go out just cold and try to figure it out. Start with the distribution and the fulfillment first, get that locked in because they're gonna be a partner who's invested in your success and they're gonna be the ones who are effectively doing the fulfillment. And then number three, do things that don't scale. Go to the homes, do the measurements, talk to people, play a really active role.\r\n\r\n\r\nin launching that business. Did I miss anything? Is there anything you would add to that?\r\n\r\n\r\nJared Kotter (43:28.354)\r\nNo, think he nailed it. think, and I guess maybe the only one thing I would add is make sure that the agreement you have is a win-win for them, right? So they are invested, like you said, because if I was taking home 90 % split because my brother's nice to me, no one else could go replicate that unless they have a brother or a dad they can sell for. But in this case, it's like, I'm bringing in meaningful income.\r\n\r\n\r\nAnd my brother's, like I said, almost 20 years older than me. So he's like thinking of retirement and he likes, he's like, maybe this is my path to retirement, which for most construction and trade businesses, it's like, there's no exit. so anyways, I just say, yeah, make it a win-win and just like everything in business. just have to add real value to like my real customer is the drywall business. And yeah.\r\n\r\n\r\nNikolas Hulewsky (43:59.342)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (44:16.269)\r\nI\r\n\r\n\r\nNikolas Hulewsky (44:19.694)\r\nTotally. Yeah, 100%. I also love the fact, I know this is gonna be people listening are like, well, it must be nice, bro. you freaking got your cheat code, brother. And it is true, it is nice, yes. But I just can't emphasize this point enough. All of us, now we may not have as large of a cheat code or as big as an unfair competitive advantage, but if you don't have an unfair competitive advantage when you're getting into something,\r\n\r\n\r\nYou should definitely rethink what you're getting into. Like start with the unfair competitive advantage and kind of work your way backwards. And it's exactly what you did. You don't have experience in this space, but you're like, all right, my brother's done it. He's been successful. It looks like there's a path there for me to have distribution and to learn. I can leverage his relationships and his contacts unfair competitive advantage. Let's go for it. Because it doesn't matter. Like you don't get an extra medal for doing it the hard way. It's hard whether you do it.\r\n\r\n\r\nwith somebody you know, or whether you do it from scratch by yourself. I just think, I'm glad that you buried the lead a little bit, because it was like, oh, cool. That's a point that I just want to hammer home is, yeah, you may not have a brother in the construction space, but you have some kind of unfair competitive advantage. might be a knowledge set. It might be capital. It might be relationships or distribution or fulfillment or something. But there's something that you have intrinsically when you're getting into entrepreneurship that you have an unfair competitive advantage in, and you need to find those things and then follow them.\r\n\r\n\r\nas hard as you can. So I love that. That's the other piece probably I'd take away from this conversation.\r\n\r\n\r\nJared Kotter (45:52.738)\r\nYeah, yeah, love that. And what I'd say too is like, even if you don't have a brother or whatever that's in it, like anyone, especially all subcontractors essentially all have the same problem, which is like they just get maxed out on what they can sell and manage. then also like it's a, most of them, the business owners, like a one man show, lead gen and management and whatever. And it's like they need.\r\n\r\n\r\nNikolas Hulewsky (46:15.308)\r\nYes.\r\n\r\n\r\nJared Kotter (46:18.868)\r\nthey have a real problem to solve too, which is they need someone else to bring in business for them to actually have like a any kind of exit strategy. And so, especially if like, and again, I had no, I knew nothing about drywall. Like when I started January one, I literally didn't even know what direction the boards like went on the wall. Like my brother had to take me to a construction site and say, this is dry. Like I knew nothing. Right. And so\r\n\r\n\r\nNikolas Hulewsky (46:24.398)\r\n100%.\r\n\r\n\r\nNikolas Hulewsky (46:38.839)\r\nYou\r\n\r\n\r\nJared Kotter (46:46.082)\r\nI would just say like, you can find someone who has the problem, this problem to be solved. And the second thing is like, oh, I know nothing about whatever construction. It's like, dude, I literally had not worked one day in construction, um, but on January one of 2025 when I started this. And that's not even actually like the problem, like to sell. Now that I know more there is, it's a little bit easier to sell sometimes cause I'm a little bit more of an expert, but.\r\n\r\n\r\nLike I sold, you know, like, like this big house, the $25,000 one, I sold that in February or March or something, like really early. Like I knew nothing. My, my, my, my point is I knew nothing about drywall, right? And that's not like when you have the subs, the crews, like you're talking about the know how to do the thing. Like what differentiates me from another drywaller is not that my crews are better than John's crews. It's that I'm more likeable and that you just trust me more than you trust John. And so.\r\n\r\n\r\nNikolas Hulewsky (47:18.73)\r\nmy gosh, really early.\r\n\r\n\r\nNikolas Hulewsky (47:40.622)\r\nYeah, it's high trust.\r\n\r\n\r\nJared Kotter (47:42.346)\r\nYeah, so my, anyways, I guess I'd say another takeaway is like, if you're personable and trustworthy, like, you could do this tomorrow too. You don't have to be an expert in anything and just find a contractor that has this problem to be solved and you could sell for them.\r\n\r\n\r\nNikolas Hulewsky (47:59.95)\r\nI love it. All right, Jared, if somebody's like, dude, I want to do this. I want to learn from Jared. How can they find you?\r\n\r\n\r\nJared Kotter (48:06.786)\r\nyeah, probably the only place you'll find me is on Twitter and I just barely started like 14 days ago. So just at Jared Cotter, that's my full name, pretty easy to find. And yeah, just kind of getting rolling there.\r\n\r\n\r\nNikolas Hulewsky (48:11.96)\r\nhe did.\r\n\r\n\r\nNikolas Hulewsky (48:17.758)\r\nThis is great. Appreciate you. talk soon.\r\n\r\n\r\nJared Kotter (48:20.386)\r\nOkay, thanks.",
  "metadata": {
    "duration": "",
    "date": "",
    "platform_source": "Google Drive"
  }
}