{
  "episode_number": "61",
  "episode_title": "From Forbes at 18 to Alcoholic on His Deathbed at 21: And Back with John Maher",
  "guest_name": "John Maher",
  "business_name": "Victorian Group",
  "transcript": "﻿nik (00:04.363)\r\nHi, John. Welcome to economics, my friend. I'm stoked to have you.\r\n\r\n\r\nJohn Maher (00:07.052)\r\nThank you so much. I'm stoked to be here. I appreciate the invite and I can't wait to chop it up.\r\n\r\n\r\nnik (00:13.995)\r\nDude, so let's just get into it. Tell everybody at home, what is the Victorian group? What do you do?\r\n\r\n\r\nJohn Maher (00:19.952)\r\nSo, Victorian Group, I founded this about three years ago. I did a small venture deal with Wiz Khalifa's manager, Boulders Onback, amazing guy, great guy from Pittsburgh, incredible entertainment entrepreneur. So, we focus on client acquisition and financial services. So, we do a lot of lead generation marketing. So, kind of that getting more MQLs, lowering the customer acquisition cost, especially in private wealth.\r\n\r\n\r\nconsumer lending and business lending. So I'd say about 80 % of our clients fall into that space. So.\r\n\r\n\r\nnik (00:52.491)\r\nSo before, before I just let you run like a train, cause I love your freaking energy. that's cool. That's cool. What is an MQL? You dropped that in there helping them get more and marketing. Okay. So you, your lead generation agency for wealth advisors.\r\n\r\n\r\nJohn Maher (00:57.232)\r\nI do like to run like a train.\r\n\r\n\r\nJohn Maher (01:02.448)\r\nMarketing qualified lead. Yeah.\r\n\r\n\r\nJohn Maher (01:11.12)\r\nWealth advisors and lenders is a big part. We've done some work in insurance before, some different brokerages, but a lot of our focus is private wealth and lending.\r\n\r\n\r\nnik (01:18.803)\r\nSo you said was Khalifa's manager is an investor in this business and you threw VC in there as well.\r\n\r\n\r\nJohn Maher (01:23.664)\r\nCorrect.\r\n\r\n\r\nJohn Maher (01:27.108)\r\nsmall venture. So he does a lot of venture deals himself. So private investor, whether you want to call it a small venture. So not a VC firm, but he has his own, well, actually we would call it a hold cow. So he has his own little studio that he invests his money through into his own kind of like private venture holdings. So he's my primary investor.\r\n\r\n\r\nnik (01:30.347)\r\nOkay.\r\n\r\n\r\nnik (01:38.891)\r\nYeah, well, usually.\r\n\r\n\r\nNo, did I lose?\r\n\r\n\r\nnik (01:48.043)\r\nOkay, usually when somebody says venture, those are like tech companies or companies that have really, really high upside. Is there a tech component to this or is it just private investment?\r\n\r\n\r\nJohn Maher (01:58.448)\r\nNot as much that could have been a misnomer. So we'll stick with private investment\r\n\r\n\r\nnik (02:02.279)\r\nThat's cool. No, no, no, you're good. How did that happen? Like.\r\n\r\n\r\nJohn Maher (02:09.264)\r\nSo it's kind of a crazy story. Weirdly enough, like my grandmother knew his grandmother, but that wasn't where our connection came from. That was kind of discovered retroactively. So I'm about, I was born about 40 miles east of Pittsburgh. So when I was about 14 or 15 years old, I started DMing him on the very early days of Instagram, like, hey, you're so cool, Pittsburgh guy, this is awesome. And so throughout my teenage,\r\n\r\n\r\nnik (02:35.5)\r\nWait, wait, wait, wait, wait, wait,\r\n\r\n\r\nJohn Maher (02:40.72)\r\nI discovered him on Instagram. I came across him somehow. Because I'm a local guy, he knows a lot of local guys, so I forget the exact way that I had found his Instagram page, but he has over 100 ,000 followers. It's not like he's a totally unknown character, especially locally. So he and I had started DMing over the years. And as I got through my teens, 16, 17, 18, he'd say, he'd give me advice maybe once every year, year and a half, we'd sit down and have dinner together.\r\n\r\n\r\nnik (02:44.427)\r\nInteresting, okay.\r\n\r\n\r\nnik (02:55.015)\r\nSure. Sure.\r\n\r\n\r\nJohn Maher (03:08.816)\r\nhe would kind of coach me. I was a young guy aspiring to tackle the world. And so that relationship progressed over the course of eight or nine years. And then as I decided to launch this business and I knew it was something I wanted to go after and I wanted some starting capital and I wanted a great kind of strategic partner, I reached out to him and said, hey, here's the deal. This is what I'm thinking about doing. Would you consider backing me? Months down the line.\r\n\r\n\r\nnik (03:27.371)\r\nYou\r\n\r\n\r\nnik (03:33.995)\r\nWhat did you need? What did you need the startup capital for?\r\n\r\n\r\nJohn Maher (03:38.448)\r\nSo this is the crazier part of the story. If we want to do want to backtrack a little bit to get into the how this materializes. Okay. So this is where it gets really nuts. So I started my very first business at 16. So it was consulting for larger businesses going after Gen Z consumers. So that kind of grew up grew a bit. I was 16 obviously very young at 17 years old. We landed a national contract with the college.\r\n\r\n\r\nnik (03:46.283)\r\nYeah.\r\n\r\n\r\nJohn Maher (04:08.688)\r\npromoting the SATs. So at 17, I'm sitting in high school. I was never a great student. We are doing national micro influencer campaigns, crazy stuff, rocket hot start to our lives. My brother was a co -founder, I had two friends. By 18 years old, we were featured in Forbes Magazine in an article. So by my senior year of high school, I had this...\r\n\r\n\r\nnik (04:31.275)\r\nmy gosh.\r\n\r\n\r\nJohn Maher (04:35.088)\r\ncrazy, crazy start. I couldn't have imagined it going any better. Then, this is where it gets wild. My dad had a massive heart attack in high school. I and my brother were the first responders. I gave CPR. He spent 24 days in a coma and was in hospital for six months. Years after that, I had bad, very bad PTSD and amazingly, of course, got addicted to alcohol. Terrible. So then,\r\n\r\n\r\nnik (04:46.107)\r\nman, sorry.\r\n\r\n\r\nJohn Maher (05:02.48)\r\nBy 20, I had lost everything. I had went from a Forbes -mentioned founder at 18. By 20 or 21, I was a college dropout alcoholic on my deathbed. I mean, puking up blood every single morning, multiple panic attacks a day, living hell, indescribable chaos. So I, at that point, realized, like, all right, life started amazing for me.\r\n\r\n\r\nI have this enormous humiliating fall from grace. And okay, I have one shot here. I got to turn my life around and thankfully with the encouragement of others, I did a complete 180, fixed my shit to be clear, and then had that urge. I had thought I was going to lose my life. That was very short of it. And the fact that I didn't, as things got more peaceful, I started to get those urges again of, hey, I want to get out there and I want to build something.\r\n\r\n\r\nthat those days of early success, I don't want them to be over. I loved what I did and I wanna do it again. I wanna start a new venture. And so I was broke. I mean, I mean broke, broke and physically still recovering. And so I was like, listen, I need some starting capital here, at least some. So we did a small five figure deal to start things off because I said, I want you to be about 35 ,000.\r\n\r\n\r\nnik (06:26.475)\r\nWhat does that mean?\r\n\r\n\r\nnik (06:30.219)\r\nNo, no, I know. But like, what do you mean you did the deal? You bought a company.\r\n\r\n\r\nJohn Maher (06:32.704)\r\nNo, no, no, no, no, no, no,\r\n\r\n\r\nnik (06:35.691)\r\nOkay. Okay.\r\n\r\n\r\nJohn Maher (07:01.712)\r\nhaving gone from going to die with zero dollars to having some kindling to start the fire was crazy. So that year and a half, two year period of my life was something I don't talk about a whole lot, but it's an intrinsic piece of my story and how I ended up where I am today.\r\n\r\n\r\nnik (07:20.843)\r\nWell, thank you for sharing, man. That is, I can't imagine being the first responder to your dad's heart attack. I'm sorry you went through that. That's brutal.\r\n\r\n\r\nJohn Maher (07:30.448)\r\nIt ended up being some of the greatest blessings I've ever had. The lessons I learned from that and the recovery process thereafter, often our heaviest loads to bear are what teach us our most invaluable and lasting lessons. So.\r\n\r\n\r\nnik (07:45.227)\r\nI agree. Some of the most valuable things I've ever learned or experiences that I've ever had were the hardest experiences that I've ever had. It doesn't mean that they weren't hard though. You can take good. You can definitely take good from the bad, but it's still, it's, they're still just very hard experiences. So.\r\n\r\n\r\nJohn Maher (07:56.368)\r\nno, I mean, again.\r\n\r\n\r\nJohn Maher (08:03.76)\r\nAnd again, to be clear, I was 100 % certain I was going to die and I was very close to it. So at 20, I accepted my death and then pulled it out of the hat and with the support of others turned it around. So.\r\n\r\n\r\nnik (08:16.171)\r\nSo let me ask you this question. I know you said $35 ,000 doesn't sound like a lot of money. I think that's a very good investment, right? Like it makes sense to me that someone would invest that as seed capital. The thing that's more surprising to me, to be honest, is why this business? If you're a college dropout, you're 21 -ish, 22, like how did you even know to say, I'm going to target financial wealth advisors,\r\n\r\n\r\nand lenders and generate leads for them. That's a very specific business.\r\n\r\n\r\nJohn Maher (08:50.832)\r\nIt is. So that's a good question. So I would say from a really early age, I already, I always had some type of proclivity towards the world of finance, but I realized that I did not have the grades. I was never the student. I wasn't going to be the warden school of business graduate who goes and works at Morgan Stanley. So I kind of gravitated towards marketing. Like I said, my first business in high school was very marketing focused. And what I kind of realized was like direct to consumer e -commerce that is in my mind,\r\n\r\n\r\nnot to use a military example, but like the Navy SEALs of marketing because they spend the most money, they have the most data, they're the most active in optimizations. Yet a lot of those guys are more excited about DPC e -com. They're not super knowledgeable in the finance side of things. Now, the finance side of things, there are a lot of great lower middle market, middle market financial services businesses that are awesome at fulfillment in what they do, but lean heavily on referrals.\r\n\r\n\r\nand word of mouth and aren't great at marketing. You know, they update their website and they don't touch it for four years. So that's where I noticed a disparity was, okay, here's this industry that has very, very high, typically customer lifetime value, very profitable. They probably under look marketing and then the added barrier to entry, especially in the advisory business is FINRA compliance. So.\r\n\r\n\r\nI looked at it as a low capital intensity, higher -ish knowledge barrier business to get into and figured, all right, I think there's enough of a path here, or it's showing enough promise that it's something worth exploring, and it certainly has been. So.\r\n\r\n\r\nnik (10:31.723)\r\nSo here's my question though, here's my question. I agree with all that, beautifully articulated. How does an alcoholic 21 year old have that thesis? That's my question, right? It's like, how did you even gravitate towards this? And how was it like, okay, cool, I turn my life around, this is what I'm doing, I'm going to this guy, he's invested with me. Like, where did the thesis even come from?\r\n\r\n\r\nJohn Maher (10:42.16)\r\nThank you.\r\n\r\n\r\nJohn Maher (10:54.256)\r\nThat's an amazing question. And the short answer is honestly, I have no idea. The long answer is, I think with my background, like when I was in eighth grade, I was reading 10K reports. I was bringing the Wall Street Journal and no one does this anymore, but reading, they used to, I don't know if they still do print out individual prices, opening price, closing price, day highs, day lows of the S &P 500. And I was reading through that in like eighth grade. So I always had that.\r\n\r\n\r\ndeep yearning to understand the side of the world more. I had my background and I don't know if it was kind of a lightning strike moment of this is an idea to go after and you know I can articulate this thesis now. I think probably back then it wasn't quite as put together and I can tell you this there was so much I had the first two years of my business. I got my ass kicked every day because.\r\n\r\n\r\nI didn't fully understand my ICPs. I didn't understand their once entirely. I didn't like fully, you know, we didn't have our own internalized SOPs for the first probably two years because we were building out there is a demand here, but we don't understand what the exact demand is. You know.\r\n\r\n\r\nnik (12:03.627)\r\nSo I'm gonna say something really quick. You remind me of me a little bit. You're like, I was not smart enough to go to Wharton, I wasn't smart enough to be one of these finance guys, blah, blah, blah. Dude, you're obviously bright. So we can throw that comment out the window. I graduated high school with a 1 .9 GPA somehow, I have no idea. I think my teachers just liked me, so they just passed me through. But.\r\n\r\n\r\nJohn Maher (12:10.352)\r\nAppreciate that.\r\n\r\n\r\nJohn Maher (12:19.152)\r\nAppreciate it.\r\n\r\n\r\nAppreciate it.\r\n\r\n\r\nJohn Maher (12:27.344)\r\nI was right around there.\r\n\r\n\r\nnik (12:34.091)\r\nthe when you when you talk about kind of what gets you excited and and like the thesis and these things coming together at the time, what did you think it was because you had to pitch this to somebody. You had to pitch it to you know, the guy who ended up investing with you. What's his name?\r\n\r\n\r\nJohn Maher (12:47.696)\r\nYeah.\r\n\r\n\r\nJohn Maher (12:52.176)\r\nWolf is on back. Great guy.\r\n\r\n\r\nnik (12:53.643)\r\nOkay, will did you say? Well, okay, so you pitched to will will invest. What was the pitch then was the pitch like, as simple as hey, man, there's an opportunity for us to generate leads and make money because these are high ticket clients, because I could see the rest of that thesis sort of filling in over time. But like, what was the, like the initial pitch to him? Was it just, I think this could work. And here's why. Or was it, you know, even less than that?\r\n\r\n\r\nJohn Maher (12:55.696)\r\nWell, yep.\r\n\r\n\r\nJohn Maher (13:20.144)\r\nI would say it was partly that and this. I had a really hot start in life. I have five years of experience at 21 or whatever it was, 20. So I have shown flashes of I can maybe make something appear out of nowhere and make it profitable. And two, I just almost died. I know what accepting death is like. And if you back me, I will not quit unless I die. So I think it was that level of determination of,\r\n\r\n\r\nnik (13:47.051)\r\nTo get dealt bitch.\r\n\r\n\r\nJohn Maher (13:50.32)\r\nListen, you might lose out, it might not work, but I'm gonna be here, I'm gonna do literally everything in my living, breathing power to figure out this business. And so it wasn't nearly as sophisticated as, look, here's our 36 month projections. And it wasn't that, it was, here I am, you've known me for years, I'm gonna bring my acumen and willingness to learn and dedication and grit that.\r\n\r\n\r\nI like to pride myself with as pretty unmatched being I can say, I have seen death looked it in the eyes and everything I want to do is spending my time doing what I'm doing now.\r\n\r\n\r\nnik (14:30.219)\r\nI think that's what I was trying to pull out of you because I mean, so much about getting that first investment from somebody is getting them to believe in you. It's not necessarily the idea. It's not that, man, this is a genius idea. I'm gonna invest in the idea. A lot of entrepreneurship is just, okay, I believe in John. I'm betting on John. And anyways, I think that's a really cool experience that you had to be able to get some validation.\r\n\r\n\r\nJohn Maher (14:39.28)\r\nMm -hmm.\r\n\r\n\r\nJohn Maher (14:48.432)\r\nYeah, for sure.\r\n\r\n\r\nnik (14:56.907)\r\nRight. And rebuild some of that self -confidence, have somebody invest in you and then kind of run through a wall for anybody.\r\n\r\n\r\nJohn Maher (15:03.536)\r\nIt's hard to overstate at the time how much it meant to my life and my self image and my willingness to continue to get on this path and try to build something. And honestly, not just when you're starting a business like that from scratch, as you very well know, you and I can make every slide deck we want with every graph and chart and forecast. But when shit hits the fan, I think Mike Tyson said, everyone has a plan until you get punched in the face. You have to take all that with a grain of salt.\r\n\r\n\r\nnik (15:24.619)\r\nYeah.\r\n\r\n\r\nJohn Maher (15:33.264)\r\nSo really when you're boots, well not bootstrapping, but when you're starting from the ground zero and you're getting that first investors, to your point, I think largely it's, I have a good feeling about this guy or girl, so I'm gonna get the money.\r\n\r\n\r\nnik (15:45.803)\r\nTell me about, okay, so you started four years ago, kind of what's the size and scope of the company now? What's your top line revenue in total? How many employees do you have? How many clients are you servicing?\r\n\r\n\r\nJohn Maher (15:56.048)\r\nGood question. Yeah, so like I said, the first two years we got the absolute shit beaten out as part of my French. It was every day was a slog. I would go 90 days straight where I would say every single day was like a bad day where we were just head down, figuring it out. What are we going to do next? Do we need to reposition? We need to build our distribution. We don't have a ton of resources to build our distribution. And so part of it is, you know, if I started all over again today, I think I could do the first two years in 60 days.\r\n\r\n\r\nSo that's something to keep in mind. But this year, like if you were looking at the 12 months ahead, I would be happy if we hit 600 in top line. And not only that, we have very high margins. This is the weird thing is in the last six months, my life has changed drastically, especially because of X. So we have a few things in the hopper right now, which I'll tell you off this call, which I can't disclose yet, which could.\r\n\r\n\r\nhugely impact what occurs. So involving some equity, you know, I like to think of myself as a truffle pig for equity. And so we've been playing around with, you know, our exact model. I would say in the last 12 months is where like things really started firing up. So any like what kind of entrepreneur listening to this, if at any point in the first two years you looked at me and did an analysis of everything you were doing, you would think,\r\n\r\n\r\nnik (17:01.003)\r\nAwesome. Okay, so you're awesome.\r\n\r\n\r\nJohn Maher (17:26.096)\r\nThis is insane, this is totally hopeless, please stop today. So.\r\n\r\n\r\nnik (17:29.611)\r\nNo, man, I, yeah, some people might, but it's the price of admission. You can't you, nobody can skip that line. You have to go through it at some point. It's not theoretical. You have to go through the crap because there's only things that you can learn being hands on. So I don't knock you for it taking two years. That's the beauty of it though. Like you said, next time it'll be six months as opposed to two years because you've actually gained the experience. Tell me.\r\n\r\n\r\nJohn Maher (17:36.112)\r\nBig time.\r\n\r\n\r\nJohn Maher (17:40.112)\r\non.\r\n\r\n\r\nJohn Maher (17:46.096)\r\nfor sure.\r\n\r\n\r\nJohn Maher (17:57.904)\r\nWell, sorry, I was gonna say that in 10 years from now, I'm gonna look back and think I'm a moron in this moment. In 20 years from now, I'm gonna look back at that guy 10 years from now and think he doesn't know what he's talking about. So that's the one thing I've really learned is that the world humbles you. The smartest and wisest person knows .0001 % of the information in the world. So that's a reality I've come to grasp is no matter how sharp I think I am one day, the very next day, I can have a tectonic shift.\r\n\r\n\r\nnik (17:59.563)\r\nnik (18:06.475)\r\nYeah. Yeah, that's so true.\r\n\r\n\r\nJohn Maher (18:27.696)\r\nof, whoa, I did not foresee whatever market conditions happening, whatever change in culture. So that's a thing to keep in mind as well.\r\n\r\n\r\nnik (18:34.219)\r\nSo you threw out some things earlier. You're like, I didn't know my ideal or my ICP. I didn't know. I didn't create SOPs. Can you quickly define what is an ICP?\r\n\r\n\r\nJohn Maher (18:43.312)\r\nthe old client slash customer profile. So that's standard marketing speak.\r\n\r\n\r\nnik (18:45.419)\r\nOkay. And for you, what is your ICP?\r\n\r\n\r\nJohn Maher (18:51.152)\r\nSo to break it down a little bit more detail we offer a couple of services and a couple different niches so for private wealth lead generation private well through paid media especially for ultra -high net worth is not quite as efficient because Yes, the customer customer lifetime value can be incredibly high if you land a family That's worth 40 million dollars, and you're taking a point every year for the next 25 years Obviously, that's a big number\r\n\r\n\r\nThe issue is you don't know when that's gonna happen. And so because the cash conversion cycle tends to be much slower, or even if you get a hot lead, it might take nine months to close them. Like for example, I talked to a partner at a wealth management firm a couple of weeks ago. They spent $100 ,000 on Google Ads, zero clients from it. Yeah, and to be clear, that was not with us. So with wealth management,\r\n\r\n\r\nnik (19:42.035)\r\nmy gosh.\r\n\r\n\r\nI get it.\r\n\r\n\r\nJohn Maher (19:49.296)\r\nfor us it's a lot of direct outreach. So building up email infrastructure, understanding strategy and positioning of how to get in front of cohorts of their ideal client profiles. For them it might be mass affluent, which we define as people with a net worth between say one and four million, then 10 million plus you're looking at ultra high net worth. So strategies vary between those cohorts. Whereas on the lending side of things, we're much more focused on paid media scaling.\r\n\r\n\r\nnik (20:08.683)\r\nHmm.\r\n\r\n\r\nJohn Maher (20:17.04)\r\nbecause it has a shorter cash conversion cycle, especially the consumer lending side of things. If you can hit that magic number where your customer acquisition cost is one 10th, 15th, whatever the lifetime value, you can make a great case of, hey, let's just keep piling on capital here because, and that's where you have the slam dunks, the huge victories where, go ahead.\r\n\r\n\r\nnik (20:38.475)\r\nSo what is your ICP on the private wealth side?\r\n\r\n\r\nJohn Maher (20:43.792)\r\nSo private well side, we have, so we have one client now that we focus on that's exclusive for us in the ultra high network space. We have several that are in the mass affluent space. So for that one to four, and the way, and you could argue this, which is what we hear is, okay, you need to be thinking about competition here. You know, there are only so many multimillionaires out there. If you, how can you represent multiple parties serving the same?\r\n\r\n\r\nnik (20:56.491)\r\nto that one to four versus the 10.\r\n\r\n\r\nnik (21:10.803)\r\nYeah.\r\n\r\n\r\nJohn Maher (21:12.72)\r\ncustomer profile but the answer to that is we only take on clients in private wealth that are going after distinctly different customer profiles. So for one of them it's located in the south much more focused on southern Christian wealthy families. Others it's Newport Beach California, others Manhattan. So...\r\n\r\n\r\nnik (21:32.395)\r\nSo what what are your channels for generating leads? How are you doing that right now? Is it if it's not just paid ads? Where are you generating those leads from?\r\n\r\n\r\nJohn Maher (21:40.112)\r\nSo paid ads, direct outreach through email, and then we do help a few clients with organic content. And there are inefficiencies there for us internally as far as scalability goes. The sexiest two words now are product tie service. So that's something where as in hope, what we can do this interview again a year from now, be curious to see how things progress. But that's something that we've really become focused on is,\r\n\r\n\r\nnik (21:43.019)\r\nYes.\r\n\r\n\r\nokay.\r\n\r\n\r\nJohn Maher (22:09.136)\r\nhow are we making sure that we have scalable services in a way that, because we're super profitable, but when you're doing slightly different things for every client, even though we're very standardized now as far as SOPs go on the services that we do offer, we never want to spread ourselves too thin. We want to be very, very focused on one or two core pieces of our own revenue generation and our revenue generation for clients and use that to get into those multiple seven -figure mark.\r\n\r\n\r\nnik (22:35.979)\r\nHow much does it cost for you to acquire a customer right now?\r\n\r\n\r\nJohn Maher (22:41.168)\r\nSo good question. It's very, very low for us because we get a lot of referrals, which is great. And then two is we do direct outreach. So we probably pay in total monthly between all of our software's inboxes, URLs, like $700 a month. And we're acquiring, now we have been recently much more picky with who we bring on. So we've gone to a kind of a lower volume, but.\r\n\r\n\r\nnik (22:59.595)\r\nWow.\r\n\r\n\r\nJohn Maher (23:08.848)\r\nwould say three to four new clients a month. And so our average retainers are between that three and $5 ,000 a month mark, sometimes lower when we're focusing more on performance incentives, which we love important performance incentives.\r\n\r\n\r\nnik (23:26.411)\r\nSo you're paying back that ad spend in the first month.\r\n\r\n\r\nJohn Maher (23:31.216)\r\nyeah, I mean, we're not even doing our own. I mean, if you're going to consider direct outreach ad spend, yeah, we're paying it back. And if we're first month profitability on every customer with great, I mean, we're, we're probably at like gross margins, gross, I'd say like 73%. It's incredible. We're very, very profitable. probably close to like 59, 60 right now. I have to check for this month, but we're incredibly profitable right now, which, which to be fair, as we scale up.\r\n\r\n\r\nnik (23:40.331)\r\nSo what, what are your?\r\n\r\n\r\nnik (23:48.779)\r\nAnd what are your net margins?\r\n\r\n\r\nnik (23:54.027)\r\nGeez Louise, wow. Okay.\r\n\r\n\r\nJohn Maher (24:00.528)\r\nyou know, that number is going to come back down to earth. So I don't want to act as if at 10 million we could be doing the same thing.\r\n\r\n\r\nnik (24:06.731)\r\nNo, no, no, I totally get it. So I get the lead generation on the private wealth side. What is the lending side? What kind of lending products are you marketing for?\r\n\r\n\r\nJohn Maher (24:14.608)\r\nSo business loans is a big one, and then consumer loans. So obviously as rates have gone up, a lot of people are seriously underwater in their mortgage or they need some type of liquidity through debt. And so for us, the bread and butter is meta -ads for consumer and business lending. It's huge for us. huge. And even actually tomorrow we have a call with mid -market.\r\n\r\n\r\nnik (24:35.755)\r\nReally?\r\n\r\n\r\nJohn Maher (24:42.384)\r\nbusiness lender to take over their direct outreach. So, but yeah, you would be shocked. Actually, and this is not a client of ours, but businessloans .com, they're doing huge numbers on Meta right now. I mean, I see their ads every single day. So these, and actually, I posted an episode on X the other day, even Ford, like Ford Motor Company has a new restaurant. They're doing paid media to find accredited investors to open up franchises.\r\n\r\n\r\nnik (24:57.899)\r\nWow.\r\n\r\n\r\nnik (25:09.003)\r\nReally?\r\n\r\n\r\nJohn Maher (25:09.936)\r\nYeah, so that's something where I think people look at Facebook ads and think, you can sell accredited investor -only deals on here or whatever it may be. And it's just so not the truth. If there are eyeballs, there are customers and so are clients.\r\n\r\n\r\nnik (25:22.859)\r\nI don't think that.\r\n\r\n\r\nNo, man.\r\n\r\n\r\nNo, Metta has Metta not only has a lot of eyeballs, they've got a lot of boomers, they got people who are wealthy, well to do like in 10 years, it probably is going to shift to more like Snapchat and Instagram where you're shifting your dollars. But right now, meta still has the majority.\r\n\r\n\r\nJohn Maher (25:35.056)\r\nfor sure. And so.\r\n\r\n\r\nJohn Maher (25:44.56)\r\nDefinitely, definitely. And there are so many firms that we talk to that it's one, they might not do any meta advertising at all, or it's, we spend a thousand bucks a month. we spent 2 ,000 bucks a month. And it's, hey, this is a crazy lever for growth. It's probably one of the most capital efficient ways you can quickly scale a service based business. And so I kind of, go ahead.\r\n\r\n\r\nnik (26:03.975)\r\nAre these are these banks using you as a third party? They're outsourcing their lead generation to or are you just generating leads and then sending them to the highest bidder?\r\n\r\n\r\nJohn Maher (26:16.176)\r\nGood question. So they're using us as a vendor to generate leads for them. I know some people do that model where they do lead generation and sell off the leads. We've never done that.\r\n\r\n\r\nnik (26:26.379)\r\nSo in the lead generation process, are you qualifying or are you just doing? Hey, we'll create the Google Facebook YouTube, whatever ads, but anybody who clicks through goes to your team. You handle it bank and you close them. Or is your team taking the call pre qualifying them and then sending over warm leads to the bank?\r\n\r\n\r\nJohn Maher (26:46.864)\r\nSo good question. So we do a degree of qualifying. A lot of that comes through surveys. They opt into whatever it may be, a lead magnet or whatever it may be. But we have discussed MQL versus SQL, marketing qualified lead versus sales qualified lead, about having our own kind of call center where we're getting on the phone and confirming that they are the next highest level of lead, a sales qualified lead.\r\n\r\n\r\nnik (27:13.579)\r\nTell me the difference, break those down. Okay, so a marketing qualified lead would be what?\r\n\r\n\r\nJohn Maher (27:19.056)\r\nSo a marketing qualified lead, I think people can argue over the exacts here, but let's say you want to buy a new car and you could say, I want a Chevy Tahoe, I want a red Chevy Tahoe, and we have one under our dealership, and you click on the link and you enter your email address, you would say, okay, you're a marketing qualified lead by the standards of the marketing. You're interested in a Chevy Tahoe. But then once you get to the dealership and we go, okay, your credit score is good enough.\r\n\r\n\r\nyou're ready to buy and are financially capable of doing it, you become a higher form of lead. Now you're a sales qualified lead. So the exact definition is gonna change on what you're selling. So.\r\n\r\n\r\nnik (27:56.683)\r\nnik (28:01.291)\r\nSo lead, but lead gen companies can be either just doing that lowest level of qualifying the MQL, the marketing qualified leads, I think, or they can, they can get those leads, qualify them, and then send them on as an SQL to their customer. I'm assuming you get paid more obviously for doing the SQL stuff versus the MQL.\r\n\r\n\r\nJohn Maher (28:08.368)\r\nCorrect.\r\n\r\n\r\nJohn Maher (28:22.384)\r\nCorrect. And like I said, there are businesses that have really, really great funnels where by the middle of the pipeline, their MQLs are almost as good as their SQLs. So there's definitely a spectrum of which you would identify either and how well businesses do. They might say they do it well, but how well do they actually do it? So for us, we have considered building up our own call center and team. Part of the complexity is though, when it comes to compliance,\r\n\r\n\r\nThat's opening up a whole other can of worms that's gonna be much more capital intensive for us by making sure, not only, it's not just like, okay, we're having someone who gets on the phone and says, hey, are you interested in this? Depending on what area of financial services you are in, you need more qualifications and prerequisites to be able to sell something, or are you selling it really, or are you just asking questions about it? It's a sticky area where I...\r\n\r\n\r\nnik (28:57.803)\r\nWhat do you mean?\r\n\r\n\r\nJohn Maher (29:20.528)\r\nFor us to do it, we really have to dedicate to educating ourselves on making sure that we're in compliance. It's something that we can do profitably and there's a one for it because there are plenty of businesses, especially like in wealth management, where it's just a much lower volume of clients, where the partners and juniors, they want to get on the phone as soon as possible. They don't want some third party team who they've never met to be on the phone with potential leads. So.\r\n\r\n\r\nIt's just something we haven't ventured into, but there are certainly other people who do do it and do it very well. So, yeah.\r\n\r\n\r\nnik (29:54.475)\r\nWhich side of the business are you more excited about?\r\n\r\n\r\nJohn Maher (29:58.256)\r\nThere's more scalability on the lending side because of the paid media factor, because it has a faster cash conversion cycle. That's something where as far as what it does for us is more lucrative. I, however, get very excited about working on more complex projects in wealth management. So we have a client now that does very, very interesting stuff who basically for ultra high network families, so they're worth $10 million or more.\r\n\r\n\r\nLong story short, typically you get those multi -million dollar echelons of net worth, you're paying into a life insurance policy and building the value of that up. And then you're paying the premiums for it. And then there's the $13 .6 or $13 .1 million death exemption that we have in America currently. And then you have the gift tax exemption, which is $18 ,000 per person you can give money to every year. And so the way things work a lot is you give that money.\r\n\r\n\r\nthat's deducted from your death benefit and paid into your insurance policy. This person and their company collateralizes your personal assets, uses that to issue a corporate bond which proceeds offset the cost of paying into the insurance premiums without affecting the death benefit. So it's a very arcane esoteric financial product. And so that has been an awesome challenge for us. And the, you know.\r\n\r\n\r\nThe fees from even one transaction can be in the high six figures per deal potentially, but very, very, very interesting situation. And so that stuff like that, I love a challenge where it's not as easy to scale up on, but it's really fascinating work.\r\n\r\n\r\nnik (31:38.667)\r\nYeah, and let me, I'm going to do my best here because I, I, I don't have stuff in front of me. I wish I did, but financial services. I'll kind of want to just like explain what this is to people who are listening. When you get to a certain level, up until that level, your financial picture looks like your savings account, your house, potentially if you own it and your 401k potentially, if you're contributing to it, that's about it. Maybe you have a life insurance policy.\r\n\r\n\r\nBut other than that, those are like the major assets that you have. When you get to a level where you have a few million dollars. Hey, Matt, Matt, check that when you when you get to the level where you have a few million dollars, then typically you have someone who's managing your money and they'll get charged one to 2 % a year of an asset fee to manage your money. And then after that, there's a bunch of different add -ons that they can sell to you. They sell you life insurance and the way these life insurance policies.\r\n\r\n\r\nfunction now as you can pay into the life insurance policy. It can almost function as a savings account. And when you die, the death benefit is not taxable up to a certain amount. There's also the estate taxes is the gift tax. So they're trying to maximize their ability to not pay taxes and, and the wealth advisor, the wealth manager, financial advisor, whatever you want to call them, they're playing the game with them. And the better that they can do, the more the family is willing to stick with them.\r\n\r\n\r\nand justify that 2 % a year, but then they also get paid for all of these supplemental add ons that they're able to offer to wealthier families. An umbrella policy, for example, is an insurance policy that is very generic. Let's say you live at a house, you have a zip line and some kid breaks their arm on the zip line and they sue you. Well, you have an umbrella policy that protects the majority of your assets, but they can still handle that claim. Anyways, so what you're saying is like, this is a very high net worth.\r\n\r\n\r\nenvironment and they pay a lot for specific products. So if you can just land one, you can, it's a very high ticket item. You can make a thousand dollars, $10 ,000, or in the case of the financial advisor, you can make hundreds of thousands of dollars over the life of that client.\r\n\r\n\r\nJohn Maher (33:48.336)\r\nYes. And so the example I just gave actually, the client pays nothing out of pocket, which is amazing. The proceeds come from the insurance side of things. But yeah, as you get into the upper air, the rarefied air of wealth, the complexities of personal finance become much more like business finance because you own so many different assets. You have so many different liabilities that it's much broader and more complex than, you know,\r\n\r\n\r\nmost people would usually think about, my house, my car, my student loans. It gets a lot deeper than that. And concierge services as add -ons, here's a funny example where a wealth management firm I know, they are big into their concierge services. So you can hire their personal concierge. And the example I was given was this lady who's a client driving by a car dealership points to a black BMW she likes.\r\n\r\n\r\nnik (34:23.786)\r\nYep. Totally agree.\r\n\r\n\r\nJohn Maher (34:45.808)\r\ncalls the concierge and says, hey, I'm giving this an anonymous, at XXY &Z dealership in X city, there's a black BMW, buy it, hang on. Then they go, they call the dealership, they pick up the car she pointed out, they buy it, they pay the tax, they get everything set up, and the next day, the wealth management client wakes up and the car's in her driveway. So those are the kind of crazy luxury add -ons which a lot of people just aren't even aware of this work.\r\n\r\n\r\nnik (35:01.163)\r\nseries.\r\n\r\n\r\nnik (35:11.083)\r\nYeah.\r\n\r\n\r\nNo. All right, let's finish this up with some rapid fire questions. You ready? What do you love about this business?\r\n\r\n\r\nJohn Maher (35:18.384)\r\nLet's do it, hit me.\r\n\r\n\r\nThe opportunities it gives me to learn and compete, I love it. I mean, I cherish every moment I'm in it and I adore this space.\r\n\r\n\r\nnik (35:28.779)\r\nAwesome. What do you hate about it?\r\n\r\n\r\nJohn Maher (35:31.664)\r\nThe over -saturation or at least perceived over -saturation differentiation is more important than ever.\r\n\r\n\r\nnik (35:39.339)\r\nOkay, as you sit here and look, what businesses or industries are you jealous of right now?\r\n\r\n\r\nJohn Maher (35:47.024)\r\nI'm not a tech guy, so AI, I would love to have $100 ,000 of revenue and be valued at $40 million. So when I look at 95 price to earnings ratios, I get jealous of that.\r\n\r\n\r\nnik (35:54.443)\r\nyou\r\n\r\n\r\nnik (36:01.771)\r\nAll right, here's my last or second to last question. What are you obsessed with right now? If you have two hours in your day, you don't have family stuff, you don't have work stuff. What are you spending your time doing?\r\n\r\n\r\nJohn Maher (36:15.088)\r\nfriends and my girlfriend. But that's generic as far as kind of the business or development side of things. To me, I'm fascinated by the world of private equity, so continuing my education on the more high -level finance side of things.\r\n\r\n\r\nnik (36:28.171)\r\nOkay, and then last question, if you were giving advice to yourself 10 years ago, what advice would you give yourself?\r\n\r\n\r\nJohn Maher (36:36.24)\r\n10 years ago, so I'm 24 now, so 14 years old. Five years ago, five years ago. Probably don't almost die. I would say, let's just stay on the linear path of things. No, but in all honesty, not that I have done things to perfection by any stretch of the imagination, but as far as advice, I'd say, start sooner, try harder, and lean into the fact that it's going to suck. You're going to fail a ton. You're going to...\r\n\r\n\r\nnik (36:39.659)\r\nAlright, five years ago.\r\n\r\n\r\nJohn Maher (37:05.168)\r\nconstantly not live up to what your expectations and goals are and that only means you know put the foot on the gas keep going through and play the long game and stay focused on that.\r\n\r\n\r\nnik (37:14.219)\r\nI love it, man. All right, well, where can people find you if they wanna follow you or learn more about what you do?\r\n\r\n\r\nJohn Maher (37:19.696)\r\nRealJohnMacher77 on X and on LinkedIn, JohnMacher. That's where you can see me.\r\n\r\n\r\nnik (37:27.243)\r\nJohn, this was Rad, my friend. Let's talk soon.\r\n\r\n\r\nJohn Maher (37:28.944)\r\nI super enjoyed it. Yeah, definitely talk soon and we'll we'll look I'll have you back on my podcast next year You'll have me back on this and we can do a we can do like a little side -by -side comparison of what we said and what came to be Let's do it. Let's do it. Let's do it You as well my pleasure\r\n\r\n\r\nnik (37:40.779)\r\nDone. I'm in. I'm ready for it. Sign me up. All right, man. Have a good one. See ya.",
  "metadata": {
    "duration": "",
    "date": "2024-09-23",
    "platform_source": "Google Drive"
  }
}