{
  "episode_number": "27",
  "episode_title": "How to Turn $500 into $25k/mo Cleaning Airbnbs with Logan Robinson",
  "guest_name": "Logan Robinson",
  "business_name": "Bonnie and a Broom",
  "transcript": "﻿Hey, what's up guys. Welcome back to another episode of economics. A few months ago, I posted something on social media saying that today I will pay more in taxes.  Then your cleaning company will do on top line revenue this year. And frankly, I got some blowback for it.  So today, in order to fulfill my community service that was mandated by,  I decided to have Logan Robinson on, who was the owner and founder of Bonnie and a broom, which is a short term rental focused cleaning company. \r\n\r\n\r\nIt was a really cool conversation. Logan actually told us about the Genesis of this company, which came during a six week competition that he and his friends had. To see who could launch and grow the biggest business during that time. And crazily enough, another one of his friends launched and grew a Instagram account, which now has close to 200, 000 followers that he's able to travel all around the world, reviewing golf courses.\r\n\r\n\r\nLogan also told us the story and strategy behind focusing on short term rentals, what his margins are, how he acquires customers and the struggles. Of residential cleaning. You're going to like this episode. And if you do enjoy this episode, please let us know, like, follow, subscribe, send to a friend. But with that, let's get into the episode calling in from our Kansas.\r\n\r\n\r\nWelcome to economics. How are you?  Thanks. Yeah. Excited to be here. Yes. It's, uh, in Arkansas, believe it or not, we have internet here.  I do. I do believe it. Tell me a little bit about your business and how you make money. What is it?  Yeah, absolutely. So I own an Airbnb cleaning company. So that's all we do is we clean Airbnbs in simplest terms.\r\n\r\n\r\nWhen you check into an Airbnb and when you check out of an Airbnb, there's a lot that goes on. Okay. In between you checking out and the next person checking in, we make all that happen. We make it look like nobody's ever stayed there before. That's awesome. What's the name of the company?  So my company's name is Bonnie and a broom.\r\n\r\n\r\nThere's a whole long story that goes along with that, but Bonnie is my grandma's name and nothing. Nothing sexy. Yeah. Bonnie and a broom.  I won't tell your grandma. You called her not sexy. That's fine. \r\n\r\n\r\nHow did you get into this space? Like what prompted you to even think about starting a cleaning company?  Yeah. So this is actually a really fun story. I've always been entrepreneurial, dabbling in a lot of different small stuff, but one time I was at my in-laws house and we're watching the show undercover billionaire.\r\n\r\n\r\nIf you've ever seen that show, I think it's on CNBC or something. Anyway, my brother in law says we could do this. Like we could do our own version of an undercover billionaire. And so we did it. We said, okay, you got six weeks. You have to start a brand new business from scratch. You each have a thousand dollars to start this business.\r\n\r\n\r\nYou can't tell anybody it's a competition, but it's essentially a competition. Whoever makes the most money in six weeks, starting a brand new business wins the competition. So this is between you and your brother. This is me, my brother in law and three other friends. We were like, let's do this.\r\n\r\n\r\nWe're all entrepreneurial. We all want to start something. So he goes six weeks, we met weekly, everybody had a thousand dollars anyway, off to the races.  So I spent the first five weeks of that competition trying to make money, like trying anything. And I made zero dollars at the end of the first five weeks, like nothing really demoralizing.\r\n\r\n\r\nBut the good part about it was nobody else made any money either. So five weeks in, it turns out we're all terrible entrepreneurs and nobody made any money.  So I was like, okay, it was five weeks in any way, my buddy sent me a tweet that he just read on Twitter and it was like, how to start a cleaning business in five minutes.\r\n\r\n\r\nAnd I was like, that's it. I want to know who it was.  Squeegee God. Johnny Robinson. That was the tweet. So he sends out this tweet or this tweet goes, whatever. I got this tweet and it's like, how to start a cleaning business in five minutes. And I was like, I'm so desperate to win this competition. I'm doing this right now.\r\n\r\n\r\nI literally, I kid you not the website was set up. I got my first cleaner in two days and I had my first customer two days later. So from start to finish it was four days and I made 500. In four days. No way. And so I won the competition. I was like, I'm at 500 bucks and y'all didn't make anything. So I win by, by default.\r\n\r\n\r\nNobody made anything. No, but actually, so,  so my business, which is now my full time job, started because of this competition. And I have a buddy who was also in the competition. He started a golf Instagram account, which is called course it's called courses. You need to play. They have over 150, 000 followers now on their golf Instagram account that was started during this competition.\r\n\r\n\r\nAnd they're being flown to courses all around the country now to play golf and film for these courses. And they're getting paid like 10 grand of profit every trip they go on. So how crazy is that?  What's that? I said, how crazy is that?  Oh, it's not amazing. It's not. They've been sponsored by Bonobos now, like they're getting free.\r\n\r\n\r\nSo anyway, so I started my cleaning business from this competition. He now has 175, 000 followers on Instagram and they're being flown to like Florida. They're just in Virginia playing golf all from that competition. So yeah. And at a certain point or after that four days, I was like, Oh crap. Well, I have a cleaner now.\r\n\r\n\r\nAnd I have a customer, so I guess I just like by default have a business and I just gotta keep going so like I didn't think about it and it was not premeditated, it just happened. So what a freaking cool story. You know, Chris and I, my business partner, have tossed around this idea of sponsoring a competition where we just give 10 people 1, 000 each and see what they can build.\r\n\r\n\r\nIn a three month period of time, just cause like, that would be so cool to see.  And it doesn't have to be people who are starting businesses that have never run businesses. It can be people who have lots of experience. Like Chris would love that like competition. Cause he, I told him I spent 10, 000 going to main street or excuse me, capital camp.\r\n\r\n\r\nAnd he's like, do you know how many businesses I could have started with 10, 000?  I think it speaks to the power of a network and a community where like you, six friends on your own probably would have been sitting twiddling your thumbs or like never launching anything, but. When you get the six of you together and you have some positive peer pressure like, Hey man, how's your business going?\r\n\r\n\r\nOh, did you launch? Oh, you didn't do anything yet. You, Oh, you got 500 all of a sudden out of that two out of six, I mean, a 33 percent success rate where one business, um, started and one, I mean, I guess they're both businesses at this point because he's probably making some decent money or at least able to, to fly cool places.\r\n\r\n\r\nWhat that's a really cool story, man. And I think that like doing something like that epitomizes everything that I love about entrepreneurship. Like I think that the true entrepreneurs are the people that have an idea and they execute as quickly as possible. Like they don't write up a business plan.\r\n\r\n\r\nThey don't sit and stew on it for weeks and weeks and weeks before they do anything. It's, you have an idea, you notice a problem, whatever you see a gap in the market and you just go like, you just do it. Yeah. Have you always been like that? What was your background? Where are you from? Where did you grow up? \r\n\r\n\r\nYeah. So I grew up in Michigan,  grew up in Michigan. My grandpa owned rental properties. So we were always doing work on his rental properties all growing up. My family moved to Utah during the middle of my junior year of high school. So we picked up from, we were in Lansing, Michigan. So the Capitol, we moved to Manti, Utah, which is a town of 3, 000 people.\r\n\r\n\r\nYeah, it's super small town and central Utah at the middle of my junior year of high school. So I kind of got thrown into, you know, you left this great place in Michigan, you're moving literally the week after homecoming to this town that you've never, like, it's the tiniest town. So it's crazy. You're like immediately thrown into an uncomfortable situation where you have to make friends like day one and put yourself out there.\r\n\r\n\r\nSo it was really awesome. Yes. It was really, really awesome. Are you LDS? Yeah. Yeah. Okay. So you got, at least you got dropped in and it was, there's like some cultural familiarity that would have sucked going from like Michigan to Manti, Utah, not even knowing a soul or knowing what the culture was like there.\r\n\r\n\r\nNo, it was a weird culture still because I was walking in the hallway. I was walking down the hallway my first day in Manti high school and people are opening up their lockers. And there's like a picture of Jesus and people's I was like, what is going on? I was so rattled. I was like, what is happening?\r\n\r\n\r\nWhat school am I in?  It was like, so mom and in the cult, everyone used to make fun of me for being cold. It really is one. It was weird. It was weird. But some of my best friends, I met some really incredible people there and my parents still live there. So it's an awesome place. Yeah. So anyway, after school, I served an LDS mission in Italy.\r\n\r\n\r\nSo I was in Rome for Italy for two years, which was, when were you there?  I was there from 13 to 15. Okay. Well, I'm way older than you. I am way older. Yeah.  Rome, that would be a really, really cool place. So you got two years, like I did, I was in Hungary. Of just knocking doors and no, no, no, no, no, no thrown in your face.\r\n\r\n\r\nOh yeah.  After you came back, how did that help you start this cleaning company? Look, when you serve an LDS mission. Mormon mission more colloquially known, you don't have an option, but to get to work, but there's not like people think that you just sit around and like, you have to leave your apartment by what is, I can remember 10 am and you don't come back until 9 PM and you better be working every single second of that day.\r\n\r\n\r\nAnd so like when you serve an LDS mission, you're working nonstop for two years. Like you don't, it's not fun. You're not on the beach. Like you're working.  I was just talking to somebody about this. There's a couple of profiles, a veteran. So somebody who's served in the armed forces, I think LDS missionary.\r\n\r\n\r\nSo people who've served LDS missions. People who have sold calico cut knives. Oh, there you go. What do they call it? I think that's their name. And then D one collegiate athletes.  Those are  some of the best. Entrepreneurs and workers, just because they had to go through some really difficult things and they understand what it takes to kind of get to work.\r\n\r\n\r\nIn fact, Chris and I, I trained Chris on our missions. So he and I have known each other for almost 20 years now, which is kind of crazy to think about, but.  Why did you start a cleaning business? I honestly,  I look at cleaning businesses and I'm like, no, thank you. Switching costs are super low. The labor is really hard to manage.\r\n\r\n\r\nIf someone finds a hair in their drain, they're mad at you. It just seems like a really, really hard business to start. What was attractive about it to you? And like, how was it able to get spun up so quickly?  So, yeah, I'll answer that first by saying.  I did not think about it. Literally saw the tweet, set up the website the next day.\r\n\r\n\r\nLike it was not because in the competition, I didn't think about it. I don't like I had a photo booth business before that. I've we've I've owned, we own eight different rental properties. So I've always done something, but like the cleaning business was like, I'm just starting it right now. Cause you're right.\r\n\r\n\r\nThere are lots of challenges. What I've tried to do with my cleaning business is. Mitigate all of those risks. So you said low switching costs. You said super picky customers. I can't remember what the other things you said, but I've tried to do things in my cleaning business to mitigate all of those and make those not true for my business.\r\n\r\n\r\nAnd we can get into what I'm trying to do there. But do you know who Neil Parekh is?  I had Neil on, I don't even remember when at this point, a couple of weeks ago.  And his company seems very similar to yours. They're focused on short term rentals. So that's where their relationships are coming from, except his is a franchise.\r\n\r\n\r\nHe's more of the franchise award and he's starting different franchises around the country.  You picked Airbnb, which is essentially short term rentals.  Was that on purpose or did you fall into that?  So I started out residential. It started residential. That's where I got my first couple of customers. And I hated it.\r\n\r\n\r\nI hated residential. Residential was terrible. And I'll tell you why. This is why cleaning is such a bad rep reputation is for residential cleaning. Because when you do residential cleaning,  you go into that property, that customer knows where all the dirty things are in that house. And they don't tell you where those dirty things are.\r\n\r\n\r\nEvery time you go clean a residential customer, this this is a hyperbole. Obviously, a lot of times when you go clean, They're testing you. They just want to see, can you find the dirtiest pieces? So for example, I hired a cleaner, one of my own cleaners to come clean my house.  And my wife who knows I'm in this business, she knows how much I hate residential cleaning.\r\n\r\n\r\nMy cleaner comes in and does a great job. I'm like, this is a great, she did a great job. And my wife is like, yeah, but she missed. The tiny little ring in the sink and I can see that there's grime in there and I'm like, yeah, but you don't see the 300 other things that she cleaned perfectly. You only see that tiny little ring.\r\n\r\n\r\nThat's why I hate it. Residential. Yeah, you're articulating.  That's why I hate residential. You could never make a customer.  So Neil pivoted into the short term rental on purpose. Did you do the same? Was that what you like? Okay. Okay. Why walk us through kind of your reasoning for going into short term rental. \r\n\r\n\r\nIt was very calculated. It was very deliberate decision. I looked at, I knew that at a certain point in my business, we were doing, we had some commercial contracts. We were cleaning a hotel. We were a motel. We were cleaning a clubhouse. We were cleaning residential. And we were cleaning Airbnb. I knew that my business was going to just start to suffer if we didn't focus on one of them.\r\n\r\n\r\nAnd I knew that we would not have a good reputation if we were trying to do all of these different types of cleans. So at a certain point I said, okay, who is bringing me the most money? Which customers are bringing me the most money with the least amount of headaches and which cleaners are doing the best job and what's their focus.\r\n\r\n\r\nAnd it was very clear that my customers that were paying me the most money owned Airbnbs. And my cleaners who were doing the best job  focused on Airbnbs. That's what their, that's what their like focus was. And so I made a decision September of 23. So six, seven months ago to say, I am only going to do Airbnb cleaning.\r\n\r\n\r\nLike literally the next day I got calls for residential, turned them all away. I said, we are only going to do Airbnb cleaning. How long into your business did you decide to make that pivot? So September of 2023 was how long into the  company's life?  11 to 10, 11 months. So not even a year, less than a year. \r\n\r\n\r\nAnd so since making that switch, will you talk about kind of how big is your company? How many employees revenue per month, you know, number of customers or clients just give us a high level, how your company looks today?  Yeah. So we have doubled the, so. So some context, I'm not, I never pretend to be some incredible entrepreneur.\r\n\r\n\r\nI'm just a guy that's trying to figure it out. So my business is not nearly as big as some of the other guys that you're going to hear about right now. Our run rate this month, we're going to do about 25, 000 a month in revenue. That's kind of our run rate for this month. Back then in September, we were doing about 10, 000 a month.\r\n\r\n\r\nWhen I turned down, I was working full time. I was at Walmart full time, so I was growing this as a side hobby. So I was working full time. This is kind of my side hobby. Walmart corporate, I'm assuming since you're in Bentonville. Yep. Walmart corporate. Yep. Believe it or not, they actually do have a corporate office.\r\n\r\n\r\nWhenever I worked for Walmart, they're like,  as like a bagger, like what, like, what do you do? So yes, they have a corporate office anyway. So in September we were doing about 10, 000 a month, residential, commercial, all that stuff. I said, no more, we're just going to do Airbnb. So we took a big dip, right? We like cut out half of our business, but I was working full time.\r\n\r\n\r\nSo like, it didn't really matter.  Like a intentional dip in my business because I wanted to create a brand and a reputation for my business in my area. So now since then we've, I mean, we've quadrupled since that number. So now we're doing about, yeah, 25. 1, 000 a month, strictly Airbnb. What gave you the conviction to go all in?\r\n\r\n\r\nLike, why did you quit your job finally in September after you decided to make the pivot? There's a lot of different answers that I could give you. I've always, it's always been on my roadmap to try to do something, to try to take a risk and do it. I will tell you more personally, I've got family members who have all been fired from their jobs.\r\n\r\n\r\nFor no fault of their own, and it totally upended their family. So my dad, for example, he was a, he was the manager of emergency room. My mom was a teacher. My dad's a nurse. My dad was the manager of emergency room in Michigan,  got fired because he wouldn't do certain things. Anyway, his boss was trying to save budget.\r\n\r\n\r\nHe didn't agree with the changes. So he got fired. That moved our whole family to Utah during the middle of my junior year of high school. So my dad gets fired. We moved to Utah. I think that's always kind of stuck with me as I'm never going to let anybody else determine what happens to my family. Right. \r\n\r\n\r\nLike my dad, no fault of his own. He's incredible. And he landed on his feet. He's got a great job today.  He's an incredible man, but I didn't want to put myself in a situation where somebody else was going to tell me what I had to do with my family or my life. So why September of last year? Like, why was September the, all right, I'm out.\r\n\r\n\r\nI'm doing this.  Well, September was when I made the switch to just Airbnb. I didn't actually quit until February.  So only three, four months ago is when I quit. Actually. You were seeing some traction. And at that point you, you probably were like, it's time.  Yeah. And I didn't agree with, You know, I didn't think, I didn't think I had a clear path to get to where I wanted to go at Walmart.\r\n\r\n\r\nThere wasn't, there wasn't a clear path there. And so I just said, I've got a business that's working. I want to do this anyway.  Might as well take the jump right now.  It's interesting. My brother in law made a comment to me seven years ago  when he left his job and he was working at a skilled nursing facility company.\r\n\r\n\r\nAnd he was kind of like trying to figure out what he wanted to do.  And, you know, everybody has a story of when they left. And he just, he said, I didn't want to be reliant on somebody else's generosity anymore.  Yeah. And a lot of times in a corporate setting, performance doesn't necessarily equal. Yeah.  Yeah.\r\n\r\n\r\nThere's a lot of politicking, or there can be things that maybe you get a bonus because people like you, et cetera. And so he's like, I want to start my own company. And that was hard for his family for two years. And now he's built a skilled nursing facility company with 60 facilities and 200 and  300 million a year in revenue.\r\n\r\n\r\nYou know, he wouldn't have started unless.  He was kind of pushed to make that leap. And so that had like always stuck with me. And in 2020 I I'd had the same feeling. I'm like, I don't want to be reliant on other people's generosity anymore. And that's when I bought and started my first businesses.  So I get it.\r\n\r\n\r\nI get kind of like having that  internal motivation for you. Like you probably could have done anything. What made you decide to double down  on cleaning? Like, why not pivot out and start another business or buy another business or do something else that was maybe more your skillset? Like, what's your background?\r\n\r\n\r\nWhat, what were you doing at Walmart?  I was in finance. I was in finance for two years and then I was a buyer for years. So like you could have started a fractional CFO company, you could've started a CPA company, you could have done something in the services space, finance, consulting, et cetera. But you doubled down on cleaning.\r\n\r\n\r\nWhy?  Yeah. I ask myself that every day,  every day when new prompts pop up, I'm like, why am I doing this? What's going on? I'm a firm believer in the best business is the one you already have. Like the best business is the one that's already working. The cleaning business was working. If I did not hire a full time manager, I hired a full time manager.\r\n\r\n\r\nShe's 40 hours a week. I would be, I would have already replaced my Walmart income.  Just with her, like with the business making good money and I've already replaced my Walmart income, right? Essentially it's working, right? So it's already working. And so why would I, if it's not broke, don't fix it kind of thing.\r\n\r\n\r\nWell, but I'm also trying to pivot into other things as well, because I don't want to be a cleaning company owner for the rest of my life. Do you have some income from,  uh, your rental properties? Like, are those also helping you as you launched this business or? Has that been a stressful part of the process trying to manage these  rental properties that you have  the rental properties?\r\n\r\n\r\nWe've had for 5 years now. They are cash flow positive, but we've just reinvested. We're just reinvesting everything. So they're older. So we've put new roofs on all of them, updating all the appliances. So they're not necessarily been a source of income for you or stability. Yeah. I'm not getting us. Yeah.\r\n\r\n\r\nHow do you get customers right now for your cleaning business?  Yeah. We do not spend any money on advertising. We have the exact, I got the exact numbers for you. Yeah, man. Come on. Say what?  We don't, we don't mess around here. So I have the exact numbers for you and I just switched my screen. 57 percent of our customers come from Google.\r\n\r\n\r\nThey search home cleaning business, whatever. They see our reviews and they call us, so that's good. That's going to be SEO, Google business profile. Okay. Yep. 57 come from Google. 22 percent come from Facebook groups. So I'm really active in Facebook groups and our local Facebook groups, just like posting what I do.\r\n\r\n\r\nSome people might hate this, but what I do is when somebody posts their Airbnb in our like global community, I'll immediately DM them and be like, Hey,  beautiful Airbnb. Can we give you a quote for cleaning? Like super easy. And then 21 percent come from just word of mouth. Yeah. Have you seen, do you know who Dan Magazu is on Twitter? \r\n\r\n\r\nHe just started a business recently that it's a marketing business, but what they do is they go into local Facebook groups and they will talk about your business or they'll find prospects and they'll cold outreach to them.  So like he's doing what you're doing except you would pay him to do it for you.\r\n\r\n\r\nOkay.  For you, like why not spend some money on advertising? If you're doing that well, organically, why not juice it a little bit and do some pay per click maybe do a little more on the SEO? I don't know what other avenues or platform mailers, those types of things. Why not?  So I definitely started out doing advertising.\r\n\r\n\r\nThat's how I got all my residential customers was through running ads. Um, I've tried pay per click with Airbnb and it just doesn't convert nearly as well on that. So, I'm not opposed to it. I think it's really tricky though. And this is going to sound like an excuse. It's not an excuse, but I don't want to grow too fast.\r\n\r\n\r\nAnd that sounds ridiculous, but in Airbnb cleaning, like I think you said at the very beginning, like  with Airbnb cleaning, it has to be perfect. Like it really does have to be a perfect clean. So we charge a lot, like we're expensive. Like people probably hate us because their Airbnb cleaning fees are so high.\r\n\r\n\r\nBut like, did you want to sleep in a clean property or not? That's what it costs. So it has to be perfect. And if we just go and bring on 10, 20 new properties, I have to staff that. And if I can't find the staff that I trust, I'm not going to do that because we'd get bad reviews and it's just a bad thing.\r\n\r\n\r\nSo I'm trying to grow really thoughtfully and really trying to manage that growth. Cause yeah, I could spend a thousand bucks a month on ads, no problem, but I don't know that I'd be in a better position if that makes sense.  Yeah. You potentially have more revenue. You potentially have more word of mouth, but the question is whether that would be a sugar rush or that would be a A sustainable growth, right?\r\n\r\n\r\nCause I've had businesses where we've popped in revenue and then come back down. And it was because we didn't have the infrastructure necessary to actually support that longterm. And there's nothing worse than growing and then seeing it come right back down because you know that you screwed up. It's not any other external forces, except for the fact that you didn't provide the level of service that you were hoping to.\r\n\r\n\r\nSo talk about a little bit.  What is your  customer? Is your customer, I'm assuming would be individual. STR owners or is it like property management group? Cause I also know that there are groups that manage short term rentals. How do you go about finding new customers? Yeah, the majority of our customers are individual owners.\r\n\r\n\r\nThat they just set up a new Airbnb. They're searching for STR cleaners in Bentonville. We're the first people that pop up on Google. They call us and that's kind of, we're off to the races there. So our biggest customer is individual short term rental Airbnb hosts.  Second to that would be property managers.\r\n\r\n\r\nWe don't have a ton of property managers that we work with. They're mostly just individual Airbnb owners. So, which is awesome because we provide. A lot of value and a lot of service to those owners, especially the ones that live out of state, right? If you live out of state, something goes wrong in your property and you don't have a property manager or kind of like the first boots on the ground, we can go help you out. \r\n\r\n\r\nSo, because you're focusing on the short term rentals,  is it seasonal? Are there times of the year where it's going to be a lot busier than other times of the year?  So January, January, February, super dead. Yeah. Anyway, go ahead. Oh, okay. No, keep going.  Well, so think about it. Think about your own travel schedule.\r\n\r\n\r\nWhen are you traveling and when are you not traveling? Right. Yeah. Honestly, January and February we do travel because it's cold. Yeah, it's well, it's cold here in the winter and we always make a California trip or a trip somewhere warm. Once in January for my wife's sanity. And then once in February, because three of my four boys have their birthdays in February.\r\n\r\n\r\nSo it's like.  That's just kind of where I think, but I get what you're saying, like  nobody's going to Bentonville, Arkansas in the middle of January. Right? I mean, yeah, we're in the South, but we're not that South. Like it's still cold. Yeah. So yeah, January and February are pretty dead. Other than that, like it's, it is pretty consistent flow.\r\n\r\n\r\nSpring break is huge for us because a lot of people travel for spring break. So just think about like typical travel schedule and that's what, you know, that's how seasoned all our businesses. Well, like what's your average revenue per month per customer?  Yeah. So the average customer, let's see, about 700 per customer  per month.\r\n\r\n\r\nHow much time is that? Like 700  is like a two hour cleaning. Like, what is that? That's the tricky thing with Airbnb cleaning is these cleans take a long time. Like we, yeah, you gotta do, you gotta do all linens on site. Typically you can outsource some of it, but our cleaners on average, they're spending three to four hours at each property.\r\n\r\n\r\nSo it does take a long time.  And how do you get paid by these customers? What's your cash conversion cycle? Is it credit card? Are they paying you upfront? Are they paying you in arrears? What does it look like?  We have credit cards on file for all of them. So it's really great. I'm not sending out invoices, waiting for people to pay me.\r\n\r\n\r\nThat's on our onboarding process. I get their credit card information. We do the cleaning. I basically build their credit card same day. For you  and these customers, how do you ensure quality?  Like you're probably not going to every house, but do you go out? Does your manager go out?  Do they take pictures every single time?\r\n\r\n\r\nWhat there has to be something I'm sure that you've instituted that gives people peace of mind that like, yep, John was there, they cleaned the house. Here are the pictures of us entering and exiting. Cause there's probably a lot of liability potentially. If you don't document that stuff, what do you guys do to make sure that you're. \r\n\r\n\r\nI mean, this feels so ridiculous to be talking about this, but we have a very like intense process for this. Our cleaners have checklists, so they, we have an app. Our cleaners have 60 items on their checklist. They're required to upload photos when they're doing the clean. And then after that clean, we do send in another cleaner to do quality control inspection.\r\n\r\n\r\nSo about 75 percent of our cleans have another person coming in to do quality control all for the sake of. Dang. It is. You find a hair in your shower,  it's over, right? Like you're going to call and complain and you're going to have to refund the cleaning fee. It's so important for us that we get a five star cleanliness rating that I will pay another person to go to a quality control check.\r\n\r\n\r\nNow they're there for 15, 20 minutes doing quality control. It's not a huge cost for us. But it's just, it's really important to make sure that we're maintaining five. What do you mark? What do your margins look like?  So gross margin, 50 percent just immediately whenever I, if my cleaner is going to charge me this amount to do this job, I just double it to the customer.\r\n\r\n\r\nSo 50 percent when you look at your net margin, you should, I mean, it's still expecting 20, 25 percent on that.  So your cleaners are 1099. Yeah. There. Yep. Okay. And your only employees are, it sounds like your office manager and maybe one or two other people. Just one. Yeah. Just the one.  Yep.  Man. That's.  So I have a couple of questions about this space.\r\n\r\n\r\nI don't fault anybody in this space at all, but I see, I can't remember what his name is.  He's on Twitter. Young guy seems enterprising and.  It's like they get to a point 30, 000 a month. It's kind of like the number in my head. I don't know if that's true or not. And all of a sudden it's like, Hey, buy my course.\r\n\r\n\r\nI'll show you how to get to 30, 000 a month. And then all of a sudden his monetization mechanism is about selling the course or selling an info product, as opposed to growing his cleaning company.  Am I just judgmental or Is there a reason that I tend to see a lot of people selling these cleaning courses or like talking about how easy cleaning companies are? \r\n\r\n\r\nNo, you're 100 percent right. And I'm not going to like, I've sold courses before too. So I'm not like faultless here. I will tell you that I do think that the cleaning group on Twitter is a much more aggressive with selling courses than a typical industry. And I don't know why that is. I think it's because I would say it is really typical.\r\n\r\n\r\nIt is pretty easy to grow a cleaning business with what's it called? Like a flash in the pan, like a really quick build this big cleaning business. And then be able to market that because you do have marketable skills of how you grew that cleaning business. But I don't think those people are building real legitimate businesses.\r\n\r\n\r\nLike I think they're building businesses for the sake of being able to talk about them.  I'm trying to take a very different approach of like, I'm trying to build something of value here, like of something that is actually a valuable business. And yeah, I've sold courses before. Like I don't, I don't try, but don't, don't get me wrong.\r\n\r\n\r\nI don't knock them for selling courses. That's,  I think. Make money. However, you're adding value in the world and people will tell you whether or not you're adding value by by paying you. I've just been like, you're like 23. Yeah. 30, 000 a month. Isn't that impressive? Is it just  Like, maybe it's because like you started your business with 500, right?\r\n\r\n\r\nMaybe it's that it's a pretty low barrier to entry and it's something that's easily teachable to people who are enterprising. So obviously, you know, maybe there's a, just a larger course market for it again. I don't want to knock it. Cause it's like, I get it. I totally understand it. It's weird. It's weird.\r\n\r\n\r\nI don't know. I like, I really, I can't put my finger on it. Every person on Twitter. This is. That's a hyperbole. A lot of people on Twitter that have cleaning businesses also have courses.  I do think that maybe it's because they're not profitable. Like I really, maybe these cleaning businesses, yeah, they get, they have high revenue numbers, but they're not actually making any money at the bottom.\r\n\r\n\r\nYou know, selling an info product is much more profitable, scalable, replicable.  They're just trying to make, they're just trying to make profit wherever they can. So my biggest question is why is your cleaning business not making profit? Like you, why would you sell a course? Hey, come learn how to do this.\r\n\r\n\r\nOh, by the way, I don't actually know how to make any money from it, but by my course anyway, right? Like that does not, that doesn't sound good to me. So it could very well be that they're just not making any profit. They have a huge top line number, but they haven't figured out the operations and so they're not making any money.\r\n\r\n\r\nSo they have to sell a course. Yeah. Okay. I'm going to pivot just a little bit before we get to the rapid fire questions.  I have a business idea  that I am personally in love with, but I just have no idea if it would work. I want to pitch it to you. Sure. Go for it.  So I live here in Idaho. There's this resort town near us called McCall.\r\n\r\n\r\nIt's on a beautiful Lake, lots of cabins on the Lake. And there are these types of resort towns all across the country.  But I've always wondered, and maybe this exists,  why wouldn't there be a service for wealthy families in particular?  Where they could call and say, Hey, look, I'm coming up,  please get the house ready. \r\n\r\n\r\nAnd that company has a list. They know what food, what drinks to get. They fuel up the jet skis. They fuel up the snowmobiles. They make sure the car that's there is detailed. Right. And so then when the family gets there. They've got their food stocked. They've got everything ready to go. The boat's ready to go.\r\n\r\n\r\nOr if it's in the wintertime, the snowmobile is ready to go. And they then pay that company either a membership fee or like a cost plus fee. And it would seem like the Airbnb space would be Kind of, I don't know, something you could play off of. Have you ever heard of something like that or have you ever thought about doing a services business like that?\r\n\r\n\r\nSo truthfully, I've never heard of something like that, but for some reason that just like that feels so intuitive to me, right? Like whenever you're traveling, you do a Walmart grocery order or something to get food at the house and it is kind of a pain. That feels, I mean, that feels really intuitive to me that if I had the money, I would totally pay for something like that.\r\n\r\n\r\nLike that feels, I think so. I mean, if you have enough money, you have all those toys, you'd probably pay an extra thousand dollars a month just to have somebody to get them all ready. Yeah. Even if you ordered the Walmart order and they come to your house and they pick it up, they know the code, they put everything in your fridge so that when you get there, the food's all there because there's so much I'm showing my privilege.\r\n\r\n\r\nNow, when you go to an Airbnb or when you go to a cabin or when you go to one of these places. There is so much prep, you got to get the order there. You got to get the kitchen ready and then you got to throw the stuff out when you leave. It's kind of a nightmare. And that's not a nightmare. I shouldn't say that.\r\n\r\n\r\nIt's just a pain. And if there was a service that I could pay to just get it done, I would think that it would work really well in towns like Vail and towns like, what's Park City in Utah. The challenge there is the labor. Because you're not going to find anybody who's willing to work for 20 an hour that's able to live in Park City or van, right?\r\n\r\n\r\nSo the challenge is, do you have people that you can staff to do that? Because they can't afford to live there. And so you're going to have to be, I don't know how you get labor for that, but I think Park City would be easy because you could just pull somebody from Salt Lake, right? Like you, you tell the client, look, there's a six hour minimum notice.\r\n\r\n\r\nOh, okay. So six hours ahead of time, they let you know somebody can get there from Salt Lake in under an hour to Park City and then they can bring all the food and do all the shopping and just like have it ready to go in that place. I don't know how easy veil is. I don't know how easy. Okay. Some of these other resort towns might be, but  that is a potential solution.\r\n\r\n\r\nNot sure, but anyways, put that on your back burner. I think that's your next company.  That sounds nice. That sounds operationally really challenging, but that sounds like a, it's a, it's an opportunity for sure. Oh yeah. All right. I have some rapid fire questions for you. Are you ready? Go for it. What do you love about this business? \r\n\r\n\r\nI love the recurring revenue aspect. Once you pay the property five times, it's so easy.  What do you hate about it?  I hate Airbnb tends to get a lot of Karen's hosts that are like, you know, super, super picky. I don't like this. I have fired three hosts because they just drove me nuts. So that would be a nightmare.\r\n\r\n\r\nThat would be a nightmare. Okay. What industry are you personally most jealous of right now?  This, I am going to get a lot of hate from this. I think I am so jealous of the newsletter industry. Here's why go on. Okay. I. What's my worst nightmare? My worst nightmare in my business is that my cleaner doesn't show up and now I have to go clean.\r\n\r\n\r\nThat property ruins my whole day, right? That's my worst nightmare.  What's the newsletter's worst nightmare  that their server goes down and they have to delay the email one hour.  That's not a nightmare. That's like, for me, that'd be a cakewalk. Like, oh, it's an hour delayed.  Awesome. Like, I'm just trying to think what's what are the businesses where their worst nightmare does not sound like a nightmare to me.\r\n\r\n\r\nYeah. That is the easiest business. Sorry. That's what I was saying. Like people are going to get mad at that. I think you've got life on easy mode. I'm going to do, we'll get mad at that. It's an info product business and it takes a lot  to scale your newsletter to the point where you're making enough money to sustain yourself.\r\n\r\n\r\nRight? Like that. You're not doing it on 500. You're, you know what I mean? Like you're spending a lot of time in it. And if the only cash you ever paid was 500, well then you were the person putting in the time and energy. And so then there's a large cost associated with that. But that's interesting because it's an info product business, right?\r\n\r\n\r\nLike you're selling information to people. Do you have experience with a newsletter? Have you ever done it?  I have a newsletter that is  specifically for Airbnb cleaners. It's called called same day, turn same day, turn.  com. So if you're interested in Airbnb cleaning, That is the newsletter. It's brand new. I think we've had like  four, 1, 500 subscribers to the newsletter.\r\n\r\n\r\n1, 500? Yep. On the newsletter. They're all brand new.  Brand new. Started it. I think I've sent out like five emails.  How do you have 1, 500 subscribers?  You know? So  I have been working since March Facebook group. I grew a Facebook group that is just for Airbnb cleaners. I have 3000 people in that Facebook group that are all Airbnb cleaners.\r\n\r\n\r\nAnd that's how I've sourced newsletter subscribers for this newsletter. You know, that 1500 is good for a new newsletter, right? It's not as big as I want it to be, but  I've heard that before. No, but 1500 is really good.  Yeah. We've got 40 last time I checked 42 percent open rate, 2 percent click rate. Like I think we're hitting all the metrics that you'd want to.\r\n\r\n\r\nSo,  so You are much closer to the monetization number than you realize that. I have a friend of mine in a very niche space  who makes 2, 000 a newsletter, 8, 000 a month,  and he's got 5, 000 subscribers, but it's because it's a very niche space, so  I,  I think you're very close actually to being at a place where you could, you know, Meaningfully monetize that newsletter. \r\n\r\n\r\nOh, that's exciting. Well, if anybody's listening or if, you know, what my next steps are, let me know. I just got to grow it.  That, and you got to figure out, okay, who's marketing to Airbnb owners. What are the types of products that they, I don't know, but I would assume there's somebody who's like, Maybe air DNA or yeah, I don't know. \r\n\r\n\r\nThink about all the cleaning products. Think about all the cleaning products that these Airbnb cleaners have to buy. Like  Clorox, PNG, like these are kind of, I'm imagining these are my customers that are going to want to advertise to cleaners. Yeah.  That's super interesting. Okay. Last two questions. You have a family, a business.\r\n\r\n\r\nIf you have two hours in your day, you don't have anything to do  and you decide to do something. What's taking up your mental space? What are you obsessed with right now?  Fun related or work related? Anything like you can choose between either one of those. What are you doing with that two hours?  I'm at the stage where.\r\n\r\n\r\nI just quit my job. I'm going all in. So like, if I have an extra two hours, like as much as I hate to say it, I'm working. Like I, I'm grinding. No,  I know, I know. I'm just kidding. I hate that. I'm the, I hate that.  I hate it so much. I'm the same way. I'm the same way. Yeah. And it is terrible. I don't have hobbies.\r\n\r\n\r\nLike I just bought my first golf set. I don't even know how to say that, right. Like three weeks ago. And so like, maybe I'd go golfing, but like that's, oh, I hate golf. But that's so unlikely. I'd be working. I hate it. But I do. It's a fine answer. What advice would you give to yourself 10 years ago, 19 year old Logan, other than someday your mission will come to an end.\r\n\r\n\r\nWhat advice would you give yourself?  Oh gosh, this is, yeah, I don't know that I thought about this too much. 19 year old Logan. I would have done college way differently than I did. I did college very wrong. Very poorly.  I went to BYU in Provo. I was so obsessed with my grades and getting a good, getting good grades.\r\n\r\n\r\nI was in bed every night at 10 p. m. My wife, my now wife, she asked me to go on a date. The date started at 8 p. m. and I told her no, because it was too late for me, \r\n\r\n\r\nI'm in college. I was like a sophomore in college. Why was that bad? I mean, it didn't, those experiences get you to where you are today. What would you have done differently in college? Do you think my Airbnb hosts care what my GPA was?  Like they don't care. Here's what I wouldn't have done differently. I would have invested more in relationships.\r\n\r\n\r\nI would have spent more time getting to know people, like just becoming friends with people. I didn't have as many friends because I was always studying. Apparently nothing's changed, but I was like always working and like studying. And so I would have invested more in relationships. I wouldn't have tried to graduate so fast.\r\n\r\n\r\nLike I would have tried to experiment with different things. Like I would just take my time and enjoy being a college student. So if you're a college student listening to this, like Don't rush through school. Your grades really don't matter that much, like above a certain number, like your grades, unless you're trying to get investment banking.\r\n\r\n\r\nWell, unless you're trying to go to law school, medical school, to some extent, business school, unless you have some post graduate ambition to go to higher learning. Like have fun, get to know people like, yeah, work hard, but like relationships are going to be way more important.  That's it. All right. That's a good answer.\r\n\r\n\r\nWell, Logan, I appreciate you coming on, being transparent, sharing all this information. Where can people find you if they want to come learn more about you?  Yeah. Twitter. Logan a Robinson is my Twitter handle. And then, uh, yeah, you want to learn more about Airbnb cleaning the newsletter. Same day. Turn. \r\n\r\n\r\nAwesome. Well, thanks, man. We'll talk soon.  Thanks, Nick. Appreciate it. Well, a big thank you to Logan for coming on today. And I just wanted to close the show by briefly addressing some of my comments earlier in the episode. Now that I've had a chance to reflect on them, I don't think selling courses is bad by any stretch of the imagination. \r\n\r\n\r\nI think what I was trying to articulate that I'm not sure that I had necessarily got across was.  I've seen people who are selling courses with either minimal experience,  or  it's obvious that selling the courses become the core business, not the core business. And again, I don't think it's bad if selling the course is your core business.\r\n\r\n\r\nI think you just need to be open and state that selling the course is your core business. And that's where I tend to see the rub. Kind of coming in with course creators or people sell people selling any information products. It's not bad in and of itself because people want to know how to do these things.\r\n\r\n\r\nPeople are looking for ways to learn and implement these things into their lives that make their lives better.  I tend to be a little judgmental when I feel like. The course has become the main business and yet they're still using the main business as like a credibility or marketing tactic to get more people into the course.\r\n\r\n\r\nNow these words may come back to bite me. I don't know. Maybe I'll do a course someday, but I would hope that I'm doing a course based on my experience, teaching others maybe how to buy a business or how to manage or how to transition or how to evaluate or value a business and not selling a course  Necessarily based on how successful my podcast is. \r\n\r\n\r\nAnyways, I hope you found some value. I hope you can apply something to your life from this episode.  And always remember there is no such thing as a dumb question. There are only dumb people who are unwilling to ask the dumb questions. We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-07-05",
    "platform_source": "Google Drive"
  }
}