{
  "episode_number": "244",
  "episode_title": "The Math Behind a $100M Concierge Medicine Business with Sandeep Palakodeti",
  "guest_name": "Sandeep Palakodeti",
  "business_name": "Velocity Health",
  "transcript": "﻿Nikolas Hulewsky (00:00.876)\r\nAll right, Dr. Deep, I am so excited to have you on economics today. I think that your business is probably my favorite emerging healthcare business of any business that's happening right now. High-end concierge medicine. And the reason that I like it is because there are some huge macro trends that are happening. The population is aging. My generation, the millennials, are getting older and older. And we're starting to understand that we're not 20 years old anymore, that our joints hurt.\r\n\r\n\r\nthat there's a problem when we wrestle with our kids the next day and we feel sore. And the traditional sort of approach to medicine hasn't really delivered for us. And so there's been a lot more focus on this functional medicine where they're looking at many different disciplines and practices, having them come together and helping us live not just healthier lives, not just longer lives, excuse me, but healthier lives, not just to focus on the lifespan, but the health span. And so.\r\n\r\n\r\nHaving somebody like you who started Velocity Health is a really exciting conversation for me to have. But the first question I have for you is, you were doing a lot of these executive physicals at the Mayo Clinic Kaiser Foundation. Why the freak would you leave some of these large institutional organizations and start your own business, Velocity Health?\r\n\r\n\r\nSandeep Palakodeti (01:12.014)\r\nThanks.\r\n\r\n\r\nSandeep Palakodeti (01:18.636)\r\nWell, that's the same question my mom asked me, Nick, and I continue to answer my parents. And first of all, thank you for having me. Look, I have a tremendous amount of respect for my colleagues at the Mayo Clinic. It's the number one hospital in the world. I practice as a hospital-based physician there. And in many cases, I got to see the end state failure of American healthcare. By the time someone got to me, their local community, all the stops along the way, they were in distress.\r\n\r\n\r\nthey were admitted to the hospital at the Mayo Clinic and now this was kind of like their last shot in many ways. Interestingly though, the Mayo Clinic also serves a local community there. And one of the key metrics we look at for quality as far as how we are doing in the hospital world is readmissions and how many patients are coming back to the hospital. And again, all love and respect in the world for my colleagues there, but our stats didn't look all that different from what we see across American healthcare and you know these stats.\r\n\r\n\r\nNikolas Hulewsky (02:16.781)\r\nreally?\r\n\r\n\r\nSandeep Palakodeti (02:17.038)\r\nwhich is that about one in five patients returns to the hospital within 30 days for a complication. We fundamentally are not serving the needs of our communities. And that was made very clear to me in my microcosm, but I have a master's in public health and I'd spent time at these integrated health systems. And when you zoom out too, you start to realize like 70 % of us are overweight or obese, 60 % of us have diabetes or pre-diabetes.\r\n\r\n\r\nNeridative generative diseases are on the rise, cancer is skyrocketing. Our kids have, a third of us, our kids have pre-diabetes or diabetes. Like no one can look around and say that American healthcare is delivering the kind of results that we should be relative to the amount of money that we spend on healthcare and the amount of opportunity and success that we've enjoyed in this country. So there clearly needs to be another way and velocity, we'll get into it, is my way of sort of\r\n\r\n\r\nbeing the change I want to see in the world.\r\n\r\n\r\nNikolas Hulewsky (03:17.904)\r\nLet me understand exactly what does velocity do.\r\n\r\n\r\nSandeep Palakodeti (03:20.504)\r\nSo Velocity Health is a concierge precision medicine clinic. We kind of deconstructed healthcare and reconstructed a clinic in the way that we would want for ourselves and our family. Twice now, I've rushed to the hospital to stay in at my family's side as my dad was wheeled back for a cath as he's having a heart attack. Three of my grandparents died in their 60s from heart attacks. Both my parents have diabetes. I don't have a great genetic...\r\n\r\n\r\nsubstrate from this. But the American healthcare system, you know, you can, we can talk about where I've been in my history, but I've seen a lot of different aspects of how we deliver care here and we're fundamentally a sick care system. We are very good at curing disease once disease is apparent. And if I were having a heart attack or stroke, there's no better place in the world. I'd rather be than America, but to prevent all of those things from happening in the first place.\r\n\r\n\r\nall of the data and all the metrics would show that we are woefully behind in that regard. So if you could construct a system with first principles thinking, you would want one that was extremely proactive and preventive and highly individualized and was a team-based approach that would sort of wrap around you and give you the support you needed at different times when you needed it based on your particular journey. And so that's what we built.\r\n\r\n\r\nNikolas Hulewsky (04:46.818)\r\nSo let me flip it a little bit. If I'm listening and I say like, okay, great, you're proactive medicine. How does that differ from me just having a primary care physician? I go to the doctors once a year. I get an annual screening or an annual physical. I try to eat right. Why would I need something like velocity health? Like what is the problem set that velocity health is solving for?\r\n\r\n\r\nSandeep Palakodeti (05:09.006)\r\nWell, first, I'd say the problem set is grossly apparent at the macro level with those statistics that I just quoted, right? If everyone were actually being served by their primary care experience, then we would probably have a much healthier population at home. I think every single person listening could say that their health care is absolute shit, or they know that someone in their family is not being served by the health care system in the way that they need.\r\n\r\n\r\nThe average time that we spend in this country in a primary care visit is seven minutes. The average amount of seven minutes, that's the number. Seven to 12 is the stats if you look it up. The average time it takes for a physician to interrupt a patient during an interaction is 30 seconds. And this is not because of some patriarchal thing. I love my physician colleagues. It's because we are widgets in a machine that we have 30 patients sitting in the waiting room.\r\n\r\n\r\nNikolas Hulewsky (05:43.183)\r\nWhat?\r\n\r\n\r\nSandeep Palakodeti (06:07.456)\r\nand we have a checklist of things that we're being asked to sort of go through. And that is the experience I'd say subtly most people feel with their primary care, that I'm just a number or I'm a statistic or I'm an appointment in this day, but it's not this intimate relational kind of companionship and relationship that we have. Like my dad was a family doc for 40 years and I used to ride around town with him at nighttime as he'd like make house calls or, you know,\r\n\r\n\r\nSaturday mornings, he'd go visit his patients in the nursing home. That's just not how things work anymore. It's so transactional. That's not the kind of reaction or the relationship people expect out of their primary care. And that's what we flip. And last thing I'll say about this, Nick, is that relationship allows us to go much, much deeper on the diagnostics, on understanding what your real risk is. Someone of your age in most primary care,\r\n\r\n\r\nNikolas Hulewsky (06:43.16)\r\nYeah.\r\n\r\n\r\nSandeep Palakodeti (07:05.172)\r\noffices is not going to get more than two or three basic labs. And you're going to be told to come back if something's wrong. We think that that's fundamentally the wrong approach, that we should be rooting out what your risk is, doing a risk assessment. You have a lot of founders and entrepreneurs. How many people run their business without understanding the KPIs, understanding the strategy of where the next five years is going, and having risk mitigation.\r\n\r\n\r\nNikolas Hulewsky (07:26.928)\r\nYeah.\r\n\r\n\r\nSandeep Palakodeti (07:30.734)\r\nstrategies and plans for things that might happen, right? You should see your body in the same\r\n\r\n\r\nNikolas Hulewsky (07:36.048)\r\nWell, I think what's interesting too, is if you talk to any physician, kind of what you articulated is from the consumer's perspective is like, okay, I go in there, I'm there for a few minutes, and maybe they ask me one or two questions. But from a physician's perspective, I was just talking to a pediatric oncologist in USC Keck School of Medicine. And she was saying she's like, it's so frustrating, because I don't even have time to like get to know these patients or to spend the time that I'd want to with them because of whatever it is, the documentation or the regulations.\r\n\r\n\r\nSandeep Palakodeti (08:02.702)\r\nWe're all widgets in the machine. The way we get paid is something called relative value units, which is set by a committee in Congress. And it essentially pays us more to do more stuff, especially if that stuff includes interventions like surgeries or procedures. It was only recently that physicians got paid to have a counseling discussion with a patient about not smoking or their diet or their exercise.\r\n\r\n\r\nWhereas if I just waited for you to have the heart attack and I do a stent, I get paid 5,000 bucks or whatever, right? Like the economics and incentives are completely wrong. And most doctors feel like widgets in the machine. This is not what most of us went to medical school for. What I get now is 90 minutes with my patients every few months. I know your dog's name, your spouse's name. I know what stresses you out. I know your culture. I know what food you like and don't like. I know what workouts you like and don't like. I know how you sleep.\r\n\r\n\r\nThat's the kind of relationship you should have with someone who you're entrusting with healing and bringing out the most optimization.\r\n\r\n\r\nNikolas Hulewsky (09:08.016)\r\nYeah, let me break down for the listener really quickly kind of the way that payment happens in healthcare and why your practice like Velocity Healthcare is emerging as more and more of a viable option. What Dr. just kind of articulated is typically healthcare providers have been reimbursed based on volume. So if I go and do a thing, I have an encounter with a patient, whatever it is, there's a procedure, I get paid for that. That doesn't sound bad on the surface, but what it is is it's incentivizing\r\n\r\n\r\nmore volume, not necessarily better value. And what we're trying to shift to as a healthcare system is value based reimbursement. We've seen Medicare move towards this. Medicaid has some movement towards this as well. The insurance companies are kind of trying, but anyways, that's a whole rigmarole. So you've got insurers, you've got governmental agencies that pay, and then you've got cash and private pay. Now the cool thing about cash and private pay is they don't have the same strict regulations and top-down sort of mandates that these other payers have, and they can go and approach medicine.\r\n\r\n\r\nin a fundamentally different way. Velocity Health is all private pay, it's all cash pay. And so you can say, look, I don't want to play in that system anymore. I want to do something different. I want to do functional medicine. And I guess I view your medicine as functional medicine. Maybe I'm totally off in that assessment. But effectively what you're doing is you're redesigning the way that health care is delivered to individuals. Unfortunately, it's expensive. And so the first people that kind of get it are those who can afford it.\r\n\r\n\r\nDid I do a like a decent job of kind of articulating?\r\n\r\n\r\nSandeep Palakodeti (10:37.454)\r\nYeah, I think you did a great job of that. And I do think that the healthcare landscape is moving more towards value-based care. That's where I've spent the last decade of my life. you know, again, instead of paying for volume, it would, for example, say to a primary care doc, hey, you've got a thousand diabetics on your panel. If you have 70 % of them who are under control, you'll get paid more. That sounds...\r\n\r\n\r\ngood, right, on the surface. It is a step up from the transactional fee for service nature that most of us feel. But the fact of the matter is we've been at value-based care, quote unquote, for 20 years, and health care costs continue to go up, quality continues to stagnate, and access continues to be a challenge. And so has that really delivered on the promise? think cash pay is a separate aspect to that because the great irony maybe is maybe not the right word, but\r\n\r\n\r\nOur healthcare system has divorced the stakeholders from the payers. And it's one of the only industries in the world when you think about like, if I am interacting with you, as physician and patient, you're not paying me. Actually, your employer is paying an insurer who's paying my health and who's paying me, right? And so the two people who are actually engaging in value with one another are not even\r\n\r\n\r\nconnected in an economic relationship. And that creates weird incentives and it makes things awkward. And so for us, frankly, if we are not delivering value to someone's life, they will walk away by not paying us. And just like any other service in the world works, right? And so we are there to promote health and wellness. If we don't do what we say we're gonna do, then people have that opportunity to shift. And really when you look at the numbers,\r\n\r\n\r\namount you might invest into us and cover yourself with a catastrophic plan or something like that would probably keep you healthier and out of trouble and costing less than the traditional health system would if you wait for disease to happen. We often talk about this idea that it's hard now or it's hard later, it's expensive now or it's expensive later, but at some point it's gonna balance out.\r\n\r\n\r\nNikolas Hulewsky (12:53.125)\r\nYeah.\r\n\r\n\r\nTell me, so what are the offerings that you provide? How are you different than maybe a traditional healthcare practice?\r\n\r\n\r\nSandeep Palakodeti (13:00.238)\r\nSo when, this is what it feels like when a patient comes in. You are assigned a concierge. This is your personal navigator who helps you understand how do you pay for this thing out of, with cash. Some things do still get paid by insurance. How do you get scheduled for your labs or your DEXA scan or this advanced imaging that you're going to. You then have a health coach who you're assigned to. This is kind of your extended family member. You're worried.\r\n\r\n\r\nsibling who's checking in on you, holding you accountable, making sure that we have set clear goals of what are we going to accomplish over the next three months and are you doing those things? Let's check in. Let me help you remove any barriers.\r\n\r\n\r\nNikolas Hulewsky (13:38.864)\r\nAnd are those clinicians or physicians or are they just people who are helping them work through the process? Okay.\r\n\r\n\r\nSandeep Palakodeti (13:42.595)\r\nThose are team members. Our health coaches are trained as RNs, but they might have different backgrounds as well. These are our interdisciplinary team that comes together. Your next visit, though, is with your longevity precision medicine physician. Many of us have trained and untrained ourselves from the traditional health care system in many ways, pursued other.\r\n\r\n\r\nyou functional medicine certifications or sports medicine or obesity medicine, whatever it is, and have relearned a different approach to medicine 3.0 and to healthspan. And so that first meeting is really to understand your history, to understand what kind of risk factors you have. We have access to so many different diagnostics in our baseline programs. Everyone is getting, over a hundred biomarkers to start, both initially and quarterly.\r\n\r\n\r\na DEXA scan, which we can talk about each of these, a coronary artery calcium scan, and a VO2 max. These are all objective measures of different drivers of health, and we use that in extremely clinical ways. And so in addition to that, though, we have access to things like full body MRIs and liquid biopsies if you have a worry or a history or risk for cancer, or maybe...\r\n\r\n\r\nNikolas Hulewsky (15:00.324)\r\nA liquid biopsy, I've never even heard, what is that?\r\n\r\n\r\nSandeep Palakodeti (15:02.861)\r\nYeah, so there's a company out there called Grail and what they look for are these end methylation products, which are shed from certain tumor cells that are microscopic and it can detect up to 50 kinds of different cancers. It performs better at like later stages. And so if you have a stage one or two, it can still detect that. But certainly if you have something like a stage two or three or four, it's going to tell you, Hey, something's flaring.\r\n\r\n\r\nNikolas Hulewsky (15:30.186)\r\nIt's almost like it's looking for breadcrumbs as opposed to necessarily testing the actual tissue.\r\n\r\n\r\nSandeep Palakodeti (15:33.825)\r\nExactly. It's not going to tell you exactly the thing that it is, but it tells you, hey, there's something that tells us maybe this person has a pancreatic issue or something like that. So that plus a full body MRI, plus a few other scans are kind of the most advanced screening that we have right now when it comes to cancer.\r\n\r\n\r\nNikolas Hulewsky (15:51.248)\r\nCan you talk a little bit about what functional medicine is? Because I've said that word a couple times, you've said it now. What is that?\r\n\r\n\r\nSandeep Palakodeti (15:56.535)\r\nYeah. functional medicine is fundamentally just root cause medicine. It is trying to understand rather than treating the symptom, if you have chest pain, if you have acid reflux, what's causing the chest pain or what's causing the acid reflux. Let's not just throw meds and throw things at the symptoms, figure out what's actually going on. Oftentimes functional medicine is\r\n\r\n\r\nrooting out things that traditional medicine doesn't even think about or doesn't know how to even order. I've had to learn a lot of these things. So a gut microbiome, for example, I'm a very big believer now, especially that the gut brain axis is a major player that the gut plays a big role in chronic inflammation and all sorts of systemic diseases. And there's real ways to test for this. And it's not some kind of fringe stuff. mean, these are like,\r\n\r\n\r\nrecommended by the American Gastroenterology Society, right? It hasn't diffused down into normal practice and people don't get it. So, you know, we get all sorts of different tests like that that help us understand from an individualized standpoint what might be driving someone's path.\r\n\r\n\r\nNikolas Hulewsky (16:54.191)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:01.296)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (17:07.664)\r\nAnd here's an example. I didn't realize seven minutes was the average amount of time that a primary care physician and I love my primary care physician. But here, I think here's an example of what you're talking about. The difference between sort of traditional medicine and functional medicine. If you got seven minutes with a primary care physician and you go in there you're like, Hey man, I'm getting heartburn. They're going to say, okay. We'll try these three medicines. They don't have the time to dig in and say, well, that's interesting. Right.\r\n\r\n\r\nSandeep Palakodeti (17:32.429)\r\nThey're hanging on for dear life, right? And I think that that is the moat of our business. If we want to talk about our business, people are paying for access to a physician to spend 90 minutes like this long format, talk about everything and anything. to be able to, I get patients that send me like articles off X that they've seen or some random thing. And they're like, I want to learn a little bit more.\r\n\r\n\r\nOkay, I'm not gonna belittle you. I'm not gonna say that's stupid. I'm gonna encourage you to bring your GPT stuff in. Like, let's learn together. Let's unpack all this together. Because we all have these tools at our disposal now. Most people want a Sherpa and a guide. And that's really what you're paying for.\r\n\r\n\r\nNikolas Hulewsky (18:12.814)\r\nYeah.\r\n\r\n\r\nSo the functional medicine piece I find really interesting because the body is made up of so many different systems. From my research, I'm just going to name some of these and like this is what I have found typically in practices like yours that they're looking at high level. There's the cardiovascular and you already said that, you know, the VO2 max or the, I can't remember the name of the calcium test, but there's certain things that you can do there. There's your brain and your nervous system. So there are MRIs obviously that, that you can be run through.\r\n\r\n\r\nSandeep Palakodeti (18:36.527)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (18:43.674)\r\nThere's the metabolic and endocrine system that you'll actually do full blood paneling for. You're obviously also looking at the liver, the kidneys, the GI tract, your body composition, musco, I can never say it, whatever, the musculoskeletal, lungs and respiratory, cancer screening. And then my favorite recently has been the genetics and like the, the, the bio genome mapping.\r\n\r\n\r\nSandeep Palakodeti (18:58.381)\r\nMy skill is still a little tough,\r\n\r\n\r\nSandeep Palakodeti (19:12.493)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (19:12.698)\r\nDid I miss anything though? are those like generally speaking, like sort of broad buckets that you're playing with?\r\n\r\n\r\nSandeep Palakodeti (19:15.981)\r\nYeah, generally, okay, we do every single one of those things. And generally speaking, we believe all of those have their place. What's challenging for folks is figuring out which one should I get? When should I get it? How do I interpret that, right? And so what we help do is rationalize when are we gonna focus on your cardiovascular health? And when are we gonna focus on your...\r\n\r\n\r\nNikolas Hulewsky (19:30.053)\r\nRight.\r\n\r\n\r\nSandeep Palakodeti (19:41.209)\r\ndementia risk and when are we going to go down the genetics path and the GI path, right? There's just so much. And so you need a team that's going to kind of walk you through that in a rational way. And that's what we do. And we do that by understanding one, what are your goals? and two, what is your risk? And to me, it's like, I need to address anything that's going to kill Nick in the next decade, right? Quickly, right? Anything that's going to cause morbidity, meaning cause\r\n\r\n\r\nchronic disease or some kind of change in your life. And then start shifting to the things that are going to optimize you and get you in your absolute best right now. We call this sort of prime preservation. If we can be at your prime right now as you turn 40, how do you extend that for as long as possible and keep as many good decades as possible? And then the last sort of phase is talking about\r\n\r\n\r\naging health span, like how do you push out those marginal decades, 80 and 90 and a hundred where you're not in the nursing home, you're not dependent on others, you're thriving. You're one of those 90 year olds that people are like, wow, look at that.\r\n\r\n\r\nNikolas Hulewsky (20:53.36)\r\nWell, I think, think it's really interesting. And for people listening, this is the interesting part is many times entrepreneurs in particular will come to an aha realization in their life that, entrepreneurship is about giving me freedom, freedom to do the things that I want to do. Whatever, take vacations with my family, spend the time where I want to work with the people that I want to work with, work on the projects I want to work with. But they don't spend a lot of time thinking about the, what enables you to do all of those things is your health. Like if you don't have good health, none of those other things matter.\r\n\r\n\r\nin life. as you get, you know, more financial means, I should say as an entrepreneur, you need to be thinking about how am I putting money aside to my health, not just a gym membership, but like these types of conversations. And that's why I like companies like yours, because you give people an opportunity to go and speak with a physician and say like, Yeah, my I'm feeling kind of tired. And then cure the other areas that I'm having a problem in and\r\n\r\n\r\nand we run a smattering of tests and kind of look at it holistically as opposed to, that's it. You're tired. Well, here's an amphetamine. Not that we get anyways. My question though is I'm about to turn 40 and I am, I am thinking about this a lot. I just don't know what to do. Like there's so many options out there. Should I, should I go with a company like function health? Cause I look and I'm like, okay, well they, they, they can help me schedule the MRI. They'll run a full blood panel. They'll have somebody come to my house. I'll get a smattering of tests.\r\n\r\n\r\nSandeep Palakodeti (21:54.479)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:17.648)\r\nbut I won't necessarily have the concierge medicine. Or I could go to somebody like you. like, I could go spend a day maybe. I go to your clinic, I run a spattering of tests, I pay more, but I at least feel like there's a white glove approach and it's just taken care of. Or do I even need that? Like, do I even need all those tests right now? Am I healthy? I don't know. I'm skinny fat. I got a lot of weight around my midsection. Am I at cardiovascular risk? Like, how do you even approach it? Like, how do you even start approaching it as an entrepreneur?\r\n\r\n\r\nSandeep Palakodeti (22:38.393)\r\nYep.\r\n\r\n\r\nSandeep Palakodeti (22:42.671)\r\nYeah. So two things. One is we believe we work with lot of wealth managers, family offices. We believe in preserving health is much more and just as important as preserving wealth. Unfortunately, I get a lot of folks who are 60, 63, 65. They've had an exit. They've done really well. And they're 50 pounds overweight.\r\n\r\n\r\ncompletely inflamed, diabetic, joints hurt, and staring down the barrel the next decade of chronic disease getting worse. And this is kind of like their last open window to make a meaningful change before that becomes the dominant narrative to them. And so unfortunately, too many people trade kind of the glory or the wealth or the hype or whatever it is for their health overall. And so we really believe it's...\r\n\r\n\r\nNikolas Hulewsky (23:12.464)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (23:26.245)\r\nYeah.\r\n\r\n\r\nSandeep Palakodeti (23:38.125)\r\nI think we're shifting, Nick, like even when you start to see the stats on young people and their like decreased alcohol intake and dedication, like who knows, maybe we're starting to see some signal there. But what I would suggest is that everyone probably, especially if you're like about to turn 40, like I really think the data would suggest that we need to pull up how preventative we are being and when that happens. So at age 40 at least, but certainly in your 30s, I believe,\r\n\r\n\r\nNikolas Hulewsky (23:46.148)\r\nYeah.\r\n\r\n\r\nSandeep Palakodeti (24:07.469)\r\nyou should do at least a one-time risk assessment. Just like we talked about the KPIs with your body or with your company, we have these KPIs of your body that you should take assessment of. And you can do that in your own sort of, you know, like DIY biohacker kind of way.\r\n\r\n\r\nNikolas Hulewsky (24:22.256)\r\nMm.\r\n\r\n\r\nSandeep Palakodeti (24:33.038)\r\nRight. And a lot of people I think are doing that and they're looking up, you can go order labs. You mentioned function. think you may have been talking about fountain health, but function health is, like a $500 very comprehensive, you know, blood panel and they come with some AI readouts and, um, some recommendations and that's great, you know, but frankly, lot of patients have come to us with their function health report in hand and they're saying,\r\n\r\n\r\nNikolas Hulewsky (24:45.402)\r\nGuess.\r\n\r\n\r\nSandeep Palakodeti (25:02.541)\r\nHey, what do I do with this now? Or it's identifying this and you need a longitudinal clinician to help prescribe something. Like maybe we could optimize your hormones or whatever it is, right? So whatever it is, like here's what I would suggest as far as a one-time sort of assessment. We have one of these and I can talk to you all about like what our sort of version of the executive physical is, but at the very least you should get a sense of your cognitive capital. like,\r\n\r\n\r\nNikolas Hulewsky (25:04.951)\r\ninteresting.\r\n\r\n\r\nSandeep Palakodeti (25:30.337)\r\nobjectively understand how is your sleep, your stress, your focus. We have cognitive tests and exams. We've worked with a company called Brain Code that does a neurofeedback and does EEG brain mapping. And so there are these very objective ways for us to get a sense of like, how do we...\r\n\r\n\r\nNikolas Hulewsky (25:47.76)\r\nIs that the one? Is that the one where you're in the MRI and they're asking you questions and they're like mapping? Oh.\r\n\r\n\r\nSandeep Palakodeti (25:51.887)\r\nNo, that's not. It's interesting. mean, but EEG is that those are functional MRIs and those are really cool to see. EEG is basically like a, a little hat you wear and it's checking all your brain waves and you can do it at home. You can do it in the center, but you know, cognitive, physical, and then understand your overall risk from a physical standpoint. VO2 max is probably one of the most predictive long-term metrics of overall longevity and lifespan.\r\n\r\n\r\nNikolas Hulewsky (26:20.08)\r\nAnd what is that?\r\n\r\n\r\nSandeep Palakodeti (26:21.635)\r\nThe VO2 max is a measure that we get if you've ever seen the athletes that are like they have a mask on and they're running on a treadmill. That's called the VO2 max. So we like to get that on every single patient. And the reason why is it is one of the best overall composite measures of total body health and longevity. And the reason why is because it is measuring how well your heart is pumping blood, how well your lungs are oxygenating them.\r\n\r\n\r\nhow healthy your blood vessels are. And ultimately it is looking at the amount, the milliliters of oxygen per minute that your mitochondria in your cells are able to utilize to create ATP, which is the energy that fuels our body. And so it is this crazy cascade of macro and microscopic, you know, circumstances that are happening that leads to this VO2 max output. Here's the stat. So if you are a,\r\n\r\n\r\nlifelong smoker versus a non-smoker. You have about a 40 % higher chance of all-cause mortality in the coming year versus that non-smoker. That's high, right? We all think that. If you have a low VO2 max versus a high VO2 max, you have a 400 % higher chance of all-cause mortality than the person who has a high VO2 max. It shows you an order of magnitude more predictive than even smoking is\r\n\r\n\r\nis how important that is. Absolutely. Absolutely. There are multiple data points that corroborate that, but the direction is not even close. It's like a 10X differential. And for all those reasons I just mentioned, right? Like if your heart's not beating well, if your lungs are not oxygenating well, if your mitochondria are sick, if your blood vessels are inflamed, that probably means a lot of other things are not going well.\r\n\r\n\r\nNikolas Hulewsky (27:47.65)\r\nIt's riskier to have a low VO2 max than it is to be a lifelong smoke.\r\n\r\n\r\nSandeep Palakodeti (28:16.767)\r\nand you are at risk for many other downstream comorbidities. So we have a very structured way to build up VO2 max in our patients, right? But if you don't know that about yourself, here's where it matters, right? I think the working backwards from where you wanna be 30 and 40 years. So if you're about to be 40 and you think about where am I gonna be when I'm 80 years old, right? You're gonna lose about 10 % of your VO2 max per decade if you...\r\n\r\n\r\neven if you're staying relatively well trained. So if your VO2 max dips into like the low 20s, say 20, you will be winded walking up a flight of stairs or around one flat block. If you want to be 80 and you want to be hiking Rockies or dancing with your grandkids, right? Like you probably need a VO2 max of 30 or more. so...\r\n\r\n\r\nNikolas Hulewsky (29:10.032)\r\nThank\r\n\r\n\r\nSandeep Palakodeti (29:12.751)\r\nWhere are you now? If you, if you're starting right now with a VO2 max of 33, you're not going to make it there. Right. And that's the objective way that we need. So like, it's not, look, people sometimes say like, well, aren't you just telling people to like exercise and diet more? Yeah. But like, when have you ever heard this kind of specificity and individuality around how to build where you are? Cause maybe like another test we get is a DEXA scan. look at.\r\n\r\n\r\nNikolas Hulewsky (29:21.616)\r\nDang, that's crazy.\r\n\r\n\r\nNikolas Hulewsky (29:32.943)\r\nRight.\r\n\r\n\r\nSandeep Palakodeti (29:42.521)\r\nsubcutaneous fat, visceral fat, and a measure of muscle called appendicular lean muscle index. And that is because, again, you will lose about 10 % of your muscle per decade if you've spent time in the end of life care or nursing home space and all that, right? Like many of these folks are there because of functional decline. Like they might have their minds, but they literally don't have the muscle mass. Arcopenia is what we call it, age-related loss of muscle mass. And so,\r\n\r\n\r\nyou need to have a, what we hope would be in the 75th percentile or higher of appendiculine mass index. Now, in order to preserve as much muscle mass as you can to do the functional things you want to do, like stand up from a chair by yourself or put a suitcase in the overhead when you're 75 or whatever it is, right? So these are the kinds of things that your primary care doc is probably not assessing. And when you ask like,\r\n\r\n\r\nWhere do you start with this? Cause there are a lot of programs out there that do that. think first you gotta go with someone you trust, like go with folks who have established thought leadership who seem to not just be selling you something underneath. One thing we're proud of and that we will continue to maintain is that we make $0 from any supplements, from any imaging tests, from any lab vendor, from anyone. We pass all that saving through to our patients and we're very transparent with that because we don't ever want the illusion that we're\r\n\r\n\r\npushing a supplement on you because we're going to make money from that. We're telling you something because we think it's for your best interest and that's it. Like go get that sort of whatever you\r\n\r\n\r\nNikolas Hulewsky (31:20.526)\r\nlove this idea of like where you want to be and working your way backwards. think something, this shocked me. You you said I worked in hospice. One in three, it might even be higher than this, but let's just say one in three people over the age of 75 who break their hip die within a year of breaking their hip. Yeah. And they could be super healthy before that. But once you lose your mobility, it's a very fast decline when you get to a certain age.\r\n\r\n\r\nSandeep Palakodeti (31:37.559)\r\nIsn't that crazy? Isn't that crazy?\r\n\r\n\r\nNikolas Hulewsky (31:48.304)\r\nI thought that that was like made up. I didn't believe that. And then, you know, I did research and like, holy crap, that's a, that's a real statistic. So to your point, like, you can't just wake up at 71 day and say, like, actually, I want to be in much better, like, you have to have some planning decades before.\r\n\r\n\r\nSandeep Palakodeti (32:02.063)\r\nWell, look, I think it's never too late. I don't think it's ever too late. And I love these videos of these like little 80 year old ladies who are doing dead lifts, supervised and whatever. But the earlier you start, the better opportunity you have to give yourself optionality more than anything. And just to round out, you know, that last comment is, you know, one thing that we think we have solved is\r\n\r\n\r\nNikolas Hulewsky (32:07.677)\r\nSure.\r\n\r\n\r\nSandeep Palakodeti (32:29.103)\r\nYou're a busy executive, know, family obligations, business obligations, all of these things. You can fly down from Boise to wherever you want, take several days out of your, your schedule and come to them, uh, and have the privilege of being cared for by some company. We see it the other way. We are incredibly honored to be caring for folks across the country. are 50 state virtual practice and we bridge that gap by.\r\n\r\n\r\ngetting those diagnostics in your local community. doesn't matter to us for you to have to take four hours to come to our center. We'll send a phlebotomist to your house to draw the blood. We'll get a mobile ultrasound to come to you. We'll schedule your DEXA scan when you're in Florida traveling with your family, because it's most convenient to you. And then you're at that conference in LA the next week, and that's where you want to your thing, right? We will meet you where you are and we get the data. That's what we care about. Then...\r\n\r\n\r\nNikolas Hulewsky (33:04.56)\r\nand we'll see you time.\r\n\r\n\r\nyou\r\n\r\n\r\nNikolas Hulewsky (33:21.605)\r\nYeah.\r\n\r\n\r\nSandeep Palakodeti (33:27.607)\r\nNo matter where you are in the country, we can manage you. We can send in prescriptions.\r\n\r\n\r\nNikolas Hulewsky (33:32.4)\r\nDo you replace the primary care physician? do you still have patients who are, yeah, they still have their local?\r\n\r\n\r\nSandeep Palakodeti (33:37.279)\r\nIn 98 % of circumstances, we replace the primary care doc. We advise folks to have someone in their local community, just as a backup. you ever need to like, someone really needs to lay eyes on you or hand on you, or you get COVID at 2 a.m. and whatever. But we respond next day, same day. We have next day, same day appointments. We end up taking over. There's so much overlap. Like when you think about managing lipids, you're...\r\n\r\n\r\nNikolas Hulewsky (33:43.44)\r\ninteresting.\r\n\r\n\r\nSandeep Palakodeti (34:05.731)\r\nblood sugar, blood pressure, our overall, like all of these things are in the primary care camp. And so we take over all of that. And frankly, Nick, people come to us because they trust us because no other doctor knows as much about them other than us. And so if something else comes up that might not be sort of in the scope of their care with us, they still want to ask us because that's where they've established their care.\r\n\r\n\r\nNikolas Hulewsky (34:25.125)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:35.056)\r\nI'm going dive into the business side of it in a second. But before I do that, I just want to tie a bow on what you were saying. You were saying that you test and sort of establish this baseline and you look at cognitive and physical health. then you in the cognitive, you talked about some of the tests that you apply, the MRIs, the physical health, you talked about the VO two max, the DEXA scan, the lip, the panels that you run as well. are those the two major buckets? Was there anything we missed?\r\n\r\n\r\nSandeep Palakodeti (34:51.555)\r\nYep.\r\n\r\n\r\nYep.\r\n\r\n\r\nSandeep Palakodeti (35:00.791)\r\nAnd then the third one is really the risk liabilities. And you can think about this across a few different vectors, but we usually think at least cardiac, metabolic, inflammation, and hormones. so cardiac, we're looking at things like your APO-B and your lipoprotein A and your coronary artery calcium and your plaque. And these are things that are in guidelines everywhere, but most PCPs don't order.\r\n\r\n\r\nwe're looking at insulin resistance scores and multiple markers along the metabolic route to, optimize how, how your body is handling glucose. and, and hormonally, you know, I see a lot of folks wrecked, from their hormone profiles, whether it's thyroid or cortisol or testosterone and estrogen and all the andropause and menopause are different phases of life. And most of them.\r\n\r\n\r\nNikolas Hulewsky (35:55.962)\r\nHairy menopause, apparently, which I'm just learning about.\r\n\r\n\r\nSandeep Palakodeti (35:58.639)\r\nWell, I'd say some of this is mainstream with some docs, a lot of it is not with a lot of docs. so you have to understand like where are the big risk factors that are going to get me in the coming years and let's mitigate those to start with. So that's sort of the framework.\r\n\r\n\r\nNikolas Hulewsky (36:17.498)\r\nAre you 100 % virtual?\r\n\r\n\r\nSandeep Palakodeti (36:19.661)\r\nWe interact with our patients 100 % virtually. do have, again, in local communities, we will connect with them through those partnerships. And then once a year, we are planning our retreats where we'll bring our patients together, where we can do in-person diagnostics and learning events and community building and things like\r\n\r\n\r\nNikolas Hulewsky (36:41.946)\r\nWhen did you launch this business?\r\n\r\n\r\nSandeep Palakodeti (36:44.717)\r\nWe have been in the business of Concierge Precision Medicine for about three years. Velocity Health was launched this year though, with our focus on founders, executives, biohackers, athletes, folks like that.\r\n\r\n\r\nNikolas Hulewsky (36:56.932)\r\nthing.\r\n\r\n\r\nNikolas Hulewsky (37:00.368)\r\nAnd how big is it? How many patients do you have currently? How big is your clinical team?\r\n\r\n\r\nSandeep Palakodeti (37:04.225)\r\nYeah, so we've built this to several hundred patients and during this pivot now we're sort of reconstituting our panels. Now we have eight docs though. All of us, you know, have different varying amounts of, you know, patients on our panel, but you know, we really think a full-time doc shouldn't have more than 200, 250 patients or so on their panel. The average primary care doc in this country has 2,500 or so. So we want our docs to\r\n\r\n\r\nknow people, right? Like I said, they should know every detail about their patients and the amount of data that we get, there's just a lot to wade through in the kind of care plans that we're creating. We also, two other things that we didn't mention about the care model, we have integrated behavioral health. So we have performance mindset coaches. We find that the mindset aspect is so much the driver more than the will or the physical capability. And then when\r\n\r\n\r\nWe do, or if we do, if we need subspecialists, we have those folks on our team as well. So we may have identified a cardiac issue that requires a cardiologist to come on board, or you may have a particularly high dementia risk and we have our neurologist on board. can weigh in on the case in that way as well.\r\n\r\n\r\nNikolas Hulewsky (38:23.76)\r\nTell me, what does it typically cost for a patient? Is there a spectrum that it costs? Is it all a cart? Is it annual, recurring? What does the revenue model look like?\r\n\r\n\r\nSandeep Palakodeti (38:33.793)\r\nYeah, we have three different versions. We have kind of our entry level, which is the one-time precision review. It's kind of our version of the executive physicals. You mentioned the Mayo Clinic. I had the opportunity there to, you know, engage in some of those. And it is your one-time snapshot of sort of where you are right now, but more than just giving you an AI readout, you get 90 minutes with a doc. You're really understanding what every one of these numbers means. You're getting a plan forward. You're\r\n\r\n\r\nunderstanding, you know, just talked to a patient this morning and she said that she runs marathons and she's training for one in the next three months and she's going to come in and get this, this one time review. And it's a great opportunity to sort of see where she is pre-race to give her a good plan on training and nutrition as she sort of builds to that. Uh, for any of the founders out there, you just want to get a sense of like, okay, do I have like a big unmitigated risk that I'm not seeing?\r\n\r\n\r\nThat's kind of the best option. The one that most people choose is our recurring. That one is $2,500 one time. And that includes all the diagnostics, the lab work, the decks, the VO2 max, the time with the doc, the constant years. She's going to manage all that and the plan sort of going forward. Yep. Yep. That's all yours. We don't want any of it. It's yours. You keep it. We'll give you.\r\n\r\n\r\nNikolas Hulewsky (39:36.826)\r\nWell, how much is that first one? How much is that? Just one time.\r\n\r\n\r\nNikolas Hulewsky (39:53.73)\r\nAnd then I keep all that information. have all that data. It's a baseline.\r\n\r\n\r\nSandeep Palakodeti (40:00.995)\r\nI mean, we'll give you a nice readout of it that you can pass along to your next clinicians. And some people will come out of that and say, okay, I feel like I've got a good clean bill of health and I'm feeling good and I'm gonna just keep doing what I'm doing. Some people will say, okay, I've got some recommendations. I'm go back to my PCP. Maybe I'll do this once every year or something. Some people say, okay, well, we've actually identified something. I really liked my experience with you. Why don't I upgrade to one of these longitudinal plans? And so...\r\n\r\n\r\ngo ahead.\r\n\r\n\r\nNikolas Hulewsky (40:30.96)\r\nIs that $2,500 plus? Is it like $2,500 plus the cost of the panel, plus the cost of the MRI, plus it's inclusive?\r\n\r\n\r\nSandeep Palakodeti (40:38.709)\r\nNo, so the $2,500 includes the blood work, the VO2 max and the DEXA scan. You can add on things like the advanced coronary scan, the full body MRIs, full body MRIs. So folks know there's two big companies out there, Prinubo and Ezra. They're usually around $2,500. You can add some things on there. They're trying to bring those prices down. Function actually just bought Ezra. And if you have a function membership, you can now.\r\n\r\n\r\nget an EZR scan for 500 bucks. Another reason we don't want to be in the diagnostics business is we think that's a race to the bottom. Good luck to all those companies, but there's going to continue to be pressure to bring down the price on just like I can get a DEXA scan for 100 bucks now. I really think in five years, you'll be able to get a full body MRI for a couple hundred dollars. So in the traditional health system, have to figure out how to like...\r\n\r\n\r\nNikolas Hulewsky (41:29.678)\r\nInteresting.\r\n\r\n\r\nSandeep Palakodeti (41:33.685)\r\nintake all of that data and act on that, we're gonna be already doing that.\r\n\r\n\r\nNikolas Hulewsky (41:40.432)\r\nSo if I came to you and I was like, yeah, I want the $2,500, but I'm also, I'm really concerned about my heart. So I do want some additional tests for the cardiovascular system. There'd be an add-on for that potentially. Yep.\r\n\r\n\r\nSandeep Palakodeti (41:46.383)\r\nYep. Yep. Exactly. I mean, the most common one is the coronary calcium scan. That's usually a hundred or $200. We find that in your local community. add that on. have that discussion with you when we review all of your data together.\r\n\r\n\r\nNikolas Hulewsky (42:03.14)\r\nAnd do you coordinate all that? Like does your team work with them to coordinate with the local? that's awesome.\r\n\r\n\r\nSandeep Palakodeti (42:05.261)\r\nYep. That's the concierge. Yep, exactly. And so, I mean, we got to like ask you for your schedule, right? But you're not trying to go pay and figure out, do I use my insurance card for this thing or whatever? You show up and you get your test and they're not charging you. There's, you know, the good ones are sending us results at the very least they're sending you results and you're sending those to us. And we have the data. That's all we really care about. And we want to make sure that this process is seamless for most of\r\n\r\n\r\nNikolas Hulewsky (42:12.698)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:35.888)\r\nOkay, so those first tests, let's just say $2,500 to $5,000, depending on how many add-ons you throw onto it, ballpark. Okay.\r\n\r\n\r\nSandeep Palakodeti (42:42.573)\r\nYep. Yep. If you do kind of the all in, you're probably talking 5,000. Yep.\r\n\r\n\r\nNikolas Hulewsky (42:48.976)\r\nOK, so that's one offering. What's the next one?\r\n\r\n\r\nSandeep Palakodeti (42:52.761)\r\nSo then some people come to us through that channel and they go, okay, we've discovered something. I really like you guys. I want to keep working with you. I'm to upgrade to this longitudinal program. Some people come to us knowing that they want this longitudinal program. So this one is initial blood panel over a hundred biomarkers. then we, quarterly, we get more blood work depending on what you need. The DEXA, VO2 max, coronary artery calcium. That's included plus,\r\n\r\n\r\nyour concierge monthly visits with your, health coach and quarterly visits with your, physician, including longitudinal prescribing if you need. so every three months we sit down together, we spend 90 minutes, we unpack how everything's been going. We talk about your. Yeah. Yeah. We're here for you, man. It takes that long sometimes. mean, some people are like quick and they don't want to spend that much time. They're like, okay, I told you everything in 20 minutes. Like I'm good. I just get my script and like,\r\n\r\n\r\nNikolas Hulewsky (43:34.64)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (43:39.504)\r\n90 minutes.\r\n\r\n\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (43:49.541)\r\nYeah.\r\n\r\n\r\nSandeep Palakodeti (43:51.883)\r\nI think we're on a good path here and yeah, we sign off. But in that first year, Nick, there's so many things that we can unpack together, right? Like, it's like, okay, next quarter we're gonna get your gut health tests. And then there's a whole conversation about that. The next quarter we're gonna get your heavy metal tests. There's a whole conversation about that, right? And so it's not to say that we're constantly looking for things. We have to like pair it with symptoms and why we're hunting and pecking, but.\r\n\r\n\r\nfor the right reasons, there's a lot of data that we can sort of get. And so for those reasons, you know, a lot of times we'll, for example, start hormone optimization therapy on people if it's indicated. And so they're gonna stick with us long-term. They want a doc who's gonna be there every month and every quarter to watch how things are going. That's how we think things should go. This should be a longitudinal relationship. That's what we ultimately want is to form relationships with people long-term.\r\n\r\n\r\nNikolas Hulewsky (44:21.711)\r\nYeah.\r\n\r\n\r\nSandeep Palakodeti (44:45.519)\r\nAnd from a business standpoint, know you all think about this a lot, right? Like we peg our business from a CAC to LTV standpoint at one to 10. I'm really happy if we can keep that ratio, but that's a one year, you know, LTV. If they stay for a second year, if we earn people's trust and retain them for a second year, our LTV doubles every, you know, every time they stay with us. And so that ratio gets crazy if we can keep it low on the front.\r\n\r\n\r\nNikolas Hulewsky (45:06.084)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (45:13.52)\r\nSo how much is it for the monthly?\r\n\r\n\r\nSandeep Palakodeti (45:15.767)\r\nThat one is a thousand dollars a month is the best way to think. So that includes everything that I just said. If you want additional diagnostics, you can add those on alacarte. The last plan I'll say is basically that exact thing, but all of the diagnostics are included. So you don't have to think about anything like all of the stuff we recommend is included. So the full body MRI and telomere testing and genome testing and pharmacogenetic testing and all of these things. so some people say,\r\n\r\n\r\nHey, I want like the most advanced diagnostic suite that the market has to offer. That's what this is. So we would suggest doing that once every three to five years, you go in and get the full diagnostics that get everything. then, you know, then you still meet quarterly with your doc and monthly with your health coach and all of that. And, and then the next year you fall back to that, that middle plan. that, that last one's called our elevate plan. That's $25,000. And that's.\r\n\r\n\r\nOne time again, you just get all of that, includes the full services for the year, and then the next year, most people would drop back to the essentials, which is the thousand dollar\r\n\r\n\r\nNikolas Hulewsky (46:22.448)\r\n$5,000 a month. That's interesting. that that test the diagnostic test Do you view that almost as like a lead magnet where it's like sure we'll help you get your tests and we know that some percentage of those Patients are going to convert to our longitudinal base\r\n\r\n\r\nSandeep Palakodeti (46:37.109)\r\nYeah, mean, yeah, look, I think people are sick of point solutions. know payers are, I think people are too. I don't want to pay, meaning I don't want to pay five different people to get my labs and then get my MRI and then get this other gut test and then my doctor and then my functional med and then my nutritionist. Like, I just want one thing where it's all integrated into one place.\r\n\r\n\r\nNikolas Hulewsky (46:48.516)\r\nWhat do mean point solutions?\r\n\r\n\r\nSandeep Palakodeti (47:07.213)\r\nThat's what we've tried to achieve and that's what we're trying to smooth.\r\n\r\n\r\nNikolas Hulewsky (47:11.418)\r\nWhat does the business look like? So the reason I love these businesses is because there's more demand for it. And I just think that the technological advancements that we're seeing, even in AI, have not yet caught up with traditional healthcare. Like we don't have that level of diagnostics. We don't have that level of access to some of these new cutting edge technologies. I like these businesses for that reason, but I don't necessarily know the total economics. So for a practice of, I think you said five,\r\n\r\n\r\nphysicians or eight physicians, eight physicians, several hundred patients. What does that represent? Like, are you guys all partners in the practice? Do you own the platform and they pay to be on the platform? Like what does velocity look like?\r\n\r\n\r\nSandeep Palakodeti (47:42.617)\r\nYep.\r\n\r\n\r\nSandeep Palakodeti (47:54.681)\r\nSo let me describe this because there's a regulatory component and then there's a business side of it as well. There's a, I'm sure you're very familiar with a corporate practice of medicine laws. So in many states, a non-physician cannot own a clinical entity that is directly engaging in clinical care with a patient. There's big ones like California, for example.\r\n\r\n\r\nNikolas Hulewsky (48:02.51)\r\nMm-hmm.\r\n\r\n\r\nSandeep Palakodeti (48:24.399)\r\nRight. And so you kind of have to adhere to corporate practice medicine laws for that reason. We've created this. Bifurcated model in healthcare for for-profit organizations where you're taking investors and when there are owners and that is the MSO PC model. And so an MSO is a management services organization. That is the overarching structure that all of the value is essentially being created to.\r\n\r\n\r\nThere is the professional corporation though, which is the physician owned entity that engages directly with the patients. And so they have to stay separate. Like a non-physician cannot tell a doctor, you need to prescribe more medications or you need to do more tests, X, Y, It's meant to have that separation of business and medicine. so physicians own the PCs because we have to, but\r\n\r\n\r\nWe took a very concerted approach that we would be a physician-owned and led organization. So physicians own more than 51 % of the majority of the MSO as well. We took an investor and are courting a couple others and then have equity for early employees and advisors and other strategic partners.\r\n\r\n\r\nNikolas Hulewsky (49:38.416)\r\ncool.\r\n\r\n\r\nSandeep Palakodeti (49:53.999)\r\nThe equity, look, I'm a serial entrepreneur. I've raised VC, I've raised tens of millions of dollars. I've been on, you know, in cap tables on all sorts of weird situations. And this one for me, for my own personal company, I felt very strongly that I was not going to partner with someone who demanded a liquidation preference or a board seat or preferred shares. So, um, everything is common stock and everyone is just a percentage owner.\r\n\r\n\r\nAnd so your percentage of the company dictates your say and how we're sort set up. But clearly, we're not.\r\n\r\n\r\nNikolas Hulewsky (50:28.688)\r\nIs it?\r\n\r\n\r\nIs there a tech component to it? you went out and raised money or is it, cause like, mean, traditionally with an MSO, you're not going out and raising a of money.\r\n\r\n\r\nSandeep Palakodeti (50:37.559)\r\nAbsolutely. So we raise money for several things. One, there's a huge regulatory component getting licensed in 50 states and checking all the boxes is a several hundred thousands of dollars undertaking. You have to really know what you're doing. There's a tech component. have a, a portal, a platform that patients use that amalgamates all of this different data and it'll plot to you your\r\n\r\n\r\nNikolas Hulewsky (50:48.249)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (51:01.424)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (51:05.262)\r\nMm-hmm.\r\n\r\n\r\nSandeep Palakodeti (51:06.351)\r\nsort of biological age and chronological age and where your risk is versus age and sex. can ask it questions. can schedule with your doc and all those kinds of things. And it's really about top of funnel, Nick. Like we know that we have a 96 % retention rate. It's sticky when patients come in. It's really though, and then we also know that there's such a need for it. Like the timing is right. There's so much information and data available to\r\n\r\n\r\nNikolas Hulewsky (51:08.176)\r\nand\r\n\r\n\r\nSandeep Palakodeti (51:36.185)\r\npatients as far as like podcasts with Huberman and Atiya and Rhonda Patrick and all this stuff. And then there's all this data available with function and these MRIs and the lab tests and everything. And people are just swimming in information. They don't know what to do with it. So we're like, at the right moment, I think. And if you compare it with the right sort of unit economics, that's what is attractive. And so building out the tech component, making it a pleasant sort of digitally native experience.\r\n\r\n\r\nNikolas Hulewsky (51:40.208)\r\nYeah.\r\n\r\n\r\nSandeep Palakodeti (52:04.237)\r\nWe are thinking about a brick and mortar expression from this as well. Like what would it feel like to dot, you know, the country and put a velocity health center?\r\n\r\n\r\nNikolas Hulewsky (52:12.524)\r\nYeah, I would think if you started getting concentration in any particular market, yeah, why wouldn't you have a brick and mortar location?\r\n\r\n\r\nSandeep Palakodeti (52:17.647)\r\nExactly. Well, look, the way I think about it is a broken mortar, first of all, it's a distraction, right? You have to like operate it and it's that whole thing strategically. But to me, if you're going to, it needs to both be amazing and like a line of vision and mission and values and value, but also it needs to be standalone profitable. Meaning if just the services that you have incorporated into the center,\r\n\r\n\r\nNikolas Hulewsky (52:26.244)\r\nYeah.\r\n\r\n\r\nSandeep Palakodeti (52:45.807)\r\nshould have enough like a la carte service that it could exist on its own. And then the icing on top is that if any of those folks convert to a longitudinal relationship, then you've got the recurring SAS revenue. And so, you know, when you really ask about the business, right, like just take the middle plan and use that as a benchmark. If we can get a thousand patients paying a thousand dollars a month, we're making a million dollars a month. We're 12 million ARR, healthcare multiples are\r\n\r\n\r\n10ish X ARR, maybe 30 or 40 X EBITDA. We have probably a 30 % margin or so. That is taking into account all of our startup costs and everything. So we might get more efficient. You talked about AI. I think there's some opportunities there operationally. But it's not that crazy to get 20 patients per state in 50 states.\r\n\r\n\r\nto get to a thousand patients and to be valued at a hundred million dollar company. Right. And it's not about like what our value is for our personal. If to me, it's like, once you get that and we're profitable, like you're already profitable. You are broke even at a hundred patients or whatever. Like you, your destiny is in your control. Like I can go to a bank and get like better terms to go think about, okay, well, maybe I want to expand and go buy a bunch of these practices and roll them up. Maybe I want to do this brick and mortar thing. Maybe I want to go big on the AI thing. Right. But that happened.\r\n\r\n\r\nNikolas Hulewsky (53:59.695)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (54:08.996)\r\nYeah. Yeah.\r\n\r\n\r\nSandeep Palakodeti (54:10.753)\r\nif I can get even minimal kind of scale, right? And so that's how I sort of see the business. Now, once you start like layering on, okay, 10X that can I get to 10,000 patients? Like that's not that many people, right? 10,000 people is not that many people. You gotta find the right people, but you know, that's it.\r\n\r\n\r\nNikolas Hulewsky (54:25.85)\r\nWell, so you're doing all the back end work. you credentialing all these physicians in every state? Like are you the back office who are going out and getting them credentialed or licensed, I guess?\r\n\r\n\r\nSandeep Palakodeti (54:37.283)\r\nYeah, I mean, a lot of our docs are coming to us with a lot, several licenses already. are recruiting for that, but we also, yeah, we help them build. There's something called the IMLCC, which is the interstate medical license compact. And if you have a home state, you can basically get reciprocity in 30 something states. Then it's just like picking off the other big ones. So we've essentially like regionalized our docs so that\r\n\r\n\r\nNikolas Hulewsky (54:57.721)\r\nOkay.\r\n\r\n\r\nSandeep Palakodeti (55:04.431)\r\nWe've got like a West Coast stock. He's got all those 10 states and a Midwest stock. He's got those 10 states or whatever.\r\n\r\n\r\nNikolas Hulewsky (55:07.182)\r\nMm-hmm.\r\n\r\n\r\nAnd then what does the rest of your team look like? Do have a dietician? Do you have any specialists?\r\n\r\n\r\nSandeep Palakodeti (55:13.903)\r\nYep, yep. we have a dietitian, trainers and the behavioral health folks as performance mindset coaches and then subspecialist network as well. And so we've got the eight primary docs who are longevity focused, optimization focused, but we also have access to our subspecialty network. so whether you need a GI doctor or endocrinologist or a preventative.\r\n\r\n\r\nrheumatologists or whatever it is, we'll have access to those folks and we bring them on the team. And the experience we like is sometimes we can pull this off. We like this from a scheduling standpoint is like, like this, me and the specialist should be in the room together. Meaning like, let's all have the conversation, right? One of the things that always frustrated me even at a place like the number one hospital in the world was I couldn't get three specialists in the room at the same time to talk to the patient at the same time.\r\n\r\n\r\nHow frustrating is that? They're all saying their little snippets and that's not the kind of care I'd want for myself or my family and we're committing to trying to build something outside of that. And so yes, we do have those sub-specialists as well.\r\n\r\n\r\nNikolas Hulewsky (56:20.048)\r\nHow were the physicians compensated? Is there a bonus structure with, I don't even know how you would do it. Is it just billable cash?\r\n\r\n\r\nSandeep Palakodeti (56:29.619)\r\nNo, because we don't want to recreate the same pathologies of the current system. Service where docs are incentivized to churn and burn volume. We pay a per member per month fee to our physicians as well. So, you know, like just pick a number. I'm not saying this is a number, but say it's a hundred dollars or easy number, right? If you had a hundred patients on your panel,\r\n\r\n\r\nNikolas Hulewsky (56:36.015)\r\nRight.\r\n\r\n\r\nSandeep Palakodeti (56:56.975)\r\nThat means you're making $10,000 per member per month or overall, right? You're making $10,000 to care for those hundred members, if that were the PMPM fee. So we create whatever that PMPM fee structure is and we build their panels. know, what I'll say is like, if you're at a full, if you're a full-time doc working with us, you're earning top five percentile of physicians in the country. And so we want to attract.\r\n\r\n\r\nNikolas Hulewsky (57:02.362)\r\nGet total. Right.\r\n\r\n\r\nSandeep Palakodeti (57:25.583)\r\nthe very best of the best and we want to retain them and that means you got to pay them, right? Frankly.\r\n\r\n\r\nNikolas Hulewsky (57:31.696)\r\nWhere are you finding customers? So you mentioned a one to 10 ratio. So it's like, all right, for every thousand dollars we spend, we get $10,000-ish for that. Where are you seeing those patients come from? How are you getting them?\r\n\r\n\r\nSandeep Palakodeti (57:42.073)\r\nYep.\r\n\r\n\r\nSandeep Palakodeti (57:48.099)\r\nWe are in the midst of running several different channel experiments. There's the traditional stuff like digital media, social paid advertising, right? is someone going, yeah, if someone gonna pay for a thousand dollar a month product off of a TikTok ad, some people will, right? And I think you just have to tune in the algorithms in the right kind of way.\r\n\r\n\r\nNikolas Hulewsky (58:00.106)\r\nGoogle meta.\r\n\r\n\r\nSandeep Palakodeti (58:14.105)\r\ncall it 20 % or so of our marketing spend is on that realm. And if we can prove that that CAC is reliable and we find the right channels, we'll probably pour gas on that. Cause that's a really reliable way to get in front of a lot of people. But we're exploring a lot of other things. The most successful one from like a per capita standpoint has been like CEO and executive round table clubs. And so,\r\n\r\n\r\nwe're part of one called Amalfi. For example, they bring together founders, executives, CEOs, former athletes. they golf, they talk about business, they do these wellness retreats, had the opportunity to go do like a fireside chat, question and answer, hang out all weekend, really get to know people. That's like the long format sale. Right. Like people want to know their doc more than anything and they want to.\r\n\r\n\r\nNikolas Hulewsky (59:04.944)\r\nMmm.\r\n\r\n\r\nSandeep Palakodeti (59:10.863)\r\nyou know, be able to question them on certain things like values or how they see certain clinical circumstances or whatever it might be. And so that's another channel that we've found a lot of success in, but frankly is very time consuming and expensive as you might imagine. And so how we scale that is something that we're thinking about.\r\n\r\n\r\nNikolas Hulewsky (59:36.016)\r\nyou\r\n\r\n\r\nSandeep Palakodeti (59:40.111)\r\nWe've done other things like sponsor newsletters and webinars and you know, print media. I'm writing a book.\r\n\r\n\r\nNikolas Hulewsky (59:50.99)\r\nIt doesn't sound like though you've necessarily found your like channel where you're like, okay, this is it. Let's No.\r\n\r\n\r\nSandeep Palakodeti (59:54.477)\r\nI don't think we are, no, no. I think we are literally in the midst of that experiment right now. And I think we've done in a smart way where we can pretty accurately tell you what our CAC is by channel and by experiment and by partner. And we're just letting them all play out. When we stopped that experiment, I don't know. I would like to see a very, like a front runner, right? Like this thing.\r\n\r\n\r\nreliably for 700 bucks, we get patients. These other five things, it's like 2,000 or more every single time we're paying that much. Like, okay, let's throw all our resources at this thing.\r\n\r\n\r\nNikolas Hulewsky (01:00:33.124)\r\nYeah.\r\n\r\n\r\nIs there one that you think it's going to be? Like I would think that Metta or Facebook would be kind of the perfect place for you to go run.\r\n\r\n\r\nSandeep Palakodeti (01:00:41.871)\r\nYou know, what we learned about Metta and Facebook and why it's not a good channel is because it's passively serving up ads to people who, yeah, might be interested, but scrolling and seeing an ad is different than going to Google and typing in longevity practice. Like you're already showing another sort of a step towards conviction towards this thing by taking time to search for this thing rather than being\r\n\r\n\r\nNikolas Hulewsky (01:01:00.548)\r\nYeah.\r\n\r\n\r\nSandeep Palakodeti (01:01:10.841)\r\npresented it passively. so, look, did we just mess up our approach to Meta and Facebook? Sure. Are there companies in our space that are successful using Facebook and Meta? I am very certain of that. That's not been our experience so far, but we're also early and we're not spending all that much money on it.\r\n\r\n\r\nNikolas Hulewsky (01:01:14.061)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (01:01:31.872)\r\nWhat's the conversion of entrepreneurs who come or owners? I'm sorry, my camera keeps shutting off. I'm still gonna ask you this question, give me a second.\r\n\r\n\r\nNikolas Hulewsky (01:01:45.37)\r\nWhat's the conversion? So what's the percentage of entrepreneurs who go and do that first test, that $2,500 test that then convert to the long-term patient?\r\n\r\n\r\nSandeep Palakodeti (01:01:55.407)\r\nYeah, that's much higher. That's like 25 to 50 % of patients stay with us. So, I mean, we think that's a great way for people to come in and get a sense of who we are. And, know, what happens more times than not is not that like, oh, we found something scary, you better stick with us. That's not even what we're saying, right? We're saying like, we're just having a genuine authentic conversation like this. And patients are like, I want to keep working with those people.\r\n\r\n\r\nNikolas Hulewsky (01:02:17.796)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:02:21.838)\r\nYeah, I love this business. Where's the best place for people to come find you? Online, Velocity, YouTube.\r\n\r\n\r\nSandeep Palakodeti (01:02:30.425)\r\nYep, www.velocityhealthclinic.com is our website. We do have a YouTube and a podcast called The Ultimate Asset. just interviewed two of probably the world's leading cardiologists and brought them in, had fascinating discussions with both of them. We kind of will juxtapose different viewpoints and we want to elevate the kind of conversation that we're having around optimization and longevity.\r\n\r\n\r\nI am writing a book that will be released early next year. 50 is the new 30. This is really meant to optimize and bring out what I think is the prime decade in most of our lives if we can achieve it and have the right team around us. I'm all over X, Dr. Deep, MD, and LinkedIn.\r\n\r\n\r\nNikolas Hulewsky (01:03:06.052)\r\nHope so.\r\n\r\n\r\nSandeep Palakodeti (01:03:26.113)\r\nInstagram and all that good stuff, but search velocity health clinic.com to start plenty of information there.\r\n\r\n\r\nNikolas Hulewsky (01:03:32.528)\r\nLove it. Dr. Deep was fantastic, my friend. I can't wait to talk to you again. All right. Stay on for a second. I'm going hit stop.\r\n\r\n\r\nSandeep Palakodeti (01:03:36.783)\r\nThanks a lot, Nick. Appreciate you having me.",
  "metadata": {
    "duration": "",
    "date": "2025-10-15",
    "platform_source": "Google Drive"
  }
}