{
  "episode_number": "102",
  "episode_title": "EBITDA vs. SDE: What Every Business Buyer Needs to Know with Dennis Unrein",
  "guest_name": "Dennis Unrein",
  "business_name": "Private Ventures Group (PVG), SMB PE",
  "transcript": "﻿Nik (00:00.75)\r\nAll right, Dennis, why don't you, you have a solo GP model. Why don't you kind of just describe to me what it is you actually do?\r\n\r\n\r\nDennis Unrein (00:10.453)\r\nYeah, no, thanks for having me on. think for us, we really focus on the micro VC and micro PE space. I started doing investing out of a vehicle called Private Ventures Group or PVG three years ago, three and change three and a half years ago. And we've morphed that into investing in the SMB space with our SMB PE entity that's more on the media side. So we look for interesting investments.\r\n\r\n\r\nfor our group of high net worth investors and family offices and put some content around that to drive the oil flow.\r\n\r\n\r\nNik (00:42.648)\r\nSo a lot of people will, they know the words venture capital, they know the words private equity. Can you just give us a very quick, what's the difference between venture and what's the difference between private equity?\r\n\r\n\r\nDennis Unrein (00:53.725)\r\nAbsolutely. Yeah, I think on the venture side, it's a very different investment focus right there. You're looking at a portfolio approach. So folks usually pick 30 companies, they'll place those bets and one or two of those bets will pay out an outsized return to your overall investor group and drive a portfolio return based on the other bets that don't work out. On the private equity side, it's much more of a focus of I give you a check, I would like to get a check back and there's more downside protection.\r\n\r\n\r\na little more financial focus in terms of the business profile and the cash flow profile. And what we've done is really focused on the smaller part of that market where a lot of high net worths and family offices are playing and want to access really compelling private deals below where some of those larger institutional players play and some of the larger funds. So anything below $10 million in total enterprise value is kind of where we focus right now.\r\n\r\n\r\nNik (01:50.606)\r\nOkay. Usually the way I think about venture is like venture early stage, higher risk type companies. They don't have to be tech companies, but are typically tech companies. Higher risk, higher reward, private equity, lower risk, lower reward, but it's kind of where you park your money not to lose it. I'm expecting a check back in return. So tell me you started with PVG. So that was the you originally raised.\r\n\r\n\r\nDennis Unrein (02:15.701)\r\nYeah. Yeah. So I've been in finance now for 11 years and went off my own three years ago to start our own shop. And that was a PVG. So the initial focus there was to get into blue chip venture capital deals and access really compelling venture investments in the private markets. 21 and 22 there were a lot different than today in terms of where we were as a\r\n\r\n\r\nas an investment market. But before that, spent a lot of time at JPMorgan and in private equity putting together what they call SPVs, which are special purpose vehicles, not to get too acronym focused for the folks out there. But think of it as a pooled investment for private investors. traditionally, the cost of those vehicles have been higher than they are now. And it's allowed a lot of folks to make independent bets as smaller firms.\r\n\r\n\r\nlike myself and a few others we work with on interesting companies. so working in that space, we put 25 deals together in the last three and half years, equity investments into companies. And in the last eight to 12 months, we've pivoted over to the SMB space to back self-funded searchers because the way we're set up, the equity checks that we're putting to work generally will work well in terms of size-wise in this space as well. That's at least the thesis.\r\n\r\n\r\nNik (03:42.174)\r\ninteresting. OK, so on the venture side, you raise money, right? Can you disclose how like how much money did you raise for PVG?\r\n\r\n\r\nDennis Unrein (03:49.385)\r\nYeah, sure. We have just over five million bucks of AUM right now. So small checks think, you know, anywhere from 200K to a million dollars, I would say, is sort of a check range that we focused on.\r\n\r\n\r\nNik (03:58.478)\r\nOkay, that's what I was going to ask. So on the SMB space, what you're saying is you're primarily investing in searchers.\r\n\r\n\r\nDennis Unrein (04:05.941)\r\nYeah, we took time in 23. I think that was a pivotal moment for this small investment firm that we have where the venture market had gone through quite a up and down, if you will, following COVID and a few other things where 21 and 22 were very up and to the right. And 2023 was more of a where do we stand as a venture market? And I think we have a lot of really compelling investments there and we're still backing the founders that we've worked with.\r\n\r\n\r\nBut going back to the drawing board, you know, I spent time in JP Morgan's &A group and understand &A quite well and have been reading more and more about some of the online &A going on in this space, especially in foreign businesses. And we took the time over the last eight to 12 months to say, look, instead of doing what we've been doing, where we go out to investors, we'll send them a memo. There's no fund vehicle. We underwrite each deal individually and ask them, hey, do you want to participate in this deal?\r\n\r\n\r\nInstead of doing that on the venture side, we've shifted that over to the boring business side now to back self-funded searchers. Just given that the equity checks do line up in terms of sizing well for those folks too. So the idea now is to find searchers and entrepreneurs that are looking to buy businesses versus to your point before in the venture world, take riskier bets where you're trying to grow something very big, very fast and very large.\r\n\r\n\r\nNik (05:26.19)\r\nOkay, so you still have this fund, the PVG, that you guys are, you're managing assets. Is that capital fully deployed or do you still, are you still making small bets?\r\n\r\n\r\nDennis Unrein (05:31.028)\r\nYes.\r\n\r\n\r\nDennis Unrein (05:37.173)\r\nI would say right now there, I've sort of paused future bets in the venture world, except for follow on capital in our current portfolio. And then we've gotten full tilts into the SMB world with a lot of content and focus around back end searchers there. There's still been a lot of opportunities on the VC side, but we found that I wasn't going be able to do both of those things at the same time. Just became too much to work on. So there we have some good bets. We're in OpenAI is a big name.\r\n\r\n\r\nWe've made investment in Jackpocket, which was sold to DraftKings, had a nice exit there. So there's some good names and some not as good names, but overall really focused on maximizing our investors' returns there. And then here going forward, really have refocused them to say, hey, let's go try and back a few self-funded searchers around our new content, our new outreach. And so that was certainly a big pivot to explain to our investors, but I feel like we're in a better spot for it and have a better hold on our\r\n\r\n\r\ninbound deal for now, just given the way it's lined up.\r\n\r\n\r\nNik (06:38.382)\r\nOkay, I really wanna talk about SPVs and I really wanna talk about the way that you're utilizing media to essentially create deal flow. But before we get into those two things, I wanna go through like, searcher, quote unquote, because there's a traditional searcher and then there's now this self-funded searcher that I think has become popular over the last few years. There's the traditional searcher, graduated usually from a top MBA, Stanford, Harvard, Chicago's Booth, Wharton, wherever.\r\n\r\n\r\nAnd they become a quote unquote searcher. They go out to the market and they raise money from individuals that will pay them for two years ish to go buy a business. So usually they'll raise let's call it three, four or $500,000. They'll pay themselves a salary, but then also they'll also use that money to go to conferences and network and lawyer fees and all the the all the things. And then when they find a deal, they'll go back to those original investors and those original investors will get an opportunity to invest in the actual deal.\r\n\r\n\r\nand they'll get a step up in the original investment, but they'll also be asked to contribute capital in order to close. OK, so that's like the traditional searcher model. But there's now a new searcher model, which is I'm an entrepreneur or I'm a person, a watchman or I want to get into entrepreneurship. I want to buy a business. looking for a business to buy. I have a W-2, but I don't have the capital to close on a business. So I'm to go out and raise money to essentially provide gap funding, right, to close that business.\r\n\r\n\r\nand then whoever's investing in that obviously gets a piece of the business. Are you investing in both of those models or are you investing in one over the other?\r\n\r\n\r\nDennis Unrein (08:15.657)\r\nYeah, it's a great question. We're really focused on the self-funded space. To your point, I've done a lot of work over the years, I felt like with more of the traditional search folks, which I viewed as small private equity funds. So those folks are, they generally have a pretty formal board. They have investors that are involved in the process, to your point, upfront. And over time, they'll pay for a search for a couple of years for those individuals who will go out and develop a thesis, try and close a business. It's usually\r\n\r\n\r\nyou know, a larger fundraise, a few partners, and again, a board, just very formal process in that standpoint, and using an MBA focus graduate. What's developed in the last couple of years, I would say more on the self-funded side, which is where we focus, is the use of the SBA loan program and going out and buying a deal yourself under $10 million in deal value, under $5 million in deal value, majority of the time. And that\r\n\r\n\r\ncombined with the proliferation of some of these online tools has really led to a market where you can go out and buy a company yourself versus starting it from scratch. And the big argument there is you're starting a company with customers, with employees in place, with a of the hard stuff already taken care of versus on the venture side, traditionally, you're starting from the ground up, which just has generally a higher failure rate, right? It's harder to start companies from scratch than buying something established. And you combine the two of those\r\n\r\n\r\nwith the wave of retiring baby boomers in this space. And I think you're at a spot where there's a big push in that demographic of businesses that are profitable, have been around for a long time and are up for sale, if you will, in the next couple of years due to a lack of a transition plan for folks that want to execute in this self-funded space. That's kind of where we'll be focused. The traditional search folks have a really good network going there too. It's just a little bit of a different model, a little different approach.\r\n\r\n\r\nNik (10:11.662)\r\nWhat about the target businesses? Like traditional search, they're going to be like $2 million in EBITDA is sort of their low end. Sometimes they'll go below it, but they're low end and then they move up from there. But the SMB space, when you're talking about going through the SBA, signing on a personal guarantee, individual going and buying the business and owning the majority of the equity, I don't think of that as typically $2 million in EBITDA. I think of that as lower. What are the type of deals that you're looking at?\r\n\r\n\r\nDennis Unrein (10:39.689)\r\nYeah, that goes exactly where we sort of drew the line to in talking to friends of ours in the private equity world. We started off with a larger institutional lender and said, kind of deals are below your threshold? And they threw out 20 million bucks. They're a bigger person in that space. So we started to go down towards lower middle market private equity firm. Sorry, $20 million in EBITDA. so much, much larger lender. Yeah. And then\r\n\r\n\r\nNik (10:58.606)\r\n20 million or $20 million in EBITDA.\r\n\r\n\r\nDennis Unrein (11:07.381)\r\nThat's what you get in that institutional world. The one went down to the lower middle market. And to your point, I think below $2 million, we don't really go after and we don't really keep books on or focus on. I think maybe some of that's changed recently. But to your point, these self-funded folks typically are looking for companies with as little as $600K to a million and half of SDE, which is another metric used in that space. But think of it as cash flow, similar to EBITDA, a little bit different.\r\n\r\n\r\ndifferences there, but you have $600K to $1,005,000 in EBITDA or cash flow and below that $2 million threshold. And what they'll do is use an SBA-backed loan to purchase this business plus equity without partners, right? So it's usually a solo individual who's going in there. So from an economic standpoint, they don't need two or three salaries and a larger company with $2 million plus of EBITDA. They're looking for\r\n\r\n\r\na much different business profile in that sense. So it opens up a pretty big universe of companies that are out there below that $2 million threshold that you mentioned before.\r\n\r\n\r\nNik (12:10.542)\r\nSo you're investing in the below $2 million threshold?\r\n\r\n\r\nDennis Unrein (12:14.259)\r\nYeah, that's kind of below $2 million of cash flows where we're focused. I think that's where a lot of individuals can make a move and need some equity to make it happen.\r\n\r\n\r\nNik (12:24.066)\r\nOkay, maybe we'll talk about the difference between SDE, EBITDA and cashflow. Everybody uses it the same way.\r\n\r\n\r\nDennis Unrein (12:29.095)\r\nYeah, at the end of the day, you always have to find your own numbers that work, but they're all used interchangeably in this space.\r\n\r\n\r\nNik (12:36.758)\r\nWhat's your favorite SDE, cashflow or EBITDA?\r\n\r\n\r\nDennis Unrein (12:40.341)\r\nIt depends who I'm talking to. I always tell our folks, we try and help people find companies too. If you're talking to a broker or a seller, you're talking an SDE. If you're talking to a lender or an investor, you're talking to EBITDA. So if you're below the $2 million threshold, you have to be to speak both languages if you will.\r\n\r\n\r\nNik (12:58.732)\r\nYeah. And for those of you listening, SDE, seller discretionary earnings, is typically just anything that the seller took home, quote unquote. EBITDA is much more in line with GAP and is going to, you know, earnings before interest taxes, depreciation and amortization, but they are not the same. They are definitely not the same.\r\n\r\n\r\nDennis Unrein (13:22.879)\r\nDefinitely, definitely different. The one thing with SDE to think about too is the big distinction is think of EBITDA plus the owner's salary and any payments to the owner and discretionary owner spending, right? So a lot of folks run a lot of expenses through these businesses, are very attached to them and they'll take those expenses and add them back on the broker side to tell you as the new buyer, look, here's all the cash available to you in this SDE metric. But it's, yeah, it's definitely confusing to folks.\r\n\r\n\r\nNik (13:48.172)\r\nWhy do in that range, why do people like using SD versus EBITDA?\r\n\r\n\r\nDennis Unrein (13:53.845)\r\nThe thinking there really is the sellers are really representing all of the cash that's available to you, right? They're going to go through the books and say, look, here's a business, everything that's thrown off. But to your point, as a buyer, you have to make adjustments for new salary needed, new hires needed, all that stuff on your end anyway. But it's generally because of the way that these owners are very involved in these businesses and they want to represent that from that perspective of how much cash is available to you to make your decisions with.\r\n\r\n\r\nIt can confuse some people, there's ways to go through it and figure out what's what.\r\n\r\n\r\nNik (14:30.594)\r\nYeah, the only thing I would add is usually in those size of deals, SDE is going to be used because the person who's buying is going to be an owner operator. And so they don't care as much about you, but I don't care what the depreciation or amortization is on the market. What can I expect to take home as this new owner operator? But it runs into conflict when you get people like you who have a fund or are investing in a space looking at it as a business that can potentially grow and scale.\r\n\r\n\r\nYou don't care as much about SD, you care about EBITDA.\r\n\r\n\r\nDennis Unrein (15:04.415)\r\nYes, and the lenders too. They're definitely Evita folks, but it's interesting.\r\n\r\n\r\nNik (15:07.18)\r\nYeah, yeah. So tell me, because this was the thing that I got the most interested in. Tell me about SPVs. So like, I know it's a word, I know that it's used. What the freak is an SPV?\r\n\r\n\r\nDennis Unrein (15:20.722)\r\nYeah, no. mean, it's the first time you hear it, you always say, what does that mean? I mean, it's a very strange acronym and special purpose vehicle is a mouthful. But think of it like a very simple investor group or pool of assets that's investing in a company. So they've been used. You can use them all the way up the chain, right? You can do really large series D investments with multiple hundreds of millions of dollars in an SPV, right? But that's just referring to the vehicle itself.\r\n\r\n\r\nRight. Think of it as a EIN and an LLC that holds investor funds that can then be invested into a company. I started doing them what is now eight years ago, and we use New York based lawyers and New York based private equity firms. And as you can imagine, that wasn't as cheap as some of the really interesting online solutions now. So, you know, the easiest way to describe it to folks is all of your friends who invest on something like an Angelist.\r\n\r\n\r\nthey're using SPVs as the vehicle that makes a contract agreement with you as an investor and then invest into the cap table of the company in one line item. That's kind of the simplest way to think about it. And from the company's perspective, instead of picking up 50 small investors, they can just take one line item. And for the GP or the smaller investor in that space, they can get into more deals because they have a more institutional offering where they can just go under a company's\r\n\r\n\r\ncap table with one line item, again, without 50 different small investors the companies want to deal with. So given the latest run up in the market in 21 and 22, you had a big spike in online providers in this space. And there's a lot of solutions around how to create these vehicles. The other benefit being besides just the cleanliness, you will, on the investing side for these companies is the tax side. So in general, they're\r\n\r\n\r\ncreated to distribute tax documents to your investors on time as the GP. So works in both ways. The company gets a clean entry from you as an investor and then you can service and manage your investors out of that vehicle.\r\n\r\n\r\nNik (17:26.318)\r\nHmm. So like I'm thinking of the real estate model. I have a friend of mine who he raised a fund, right? And he, it was almost like a search fund to be honest with you. He's like, all right, I'm raising a fund. It's the GP. You're going to pay me essentially for two years to look for that first deal. We're going to build out the office infrastructure. And then when we find deals, these are real estate deals, we'll go back to LPs and raise money for each one of those individual deals. The GP will get a certain percentage. The LPs will get a certain percentage, et cetera.\r\n\r\n\r\nWas he just describing an SPV and just didn't use the word?\r\n\r\n\r\nDennis Unrein (18:00.767)\r\nProbably, yeah. No, it's often used too with fund vehicles. It's kind of traditionally how it's probably used the most, I would say. You know, a lot of times on the VC side, folks will use it for example, a follow on deal where they're constrained, right? So if they put an X amount of dollars, but they have an allocation in the company they really liked, they'll open up an SPV, offer it to their investors, let them do more capital on. To your friend with the real estate fund, they're also very familiar with this structure. If they're using some sort of fund investment, they might.\r\n\r\n\r\ncreate an SPV alongside one of their fund investments to increase the equity that's going into the deal if they want to or size up or size down in supplement to the fund itself. So they are used quite a bit supplementing funds.\r\n\r\n\r\nNik (18:42.968)\r\nAt what point do you do the SPV? If you have one person who you're raise money from to help close this deal, do you do an SPV? is it just once it passes three individuals who are gonna be owners in the company, you should probably have an SPV? How do you think about when to do an SPV?\r\n\r\n\r\nDennis Unrein (18:59.453)\r\nYeah, so for us, it really depends on the deal. We generally underwrite the deal upfront and then bring it to investors. The idea there is to offer your investors the ability to look through the menu, as an old client of ours told it. So if you're a fund, you're generally investing in everything at the restaurant. So if you're doing one of those all-inclusive meals, everything kind of comes out as is. This allows you to look through the menu of the fund and pick out just individual deals.\r\n\r\n\r\nSo while it can be a little bit more burdensome in terms of work, generally how it works is if you find a compelling investment, you'll then underwrite it, go through your processes with your small investment committee yourself and solo GPay and maybe a few close advisors and talk about if it makes sense. Then from there, you put together materials and go out to your broader group of investors, ask them who's interested, figure out if an allocation makes sense and go back to the company and communicate that. A lot of times it kind of just depends on investor interest.\r\n\r\n\r\nNik (19:56.878)\r\nSo I get why it'd be advantageous for you as the fund to essentially have these vehicles for every individual deal that you're doing. makes it a lot cleaner. Talk about the benefits of doing an SPV versus doing it the other way.\r\n\r\n\r\nDennis Unrein (20:11.669)\r\nYeah, so I mean, look, if you're, you know, if you're a first time fund manager, it's there's a lot to do, right? I think folks think sometimes our funds just sitting back and investing and reading, you know, a bunch of Sims and stuff. And that's totally true. But, you know, what you're really doing as a fund manager when you first start is let's look at two different ways. If I can raise five, 10, you know, $15 million on a smaller fund, maybe $50 million on a bigger fund, whatever that looks like. That's a very different conversation.\r\n\r\n\r\nthan raising an SPV and doing a deal first and going to investors and saying, hey, can I bring you this deal? So from a mechanical standpoint, as an early fund manager, it helps you in the sense of you don't have to do all the complicated part of raising this big fund. You can go to investors first and give them a proof point, right? You can put in front of them in paper, hey, we have access to this deal. We're doing this deal. Would you like to participate? So it's very good vehicle for junior managers. And then to your point on the tax stuff, what it's able to do for a lot of these folks is it essentially forms a entity.\r\n\r\n\r\nAnd then you work with great accountant teams that are out there and put together what they call K-1 partnerships and issue all of your investors at K-1 through this investment entity at the end of the year. And it can be varying levels of difficulty there. found on the self-search side, actually more complicated than the venture side, but it does allow an accountant then to issue all of your LPs through this tax ID and this investment vehicle, all of the necessary\r\n\r\n\r\ntext documents that they need, which when you're first trying to figure out how to do a fund and make an investment is definitely a big part of the pie, if you will.\r\n\r\n\r\nNik (21:47.448)\r\nWhy would it be advantageous for a searcher? Why would I as a searcher be like, I should go raise an SPV?\r\n\r\n\r\nDennis Unrein (21:54.293)\r\nYeah, you at first we were looking at these, you see a lot of folks on the internet talk about how you can buy a business with 0 % down and live on the beach, drink my ties. I'm sure some people have done that and it's successful in the very small, small minority. But in general, when you go through these investment processes, 50 % of the companies we're looking at under LOI don't go through.\r\n\r\n\r\nFor the searchers, they're putting up costs out their pocket for legal, for accounting, for a few other things. It could be some significant cash out of pocket. And they're also searching for these companies for multiple months. Some of these folks are employed, some of these folks are not employed. And all of the time that they've spent searching for this company might be quite a few paychecks that they've missed. And then the closing gets delayed 30 to 60 days later than you thought.\r\n\r\n\r\nThese are all costs and time and things that go into this deal that when you add it up, a few, it can be a few hundred thousand dollars for folks depending on what kind of deal size they're buying. So we found that if I'm a self-funded searcher, it might be better to sell 10, 15, 20 % of the equity, take on some cash. That way when I buy this business, I'm not completely cash strapped as an entrepreneur. In case something goes wrong, I get sick, God forbid life happens. I have some extra cash on the balance sheet and I'm able to run this company.\r\n\r\n\r\nI'm taking on investors where I'm still owning 70, 80 % of the upside of this business, but I took on some cash from the outside to just lower the overall cash I personally have to put up.\r\n\r\n\r\nNik (23:24.174)\r\nSo are they taking cash in to help with those deal related costs or is it just at close, hey, this is how much equity we need. We go to an SPV and we get that injection.\r\n\r\n\r\nDennis Unrein (23:33.429)\r\nIt really does depend. I would say for the most part, this is part of the closing conversation that this check comes in because the investors are backing a lot of your risk. So from their perspective, they're giving you a check and maybe you've never run a company before, maybe it's your first time in whatever industry, it's definitely a lot of risk. But when you're getting the benefit out is you're not going to put up, again, personally, a few hundred thousand dollars, which a lot. And as long as you run this company and pay off the debt that you're now\r\n\r\n\r\nNik (23:41.678)\r\nOkay.\r\n\r\n\r\nDennis Unrein (24:03.487)\r\nfully in charge of, majority owner, our check becomes a little bit of a hybrid VC and PE in that standpoint where we're a minority owner and really it's your job to run the business and do well. can obviously offer tons of support, but if that person can then run that business, pay off that debt, they'll generally unlock a significant wealth creation vehicle for themselves by running this company as well as personally and professionally outside of that. it really kind of lowers the burden on them on the front end side where\r\n\r\n\r\nIf so much to do towards clothes, maybe not completely cash strapping yourself, plus clothes helps you from a stress perspective or a number of other looks at it.\r\n\r\n\r\nNik (24:41.838)\r\nSo on the traditional search side, from what I've seen, traditionally what they'll do is they'll be like, okay, you searcher, you've gone out and found this business, you brought it to the LPs, they're gonna put money into it. You get 10 % equity upon close, you get 10 % equity if you hit certain metrics, and you get 10 % equity upon exit, depending on the multiple. So you could, know, potentially you're earning up to 30 % of equity in this business, but you can be fired anytime, you can be replaced.\r\n\r\n\r\nthat equity doesn't necessarily vest and depends on the vesting schedules, all those things. What does it look like with these SPVs as you're putting money into SMBs? What does the equity structure look like between the searcher and between you, the fund?\r\n\r\n\r\nDennis Unrein (25:29.033)\r\nYeah, that's really the big benefit, I think, on the self-funded side. While you can do a much larger deal on the traditional side, I generally think of the economics sort of like a third, a third, a third. And you can earn, to your point, up to a third of your own equity over the course of the deal. Your investors aren't going to talk about the other 60 % between debt and themselves. On the self-funded side, it's much different. So what's going on here is you're going out and sourcing a deal.\r\n\r\n\r\nYou're signing up to then finance it with an equity down payment and what should probably be an SBA loan, taking advantage of the SBA loans program in this space. Upon close, you are then going up to investors and saying, hey, I'd like to raise some equity. In general, to your point, you're going to raise about maybe 10 to 30%. And from the investor standpoint, they're not going to want to do much more than that because they don't want to sign over 20 % to sign onto the personal guarantee. Now, does that happen? Certainly.\r\n\r\n\r\nBut here's a personal guarantee involved with these loans. So when you are signing on to the company, and structurally what happens is you'll go raise 10 to 20 % of this equity, but you'll still own 70 to 80 % of the business post-close because you're personally guaranteeing the debt and the rest of the deal. And it's your company, to your point, that you're owning afterwards without a formal board advisory. And the reason I think a lot of the differences there are\r\n\r\n\r\nTo be fair, the traditional search guys, they're raising much more money, doing much bigger deals. Here, you're financing it with lot more debt. That's a much highly levered vehicle, plus an outside investor is coming in for a smaller amount. So you're able to own it with much more upside.\r\n\r\n\r\nNik (27:07.054)\r\nSo after close your fund is the SPV is owning between 20 and 30%.\r\n\r\n\r\nDennis Unrein (27:11.613)\r\nYeah, so in general, the pricing I've seen in market for equity right now is probably like one and a half to two and a half step up from other funds that we've seen. And that step up means whatever dollar I give you lands in that amount post close in terms of ownership. So let's say I'm putting in 10 % of the deal, I'll own 15 % as that part of that step up. And then for rates right now, it's early November 2024. We'll see where rates go.\r\n\r\n\r\npreferred rates on that are generally around 10 to 12%, I would say, in terms of annual coupon. So you're paying back that coupon to those investors, that's because given where rates are. And post-close, you own, again, like 70 to 80 % of the business, so you're really in charge, you have majority control, and these investors are in your cap table as an additional way to raise some equity and reduce the overall burden on your personal balance sheet.\r\n\r\n\r\nIt's very personal conversation.\r\n\r\n\r\nNik (28:07.086)\r\nSo if I'm buying a business, a million dollar value and I want to raise some money and maybe I've got to put $150,000 in and I go and raise $100,000 with SPV. Okay, so that would be 10 % of the deal, but we're talking about a one and a half time step up. So that 10 % actually turns into 15 % equity to the SPV. And then on top of that, there would be\r\n\r\n\r\na preferred return to the SPV of 10 to let's just say 10%. So the SPV puts in $100,000 every year, there'd be a minimum expectation of $10,000 return to them, either in the form of a payment or accruing a balance or like, is that how it would look?\r\n\r\n\r\nDennis Unrein (28:56.147)\r\nYeah, it then becomes there's a lot of ways to structure it. So don't want to give one structure. But to your point, yes, that's generally how would work is either it'd be a cash payment back to the investors until they're made whole. And then there'd be some change on the preferred maybe down to common. Or it could be what they call PIC, which would be delayed accrued interest that's being earned. Or it could be a combination of the two where there could be a certain amount of period that there's no\r\n\r\n\r\nNik (29:17.816)\r\nMm-hmm.\r\n\r\n\r\nDennis Unrein (29:23.541)\r\ncash dividend pay that then flips the cash dividend in X year, right? So you could say pick for the first two years, right? Pick being accrued, we'll say. And then in year three, we want cash dividends to turn on. And you might do something like that in a deal where you want to lower the cash burden on the company for the first couple, first 12, 24 months when some of these things tend to be kind of hard, right? So there's a few ways to structure it.\r\n\r\n\r\nNik (29:48.28)\r\nSo for you as the fund, what recourse do you have? Let's say you buy this business and the operator's not good or stuff's not going well. Do you have recourse? Are you just at the mercy of the operator? Like what does that look like?\r\n\r\n\r\nDennis Unrein (30:01.429)\r\nYeah, I mean, that's the thing, right? You're kind of at the mercy of the operator in that sense. And this is why private equity firms generally, and look, there's tons of protections you can put in there. But from the overall deal perspective, private equity firms generally like to own more than 50%, right? Because they like to control. So they can fire you if they need to, you know, because you are running their company, right? And they own that company. Here, you're taking more of a bet in the sense of, well, you know, I'm putting cash behind this individual, operator, and they're assigning\r\n\r\n\r\non the self-funded side specifically, again, not the traditional side, they're signing debt that's senior-taus, right? So the SBA is going to eat first, and then you're an equity investor behind that. Now, you can build all kinds of things into that, but if the company goes south, that's why it's more of a venture bet in that sense. It's a little bit riskier than your traditional sort of buyout private equity style bet because you're junior to the SBA debt in that sense as an equity holder.\r\n\r\n\r\nBut you're being compensated for that given the step up in the higher preferred dividend that you're paying. So it's all part of how you structure that and think about it from that perspective.\r\n\r\n\r\nNik (31:08.782)\r\nFor you, you've got kind of like an interesting deal flow, which I find fascinating. So like I'm on Twitter, I've met lots of people, I've invested in a few self-funded deals, right? But not through an SPV, it was just me investing in those deals. Talk about how you find deals.\r\n\r\n\r\nDennis Unrein (31:15.369)\r\nYeah.\r\n\r\n\r\nDennis Unrein (31:26.421)\r\nYeah, so we, you know, I did the first three years of this traditionally going through and meeting folks and building a network. And that's also a great way to do it. You generally build really good relationships with specific funds and do, you know, most of your deals with what I would call five to 10 really close funds. And then outside of that, you know, you could do one off here and there with, with newer funds that you meet along the way. And that was working great from a lifestyle perspective, maybe not as much. was up.\r\n\r\n\r\nall hours of the night all the time and let alone phone calls. And at the point in my life where I now have a fiancee in my life who said you should probably sleep some more. as you're talking to people in your life about that, you get to a point where, a few founders that are brilliant over there that I've worked with, and one was me and him would go back all the time on late night phone calls and just say, content, content, content. We have to do videos, we have to do videos. And it's easier said than done.\r\n\r\n\r\nbecause I feel like you really like doing these interviews and you have a good thing going. But for us, we just couldn't figure out what to do. And to be fair, a lot of the VC stuff is under heavy NDA. It's very, very hard to talk about publicly. So we switched to doing content in the SMB space as part of our process. And we do a different boring business every single day. So we've done 150 of them now. And it's\r\n\r\n\r\njust been very popular. I remember we first launched them and I'm not a big social media person, but just coming from finance, you can't really even have social media on your computer. But we launched it in June and it's just done very, very well. So now we get a lot of deal flow from our daily videos in terms of folks in this space. Hey, can you write us an equity check? Hey, can you sell a company? Hey, can you do whatever? Just driven around a daily content vehicle.\r\n\r\n\r\nNik (33:21.326)\r\nOkay, you've said we many times and our and who's who's we I thought you were a solo GP.\r\n\r\n\r\nDennis Unrein (33:26.653)\r\nYeah, no, I actually have a small team behind me now, which has been fun. you know, it's taken a while to get there. started dipping our toe into the hiring last year. But I always like to refer to us as we because we do have a team behind here. But yeah, it's definitely something where I didn't expect to have this kind of reach right away. But, you know, it's definitely a very popular space right now. And, you know, we'll see kind of how it kind of moves from here. But figuring out how to,\r\n\r\n\r\nwork on that channel and drive some deal flow at first was hard, but now that we've put a few months into it, we have a much better understanding how it all works.\r\n\r\n\r\nNik (34:03.438)\r\nIt's only been a few months. How does the GP work? So you go and raise these SPVs, these special purpose vehicles, and I'm assuming you have just a percentage of managing it or like, how do you get paid?\r\n\r\n\r\nDennis Unrein (34:18.037)\r\nYeah, no, mean, it's a traditional two and 20 structure or at first it was zero and 20 just to get folks in in 21 and 22 and then realized by start charging some management fees wasn't coming all out of our pocket. But, you know, I think it's traditional two and 20 and I provide a lot of access to our folks. So I'll bring them deals. There's a lot of smarter LPs in our space, you know, in our group that may, right? They're very successful folks looking to play capital and\r\n\r\n\r\nThe way it's structured is much more of, bring you a deal, you can make up your mind or not if you want to come in. And for me, there's no forcing or pushing people into stuff, right? There's really no fun vehicle there. So I have some folks that I know like certain things and I have some folks that know that like other stuff and that's how we operated for the first 36 months. And then we've developed this strategy now going forward to kind of focus our efforts here.\r\n\r\n\r\nNik (35:13.486)\r\nSo you got the two and 20 model. for those listening to and 20 just means you charge 2 % for assets under management. So if you've raised $5 million, you're paying yourself. What is that? $100,000 a year. Yeah.\r\n\r\n\r\nDennis Unrein (35:27.285)\r\nWell, it should be yet now that we've turned on fees, but it's not quite how it works. But yeah. Yeah.\r\n\r\n\r\nNik (35:30.158)\r\nI know, I know, I know. just for illustrative purposes. And that was on the private or the venture side. I think you've raised a separate fund for the SMB space. anyways, and then the 20 % would be you would also you'd get 20 % of the upside in these deals. That's a very easy way to say it. I'm sure there's a lot of nuance to it. But that's effectively what it is. How much capital have you deployed on the SMB side with these SPVs?\r\n\r\n\r\nDennis Unrein (35:54.549)\r\nWe haven't done a deal yet, to be honest. We had a deal in late August, I thought would be our first. It was good learning experience because the fund itself is a little bit different in terms of underlying costs. It turns out your accounting fees are very different, legal fees and stuff like that. So we'll get there. But the deal itself was great. We were able to raise enough money, just couldn't actually close the company, which was interesting.\r\n\r\n\r\nWe had another deal, a towing company that we were looking at for a few months that ended up falling apart in October. So good understanding of what these deals are not always going to go through. And then I think our other focus really on the SMB side is, you think of PVG as our investing arm, the SMB side has been a good media arm, right? It's driven a lot of deal flow. So naturally we're doing some advisory.\r\n\r\n\r\nNik (36:35.084)\r\nyou\r\n\r\n\r\nDennis Unrein (36:43.207)\r\non that side too for companies that want to sell. know, three or four clients out there want to sell. So we're doing a little bit of investing and a little bit of advisory on that side.\r\n\r\n\r\nNik (36:51.202)\r\nAre you finding the deals and then finding the operator? you finding the operator and then finding the deals or at the same time? Like how are you sourcing those?\r\n\r\n\r\nDennis Unrein (36:58.173)\r\nYeah, I would say we're mostly doing the operators coming to us. So I'd say it's post LOI. They've been out there searching for a little bit. They come to us and say, hey, look, we have a deal under LOI. We're trying to close within the next 60 days. Can you go out to your investors during that time and raise capital? And we'll take a look at the underlying Sib, understand the search for themselves, do some underwriting, and then take it from there in terms of getting interest. But it's usually post LOI. And given we were used to doing stuff in the VC side and very\r\n\r\n\r\nshort turnaround times. It kind of works out well here where we can essentially work alongside that cell phone searcher as a buy-side advisor and capital raiser as they go towards close.\r\n\r\n\r\nNik (37:37.486)\r\nOkay, so before I ask you my last question, which is where are you seeing the best opportunities right now in the SMB space? I want you to tell people, where can they come find you?\r\n\r\n\r\nDennis Unrein (37:49.299)\r\nYeah, check us out on Instagram at smv.pe and that's probably the best way to follow along our daily videos. It'll give you some ideas about foreign companies we look at. And, you know, there's all kinds of links and stuff on there you can follow. But in terms of places that we're seeing the best.\r\n\r\n\r\nNik (38:06.306)\r\nYeah, what businesses or industries are you obsessed with right now that you're like, that's where I want to invest. That's where I see the best opportunity.\r\n\r\n\r\nDennis Unrein (38:13.653)\r\nYou know, I think so the number one thing for me is the the retire people that are retiring right now that have businesses of 10 plus years, you know, just from a underwriting standpoint, you talk to some of these folks that have really, really strong companies they've built for a long time. You you talk to folks that have been through multiple market cycles, multiple crises, and they're still here and have a great team. Right. And so from the people perspective, you have a lot of a natural entry point there with these boomers where\r\n\r\n\r\nYou know, people throw out these stats and there's 10,000 retiring a day, eight to 10 of them own a business. That's 800 to a thousand, or sorry, 800 to a thousand businesses a day that are up for grabs, 365,000 companies a year. You know, it's a lot of companies. So from that perspective, you know, I really enjoy talking to these business owners that have been around for a long time and their main focus isn't always price, right? It's usually, can I get in touch with someone to sell to who's really going to take care of my legacy and what I've built, right? And that part's cool.\r\n\r\n\r\nAnd then to your second point, what's the most interesting industries? I would say just some of the niche industries that we find, right? Now that we've done, you know, 150 of these daily reviews, we've got, you know, 600 other whatever companies we've poked around at, a thousand other companies before that. And you find these strange companies, like there's a guy from JP Morgan who, you I know, and he bought a milk testing company in California, right?\r\n\r\n\r\nthe deal that we talked to in August, they help libraries and public schools test telecommunication services and get contracts. So it's really just some of these interesting niches that you find that you would never have thought of as you're going through everything where you're like, man, that's how they make money. And I think that part to me becomes some cool stuff as you see these companies that, you they might not have a big multiple on them. They might not be growing anytime soon, but they throw off a lot of cash and they've been doing it for a long time.\r\n\r\n\r\nNik (40:04.622)\r\nOkay, I'm tired of you giving me the hedging answers. I wanna know, gun to your head. You have to choose one business, it's your money, you're putting it into it, you're not an LP, you're not investing in the business. What would you pick right now as a business to own, operate, and invest in?\r\n\r\n\r\nDennis Unrein (40:21.653)\r\nThat's a tough one. Probably elderly care, I think. There's just a lot there. Yeah. I think it's tough space. It's a hot space. It's not necessarily the easiest, but if you can find something that's been around for a while with a good, interesting background and the right team in place, there's just a huge service to be done there for a population that's getting older. maybe it's because I think about it quite a bit because my...\r\n\r\n\r\nNik (40:25.986)\r\nReally? OK.\r\n\r\n\r\nNik (40:44.493)\r\nGood.\r\n\r\n\r\nDennis Unrein (40:51.157)\r\nMy fiance lost a grandma last year, but being around a lot of those homes, was just kind of like, man, there's a big need here for people and help and all that kind of things. And usually when there's a big problem or a need coming, that's a decent place to focus. I think there is a good space to look at, I'm not the only one looking there. There's a lot of people interested in that space, so it could be kind of crowded,\r\n\r\n\r\nNik (41:12.854)\r\nAs for my background, I had a medical billing and coding company. I had a home health, hospice, home care company, medical staffing. I love that space. It's a great space, growing like crazy.\r\n\r\n\r\nDennis Unrein (41:25.013)\r\nYeah, so it's just, it's probably one. you know, if you had to, you know, gun to my head, another one, it's, kind of hard. I mean, it really, I would say a lot of people ask me that because I have to go too long winded, but I'll get that question online a lot. And they're like, I want one business I can buy. And I'll say to them, you know what? If you look at the underlying businesses here, a lot of them are different, right? You might have one company with a great owner, one company with a horrible owner, one company with great books, one with terrible books. So once you kind of get inside a little bit, like you're two layers in, you start to say, this is a good company or not.\r\n\r\n\r\nAnd that kind of happens on the post first find, right? It's kind of under NDA once the story is being told. So it's not always easy to pick one industry, but yeah, I think the home care center is not stopping anytime soon.\r\n\r\n\r\nNik (42:05.422)\r\nThat's why I asked what you would pick because I think it's it's so person dependent. Like it's hard to make a broad statement like, the one industry that you should do is like, well, I don't know what your experience is. I don't know what you like to do. I don't know what your skill set is like, etc. But you look at so many businesses, I'm sure there's obviously the the home care side of things, or at least healthcare, elderly care side of things is appealing to you. And that that's what I find interesting is like, as you're looking\r\n\r\n\r\nWhat do you think the biggest opportunities are? And you said it. So this is awesome, man. Appreciate you coming on.\r\n\r\n\r\nDennis Unrein (42:39.647)\r\nYeah, thanks so much for the time and hopefully answered all your questions. But thanks for having me on. I appreciate it and talk to you soon.\r\n\r\n\r\nNik (42:44.748)\r\nYeah, let's do it. All right.",
  "metadata": {
    "duration": "",
    "date": "2024-12-30",
    "platform_source": "Google Drive"
  }
}