{
  "episode_number": "166",
  "episode_title": "How AI Can Hack Your Interview and Get You Fired (Or Rich) with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "",
  "transcript": "﻿Liz (00:00.733)\r\nsorry, where do you want, what topic you want to start with?\r\n\r\n\r\nNikolas Hulewsky (00:04.544)\r\nI'm gonna defer to you. What topic do you wanna start with?\r\n\r\n\r\nLiz (00:06.894)\r\nI want to start with some of the culture stuff about some of these fun stories.\r\n\r\n\r\nNikolas Hulewsky (00:12.312)\r\nPerfect, let's do it.\r\n\r\n\r\nLiz (00:14.244)\r\nGive me one quick sec.\r\n\r\n\r\nlook something up.\r\n\r\n\r\nLiz (01:02.424)\r\nOkay. All right.\r\n\r\n\r\nNikolas Hulewsky (01:03.726)\r\nAll right. Okay, Liz, another busy week. There's never a slow week with AI, but we had ChatTPT drop the API for their image generator. We've got Google VO2. We've got, what do we have, Satya Nadella talking about health, which I'm personally very interested in because that's my background. Where do you want to start?\r\n\r\n\r\nLiz (01:24.102)\r\nLet's actually go with some of the health stuff and then I have a couple things on how some of these updates are actually Infiltrating our culture and what we're seeing on Twitter some interesting examples related to that\r\n\r\n\r\nNikolas Hulewsky (01:39.246)\r\nOkay, I'm excited. Start us off.\r\n\r\n\r\nLiz (01:41.54)\r\nOkay, so you know how people like to say that politics is downstream of culture? Well, tech is upstream of culture. So tech is really obviously transformed how we behave, how we interact, obviously how we do business. We've seen this throughout history, so no surprise there. But now with AI, it's sort of like what has been happening, how we actually been seeing the real impacts. Like you do hear about some firings, but nothing massive.\r\n\r\n\r\nNikolas Hulewsky (01:47.596)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (02:08.675)\r\nMm.\r\n\r\n\r\nLiz (02:11.43)\r\nBut I think the way we interact is gonna change I'm somewhat long golf courses because I actually I saw this funny meme that I wanted to just share Because it sort of represents the direction and some of the culture and then I want to share a fun story\r\n\r\n\r\nNikolas Hulewsky (02:31.486)\r\nAnd so when you're talking about culture, you're saying like, what we're seeing in tech, what we're seeing on Twitter is maybe a couple of months or even a year, whatever, before it hits the mainstream. Like those are the early adopters.\r\n\r\n\r\nLiz (02:45.166)\r\nAbsolutely, absolutely. And so it's the early adopters, but then like, you know, people used to talk to each other at restaurants. Now everybody's looking at their phone. Like that is, you know, and so we'll start seeing some of those changes of what's happening on Twitter come into mainstream. So there was this good, okay, I'm gonna share my screen if you don't mind.\r\n\r\n\r\nNikolas Hulewsky (03:06.39)\r\nNever do. And never mind.\r\n\r\n\r\nLiz (03:13.958)\r\nOkay, here it is.\r\n\r\n\r\nLiz (03:28.782)\r\nOkay, so I had to recreate this meme. saw it and I couldn't find where I bookmarked it. But basically, for those listening, it's someone showing their boss saying, look, AI can...\r\n\r\n\r\nNikolas Hulewsky (03:38.562)\r\nHere, click on it to make the picture bigger. Here we go.\r\n\r\n\r\nNikolas Hulewsky (03:45.547)\r\ncome on.\r\n\r\n\r\nLiz (03:47.342)\r\nIt'll render in a second here.\r\n\r\n\r\nI just want to create it. Yeah, because I remembered sort of the ethos of it and I'm like, ugh, I can just do it rather than... While we're waiting, it'll pop up here in a second. Or let's see if I download it and then open it. Maybe faster.\r\n\r\n\r\nNikolas Hulewsky (03:52.21)\r\nyou couldn't find it, so you just recreated it? You just asked you how GBT-\r\n\r\n\r\nThat's funny. Alright, well, nevermind. Don't make it-\r\n\r\n\r\nNikolas Hulewsky (04:09.422)\r\ntechnology.\r\n\r\n\r\nIt's not replacing humans anytime soon. We can't even get it to load.\r\n\r\n\r\nLiz (04:14.234)\r\nYeah, why won't that? Okay. Let me try it one more time.\r\n\r\n\r\nNikolas Hulewsky (04:24.176)\r\nWe get it's there we go. Perfect.\r\n\r\n\r\nLiz (04:27.94)\r\nOkay, so basically what it says is look, AI can sort and filter your emails and this person talking to their boss and then on the other panel, it says, look, AI can send emails on your behalf. So basically the implication is AI is talking to itself. Like there's an AI on both sides doing the work and humans are removed. So this I think is gonna start happening more and more obviously as companies start implementing these tools.\r\n\r\n\r\nNikolas Hulewsky (04:45.069)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (04:55.704)\r\nWell, can I say one more thing? So on the one side of the picture, it's his employee coming to him saying, look, AI can sort and filter your emails, telling the boss. And then on the other side, it's another picture and it's now the boss telling another employee, look, AI can send emails on your behalf. The way I take that is like, in the one, his employee taught him what AI could do and then the other, he's now firing people because of what AI can do. So like the...\r\n\r\n\r\nLiz (05:22.736)\r\nExactly.\r\n\r\n\r\nNikolas Hulewsky (05:24.138)\r\nWe haven't necessarily seen all the firings yet, but that's come.\r\n\r\n\r\nLiz (05:27.15)\r\nAbsolutely. And I think then the other piece too is it's like you're going to be getting bombarded with emails. So people are going to be trying to have human to human relationships, which is great. But it's sort of funny how that sort of goes full circle where business used to be done on the golf course. And now in the future, business will probably get done on the golf course. So, but this sort of brought up sort of another, another few ideas because in hiring right now as well, what you're seeing, I think,\r\n\r\n\r\nNikolas Hulewsky (05:43.934)\r\nYeah.\r\n\r\n\r\nLiz (05:57.198)\r\nthis is being represented a lot because you have these ATS systems. don't even know what the application tracking system. Yeah. So they're, filter out like all these people. So it's really hard for people to penetrate. And so, you know, and then people on the flip side are also using a lot of AI tools to like present themselves. And there was this really big story about a month ago that kicked off, with this software, sophomore in college at Columbia.\r\n\r\n\r\nNikolas Hulewsky (06:02.658)\r\napplicant tracking system.\r\n\r\n\r\nLiz (06:25.354)\r\nAnd he was grinding, I guess he spent about like 600 hours studying for these things called leak code, which are like big tech interview code puzzles. So very grueling, very intense and tough. So he figured out how to hack the system using AI. So he built a little AI tool that's undetectable during these interviews that basically solve puzzles for it.\r\n\r\n\r\nNikolas Hulewsky (06:47.829)\r\nOkay.\r\n\r\n\r\nLiz (06:50.04)\r\nSo of course he aced all of his big tech interviews. I think got an initial offer from Amazon. Then he shared this online, of course, and Columbia ended up basically providing disciplinary action. And then Amazon rescinded their offer after he shared this. No, it's actually good. So it's good. It has a good ending to this story. So then he drops out of college.\r\n\r\n\r\nNikolas Hulewsky (06:53.71)\r\nno.\r\n\r\n\r\nit's good. Okay, okay.\r\n\r\n\r\nLiz (07:17.7)\r\nRaises a bunch of money from VCs and already I think has a couple million dollars in Revenue from a new company. He just started so Yeah, hold on this guy's name is Roy Lee. Where did I have the here's no\r\n\r\n\r\nNikolas Hulewsky (07:28.204)\r\nWow.\r\n\r\n\r\nLiz (07:36.47)\r\nanother. Let me share different\r\n\r\n\r\nNikolas Hulewsky (07:39.15)\r\nIt's somewhere in the window forest.\r\n\r\n\r\nLiz (07:42.574)\r\nYeah, I'll let him have it. Let me pull this over. Okay, so he launched this company called Cluely.\r\n\r\n\r\nLiz (07:51.91)\r\nHang on.\r\n\r\n\r\nNikolas Hulewsky (07:56.994)\r\nagain, the magic of editing.\r\n\r\n\r\nThere will be none of this.\r\n\r\n\r\nLiz (08:03.054)\r\nOkay, so Cluely, he started this company called Cluely. This guy called, yeah.\r\n\r\n\r\nNikolas Hulewsky (08:07.758)\r\nSo he gets disciplined by Columbia, author rescinded from Amazon, and he decides, I'm going to go start a company.\r\n\r\n\r\nLiz (08:14.87)\r\nExactly. So he first did this tool called Interview Coder, which is the tool he was using. He started selling that. Then he drops out, obviously, and then launches this company, which basically helps salespeople sort of cheat on their conversations. And this little video...\r\n\r\n\r\nLiz (08:42.438)\r\nSo he sort of showed this example of, I guess he's on a date here and like helping him through the conversation wearing these little glasses. So this brings up like a bunch of different ideas of the direction of AI, which I think is pretty cool. So one, yes, gonna help people as they're doing any sort of activity in the real world without, with having sort of just in time knowledge or just in time intelligence.\r\n\r\n\r\nNikolas Hulewsky (08:43.107)\r\nThank you.\r\n\r\n\r\nLiz (09:08.506)\r\nwhere you don't have to necessarily always be as prepared. So for salespeople, they can help coach them and develop their skills. But also you could have like a B player who just wants to use AI become an A player. So I think there's gonna be this interesting equalizing factor that's gonna play out with these different tools. And then this guy was wearing glasses. The other thing people aren't really talking about right now is this intersection between the hardware\r\n\r\n\r\nNikolas Hulewsky (09:08.942)\r\nOkay.\r\n\r\n\r\nLiz (09:38.142)\r\nand AI. And so this is what's called augmented reality, which there's been a lot of barriers and friction points to do that. You now have that little pendant thing, which is great. But then the glasses, which Google glasses, meta glasses, VR, all of that's been coming to the forefront and making small little strides. But in the future, people are going to have these glasses and there's going to be\r\n\r\n\r\nNikolas Hulewsky (09:39.794)\r\nMm-hmm.\r\n\r\n\r\nLiz (10:01.43)\r\nI think a lot of business applications before even a ton of consumer ones, at least I hope so, because I don't ever want to be in an experience like that where someone's doing an analysis while they're talking to me in the glasses. But just think about, I know you said you were using your phone for helping around your landscape for lawn.\r\n\r\n\r\nNikolas Hulewsky (10:07.51)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (10:20.33)\r\nGo on. Yeah, yeah, yeah.\r\n\r\n\r\nLiz (10:22.744)\r\nSo now there's still friction from like a trades perspective of like you'd have to take your phone to do an analysis to help you and facilitate stuff. It's also so expensive to develop those proprietary apps. And then for those as for a public consumer apps, you can download on the phone that help with this analysis. They're like, you know, okay. But one, the cost is obviously now becoming so minimal. I did on another video developing one of those apps for folks, but the glasses component.\r\n\r\n\r\ncreate a whole new world of opportunity because your hands free. And so if you're like a plumber, you you have these glasses that can help in real time evaluate, you know, even doing, like water assessment or whatever, and like a whole bunch of different use cases there. So I'm really bullish on that segment of where AI is enabling.\r\n\r\n\r\nNikolas Hulewsky (10:52.159)\r\nWell.\r\n\r\n\r\nNikolas Hulewsky (11:02.316)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (11:09.122)\r\nYeah, I'm going to stop this for one second.\r\n\r\n\r\nNikolas Hulewsky (00:01.026)\r\nSo I've been thinking about this, but the pendant in particular, I think one of the cool use cases for the pendant is for sales teams, because right now, how do you check whether or not your sales reps are doing a good job? You're going on ride-alongs and you're assessing them in the field. And most of time it's like their best behavior. And so you're, getting the best version of them and then you're giving them feedback. But if you're a company and you have dozens of sales employees, how do you, how do get the assessment of them either just through their numbers? So you have a sink or swim mentality, or you go on ride-alongs or check, which takes a lot of time.\r\n\r\n\r\nLiz (00:03.7)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (00:30.434)\r\nWell, what if you're recording all those conversations and at the end of the day, you're having AI analyze it and then give you feedback for here are the three sales reps that need help. These are the problems that they're having. And then you go proactively and work with them. It cuts down on the amount of time assessing the problem and allows you more time to fix the problem. And so I think that's kind of the same way you're talking about with bringing video into these glasses or into the trades. It'll allow them to assess and diagnose quicker.\r\n\r\n\r\nLiz (00:53.182)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (00:58.932)\r\nso that they're not wasting time doing those things.\r\n\r\n\r\nLiz (01:01.136)\r\nA thousand percent. And actually on that point too, we, so when I was again, working in this large company, we had that specific pain point. We implemented one of the transcription tools, which was great for our, our cold calling reps, our sales, but we couldn't do anything with the people that actually had like a ton of sales skill, which were our road warriors. And so the pendant solves for that gap. So I just, I love that use case that you just shared because that's, it really is impactful.\r\n\r\n\r\nNikolas Hulewsky (01:16.141)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:32.014)\r\nThe other thing I was going to say is I haven't used it yet, but I've heard, think it's Google's studio, or I don't know the exact word, but you can be coding and in real time it'll be looking at your screen and tell you where you're messing up as opposed to you code, do something and you're like, crap, it's not working and then copy and paste and then go ask Google, where did I mess up? And then it tell you, how does that work? Do you know how that works?\r\n\r\n\r\nLiz (01:55.378)\r\nYeah, so I actually did that yesterday. So I was building out in a video that I don't know whenever it'll come out for building out this law and assessment app. And I was getting stuck on something. And so I turned it on. It's in AI, it's AI Studio. Let me see if I can pull it up real quick. Google Studio. I don't know if it'll work because of us being on a call, but basically you use what's called video stream.\r\n\r\n\r\nNikolas Hulewsky (02:04.206)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (02:13.006)\r\nThat's fine.\r\n\r\n\r\nLiz (02:22.988)\r\nAnd then it'll start, assessing your, your screen and tell you and interact.\r\n\r\n\r\nNikolas Hulewsky (02:30.136)\r\nDo you have to prompt it? Do you have to say like, I'm going to go right now and do X, and Z. I need you to check how I'm doing this or it just.\r\n\r\n\r\nLiz (02:37.298)\r\nYeah, let's even see if we can just really quickly demo this. I don't know if it'll work, so this might be a total...\r\n\r\n\r\nNikolas Hulewsky (02:42.604)\r\nAnd is this because I've only heard it from a coder who said that that's how they use it. Is that the only use case for it or other other?\r\n\r\n\r\nLiz (02:48.5)\r\nI was using it that way, but I would say anything you could share on your desktop at the moment. I haven't tried it obviously on mobile. don't even know if it's accessible on mobile, but for sure, if you're looking at something, maybe you need to analyze data or other information. So anything you could share visually, I would imagine it could be helpful if you have questions.\r\n\r\n\r\nNikolas Hulewsky (02:58.894)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (03:09.634)\r\nHmm. So potentially a Google Sheet.\r\n\r\n\r\nLiz (03:13.478)\r\nYeah, exactly. So we can even pull that in a second. Okay. So here it is. So let me just think what I can pull up. It is ai studio.google.com slash prompts slash new chat. So if you just Google AI studio, it'll, it'll pop up and then extreme is what we want. And so why don't we just go to even like Google maps and see what happens since I don't have any data just to pull up just yet.\r\n\r\n\r\nNikolas Hulewsky (03:15.788)\r\nOkay, this is it.\r\n\r\n\r\nNikolas Hulewsky (03:20.236)\r\nAnd you're in, sorry, what's the website?\r\n\r\n\r\nNikolas Hulewsky (03:25.582)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (03:32.782)\r\nMm-hmm.\r\n\r\n\r\nLiz (03:42.836)\r\nand say.\r\n\r\n\r\nAll right, Google stream, are you there? Whoops, me share it different.\r\n\r\n\r\nNikolas Hulewsky (03:51.426)\r\nor can talk to it.\r\n\r\n\r\nLiz (03:52.742)\r\nYeah, that's the whole point. Talk.\r\n\r\n\r\nLiz (04:01.254)\r\nAll right, you're not sharing my screen. Hold on, let me stop, sorry.\r\n\r\n\r\nNikolas Hulewsky (04:09.582)\r\nWhat do mean that's the whole point?\r\n\r\n\r\nLiz (04:12.316)\r\nI think it's the whole point of being able to talk to it while you're doing stuff versus going back and forth. So, yeah, so here, let me stop it and we'll go back a sec. Stop the livestream. Okay, so you're streaming your screen. You talk, webcam, or share screen. So you could type and prompt, but like from a workflow standpoint, then you're gonna have to go back and forth. So go ahead and just do talk.\r\n\r\n\r\nNikolas Hulewsky (04:35.17)\r\nMm-hmm.\r\n\r\n\r\nLiz (04:40.83)\r\nHey Google Studio, what do you see right now?\r\n\r\n\r\nLiz (04:50.022)\r\nYes, can you go to my Google Maps and let me know if you can see that?\r\n\r\n\r\nNikolas Hulewsky (04:56.854)\r\nso she's talking to you? can't hear.\r\n\r\n\r\nLiz (05:00.676)\r\nDo you hear that or no? it sure? I was not hearing on your audio. Okay. That might not work as it's. No, I don't have AirPods. was, could hear it from my speaker. So for some reason, yeah. All right. I'll have to figure out. Yeah. Okay. We'll stop this demo and cut that out, but. Okay. Yeah. Okay. We'll definitely do that.\r\n\r\n\r\nNikolas Hulewsky (05:02.136)\r\nUh-uh, I didn't hear anything.\r\n\r\n\r\nIs it on your air? Do you have AirPods in?\r\n\r\n\r\nNikolas Hulewsky (05:11.035)\r\nWell, maybe we'll be able to pick it up.\r\n\r\n\r\nNikolas Hulewsky (05:19.458)\r\nThat's really cool. Let's do that demo sometime.\r\n\r\n\r\nLiz (05:23.698)\r\nYeah, so basically Google's coming out with all of these cool, really useful tools, integrating it in different modalities as well, whether it's voice, text, or visual. And they're doing a really good job with video analysis, think, beyond, mean, ChatGPT again is like, I think on Paranormal too, and I haven't played with Grok, but apparently they had some new releases too. But yeah, things are exciting.\r\n\r\n\r\nNikolas Hulewsky (05:46.904)\r\nDude, there's so much to keep up on. my gosh. It's a good thing we don't have jobs.\r\n\r\n\r\nLiz (05:49.552)\r\nAbsolutely. I know. I know, right?\r\n\r\n\r\nWell, it's like, was even thinking like how are, and that's the opportunity is like, if you do have capacity and time, just think about the day to day of a person. Like they don't have time to go play with this, then figure out the use cases and applications. So the gap. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (06:08.044)\r\nYeah, I know. Okay, you had some cool stuff that you wanted to show today in Claude.\r\n\r\n\r\nLiz (06:14.96)\r\nYeah, so it's simple stuff, but you no one's talking about it, and I think it's really awesome I was really pumped just to see some features pop up on my feed\r\n\r\n\r\nLiz (06:48.404)\r\nmaybe get better at screen sharing. Okay.\r\n\r\n\r\nLiz (07:00.436)\r\nOkay, so Claude just keeps, yeah, so we're looking at the Claude interface and it just keeps getting better. They just keep rolling out little features, they keep getting better with their code, and I just discover things that I think I'm gonna have to go do multiple steps, iterations, like I have historically, and all of a sudden Claude comes out with some new core use cases. So.\r\n\r\n\r\nNikolas Hulewsky (07:03.992)\r\nSo we're looking at the CLOD interface.\r\n\r\n\r\nLiz (07:24.232)\r\nThe first thing I wanted to share is they've been the pioneers in this thing called MCP. We'll get into what MCP is in a second. But basically, that is allowing you to connect tools to your LLMs. And so what does that mean? So basically right now, like as you were talking about last week, that these LLMs are going out and being able to search the web and have agentic behavior and doing more than just, you know,\r\n\r\n\r\nrewrite something or analyze the input of text. They're able to gather information from the web and that's been exciting or start writing code. But now they're gonna be able to start doing things like actually interacting with other software tools, interacting with these things called APIs historically, which is how you access those software tools. And the old way of being able to leverage connecting tools was you would have to go to make.com, Lindy.\r\n\r\n\r\nall those tools to be able to connect them together and create again workflows like we've talked about. Now the LLMs are actually starting to take over some of that functionality by incorporating them directly into the LLMs. So this is what happened with Clot.\r\n\r\n\r\nI came in and one of their first integrations was like Google Drive, which was huge. You could then search and query your Google Docs and get summaries and referenced information versus having to constantly upload new files. Now they're expanding that to the rest of the Google Suite. And I suspect this is just the beginning. So go into the interface. There's this little, four little boxes called connected apps. You click on that and it pulls up obviously Google Drive, but also now you\r\n\r\n\r\nNikolas Hulewsky (08:59.533)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (09:08.43)\r\nwow.\r\n\r\n\r\nLiz (09:09.63)\r\nGoogle Calendar, your Gmail, and GitHub if you're a developer. So I think this is just the beginning. I think we're going to start seeing a ton more of these connected apps that you can do things. absolutely.\r\n\r\n\r\nNikolas Hulewsky (09:21.432)\r\nOkay, hold on. So can I take a stab? Cause I'm the idiot on this podcast. So I learned about MCPs. This is, it's called the model context protocol. It's effectively the protocol that they've written that allows them to access these things. So for an example, for someone who's an idiot, like I am, let's say that you want to write an email campaign for your business. Well, you're going to need a Clavio, which sends the emails.\r\n\r\n\r\nYou're going to need chat GPT, which helps you write the emails. You're going to need your brand style guide that talks about your product. You're going to need a potentially artwork, something else like that. And so what happens is you've got like seven windows open and you're going in, you're copying and pasting amongst those windows. Like, okay, cool. Let me copy and paste my brand style guide. I'll put it into chat GPT. Let me tell chat GPT based on my style guide, write me a new email campaign for\r\n\r\n\r\nthis new product we have, and then it'll give you an answer. And then you take that and you take it to your email and you put it in your email and you're like, okay, Clavio, I want you to send this email to my list. so it's like this constant literal context switching your copy pasting into different things. Now with MCP, Claude becomes the interface and you can tell Claude and say, okay Claude, using my style guide, I want you to write this for this new product.\r\n\r\n\r\nOkay, cool. Now that you've written that, I want you to send an email to my list and it'll go interface with Clavio and it'll go interface with your style guide and it'll go interface with Canva to make it so effectively what it's done is it's turned Claude into your everything window that you operate through and it's pulling on those softwares instead of the copy and pasting that you're currently doing. Now that being said, you freaking blew my mind.\r\n\r\n\r\nLiz (11:06.706)\r\nAbsolutely.\r\n\r\n\r\nNikolas Hulewsky (11:10.84)\r\nWill you go back to the cloud window?\r\n\r\n\r\nLiz (11:12.66)\r\nAbsolutely.\r\n\r\n\r\nNikolas Hulewsky (11:14.282)\r\nI didn't, you're gonna judge me so hard, I didn't even know you could integrate Google Drive.\r\n\r\n\r\nLiz (11:20.217)\r\nokay, no, that's great.\r\n\r\n\r\nNikolas Hulewsky (11:22.334)\r\nYeah, can you show me that? What do you mean it can summarize documents?\r\n\r\n\r\nLiz (11:26.18)\r\nYeah, so if you go to this little plus sign, I think this is where yeah you can do add from Google Drive Then it'll pull up. Obviously. I was doing some stuff with Twitter Yeah, yep, you can search you can pull it up It doesn't populate right away Then you can just copy and paste the link and then do that. You can pull in a bunch of different docs\r\n\r\n\r\nNikolas Hulewsky (11:30.114)\r\nOkay?\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nAnd I can search?\r\n\r\n\r\nNikolas Hulewsky (11:40.667)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (11:49.58)\r\nbecause I literally just copy and paste. I have my Google Drive open. I have four different windows of Google Drive. I'm copying and pasting documents and putting them in. I can just do it from here. my God. I'm so stupid. my gosh.\r\n\r\n\r\nLiz (11:58.26)\r\nYes, yes, you can literally do that. No, you're not. Even it's like, you know, these, there's so much of a bar of information, you have to parse through it. And you know, people aren't always like, I'm not always clicking every button that pops up on the screen, you know, to be like, what's here? Because again, everybody's busy. So yeah.\r\n\r\n\r\nNikolas Hulewsky (12:17.824)\r\nSo go back to the Google Drive. I could upload multiple documents.\r\n\r\n\r\nLiz (12:21.884)\r\nyeah, up to their capacity. Their context window is smaller than chat GBT and Gemini. But I think chat GBT is also integrated with Google Drive now and their product.\r\n\r\n\r\nNikolas Hulewsky (12:31.074)\r\nYeah, I've seen the button. I just, didn't know what it meant. What if I don't know the name of the file? What if I just, I know it's like, it's in the Liz folder. I just can't remember the name of the file.\r\n\r\n\r\nLiz (12:40.318)\r\nJust go look for it and copy and paste the link. Gemini does a better job of actually hunting it down if you're in your drive in a business workspace. I don't think it's accessible for personal. But yeah, you do need to actually know what documents to reference.\r\n\r\n\r\nNikolas Hulewsky (12:44.238)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (12:56.108)\r\nOkay, let me ask this. So one of the things that I've used ChatTPT for in particular is like cleaning documents. So I have a lot of transcripts. They've got ums and ahs and filler words and timestamps that I don't want, yada, yada, yada. And I want that all taken out because I'm asking the AI to synthesize this information. Can I ask it to create a doc in my Google Drive? Because if you say yes, I'm gonna freaking, I'm leaving, I'm done. gosh, okay.\r\n\r\n\r\nLiz (13:13.652)\r\nMm-hmm.\r\n\r\n\r\nLiz (13:21.464)\r\nSo no, not yet. I know. But it's getting there. But let me give you the workflow that it will be super easy and it can be set up pretty quickly. And maybe we'll do this next week with MCP and this is the use case. So what you could do with MCP, so most of the MCP seems to be one way versus the other way, but you could leverage either Zapier or any of the automation tools. I've been using N8n to basically do that and trigger that\r\n\r\n\r\nNikolas Hulewsky (13:34.542)\r\nhuh.\r\n\r\n\r\nLiz (13:51.156)\r\nSo there's one step but\r\n\r\n\r\nNikolas Hulewsky (13:52.076)\r\nBecause. Because chat GPT will ask me like I use it a lot for it, create me an SOP, create me a workflow, create me a summarization of this conversation and then it will ask me, it's like, would you like me to put this in a in a notion template or would you like me to put this in a Google Doc? Is it saying that it will actually create that for me or is it just saying it will give me that and I still have to copy and paste it and put it into notion or the Google Doc?\r\n\r\n\r\nLiz (13:59.816)\r\nMm-hmm.\r\n\r\n\r\nLiz (14:21.308)\r\nYeah, so actually I don't know that on the, think from chat GBT, you still have to create that. But again, this sort of like agentic behavior where it's starting to be able to do things on your behalf, that is like only, I would say a couple months away. Right. And you can actually set that up with automations. So if you basically create again, an automation and in make in, in an eight N or the Zapier, you could trigger that from here. If you have MCP integrated.\r\n\r\n\r\nor then you basically say go and create that and it'll go and do that for you. So we can demo that next week where it's a simple. Yeah.\r\n\r\n\r\nNikolas Hulewsky (14:56.322)\r\nYeah, geez. so, I'm doing this for rest of the day. I'm going to be like, I had no idea. I'm going to be connecting my freaking Google Drive to all of this stuff because I'm an idiot. wow.\r\n\r\n\r\nLiz (15:10.738)\r\nYeah. But the other point on that too that you were mentioning of like go and create like a simple thing that I have found also exciting is that you can now from Claude, it creates like code, it'll create all these different types of documents. Previously, you either had to copy the code or you would have to copy and paste or download something called Markdown, which is just like a text file basically.\r\n\r\n\r\nNow they're integrating other file formats. And for me, that's exciting because again, it's staff of them having to go and convert the thing into whatever document format. So I was really pumped about that as well because PDF is now accessible, which is huge in my mind, as well as like JSON. And this week, let me see if I can do this real quick for you. I created a fully...\r\n\r\n\r\nNikolas Hulewsky (15:40.502)\r\nMm.\r\n\r\n\r\nLiz (16:03.556)\r\nthe file for an N8n, which is again, like a make blueprint or a make, you know, any of these, again, tools automation where you have to go drag and drop everything. It actually generated all the code. I uploaded that document into N8n and it had all of the modules there for me. So let me see if I can really quickly do this for you. create, so let's even do your use case. Create a, an N8n JSON file.\r\n\r\n\r\nsearch the web for appropriate documentation for N8N. The workflow should be\r\n\r\n\r\nWhen I up or let's do okay when I add a folder when I add a file to Google Drive\r\n\r\n\r\nLiz (17:07.76)\r\nit then let's just say\r\n\r\n\r\nLiz (17:14.58)\r\ncreates a draft email. We'll just do something simple. Ask any questions or provide additional feedback steps for building out the JSON. All right, let's see. Define where I did this the other day, because it was a pretty, it was like a very extensive one. This is super simple, but let's see if this works. And while that's doing that, me pull up the data.\r\n\r\n\r\nNikolas Hulewsky (17:54.638)\r\nSo I have this Chrome extension called Echoes and it allows me to search ChatGPT, Claude for my conversations. You know how like right now it's difficult to search where you're like, hey, where was that thing I was talking about? Like it doesn't allow you to like cross search across chats and conversations. That's what this does. And so I have it enabled and I can go into it and be like, where was I talking about?\r\n\r\n\r\nCreating this legal entity with so-and-so and it'll find it and pull it up\r\n\r\n\r\nLiz (18:27.9)\r\nAwesome, I will have to do that. All right, so.\r\n\r\n\r\nNikolas Hulewsky (18:31.522)\r\nHi.\r\n\r\n\r\nLiz (18:34.74)\r\nAll right, so we downloaded the JSON. All right, so let's see if this works. Okay, so this is, get intimidated by this. This is the more complex.\r\n\r\n\r\nNikolas Hulewsky (18:51.95)\r\nWow.\r\n\r\n\r\nLiz (18:53.032)\r\nYeah. So I know that I, for me, that's like really exciting because again, before what you would have to do is literally, and you can do this for more complex ones. had ones that were like 10 steps the other day that like just built this out and I was like, well, there's this weird thing. have to loop or iterate or blah, Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:54.638)\r\nAnd it's there. That's amazing.\r\n\r\n\r\nNikolas Hulewsky (19:09.602)\r\nWell, I just, I would just want to, we're talking about automations and I think anybody who's listening to this, who's a business owner, 90 % of them are going to be like, too hard for it over my head. I think this is cool. think 10 % of people will think this is cool. But for the, for the 90 % who are like, I'm never going to the time to figure it out. Go back to just, yeah, Claude, where you can integrate your Google drive and think about this as a business owner.\r\n\r\n\r\nIf you're storing any documents to the Google drive, you can now go and say, Hey, um, I want to look at that invoice that's that this company sent us. And I know it's saved on the Google drive, pull it in and have chat GPT or Claude review it and say, does this look right to you? Is there anything that stands out? Oh, I got this proposal from a company. Does this look right to you? What stands out? I've got now a legal document. I know that so-and-so uploaded that to the drive.\r\n\r\n\r\nLet's have chat GPT review that legal document and tell me if there's any risks associated with it. It just it takes that like one step of finding the doc, copying it and then pasting it into chat GPT. It removes that friction. And for anybody who's been doing that, you know that it is friction. I know it's stupid, but it is a little bit of friction. Now you have it natively. And as you start to do that, then you'll start to realize the power of M.C.P. Then you realize like, we can do more of this. my M.C.P. is going to be freaking amazing.\r\n\r\n\r\nSo if you're a business owner, go do that. Connect it to your Google Drive and you can start accessing your Google Docs from there instead of going to the drive and copying and pasting.\r\n\r\n\r\nLiz (20:42.504)\r\nAbsolutely. in projects in Cloud, it allows you to basically keep documents persistent because in a chat, at some point you'll hit a limit of the number of times you can talk or the size and all that. If you keep in your project knowledge, you can keep those documents there so you can reference them back and forth for new, like let's say you have a framework for your invoices or your legal or whatever it is, you can just always keep them in your product knowledge.\r\n\r\n\r\nand then have additional chats and say, okay, now I got this new invoice. Does this meet the standards or blah, blah.\r\n\r\n\r\nNikolas Hulewsky (21:15.822)\r\nCan I ask you this? A lot of people that I know use Claude for their projects.\r\n\r\n\r\nLiz (21:21.716)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:23.576)\r\nFor me, for the dummy person, I don't see any difference between the functionality of Claude and ChatGPT's projects. You can create projects, cool. You can add additional documents for context, cool. It saves those documents and references them when you ask it. Why do I see more people though who are in the know using Claude's projects versus ChatGPT's?\r\n\r\n\r\nLiz (21:31.145)\r\nMm-hmm.\r\n\r\n\r\nLiz (21:36.477)\r\nMm-hmm.\r\n\r\n\r\nLiz (21:40.564)\r\nMm-hmm.\r\n\r\n\r\nLiz (21:46.184)\r\nI wish I had a good answer for that. I, I just like Claude better. I have, I use all of the different LLMs, but I just always like the, the responses better. so that's sort of I think it's a preference thing. I think you can do accomplish the same ultimate goals with both, but again, like stylistically and from an output, it just seems like Claude is, it's just better.\r\n\r\n\r\nNikolas Hulewsky (21:47.789)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (21:53.559)\r\nshit.\r\n\r\n\r\nNikolas Hulewsky (21:58.414)\r\nAnd so it's a preference thing for you.\r\n\r\n\r\nNikolas Hulewsky (22:13.42)\r\nSo have you tested the Gmail integration now with Claude?\r\n\r\n\r\nLiz (22:19.411)\r\nYeah, so Okay, so you can't write emails yet unless you connect like again Yeah, so I have it can walk Okay, well I'm trying to think what I have which I don't even know I have a bunch of email accounts So let me think which one I have it connected to but okay. This will probably pull up some of my I think this is personal I have a bunch of newsletters and\r\n\r\n\r\nNikolas Hulewsky (22:19.82)\r\nWhat does that do?\r\n\r\n\r\nNikolas Hulewsky (22:25.496)\r\nBut can it read and analyze them? Shut the front door, Liz.\r\n\r\n\r\nNikolas Hulewsky (22:40.343)\r\nOkay, well, before you even do personal, could I say, hey, how many unread emails do I have right now?\r\n\r\n\r\nLiz (22:45.914)\r\nYeah, I'm not going to do that because it's connected to my personal and I have\r\n\r\n\r\nNikolas Hulewsky (22:49.57)\r\nThat's okay, that's okay. No, no, Could you say, what was the last email I got from Liz?\r\n\r\n\r\nLiz (22:56.468)\r\nYeah. So it keeps you up and same with your meeting. So I can say, let's even see if it knows I'm having a meeting with you right now. What meeting should I be in right now according to my.\r\n\r\n\r\nNikolas Hulewsky (22:58.595)\r\nShut up. Are you serious?\r\n\r\n\r\nNikolas Hulewsky (23:20.974)\r\nYou're gonna blow my mind if this answers it correctly.\r\n\r\n\r\nLiz (23:21.076)\r\nHopefully it is.\r\n\r\n\r\nLiz (23:24.818)\r\nI'm also making sure what.\r\n\r\n\r\nNikolas Hulewsky (23:26.678)\r\nIt's looking at the calendar. Looking at your calendar. Currently in your time zone. Stephen Hawking.\r\n\r\n\r\nIt's displaying some code on the the screen. Numeric metric.\r\n\r\n\r\nLiz (23:43.358)\r\nThere you go.\r\n\r\n\r\nNikolas Hulewsky (23:44.706)\r\nbased on your current time. dude, podcast recording, Nick and Liz. Shut up. my gosh. That's insanity.\r\n\r\n\r\nLiz (23:54.59)\r\nYep, I gave the meeting notes and everything so you don't have to go. And it's like that context switching that has been painful, you'd have 30 tabs open. It's basically making everything converge into the chat window.\r\n\r\n\r\nNikolas Hulewsky (24:07.502)\r\nDo you know how chat GPT has tasks that you can schedule? Can you schedule tasks with Claude?\r\n\r\n\r\nLiz (24:11.273)\r\nYes.\r\n\r\n\r\nLiz (24:14.58)\r\nThat's a good question. You probably. Right, right. You could all set that up as an MCP where it probably could do that. I'm doing that through animations right now. Not natively yet that I've seen. I could be missing because again, it's like every day you're like what something exciting and new. So if anyone in the audience knows of that already, let us know.\r\n\r\n\r\nNikolas Hulewsky (24:16.814)\r\nBecause ChachiBT doesn't have the Gmail integration, it just has the drive.\r\n\r\n\r\nNikolas Hulewsky (24:24.652)\r\nHmm. But not natively.\r\n\r\n\r\nNikolas Hulewsky (24:34.551)\r\nmy f-\r\n\r\n\r\nHere's a quick caveman tip that I just learned. It's nothing compared to what Liz has just shown us. I use ChatGPT so much, so much. I have done a bunch of folders and projects, et cetera, that the two days ago I asked it, hey, what's on my to-do list today? Because I was curious. It was 95 % correct. Like the only things that it didn't know were things that obviously it wouldn't know because I hadn't entered the information in. But it even gave me things that I didn't even remember. And it was...\r\n\r\n\r\nLiz (24:53.064)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (25:06.87)\r\nIt was incredible. So the more integrated that it gets, the better you're going to be able to say like, which emails do I need to respond? That's going to be an interesting one. Could you say which emails do I need to respond to? And through context, will, it will be able to say that.\r\n\r\n\r\nLiz (25:20.724)\r\nYeah, it should. would say what I have found is it's like not as perfect as it needs to be yet, but it's pretty good. So you just have to be really good with your prompting and it'll get better. And I'm sure again, this is the worst this is ever going to be. again, yes, but yes, you can do and just give it the context of what means that you have to respond to it. Like if you have, you know, non spam, if it doesn't say unsubscribe, because then you know, it's a newsletter.\r\n\r\n\r\nNikolas Hulewsky (25:35.256)\r\nYeah.\r\n\r\n\r\nLiz (25:46.068)\r\nor whatever other parameters to qualify that. Any guidance you can give always helps the LLMs.\r\n\r\n\r\nNikolas Hulewsky (25:52.716)\r\nmean, people were hiring VAs for personal assistance. This becomes like a personal assistant, which is nuts. With the Gmail integration, that is nuts. my gosh. Okay, Liz, this was, it doesn't what?\r\n\r\n\r\nLiz (25:59.25)\r\nand how.\r\n\r\n\r\nYeah. It doesn't.\r\n\r\n\r\nso I'm looking for it doesn't yet create things. That's the other thing. So it's usually a one way I'm still keep pushing it. I know one of these days it'll have the ability to go and create things. at least again, it's from a consumption standpoint, you're now one stop shop interface.\r\n\r\n\r\nNikolas Hulewsky (26:15.907)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (26:24.77)\r\nYeah, you're you're removing a little bit of friction at a time. This is incredible.\r\n\r\n\r\nLiz (26:27.444)\r\nBut hey, those minutes, five minutes, those add up.\r\n\r\n\r\nNikolas Hulewsky (26:31.822)\r\nLiz, as always, you blew my mind. Thank you. For those listening, go check this out. Go to Claude right now. And I'm gonna do it right now. We're hopping off this call and this is exactly what I'm gonna do. It's gonna be amazing. All right, thanks Liz.\r\n\r\n\r\nLiz (26:47.668)\r\nAll right, thanks.",
  "metadata": {
    "duration": "",
    "date": "2025-05-07",
    "platform_source": "Google Drive"
  }
}