{
  "episode_number": "147",
  "episode_title": "How to Overcome AI Intimidation and Automate Your Workflow with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:00.911)\r\nLiz, I am super excited. This is the first episode that we're going to do. I'm in the middle of this series of interviewing entrepreneurs and asking them how they're using AI in their business. And my mind has been blown and I've needed help to like synthesize this massive amount of information into something actionable. And I was like, there's nobody better than you. Liz knows what she's doing. You're an ex VC. Or well, I shouldn't say ex. You're a VC.\r\n\r\n\r\nLiz (00:03.086)\r\nThank\r\n\r\n\r\nLiz (00:25.492)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (00:27.745)\r\nYou've been working in the tech space for a long time and you are the automation guru when it comes to integrating and utilizing AI. So thank you for being a part of this.\r\n\r\n\r\nLiz (00:37.07)\r\nWell, thank you so much for having me, Nick. I'm like really, really pumped when you told me about this pod that this is like perfect, because I could just talk about this stuff all day. 20 years I've been doing this stuff. So scaled up a bunch of companies, all leveraging technology to basically make their businesses grow faster. And so really, really excited to share what's happening in AI.\r\n\r\n\r\nNikolas Hulewsky (01:02.471)\r\nOkay, so quick context and then we'll jump into some cool tools that you're seeing out there. I'd like to just do some updates on like, where are we with the state of AI? Because a lot is happening. And then let's, the point of this conversation, and we'll do this for the next few weeks at least, is to show entrepreneurs like, this is something actionable that you can do in your business. Here's exactly how you do it. Here's the automation. You go to this website. This isn't high level.\r\n\r\n\r\njust go here. It's super easy. And then you get to the prompt and you're like, wait, what am I supposed to do? No, this is go to make, get your API key from open AI. Here's how you do the integration, et cetera. So we'll get to all that stuff a little bit later, but first the context AI is just, it's changing every single week, right?\r\n\r\n\r\nLiz (01:48.27)\r\nAbsolutely. And you have to remember, don't feel overwhelmed. We are still so early. I have been through these cycles, been through cloud, mobile, all of it. We're early. We are super early. So you're not behind. If you're tuning in right now, you're already ahead. So basically right now, obviously we went from the phase of chat GBT, all of these sort of single player mode.\r\n\r\n\r\nNikolas Hulewsky (01:55.719)\r\nShe said it.\r\n\r\n\r\nLiz (02:16.864)\r\nAI tools where you're putting in prompts. Then what I would say is over the last year and a half, 18 months or so, what's really exploded is integrating these tools. So I like to say that things called APIs give AI wings. What APIs are, for those of you not familiar with the term, it's just the way that one tool can talk to another tool. That's all you really need to know about it. It just allows things to connect.\r\n\r\n\r\nAnd so that's really unlocked a ton of magic when it comes to AI. And many people may have heard then these phrases like AI automation or AI agents. That is sort of the mechanism that's allowing AI to go and explore beyond just the little window that you're putting, chat window you're putting prompts in.\r\n\r\n\r\nNikolas Hulewsky (03:04.327)\r\nYeah, so I'm an idiot. So I'll like rephrase what you're saying. If anyone's ever heard of Zapier or if you've heard of make or I think N8N is another one of them. Think of those as the roads. So you have all these just disparate systems and they have no way of actually connecting or communicating to each other. Well, make has come in and said like, I just created the freeway between Salesforce and Excel. I don't know what it is. Right. And it's called an API. And so that\r\n\r\n\r\nthat goes and gets data and it actually allows them to communicate to each other. And what you're saying is those API keys, those access keys, it gives AI wing because now you have data to play with and now you have things for it to actually be doing in the background.\r\n\r\n\r\nLiz (03:48.046)\r\nAbsolutely. And this is where you're going to see a ton of value. So with AI chat, it's like, OK, great. I can write some things. I can figure that out. But this allows actual workflows, actual tasks to get done. And so Make and Zapier, as you said, and then N8n is sort of, I would say, a little bit more advanced. Those are really the tools that will allow this to happen. And you don't even need to learn these things. There's plenty of people out there that are learning these tools as well. So you can rely on folks to do that. But again, I actually think\r\n\r\n\r\nanyone can actually build these tools. So it shouldn't be intimidating, even though it might initially feel that way.\r\n\r\n\r\nNikolas Hulewsky (04:25.425)\r\nSo tell me, I like to ask this question. What are the LLMs, the tools that you're currently using and what are you using them for?\r\n\r\n\r\nLiz (04:32.334)\r\nYeah, so I sort of use all of them. I'm a nerd, Exactly. I'll use, Cloud I probably use the most just because I do things with code and I think it has the best writing capabilities. And then I really like projects because you can organize your data and have sort of similar level of consistency as well as it keeps it private so that your data isn't being trained on it publicly.\r\n\r\n\r\nNikolas Hulewsky (04:36.41)\r\nNerd!\r\n\r\n\r\nNikolas Hulewsky (04:57.979)\r\nhad a writer today, I just spoke to her before we spoke, and she walked me through how she sets up her projects in Claude, and it was like, it's mind-blowing. Anyways, I love that, that's incredible.\r\n\r\n\r\nLiz (05:02.798)\r\nmusic.\r\n\r\n\r\nLiz (05:09.922)\r\nYeah, so that's one. Chat GPT, I have a back and forth relationship. Sometimes I love it, sometimes I hate it. They'll come out with something and I'm all excited and then two weeks later, whatever. I think I was playing with deep research. That was pretty phenomenal, but then Grok came out. And so that's also just on par, so I didn't want to pay that much. Yeah, so I would say Grok is actually pretty good compared to Chat GPT's deep research.\r\n\r\n\r\nNikolas Hulewsky (05:28.443)\r\nIs it?\r\n\r\n\r\nNikolas Hulewsky (05:35.407)\r\nreally grocks deep researches as good as chat GPTs.\r\n\r\n\r\nLiz (05:37.982)\r\nI personally think so. People can argue that, people have different opinions, but I think it was very good. Yeah, yeah, I mean. Well, for 200 bucks a month, I mean, you have to be providing a lot of value and it's like, it's a tough game right now for them. But yeah, I mean, I would say like, go with Grok. It's gonna get you as far as you need. I also use perplexity, which is technically not a model.\r\n\r\n\r\nNikolas Hulewsky (05:41.733)\r\nWell, I'm asking your opinion. Don't qualify it. Screw everybody else.\r\n\r\n\r\nLiz (06:03.182)\r\nbut it pulls in all the other models. And so it's like a really good one-stop shop so that you can actually access other models without having to go set up a whole new tool. And I wouldn't say their deep research is as good, but I've usually used that as a replacement for Google. But now I'm using both Grok and Perplexity sort of in tandem.\r\n\r\n\r\nNikolas Hulewsky (06:18.439)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (06:22.565)\r\nAre you using Grok as the standalone app or are you using it within the X platform?\r\n\r\n\r\nLiz (06:27.886)\r\nBoth both it just sort of is out of convenience. So I like on my phone I'll probably go to grok And I've started that habit of going separately to grok like if I happen to be on Twitter and want to look something up Like I'll just pop over so I don't have like a perfect workflow yet, but I am going to the standalone I I don't think it really matters Yeah\r\n\r\n\r\nNikolas Hulewsky (06:35.687)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:47.151)\r\nOkay, have you messed with DeepSeek? I mean, I'm sure you've messed with it, but do you use it?\r\n\r\n\r\nLiz (06:51.502)\r\nSo I I've messed with it. I haven't used it a ton. I get freaked out about China. I'm one of those people. know, China. Yeah, yeah. And I know that like, can say, you know, it's nothing's actually happening. So don't be scared by that. I also wanna support American companies. So, you know, it's a race and so I've got to support the red, and blue. Anyhow.\r\n\r\n\r\nNikolas Hulewsky (07:01.563)\r\nChina, they're stealing our data! Stay away!\r\n\r\n\r\nNikolas Hulewsky (07:11.611)\r\nNo, I get it,\r\n\r\n\r\nNikolas Hulewsky (07:18.503)\r\nThat makes sense.\r\n\r\n\r\nLiz (07:20.706)\r\nBut it is a good tool and you can access it through perplexity. So I would say that's like the easiest way to do it. so Gemini, I, okay. So I want Google to win. want like, they have everything supporting their ability to win. They should have won and they haven't yet. But I will say Gemini, Google Flash, not Gemini, but Google Flash is phenomenal for images.\r\n\r\n\r\nNikolas Hulewsky (07:27.153)\r\nSo you didn't mention Gemini at all.\r\n\r\n\r\nLiz (07:50.058)\r\nSo if you go to Google studio and maybe we can do a separate time on this, they have done incredible work on images, which makes sense because again, they were the first ones for doing like OCR search. Sorry, OCR is just like visual search, it sees a picture and it can go search. It's like ocular. No, I don't remember, but it was, yeah, I don't remember. I don't know. There you go. There you go. There you go.\r\n\r\n\r\nNikolas Hulewsky (07:58.503)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (08:06.257)\r\nYeah, do you know what OCR stands for? I need to look that up.\r\n\r\n\r\nNikolas Hulewsky (08:13.137)\r\nOkay. Optical character recognition. Bam. So I've only talked to one person who said that they use Gemini all the time and their use case for it was they said that Gemini knows the Google suite exceptionally well. And so when they're writing, you know, their own custom code for integrations, they'll go to Gemini to say like, Hey, how do I get sheets to pull this data from the drive or whatever? So that was their use case for it.\r\n\r\n\r\nLiz (08:22.99)\r\nMm-hmm.\r\n\r\n\r\nLiz (08:43.214)\r\nYeah, I would say the integration has been phenomenal. Like it started off really bad and actually even when it was called Bard, I was using it actually the most until then there was weird biases that came in. But that's a whole other story. Exactly, exactly. But I would say they've done a much better job integrating it with their suite. So like I will go and chat with my Google Drive with Gemini. Like that is a perfect use case for it. So saying like,\r\n\r\n\r\nNikolas Hulewsky (08:55.557)\r\nLike black George Washington.\r\n\r\n\r\nLiz (09:12.718)\r\npull a summary from X, Y, and Z document in my drive, blah, blah, and it'll pull that up. That's beautiful. You only have access to that if you have workspace, so that's on the business side of things. I don't know if they've rolled it out for consumer yet, but it's been really phenomenal. And then yesterday I was in Sheets and I actually had it because I was doing some data manipulation and it wouldn't do a certain function that's only in Excel, but then I asked...\r\n\r\n\r\nthe Gemini to do it and it actually pulled up all the data in the chat, which then I to copy and paste. that's a whole other workflow story, but like they're doing a good job getting integrated into all their tools. So I see the future.\r\n\r\n\r\nNikolas Hulewsky (09:51.899)\r\nYeah. So the, the point of this podcast is while we do have knowledge, not to be, you know, the Greg Eisenberg, where it's like, Hey, you're in Silicon Valley. I'm Silicon Valley. Let's talk tech. The point of this is, is, you're an entrepreneur and you probably just listened to everything that we just said. And are like, I don't even know where to start. Like look at all the ones we just named. We named deep seek Gemini, perplexity, Claude, chat GPT. I'm sure I missed one or two in there.\r\n\r\n\r\nAnd they're like, I don't know all of this stuff. What are we even talking about here? What advice would you give to somebody who is just trying to figure this stuff out?\r\n\r\n\r\nLiz (10:33.143)\r\nSo I would say one, don't be intimidated. Pick one, just go for it and just start playing. Like honestly, doesn't matter. Doesn't matter, just pick one. If you are doing writing and encoding, Claude's gonna be your best bet. Like if you're doing chat GBT, just use it, just figure it out, know, just spend time iterating through. Typically your first prompt, it's gonna suck, don't worry about it. You have to train it, it has to learn what you're.\r\n\r\n\r\nNikolas Hulewsky (10:39.931)\r\nDoesn't matter. Doesn't matter which one.\r\n\r\n\r\nLiz (11:02.67)\r\ntrying to actually get to. And so it's like question and answers. If you have employees, it's the same thing. Like just think you're talking to an employee and you're just iterating through a conversation to get to the outcome that you're really trying to go for. So don't be intimidated. Don't think like, I don't know how to do this. Like you just have to try and see how it goes. And then you can start layering in, here's a little bit of ways to perfect this or that, but like, don't be intimidated.\r\n\r\n\r\nIt's hugely valuable. And I would say like pick one task that's like super painful for you and think like, how can I actually leverage it for that task? And I know that's a little bit hard to conceptualize hopefully today and through the series we'll be able to help connect those dots. But I do think that, you know, anyone can access this technology. is the most accessible technology in the history of humanity. And that's about it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (11:53.639)\r\nIt is. That's pretty well said. All right. So let's let's take a look at something. What have you found this week that you're excited about?\r\n\r\n\r\nLiz (12:02.818)\r\nSo, okay, so when I was scaling a company from about $100 million over to over a billion in ARR, one of our biggest, biggest pain point, what, well, this was our, all right, well, but this is, and this is not just for big companies. This is every company. I've worked at startups, I've worked for, every company has the same pain point. If it's not in Salesforce, it doesn't exist. That used to be like the phrase,\r\n\r\n\r\nNikolas Hulewsky (12:13.735)\r\nWow, I feel intimidated now, okay.\r\n\r\n\r\nNikolas Hulewsky (12:25.809)\r\nYeah, yeah.\r\n\r\n\r\nLiz (12:31.816)\r\nEvery CRO, every sales leader would say to their people, it doesn't matter if it's Salesforce, if it's a CRM, if your sales data is not in your CRM, it doesn't exist. And this obviously has huge impacts downstream of the workflow. So everything from you have your CSMs or people in customer support clamoring to talk to your sales team. You have...\r\n\r\n\r\nThings that happen after the sales conversation that people need to have access to that data. You have your product team wanting those insights. You have maybe you're changing your sales reps and up the person that got the new account like has no clue because they didn't enter the data. Like there's huge impacts when people don't put their information into the CRM. But nobody likes it and you have your highest paid employees being data entry people. So there's a clear misalignment of value and a\r\n\r\n\r\nthe highest point of leverage is to be able to capture that information. And so now that phrase has become obsolete. So I am like, I've been so excited about this since this has become a thing because no longer do you have to do that and everybody gets the information. And so the way to do this, so there's a whole bunch of tools out there and this used to be really only reserved for the enterprise. There's large companies like we had implemented a company called Chorus back in 2020.\r\n\r\n\r\nThere's Gong, but now for small, medium-sized businesses, there are tools that don't cost that much money that you can utilize in your business. So this is everything from Otter AI, which is like a note taker. And then there's also Fireflies that I would say is more geared towards sales teams. But even if you don't want to spend money on another tool, you can just do this with like your call recording in Zoom or Google Meet.\r\n\r\n\r\nNikolas Hulewsky (14:19.56)\r\nIs this a sales? Are you speaking sales specific or is this just anything that any company needs to document?\r\n\r\n\r\nLiz (14:26.03)\r\nThis can be applied for any conversation you have, but I would say the highest point of value is gonna be on your sales team. But yes, absolutely this.\r\n\r\n\r\nNikolas Hulewsky (14:33.607)\r\nOkay, so this could be for pest control companies that have sales reps or this could be for anybody who has a sales rep calling in a skilled nursing facility, anywhere that requires their sales reps to enter information.\r\n\r\n\r\nLiz (14:47.468)\r\nYes, absolutely, absolutely. And so even if, yeah.\r\n\r\n\r\nNikolas Hulewsky (14:50.567)\r\nGive me one second. Hold on. think I heard someone.\r\n\r\n\r\nNikolas Hulewsky (15:07.815)\r\nSpring break.\r\n\r\n\r\nLiz (15:08.974)\r\nAll good. was wondering, was like, not in school. Yeah, so basically this can be for any conversation. So it can be for customer support. It could be for anything you're able to record. so that is a little bit of a hiccup is the recording element. But even if you do have like recording issues, the other piece is you can have this tool join your conversations. So that's sort of like a loophole where\r\n\r\n\r\nNikolas Hulewsky (15:24.166)\r\nHmm.\r\n\r\n\r\nLiz (15:38.508)\r\nI don't technically know the rules where just having an AI note taker come into the meeting, think is fine from a transcription standpoint, if it's not technically recording the whole thing, but you can use that as well. So if you can't record, that's sort of the loophole. But I would double check on compliance if you have a lot of rules around that. Okay.\r\n\r\n\r\nNikolas Hulewsky (15:56.401)\r\nAwesome. Let's see it. What are you using for the automations?\r\n\r\n\r\nLiz (16:01.518)\r\nSo I'm using make.com. I would say make.com or Zapier. I like make because it gives you a ton of basically free credits for a while and then then you do have to pay based on usage. Zapier is a little bit more expensive to get started, but it's just as good. And then there's I also use a different one called N8n, but that's going to be a little bit more advanced. So we will start here because this is really beautiful. It's very visual.\r\n\r\n\r\nWhat this is is basically connecting a bunch of tools. So we'll just put it at that. And you want to do you have a question or\r\n\r\n\r\nNikolas Hulewsky (16:38.631)\r\nWell, was just, what I was going to say is effectively what we're looking at is you have different things that you want to talk to each other. You maybe you've got Otter AI, which is recording the conversation. You've got chat GPT or open AI, which is the AI that you're going to need to, I don't know, formulate it or store it. Then you've also probably got a Google drive or somewhere that the information is going to be the repository for that information later. Make is.\r\n\r\n\r\nLiz (16:53.243)\r\nhuh.\r\n\r\n\r\nNikolas Hulewsky (17:07.055)\r\nMake is the road that's connecting all of those. each one of these points, if you're looking at the screen, each one of these points are the different softwares that are being utilized, but Make is the one that's kind of bringing them all together, right? Okay.\r\n\r\n\r\nLiz (17:18.542)\r\nAbsolutely. Absolutely. So we'll even just pop in. this first, these little circles are called modules. So when I say module, that's what I'm referring to. So this first pink one is Firefly. So this is what I mentioned in terms of the note taker that'll pop into your meeting and it'll start taking notes. Yeah. So this one, you actually, I would say as an SMB, like you could just get this and you would probably get pretty far. I'll show you then what you can do with this information after\r\n\r\n\r\nYou have that but basically you'll have a meeting you'll have like a firefly show up as I'm joining the meeting and then your your data will populate in here and it all already automatically summarizes things and Creates tasks and then they've actually just added this over the last couple of months where you can connect directly from the tool to other things so if I was\r\n\r\n\r\nNikolas Hulewsky (18:14.275)\r\nSo I'm just going say, so Firefly, the way that it works, if you're listening, is that you don't have to manually add Firefly to every meeting. It will come in sync with your calendar. And so as long as there's a meeting on the calendar, Firefly is showing up in that meeting. So once you set it up the first time, it's pretty set it and forget it. But you do need to get it. Is Firefly free or is it, what, $20 a month?\r\n\r\n\r\nLiz (18:37.59)\r\nNo, it is paid and it can get a little expensive if you have a ton of people on it. Let's see. Yeah, I don't remember what that I think it's like 20 bucks per license. They give you a bunch of free you can start for free.\r\n\r\n\r\nNikolas Hulewsky (18:51.879)\r\nAnd does Firefly, does it actually record the whole conversation? Because Otter AI will actually record the conversation. I can go and see the slides that people use on a Zoom call. Is Firefly just summarization or does it actually have a transcript?\r\n\r\n\r\nLiz (19:05.034)\r\nIt has the full transcript. The recording, actually, I don't remember if it was the whole thing, but it definitely does the full transcript, which is essentially, I would say, the meat of what you want.\r\n\r\n\r\nNikolas Hulewsky (19:09.351)\r\nThat's fine.\r\n\r\n\r\nNikolas Hulewsky (19:16.517)\r\nOkay, so you're starting this automation with, I've got Firefly, I've got it integrated with my calendar. It's pumping out now, meeting summaries, it has transcripts. That's the data that we have in a repository. We now want to get it to the end state of, what's the end state that we're hoping?\r\n\r\n\r\nLiz (19:27.799)\r\nYes.\r\n\r\n\r\nLiz (19:34.658)\r\nYeah, so I wouldn't say this is beautiful, but basically I have it somewhere that other people can access because again, if you let's say from a cost standpoint, you're not going to buy a gazillion licenses where everybody's maybe going to want this information. And so you do need some workflow for it to get out of the system so that other people can utilize and do something with. And so right now I just put together a quick demo here. So what we're going to end up with is something sort of like this.\r\n\r\n\r\nand this is basically me taking the information and putting it into a custom format that I decided to pull. Yeah. It's.\r\n\r\n\r\nNikolas Hulewsky (20:07.911)\r\nSo this is a Google Doc or Word doc, whatever. So it's taking that meeting and effectively putting it in a place where people can go and read the meeting minutes. OK, cool.\r\n\r\n\r\nLiz (20:16.49)\r\nExactly, exactly. And so you could then also put the, and then I also have it going into a spreadsheet as well, because sometimes you need to organize and parse that information into actionable things. So like right now, if you're using, know, spreadsheets, just as your project management tool, you could put it in there, but you could do this for any project management tool you happen to have so that if you have action items, they go directly and the person can be notified. So there's so many different possibilities where once you have that conversation data,\r\n\r\n\r\nNikolas Hulewsky (20:40.999)\r\nMm.\r\n\r\n\r\nLiz (20:46.158)\r\nYou can then manipulate it in a gazillion different ways depending upon what you need it for or the rest of your team needs it. And you can do it again without having to buy licenses for everybody in the company. So that's sort of the beauty of being able to come up with data.\r\n\r\n\r\nNikolas Hulewsky (20:59.003)\r\nSo Firefly, what's that first automation that it does, that first step, first module? Yeah, yes, please.\r\n\r\n\r\nLiz (21:05.934)\r\nOkay, so I'll walk you through, would that be cool? then I'll... So we saw sort of what it'll go into, where we started. So what I have here is these different modules connecting. And so when you go here, you can add and access any little module pretty easily. So for here, we have first it accessing the transcript. So right now I just put in a specific ID or reference from a transcript, but literally it can be watching and waiting for every meeting and just be triggered based on that.\r\n\r\n\r\nAnd and happen you can do it based on time like you can trigger it based on whatever Rules you want then what happens here is let's say I have a ton of transcripts coming in It'll iterate through them. So this is called an iterator So it goes like it'll come in one and then it has to go through the full flow and then it'll go again and it'll go through the full flow so this is sort of just a tool for sort of how to pass things\r\n\r\n\r\nNikolas Hulewsky (22:02.052)\r\nNow, did you know that you needed an iterator, or did Make tell you you needed one?\r\n\r\n\r\nLiz (22:07.032)\r\nSo this is, I'm constantly using AI to support my learning as I'm building these things out. And so when I don't know what to do, I will go to either perplexity that has access to the public data and say, here's, I'm using make.com. I have this issue. It came in once and I didn't know. But really what I do is I start off with the guts of this as sort of like, here's my process map. Here's how I think the data should flow.\r\n\r\n\r\nNikolas Hulewsky (22:19.452)\r\nMmm.\r\n\r\n\r\nLiz (22:33.614)\r\nAnd then oftentimes I'm mistaken and I forgot something like an iterator. So usually what I'll do is I'll test it out and I'll do like one module and I'll test out, okay, so, you know, I know right now it's just one transcript coming in, but like if I get a list of the transcripts, I then would know, okay, I need an iterator for that. The other, yeah, go ahead.\r\n\r\n\r\nNikolas Hulewsky (22:53.127)\r\nCould you have gone to Claude or Perplexity and said, hey, I don't know how to do this, but I have Firefly and I'd like for my Firefly notes to be in a Word document every day so people can read and have it integrate with my project management system so I can track do outs. How do I map that and make.com? Like, can you start there and it will walk you through what you're supposed to do? Okay.\r\n\r\n\r\nLiz (23:14.072)\r\nthousand\r\n\r\n\r\nLiz (23:18.572)\r\nthousand percent. It doesn't always get it a hundred percent, but that's totally fine. It's a good starting point. And then what you can do even, and what I do is I actually export this. So it says export blueprint down here and it turns it into this, this format called JSON. I don't know what JSON stands for. I don't care. Doesn't really matter, but it's just the way that the computer can read this. and just so you guys know, I don't know how to code either. So this is not like you need to be technical either. I failed my computer science classes. So\r\n\r\n\r\nNikolas Hulewsky (23:29.169)\r\nMm-hmm.\r\n\r\n\r\nLiz (23:47.256)\r\nfor all of you like feeling like, this is starting to seem like, don't worry about it. You don't need it. Just feed it into the LLM. And so what I've done is I've exported those blueprints. I added into Claude and I say like, here's my issue. Here's the error I'm getting. Cause sometimes like if I run it through and something gets stuck, it'll show an error. So I'll just give it the error message. I'll put in the blueprint and say like, help me out. I don't know what's going on. And it'll usually do that. Sometimes you have to iterate through, but it's all just having a little bit of grit and just sticking with it.\r\n\r\n\r\nNikolas Hulewsky (24:15.823)\r\nRIT is the perfect word to describe it. I've been doing this this week because I'm trying to clean up my podcast transcripts specifically from these conversations because these LLMs can only take so much data at a time. in my transcripts, there's a lot of repetitive words, timestamps that aren't needed. So probably 30 % of my transcript can be deleted. Well, over 20 transcripts, that's...\r\n\r\n\r\nLiz (24:17.642)\r\nExactly.\r\n\r\n\r\nLiz (24:22.05)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:44.537)\r\nfive extra episodes, let's call it. Anyways, I've been playing with Google collab, which is a Python environment and using that to write Python script to edit down my transcripts. It's been so cool. I mean, and I've been using Claude to like, Hey, I don't know how to do this. And it's like, here's the Python script you should run. And I run it it's like, here is the output. And it, and it looks at the output and it's like, Hmm, I still see that it's showing some timestamps. Here's the fix you should have. And it like, it's literally just telling me to copy and paste stuff.\r\n\r\n\r\nLiz (24:50.562)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (25:13.817)\r\ninto this Google collab, which is this Python environment. And it's been mind blowing. It's been awesome because I'm actually building this.\r\n\r\n\r\nLiz (25:19.97)\r\nYeah, it's so cool. And that's like what everybody in the audience needs to have the mindset of, like, you can do this. You don't need to know code because you have an instructor right there on your screen if you're using your, if you're using Cloud. So that's awesome. That's so exciting. All right. All good.\r\n\r\n\r\nNikolas Hulewsky (25:36.359)\r\nOkay, you go, Firefly to the iterator. Hold on one second, I think I have another kid in my\r\n\r\n\r\nLiz (25:40.526)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (25:48.935)\r\nspring break, spring break. Okay. Okay.\r\n\r\n\r\nLiz (25:53.784)\r\nSo the other thing that this is doing too, that I'd sort of forgotten is that it's actually breaking it out into sentences here in the way that it outputted. And so it breaks it out into these small chunks. And so that's also why I had to iterate it through and aggregate that information. I forgot that that was actually the reason we have the iterator there. So rather than go through a bunch of transcripts, it's actually...\r\n\r\n\r\ngoing through so that I can aggregate the full transcript into one document.\r\n\r\n\r\nNikolas Hulewsky (26:25.127)\r\nCan I ask the iterator, where is that? I get Firefly as a software, I get Google Sheets, I get OpenAI, I get Google Docs. What's iterator? Is that a make software? Okay.\r\n\r\n\r\nLiz (26:34.83)\r\nYes, yes. So within make, there's these sort of built in tools so that you can help manipulate data essentially. So whether it's going through the flow of things. So you have these things called flow controls where it can repeat going through the workflow. Iterator, which again, it goes, it loops through so that it knows, I pulled information and now I'm looping through.\r\n\r\n\r\nNikolas Hulewsky (26:50.907)\r\nMm-hmm.\r\n\r\n\r\nLiz (26:59.982)\r\nYou have an array aggregator, is just like a larger set of data that it has to aggregate together. You have a router. saying like an if then statement, basically says if this happens, go this way. If that happens, go this way. Exactly.\r\n\r\n\r\nNikolas Hulewsky (27:13.849)\r\nOkay, so these are built-in functions within Make that allow the workflow to work. How many different softwares are in this current automation?\r\n\r\n\r\nLiz (27:24.14)\r\nIn this current one, have two, three. So we have just Fireflies, we have ChatGPT, and then we have the Google Suite. So that and the rest of these little things are just data manipulation tools that are built in to make. So most of these, guys probably, at least ChatGPT might, if you have an AI, that's probably the one you have. And then Google Suite also very common. So you're not having to buy a ton of extra software either.\r\n\r\n\r\nNikolas Hulewsky (27:32.177)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (27:50.247)\r\nOkay, so it goes from Firefly to the iterator to this purple looking thing. I don't know what that is.\r\n\r\n\r\nLiz (27:56.758)\r\nOkay, so now this is called a text aggregator. So this is basically saying, okay, we iterated through all of this text and now it's putting it together into one piece. and this is just each tool that you integrate has its own quirks as to how it provides the information, how it provides the data. And so you have to just work with whatever context that is to then manipulate it to get it the way you want.\r\n\r\n\r\nNikolas Hulewsky (28:07.505)\r\nOkay.\r\n\r\n\r\nLiz (28:21.79)\r\nthere's oftentimes too, can use LLMs to actually do data cleanup work. like hypothetically, I could say, put all this information from the output into an LLM and just do the thing. Like that is my like lazy way of doing data cleaning, because I would say 80 % of this workflow and a lot of these workflows is related to data cleanup or data manipulation. Huge. Exactly. And so I would say that that's also where a lot of people struggle is like,\r\n\r\n\r\nNikolas Hulewsky (28:42.919)\r\nYeah. Data integrity is like, yeah, the foundation for this stuff.\r\n\r\n\r\nLiz (28:50.786)\r\nThey don't have their data in order, and so that can be problematic. So then the fun part starts. So what I've done is from that transcript, we finally have it into a place that now the LLM will make sense of in a constructive way. I added in a little module that is a chat completion. So you can access in...\r\n\r\n\r\nthe playground of OpenAI. So this is where the backend, the API area, and there's a bunch of different things you can do in here. And so you can add in little like assistance, you can add in a bunch of stuff. you did? Okay. Super cool. We'll do a different episode on that because like people can actually do this very simply. It won't take a ton of time and it's also super powerful, which you probably learned about. So.\r\n\r\n\r\nNikolas Hulewsky (29:28.911)\r\nI literally just learned about this yesterday. I had no idea this was a thing.\r\n\r\n\r\nLiz (29:43.342)\r\nSo anyway, so you can pull in basically a different, like a chat completion, here we pull up all the different message assistant. We're using chat completion, transform text to structured data. So they have that built in. So you have to do less thinking about that. It can analyze images. So there's a bunch of little built in ways that you can already do things with the LLM that you don't have to like critically think like, how do I?\r\n\r\n\r\nNikolas Hulewsky (30:08.14)\r\nSo these open AI modules that you've put in here are templates essentially. Like you didn't have to... That's awesome.\r\n\r\n\r\nLiz (30:14.382)\r\nYeah, exactly. Well, they're templates to a degree. So the things you still have to complete. I'll pull this up. This is a chat completion. This is the simplest one, I would say, and most straightforward. It's just think of it like you're adding in a prompt into your browser, but here it just happens to be fields. So all you would do is just select, okay, chat completion. You select the model.\r\n\r\n\r\nThere's different roles and again, we can go in a different deep dive into what these roles mean and how you can actually utilize them. But for now, for simplicity, you choose a user and then you put in a prompt. So this, didn't even really put in a prompt. All I said was analyze the sentiment. Terrible prompt, but it still works. And so I have basically the text coming in and this is basically pulling in the data. So that's what this is referencing.\r\n\r\n\r\nAnd so the nice thing about this is you can reference previous outputs into these fields. And so all this is saying is like, okay, here's the text that's dynamic. So anytime it comes in from that side, from over here, it's gonna populate in here so that I don't have to make sure that it's passing the information along. This like doesn't really matter, but sometimes you wanna manage your tokens. Okay, so that's that. Then I have it basically.\r\n\r\n\r\ntransformed into this JSON format that again, just makes it more readable for the computer, the computer like.\r\n\r\n\r\nNikolas Hulewsky (31:41.531)\r\nAnd did you know you needed to add these because of your own head or was this using a not a template, but a roadmap from AI, from Claude? Okay.\r\n\r\n\r\nLiz (31:49.87)\r\nBoth, both. So again, this is usually the way I would have started this. I probably would have had Fireflies. I would have had a Chat GPT and a Google Doc and a Google Go module. And then I would have run into issues. And then from there, what I would have done is said, okay, this is a problem. What do I do? And then I would have exactly Claude and Perplexity to help. And I usually use the two because Claude doesn't access the internet as much and Perplexity always can surface info.\r\n\r\n\r\nNikolas Hulewsky (32:03.367)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (32:08.689)\r\nHow do I fix the issue?\r\n\r\n\r\nNikolas Hulewsky (32:17.425)\r\nHow long did it take you to build this?\r\n\r\n\r\nLiz (32:21.54)\r\nthis one, did a demo. I also have had a little bit of iterations and experience. So I would say this one may be like putting it together. Maybe an hour. and that's, would say more of the tweaking of that is just because of I was iterating through the prompts and then like when you get stuck on errors. so I don't know if I'm underestimating or overestimating, but also that's because I've done this. I would say like, if this is your first one you were doing, it might take you a couple of hours.\r\n\r\n\r\nNikolas Hulewsky (32:32.039)\r\nwow.\r\n\r\n\r\nNikolas Hulewsky (32:49.863)\r\nOkay, this is awesome. I think we should do, yeah, I think we should do more of this. This is amazing. Like I've learned so much from this. All right, here, we didn't even get to the whole thing. Here's the plug. Yeah, if you wanna know how to actually do this, DM Liz. Don't DM me, I don't know anything. This was amazing. All right, so next week what I'd wanna do is talk about what is make, how do you get set up in it?\r\n\r\n\r\nLiz (32:59.234)\r\nAnd I knew we didn't get the whole thing and I was bad on time.\r\n\r\n\r\nLiz (33:08.876)\r\nAnd I'm happy to.\r\n\r\n\r\nNikolas Hulewsky (33:19.579)\r\nWe didn't even talk about the API keys, because you have to make sure you have API keys to this stuff. And maybe let's just go through, hey, all right, we've got Fireflies, we've got Chat GPT, and we've got Google, and then just iterate our way through to building a simple sort of automation. I think that'd be amazing. Cool. Those are great, Liz. Can't wait to talk again.\r\n\r\n\r\nLiz (33:34.008)\r\nYeah, let's do it. Okay, we can totally do that. I would love that. Awesome. All right. Likewise. Thanks, Nick.\r\n\r\n\r\nNikolas Hulewsky (33:41.767)\r\nSee, I said.",
  "metadata": {
    "duration": "",
    "date": "2025-04-09",
    "platform_source": "Google Drive"
  }
}