{
  "episode_number": "131",
  "episode_title": "How to Turn Data Into Dollars: The Data Shopper Story with Thomas Rudy",
  "guest_name": "Thomas Rudy",
  "business_name": "Data Shopper",
  "transcript": "﻿Nikolas Hulewsky (00:00.324)\r\nI usually do like a separate intro where I take just clips from the episode and do a trailer. So, all right, Thomas, Stoke, you and I, this is a game of tag, man. We finally connected. I'm really excited about it. You are a pretty prolific entrepreneur and you're building some really cool stuff. But I think what's most interesting is the way that you've built on top of yourself. Like you took one small win to the next one, to the next one. You're just snowballing, you're compounding.\r\n\r\n\r\nCan you talk about, guess, what was the first series of events that made you think, I can be an entrepreneur, I can do this?\r\n\r\n\r\nThomas Rudy (00:38.638)\r\nWe started with the very first. You wanna go back that far?\r\n\r\n\r\nNikolas Hulewsky (00:40.286)\r\nYeah, yeah, I'm curious.\r\n\r\n\r\nThomas Rudy (00:43.919)\r\nThe very, very first thing that I did online was I created these mystery boxes on eBay. is gonna date myself a little bit back in like 07, 08. I got into it via my brother and one of his friends. Quickly found out that that was against the platform rules. Drove a lot of sales really quickly and thought like overnight I was gonna be a massive success. So that was like the foyer into online.\r\n\r\n\r\nNikolas Hulewsky (01:09.822)\r\nWhat? Wait, what was the what was against the rules?\r\n\r\n\r\nThomas Rudy (01:15.249)\r\nIs is flagged as gambling. I mean, we're going back almost 20 years now, but basically what we would do is we would say, here's a mystery box. People would bid up to like 50 bucks on it. And in one of those mystery box, I can't remember which version of PlayStation was that at the time, but in one of those mystery boxes, there was a PlayStation and another one that was like a $5 bill or like a CD or something like that. So, you know, it's basically like rolling the dice and gambling on getting a PlayStation. Most did not, but the people that did left.\r\n\r\n\r\nVery positive reviews. So yeah, that was like the entry of it. And then I mean, it turned into many, many things.\r\n\r\n\r\nNikolas Hulewsky (01:55.294)\r\nWait, wait, wait. I gotta ask about this mystery box stuff. How old are you?\r\n\r\n\r\nThomas Rudy (01:59.182)\r\n07 I was 18 19 years old\r\n\r\n\r\nNikolas Hulewsky (02:02.666)\r\nOkay, so 07-1819, you're doing these mystery boxes. How many of them did you sell?\r\n\r\n\r\nThomas Rudy (02:08.704)\r\nI don't remember at the time. think like within a few hours, there was like three grand of sales, which like back then was enormous. got shut down really quick.\r\n\r\n\r\nNikolas Hulewsky (02:14.186)\r\nDude!\r\n\r\n\r\nWas that one box though? They just bid up 3000 to one box or did they do multiple boxes?\r\n\r\n\r\nThomas Rudy (02:21.998)\r\nSo actually there were multiple boxes. So some of them were not selling quite like the one that kind of got us flagged. Um, like it actually worked for a little bit and it was like a modest money. Um, but yeah, I mean, there was, you know, we had listed different boxes that had different things. mean, the most prominent thing was a PlayStation. Um, I mean, even back then, like iPod touch, you know, that was like, or the one that was like, is that the one that was on your shoulder? The Nana. Yeah.\r\n\r\n\r\nNikolas Hulewsky (02:30.09)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (02:43.242)\r\nman, I remember those.\r\n\r\n\r\nNikolas Hulewsky (02:48.01)\r\nthink that was the Nano.\r\n\r\n\r\nThomas Rudy (02:50.35)\r\nI one of those.\r\n\r\n\r\nNikolas Hulewsky (02:53.418)\r\nSo did every box have a prize? It just depended on like the magnitude of the product.\r\n\r\n\r\nThomas Rudy (02:56.438)\r\nYeah, everybody had something. Yeah. But you know, somebody might've spent 50 bucks to get a dollar. So we got complaints. eventually got, actually, I think I looked into this recently. I feel like people are doing it again. I feel like, yeah.\r\n\r\n\r\nNikolas Hulewsky (03:06.29)\r\nAnd did you? Okay, so you got.\r\n\r\n\r\nNikolas Hulewsky (03:11.444)\r\nThey are. No, there are these mystery boxes or even one thing that's really, really popular right now is cards. So people have gotten into like baseball cards and they'll buy just tons of cards because one pack might have a card that they've been looking for and they'll like go through it. They'll spend tens of thousands of dollars, but that's why I'm surprised it got banned because I feel like that's a thing now.\r\n\r\n\r\nThomas Rudy (03:30.414)\r\nThat's all you need.\r\n\r\n\r\nYeah, that's my nine year old son now. Actually, it was kind of funny. was in, I don't remember if was Cabela's or Dick's Sporting Goods and they had like a fishing mystery box. My son wanted to buy it I was like, wow, that's literally how I thought I did it when I was.\r\n\r\n\r\nNikolas Hulewsky (03:41.907)\r\nNo way.\r\n\r\n\r\nNikolas Hulewsky (03:48.362)\r\nYou were just too early.\r\n\r\n\r\nThomas Rudy (03:51.052)\r\nWell, it's too early.\r\n\r\n\r\nNikolas Hulewsky (03:52.18)\r\nDid you just make, okay, so you got shut down, but did you make like low five figures or did you make more than that?\r\n\r\n\r\nThomas Rudy (03:58.314)\r\nI honestly don't even think we made anything. I mean, I was also doing like the retail arbitrage back then too. Like, you know, go to whatever store, look at the discount rack and sell it. had some money doing that. Actually, that's how I like paid for stuff back in the day. I really didn't have that many like jobs. think I like repped basketball. I worked at the mall for a little bit. So that was like retail.\r\n\r\n\r\nNikolas Hulewsky (04:10.879)\r\nMmm.\r\n\r\n\r\nThomas Rudy (04:26.144)\r\nnot Amazon, eBay arbitrage back in the day was how I like funded, you know, myself. But, you know, back then, like as a kid, like a thousand bucks a month was fine. So.\r\n\r\n\r\nNikolas Hulewsky (04:35.466)\r\nSo you've been a hustler, you're a hustler.\r\n\r\n\r\nThomas Rudy (04:39.474)\r\nyeah, definitely like the way I've grown my career is definitely like hustle, like just go forward. Very, you know, more scrappy non-corporate as I would call it. you know, played in the corporate world too, just with the same attitude. But yeah, that was the first one. mean, that kind of got my gears turning. Wow. You can, you can make money online. You can do interesting things. You can just do whatever you want really, and just have an idea and launch it. Right. So.\r\n\r\n\r\nNikolas Hulewsky (04:48.97)\r\nScrappy.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:09.66)\r\nSo how did you get into from from there to like software development?\r\n\r\n\r\nThomas Rudy (05:15.854)\r\nYeah, so I mean, I was going to college. First went to Juca. I played a little basketball and I went to Central Michigan, played a smaller amount of basketball there. And really, I was going to school to be an accountant and I just couldn't do it. just could not. Just couldn't do it. I'm really glad that I didn't do it. So I honestly went to the library and would check out books on basic programming, which got me so far. And then really just kind of like...\r\n\r\n\r\nbuilt websites, launched websites, built websites for friends. I mean, this is before, and we're talking like mobile devices weren't really thought of back then. You were kind of building websites, not even necessarily using WordPress, just using HTML.\r\n\r\n\r\nNikolas Hulewsky (05:57.866)\r\nBecause mobile didn't really get popular till like 2012, 2013 was when it first, I mean, even popular is a generous term to say, but that's kind when the mobile wave started, right?\r\n\r\n\r\nThomas Rudy (06:09.59)\r\nYeah. Responsive web development wasn't a thing when I started, it was like, make sure you're accounting for Internet Explorer six or seven or whatever it was, which that was like the most brutal part of it. so yeah, mean, honestly, it just, it wasn't necessarily any aha moment or like nothing has ever really like clicked overnight, except maybe that eBay mystery box thing that, you know, like spouted off, but everything has kind of just been like a slow churn, you know, like a\r\n\r\n\r\nNikolas Hulewsky (06:18.429)\r\nI'm\r\n\r\n\r\nThomas Rudy (06:38.862)\r\na long term crawl to like find success. And there's that, I mean, there's been winds along the way for sure, but that's how it started. So I really like did the basics. I was doing web development and then I got into local SEO. So I did a lot of work in local SEO earlier in my career. I guess like moving forward, know, work at Microsoft software developer, I worked at reviews.com, running tech and parts of the content.\r\n\r\n\r\nAnd I think that kind of is what helped me position and like build what became my agency, which is the precursor to my business now. so yeah, I mean, it's a snapshot of really like almost 20 years now, which is kind of cool.\r\n\r\n\r\nNikolas Hulewsky (07:17.62)\r\nOkay, so you've, I think it's really cool. You got a really interesting personality because most, you know, most guys in software aren't playing college basketball. I'm also glad you didn't become an accountant because I thought about it for a bit. My wife's dad's a CPA and she's like, you should be an accountant. I'm like, I blow my brains out. can't do it. But then you, so you went from accounting to software development. mean, web development.\r\n\r\n\r\nwhich is interesting to me, but you built a company that you sold to Benzinga eventually, correct?\r\n\r\n\r\nThomas Rudy (07:55.502)\r\nCorrect, yeah, that was my agency 1020. Yep.\r\n\r\n\r\nNikolas Hulewsky (07:56.938)\r\nSo that was your agency. So you started this agency and what was the agency in particular?\r\n\r\n\r\nThomas Rudy (08:02.95)\r\nI mean, was essentially all things performance marketing. So, I mean, a lot of the model that, you know, I learned and helped build that reviews.com with what we did there. I took and basically started servicing clients. So Benzinga, Moneyline was another one. Rocket mortgage was another one that we worked on from an SEO perspective.\r\n\r\n\r\nNikolas Hulewsky (08:22.772)\r\nSo I'm an idiot. What is performance marketing?\r\n\r\n\r\nThomas Rudy (08:26.414)\r\nI mean, it means a lot of things to different people, but to me, it's essentially, um, you know, creating marketing that you derive revenue from based on performance. So whatever that might be, like oftentimes for us, that was SEO driven content. Sometimes it was paid arbitrage. Um, sometimes it was content syndication, distribution. Um, but generally it's like, you know, we put out a piece of marketing material, whatever that is. And then that piece of marketing material makes money, which we earn a commission on.\r\n\r\n\r\nSo Benzinga, like we, you know, we had a ton of content that was going through syndication. had a ton of content from traffic through SEO. And, you we would, you know, basically find the right partners that would meld together with that content or match with that. And. Or in a commission have whatever the payment structure is CPL, CPC, flat rate, et cetera, or a combination of all of them. Um, so the model that I employed with them was kind of an interesting one where I took virtually a negligible retainer with them.\r\n\r\n\r\nand had performance, like an upside on it, on the performance that we built, pretty, pretty nice slug of that performance. And we built it into a, you know, seven figure month business. So it worked out very well. And I took that model and, I had other performance clients, kind like the same thing. think Benzinga was definitely one the more successful ones in that, from that strategy. and you know, we had clients that would just pay us a retainer to, right? Like they just pay us like a fee to help them, you know, like order their SEO presence or.\r\n\r\n\r\nwhatever it was, we did, did, you know, web development work too. We did paid work. Yeah. I mean, it worked out very well. Um, you know, a couple of interesting tidbits on that. think like the people at Benzinga were great, like Jason, Luke, if they were listening to this, like they were really good to us. Um, you know, that doesn't, you don't see that across all partnerships that you form, which is kind of like what I had, uh, you know, ran into a wall on.\r\n\r\n\r\nLike you, you know, when you're having all these like performance deals and like, you know, upside is commission and you basically have, you know, 20 business partners at the same time. And it's that's like the more challenging thing to navigate.\r\n\r\n\r\nNikolas Hulewsky (10:31.946)\r\nDid they buy you because you were just doing so well, making so much money, and just made more sense for them to bring you in-house?\r\n\r\n\r\nThomas Rudy (10:38.68)\r\nthink really what happens, they got bought by private equity. And I mean, I was\r\n\r\n\r\nNikolas Hulewsky (10:44.17)\r\nHow big were they, do know? Do have any idea of like?\r\n\r\n\r\nThomas Rudy (10:47.886)\r\nYeah. I mean, the, like the valuation on the purchase was 300 million. So was pretty big. And when I started, I mean, when I started working with them, I think the first year I was there was only 3 million of revenue. So it grew very quickly. mean, there was a couple really talented folks in that organization. Um, one that comes to mind is Neil Hamilton, obviously like Jason, Patrick Lane, um, Matt Cole, who I'm working with now partnered on with, with data shopper. Um, yeah, people moved really quickly and grew.\r\n\r\n\r\nNikolas Hulewsky (10:51.528)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (10:57.812)\r\nWow.\r\n\r\n\r\nThomas Rudy (11:17.783)\r\nthere was like a competition of the business lines and how quickly the revenue could grow and one was the affiliate revenue line.\r\n\r\n\r\nNikolas Hulewsky (11:23.562)\r\nSo the $300 million valuation with the PE, what was the revenue for that valuation?\r\n\r\n\r\nThomas Rudy (11:31.566)\r\nthink when they got bought, was floating around like 45 million a year. yeah.\r\n\r\n\r\nNikolas Hulewsky (11:35.469)\r\nwow. that's geez, Louise. Three to forty five is is a time.\r\n\r\n\r\nThomas Rudy (11:40.462)\r\nin like three and a half years.\r\n\r\n\r\nNikolas Hulewsky (11:45.524)\r\nDid they just catch a wave or was it something special about what they were doing or was it you and your team on the marketing side?\r\n\r\n\r\nThomas Rudy (11:53.646)\r\nI mean, our business line definitely had a huge portion of that. There was four other business lines that had significant revenue too. There were four different, I mean, seven figure business lines within that org, some eight figure businesses like ours was of an eight figure business at one point. I don't know what it is today, but.\r\n\r\n\r\nNikolas Hulewsky (12:11.434)\r\nAnd just for people who don't know, sorry, Benzinga is a...\r\n\r\n\r\nThomas Rudy (12:15.595)\r\nThey're like, I mean, they're a financial media publisher. They're basically the way that they started was, they were like the Bloomberg for your average show, like the retail investor. And, know, gave them access to news, data sets, information, ideas, analyst ratings, et cetera, in a simpler fashion that was digestible to the retail investor, essentially.\r\n\r\n\r\nNikolas Hulewsky (12:42.248)\r\nYeah, I kind of compare them as a mix between the Motley Fool and Bloomberg. They're kind of going after the Motley Fool-esque customer, but they are a little more data heavy than the Motley Fool is.\r\n\r\n\r\nThomas Rudy (12:48.716)\r\nYeah.\r\n\r\n\r\nThomas Rudy (12:57.388)\r\nYeah, I mean, have a good, honestly, the, the biggest portion of their business for a while before I joined was their licensing business. And I don't know the current numbers, but they definitely had some really good partnerships, from a licensing perspective, you know, like distributing content to brokerages or just the raw, like financial data that they would provide to whomever. so I mean, it was an interesting business. There was really like four or five businesses inside of that org, which kind of\r\n\r\n\r\nall took off at the same time like when I started working with them. Again, there was some.\r\n\r\n\r\nNikolas Hulewsky (13:28.936)\r\nWhich line were you working with in particular?\r\n\r\n\r\nThomas Rudy (13:31.694)\r\nJust the, we called it the Legion department. So it was just all performance marketing, SEO paid content syndication, like whatever we could do to put a dollar in to get $2 out and hopefully $5 out. Um, that was the org that I started, headed and ran for a long time and that my org got absorbed back into.\r\n\r\n\r\nNikolas Hulewsky (13:50.361)\r\nokay. So you got you got bought and then you're also working as the head of that organization in Benziga.\r\n\r\n\r\nThomas Rudy (13:55.93)\r\nYeah. Yeah. I was the head of it. Like I, it didn't exist before I started working with them. Um, you know, if I remember correctly, like month one, it's kind of funny. Month one was starting the, the Legion department. did like 40 bucks. You know, like everyone's like, Hey, I don't think it's going to work. You know, and that's kind how it always goes in this kind of stuff, you know, and like month three, we did like 60 grand and then we did like 120 grand, you know, just kind of like kept compound.\r\n\r\n\r\nNikolas Hulewsky (13:59.53)\r\nMmm.\r\n\r\n\r\nThomas Rudy (14:23.694)\r\nAnd I mean, Benzinga was, you know, it wasn't all just me. Like there was, we had, like I brought in a good team too. And they had a great brand that was, that helped facilitate that process. But yeah, so to answer your long-winded question, like they brought our org back into the group, I think, because they just wanted to improve Revedale. And I had a solid book of business that was, you know, very complimentary to what we were already doing with them.\r\n\r\n\r\nSo it was just like an easy way to like loop us back in, basically add like another pretty substantial chunk of revenue overnight. And like I brought my team, like, you know, some of the core team members back into the org to, to run ops and all that good stuff.\r\n\r\n\r\nNikolas Hulewsky (15:05.844)\r\nSo as far as the way the agency function, I kind of think of the digital marketing in two buckets. One is the creative, where you're designing, thinking through what the ad's going to be, et cetera. And then there's the strategic, which is, I don't know, figuring out who you're targeting, which audience, what time of day, how much money you're throwing behind it, et cetera. Were you doing both? Were you doing the creative and the strategic?\r\n\r\n\r\nOr am I like way off? Maybe I'm an idiot.\r\n\r\n\r\nThomas Rudy (15:38.062)\r\nYeah, no, mean, it's not the most creative endeavor, to be honest. But there's some creative aspects to it. At first, I was doing everything. I mean, even when I started, they didn't have necessarily a site, or the site wasn't structured where you could post content, track affiliate sales, do it in a fashion that's not.\r\n\r\n\r\nyou know, mind numbing and a horrible process. So I built the infrastructure for all the ads. I built like the different units that would, you know, populate and showcase. And some of those still live on today. If you, if you go on their site, there's a lot of stuff that I built that's still there. Um, so, you know, some of that was creative, but most of it was like, like from a performance marketing standpoint, like most of the work is just like functional content, testing things and seeing what works.\r\n\r\n\r\nNow you can definitely get more creative and we did get really creative in some instances. one example is we like an NCAA bracket for, I think it was stock tickers and let people vote on it as a means to like get backlinks and have fun. And a group sponsored it too, I forgot who sponsored it, but.\r\n\r\n\r\nThere were some creative aspects to it, but at first I was doing everything and over time, you know, I just kind of like replaced myself with talent as the revenue support. So the.\r\n\r\n\r\nNikolas Hulewsky (16:57.802)\r\nSo you were doing stuff not only to drive traffic to the site, but also once you got traffic to the site, capturing as much information as you could about people who are visiting and then retargeting them.\r\n\r\n\r\nThomas Rudy (17:10.786)\r\nYeah, or they would just click out to the appropriate partner, right? Like somebody would come through, somebody would consume a piece of content within that content, depending on the level of intent. Like we would structure different CTAs or different offers that made sense with certain partners and, you know, hopefully monetize them, hopefully keep the partners happy with the right audience.\r\n\r\n\r\nNikolas Hulewsky (17:13.642)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (17:31.31)\r\nso this was a revenue stream also for Benzina because you had affiliate agreements that you were referring out to.\r\n\r\n\r\nThomas Rudy (17:38.03)\r\nYeah, yeah, it was 100 % of revenue stream for Benzinga and I took a cut. So Benzinga paid me, I mean, literally like a nothing retainer to do this. And I purposely, you know, I purposely wanted that because I knew that the revenue opportunity was there. So I would rather take, I mean, in retrospect, I should have taken nothing in an even higher commission. Seriously, seriously. Yeah. But so we took like a nothing retainer and by we, I mean me at the time. And.\r\n\r\n\r\nNikolas Hulewsky (17:41.592)\r\nOw.\r\n\r\n\r\nThomas Rudy (18:06.958)\r\nYou know, a high commission and it worked out really well. And around that I was able to hire, you know, My own set of agency talent. And, I also helped Benzinga hire, you know, like technical resources or in-house people, et cetera. So it was a very like close knit relationship, but I was, I guess I'm just, I was a vendor to them and I took that model and. You know, we'll put a lot of other groups on it. think like Benzinga was just like the most successful and the one that.\r\n\r\n\r\nI guess I'm most open and transparent about just because it was such a good endeavor.\r\n\r\n\r\nNikolas Hulewsky (18:38.122)\r\nSo I was thinking you were driving traffic to Benzinga for like signups or something, right? From individuals, but you were driving traffic from the website to affiliates.\r\n\r\n\r\nThomas Rudy (18:49.358)\r\nYeah, and some of it was to sign up. they have, you know, they're, bending a pro platform. Um, you know, they have a newsletter business, they have events, um, and like they have their data licensing business too. So I, I touched pretty much every single one of those business lines in some form. Um, but the majority of it was, like working with affiliates.\r\n\r\n\r\nNikolas Hulewsky (19:12.554)\r\nbig does that get? So your agency you built to a seven figure a month agency, is that like a million dollars or is that like $8 million or maybe you can't tell me, but what did you guys\r\n\r\n\r\nThomas Rudy (19:23.926)\r\nNo, my, like the Benzinga line was over a dollars a month. I think at its peak, was touching $2 million a month. My agency will win like the mid seven figures of revenue. Cause we were taking a cut of, the, revenue from our clients and you know, our partners.\r\n\r\n\r\nNikolas Hulewsky (19:42.314)\r\nIs affiliate revenue still a pretty significant part of businesses like Benzinga or has it changed at all?\r\n\r\n\r\nThomas Rudy (19:48.398)\r\nYeah. I mean, I don't know the exact numbers, but by the time I left, it was still a pretty prominent business line. Um, I mean, and really like a skeleton crew of, you know, what it used to be. So in theory, a lot higher margin. Um, you know, we were working to build it. were, you know, we spending a lot on content. We were spending a lot on resources.\r\n\r\n\r\nNow I don't even know what the team looks like, but you know, I guess I could ask, but you know, there's probably like a few people left and the budgets are cut. So it should be very, very high margin at the moment. Um, and you know, I, I still play in some of those circles, still work with some of the partners in a different capacity now. Um, so I'll like catch wind of it, but for the most part, I'm like, it was a good, it was a good run with them. Um, great people over there. Had a lot of fun. Um,\r\n\r\n\r\nAnd yeah, mean, they definitely caught some tailwind in the COVID, GameStop mania stuff that helped them out a lot too with some of that growth. But yeah, in all honesty, I still think that there's a ton more potential there. I think if you wanted to do it again, you would just kind of have to like, not necessarily tear down what's there, but the SEO tactics and the performance marketing tactics that worked in 2018.\r\n\r\n\r\nare a little bit different now. Actually, the whole SEO landscape is a little bit different now. So yeah.\r\n\r\n\r\nNikolas Hulewsky (21:15.37)\r\nWhat's different?\r\n\r\n\r\nThomas Rudy (21:18.424)\r\nWell, I mean, the biggest thing, are you familiar with SEO at all? So I mean, the way that Google is prioritizing certain sites or ranking certain sites, especially affiliate based sites is just, you know, it's, kind of like blown up to the point where, know, in my opinion, a of people don't even know what they're doing. It's a little bit, it's a little bit of the same tactics, a little bit more of a desk work, but I think it's just ultimately like more risky to put a ton of dollars behind something like that again, because.\r\n\r\n\r\nyou've seen it time and time again, even like Forbes advisor just got knocked with a huge algo update. looks like a manual penalty. it's just riskier. You know, you can, you can build a huge business and overnight you can get wiped away. So you would have to be extremely regimented about how you're approaching that. and even still there's, there's a risk that you can get wiped out pretty quick. So, I mean, we, you know, like that was happening too, while I was working with them. So there's different ways to combat that.\r\n\r\n\r\nNot everything from the affiliate arm was based on SEO. was, you know, content, content syndication was a huge new lever that we worked to develop. Um, obviously like paid ads, paid arbitrage found some success with their, um, but yeah, I mean, like the, the SEO, was, my opinion, it's, it's risky. Like, would you want to invest that much money or your time? And you could, there's just a risk.\r\n\r\n\r\nNikolas Hulewsky (22:42.568)\r\nWell, what's interesting, you can tell me where I'm off here. This is kind of my understanding of it. You're interesting because you like this arbitrage play and you've been doing it since you were going to TJ Maxx or whatever, you know, as an 18 year old looking for retail stuff. But what I've seen, part of the biggest change in the SEO landscape is the way that Google is prioritizing things and even the Google answers where it's now like Google AI giving you an answer and you're not going to that top ranking.\r\n\r\n\r\nwebsite that was driving a bunch of money from affiliate links after you clicked into it to find an answer to your question. It's similar though, in the way that I view people who build social media audiences, they're building on rented land. Like if I'm on Twitter and I have a large audience or if I'm on YouTube, if they change the algorithm, all of a sudden you're not able to reach those people. So many people are taking the people who are seeing them on those platforms and getting their email addresses so that they can communicate with them directly offline. can take them off platform.\r\n\r\n\r\nAnd what's interesting about that, I'm just like connecting the dots as we're talking, that is your new business. Like you are effectively in the past where I had to go to Google and pay Google or Meta to access the people who are coming and accessing their website so I can target specific people. But if, you know, if they change the way that they rank things or if they change the way they prioritize things, I get kind of Whereas your business, you're now scraping these data lists and people can come to you and target.\r\n\r\n\r\nvery specifically through email, phone number, obviously there's the opt-in lists, et cetera. it's like you're moving away from having to rely on Google and Meta to access people's attention. Is that fair? Yeah.\r\n\r\n\r\nThomas Rudy (24:23.118)\r\nI mean, it's extremely fair. mean, it's part of the reason why we're doing it. I mean, I, you know, I still play very much in those performance marketing circles. Um, just love clients in those performance marketing circles. Um, and there is a nice parallel there with some of the stuff we're doing, but yeah, I mean, I honestly wanted a product that had zero reliance on an algorithm update, you know, like, you know, there's some reliance on it because ultimately are.\r\n\r\n\r\nsoftware works on behalf of the client's traffic. A lot of it is on page traffic though, so it's like a nice steady screen.\r\n\r\n\r\nNikolas Hulewsky (25:01.354)\r\nCan you do a better job than I did of just explaining what your product is?\r\n\r\n\r\nThomas Rudy (25:04.814)\r\nYeah, absolutely. So our product is a simple piece of software. I as simple as complex as you it to be. It goes on a website. In real time, you get a feed of the users that are coming to your site and our data set allows you to return. I mean, really like a myriad of data points around that user. some of their contact information, their device IDs, their demographic data.\r\n\r\n\r\ntheir financial footprint, et cetera, et cetera. So depending on the client, you can be really well equipped to help those users really seamlessly. So this group, Data Shopper, was born out of this other group, Printfineship, who was one of my long-term clients. And after I ended my tenure with Benzinga, joined up with them and...\r\n\r\n\r\nyou know, had been working with this product for a couple of years behind the scenes. so, so we do, you know, from the remarketing, do direct mail. do, you know, obviously you can pipe it to a CRM or an ad platform, and do some sort of sequencing or reaching out to them, depending on, again, depending on how the order is set up and what their business model is. and even just the, know, you're, you're not only getting, you know, Thomas Rudy and my address and my info, but\r\n\r\n\r\nyou're getting the fact that I have an iPhone and that I have the tablet and that I have a smart TV. So in one clean swoop, you can remarket all these people on every single platform, you know, really for like pennies on the dollar compared to what you're doing on Google or, or any of the platforms really.\r\n\r\n\r\nNikolas Hulewsky (26:40.682)\r\nBecause Google and Meta don't have that granular of information, or at least they're not willing to share it with you to be able to retarget them.\r\n\r\n\r\nThomas Rudy (26:47.362)\r\nYeah, I mean, honestly, it's kind of a black box. They certainly have retargeting mechanisms. You know, I don't think that they have necessarily, I don't think they want to play in this world, but they don't have like in that one clean swoop where, you know, let's say like a regional roofer as an example, they come to the website, all of sudden that individual, and they come to website and is deemed as somebody that deserves this, but that individual gets a postcard. They get some sort of, you know, like,\r\n\r\n\r\nemail sequence sent out to them or a salesperson smiles and dials them, assuming they're not on the do not call list. And then they see their ad on Meta and then they see it on Hulu when they're watching whatever show. It's a really, really good way to like find those five to six touch points that, you know, oftentimes salespeople tell you you need, you know, to get some over the finish line. And for the right product, like, you know, a roof that's $50,000, it's so affordable that\r\n\r\n\r\nit's hard pressed not to back into success if it's set up correctly and the team can administer the lead correctly and get them over the finish line.\r\n\r\n\r\nNikolas Hulewsky (27:51.764)\r\nSo on Meta and Google, you're relying on their willingness or ability to share information, demographic information for these customers. With Data Shopper, if they come to your website, you can gather that information.\r\n\r\n\r\nThomas Rudy (28:07.52)\r\nYep, we can get anywhere too. So it doesn't have to be, it's not relying on like everyone else's pixel. It's one pixel that can push the data to any format you need in order to reach out.\r\n\r\n\r\nNikolas Hulewsky (28:17.776)\r\nHow do you get that much information on me? If I just visit your website, how do you all of sudden, do you know my net worth or my Apple ID or anything else that you're collecting?\r\n\r\n\r\nThomas Rudy (28:28.214)\r\nYeah. So that, mean, that's some of that is the secret sauce, but generally the group we work with that this was born out of print friendship has, a number of different data relationships. I mean, they're, they're almost 70 years old as a company. So over that time, they formed pretty, yeah. At first it was Mel printing, then it was print friendship. So was like, you know, it was a printing house, then it was a three PL and now it's, you know, like quickly becoming like a data arm too.\r\n\r\n\r\nSo we basically have a graph that we've worked with with a ton of different partners that we've sourced data from. And foundationally, at the name and address level, we can tell you who an individual is and then use a variety of sources to enrich and amplify that data. And then the software itself is basically returning a hashed version of someone's\r\n\r\n\r\ncookie information or their email information. And then we matched it against our data set and can give like the complete footprint of who that individual is. Or it can also be, you know, depending on the group, it can be salted and, you know, like transmuted into whatever format needed in order to find the appropriate.\r\n\r\n\r\nNikolas Hulewsky (29:37.354)\r\nSo all that's legal, like all that information people collect on us is totally, I have no idea. I'm not like.\r\n\r\n\r\nThomas Rudy (29:42.55)\r\nYeah. So, I mean, we only return data that has been opted in. The biggest no-no areas, you cannot robocall Robotex people. And there's other forms of how we handle opt-in too. We have a few different opt-in mechanisms for location sharing or email opt-in. So it really kind of depends on the org. It depends on whether it's B2C or B2B, how we work with our customers.\r\n\r\n\r\nBut yeah, like the emails that we would deliver to you would be opted in and we have the stamp of when that person was opted in from, you know, which one of our partners. Um, so, so there's a, there's a variety of mechanisms for how to handle compliance. The easiest one, honestly, is just direct mail. can direct mail anybody. There's, there's not necessarily like a, um, I mean, assuming it's not flagrant or anything of that.\r\n\r\n\r\nNikolas Hulewsky (30:33.578)\r\nHow do you get specific information? me or Thomas Rudy, you're online. I don't know how many Thomas Rudy's there are in the United States. How do I know that it's you? Like, do you have a unique identifier that is assigned to you online and then you're able to tie that to every other data set that's been collected?\r\n\r\n\r\nThomas Rudy (30:53.688)\r\nSo mean, we have a unique identifier that we've built to help us basically facilitate the work easier. But really, mean, honestly, the foundation of it is just name and address. That's the foundation of it. And then from there, there's a blend and there's a mechanism to add and then layer all these other data sets. In full transparency, everything's getting updated constantly. As for instance, we don't have data on miners. So when someone turns 18,\r\n\r\n\r\nthere's a whole new data set or if someone moves or if someone dies, unfortunately, like data is always constantly changing. So there are, you know, there's potential for, know, inaccuracies at the micro level, but on the macro level, it's, know, like really accurate.\r\n\r\n\r\nNikolas Hulewsky (31:38.8)\r\naddress. Address is the key that you go and measure against.\r\n\r\n\r\nThomas Rudy (31:43.788)\r\nName and address is the foundation of it, for sure. And then from there, you can do a lot. mean, you can pair that with their career data. You pair that with their property data. There's a lot of different things you can do. And really, it's not necessarily an effort to...\r\n\r\n\r\nNikolas Hulewsky (31:44.862)\r\nI'm an address.\r\n\r\n\r\nThomas Rudy (32:11.586)\r\nYou know, like have data on everyone. Really the effort is to like help clients find the right audience and, you know, target them more effectively, even your own data, right? Like, we're working with a group now that has a pretty large data set and, you know, they, they want to basically take their data and have us, you know, do some linear aggression on it basically, and tell them which one of their cohorts in that customer group would be the most applicable to XYZ product.\r\n\r\n\r\nUm, so there's a few different like mechanisms of how we're working with clients, but, really like it's the goal of it is to give people, um, you know, again, like kind of like what meta and Google does give people the most accurate advertising that they are in market for, that they want to, that they want to buy. And if they're not, then don't. Um, so yeah, we, we like skipped over five years of stuff, but that's, that's the current.\r\n\r\n\r\nNikolas Hulewsky (33:02.346)\r\nfreaking nuts to me.\r\n\r\n\r\nNikolas Hulewsky (33:07.272)\r\nI know. I know.\r\n\r\n\r\nThomas Rudy (33:10.67)\r\nFrom eBay to Data Shopper, happened real quick.\r\n\r\n\r\nNikolas Hulewsky (33:13.204)\r\nFrom eBay to Data Shopper, I have a hard stop in one minute. I'm trying to figure out how to wrap this. Man, this was really fascinating. Is the best place to go look at the company is just on the website?\r\n\r\n\r\nThomas Rudy (33:21.87)\r\nThat's okay. No worries.\r\n\r\n\r\nThomas Rudy (33:31.502)\r\nYeah, we have a new website that's launching hopefully this month sometime. Big, I mean, you go check out the website. We're pretty active on Twitter too, or X rather.\r\n\r\n\r\nNikolas Hulewsky (33:42.782)\r\nYeah, don't, can't dead name it.\r\n\r\n\r\nThomas Rudy (33:45.09)\r\nYeah, you can't dead name it. You heard.\r\n\r\n\r\nNikolas Hulewsky (33:46.771)\r\nYou\r\n\r\n\r\nWell, this has been fantastic. I really want to know what data you have on me, but we can figure that out next time.\r\n\r\n\r\nThomas Rudy (33:58.958)\r\nYeah, I'll send you an email. If you want it removed.",
  "metadata": {
    "duration": "",
    "date": "2025-03-10",
    "platform_source": "Google Drive"
  }
}