{
  "episode_number": "120",
  "episode_title": "TOP PICK! How to Build a Million Dollar Business with James Camp",
  "guest_name": "James Camp",
  "business_name": "TMO Holdings, Blue Angels Hearing, Offmarket.so",
  "transcript": "﻿Nikolas Hulewsky (00:00.175)\r\nwas worried about the intro, dude, James, I'm freaking stoked to talk to you. You're like the Dos Aquis guy because I was doing my research on you and it was like, you started as an internet entrepreneur, essentially doing SEO as a teenager. then correct me where I'm wrong, okay? You founded this company called TMO Holdings, which was like a financial media consumer brands company that you eventually exited out of. My notes say an exit of 30 million. I don't know if that's accurate. that accurate?\r\n\r\n\r\nJames Camp (00:14.946)\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nJames Camp (00:22.466)\r\nYeah? Yeah?\r\n\r\n\r\nJames Camp (00:28.878)\r\nIt is just over a lot of it was stock. yes, the time of but fluctuates by the second.\r\n\r\n\r\nNikolas Hulewsky (00:29.773)\r\nOkay. Okay.\r\n\r\n\r\nNikolas Hulewsky (00:38.051)\r\nAll right, so you go from this, you go from the SEO world as a you go to then this internet holding company where you're doing financial media and consumer brands, then you buy this Blue Angels hearing aid company that's direct to consumer that you ended up exiting out of. And now you're focusing on leveraging your distribution channels and buying unsexy internet businesses, like the unsexy businesses in the most sexy industry.\r\n\r\n\r\nJames Camp (01:01.134)\r\nSure, that's pretty right. It is right, it is right. think I keep all of these little deal toy shelf in front of me, no one can see it except for me right now. But it's partially like a reminder to me. Sometimes I'm like feel very imposter-centered. I mean, I'm like, I did buy that. Like we did sell that. And especially while I sit in this little existential crisis about like where what I'm working on now progresses into the next decade of my life at 36.\r\n\r\n\r\nNikolas Hulewsky (01:03.011)\r\nIs it? Okay.\r\n\r\n\r\nNikolas Hulewsky (01:20.185)\r\nWell, dude.\r\n\r\n\r\nNikolas Hulewsky (01:28.975)\r\nI have people who do that. They'll like read off my history and I'll be like, yeah, I forgot I did do that thing. But so what's really cool about what you're doing is you're like the Warren Buffett of now I know I get it. I get it. You're not a hundred billionaire. But from what I can tell, you're like finding these unsexy businesses within tech and then you're just worried about cash flowing them, growing them, et cetera, and exiting. Am I reading the thesis right? Is that close?\r\n\r\n\r\nJames Camp (01:34.442)\r\nI did do that, yeah.\r\n\r\n\r\nJames Camp (01:42.574)\r\nI'll take it.\r\n\r\n\r\nJames Camp (01:59.072)\r\nYou are. I think you're there's like a little bit of a lag on your thesis and only because obviously I'm the only one inside my brain. Candidly, like I mean, 100 % at one point, the plan was to find a shell and do a reverse merger. I mean, actually Berkshire Hathaway asked, right? That is literally what Warren Buffett did. think everyone always Berkshire Hathaway was a textiles company, right? And, you know, and just started just started shoving assets into it. Essentially.\r\n\r\n\r\nNikolas Hulewsky (02:15.236)\r\nWow.\r\n\r\n\r\nJames Camp (02:25.708)\r\nBut, I know because of playing the financial media space for a long time, I'm pretty familiar with reverse mergers and RTOs and whatever. And I had thought maybe the plan was to go more that route. I think right now what I realized was some of the stuff I'd been buying was too small to really scale out. And so the question is, we either go a lot bigger, which is some conversations I've been having with people.\r\n\r\n\r\nor what but yeah, you're you're you're spot on that is the thesis. What I can tell you though is that the small stuff is fun and it's cool. It's all it sort of hits my ADHD, these little boring internet businesses that I think are kind of cool and fun to me because I get obsessed about growing things. But not having one that can scale out to be much bigger. think although they saw my ADHD, they don't like fill my cup in same way if that makes sense. I don't know.\r\n\r\n\r\nNikolas Hulewsky (03:22.105)\r\nYeah, it makes total sense. So do you have companies right now that you own and invest in or have you exited out of everything?\r\n\r\n\r\nJames Camp (03:29.688)\r\nSure, so I mean, a weird portfolio of stuff, like we have like a soccer blog, you know, that like I bought a couple years ago because I thought the writing was on the wall, all ships rise in high tide. think soccer has come to the US in a crazy way. And I think like you could perform poorly in that industry and as long as you sort of stuck around, you'd do well in terms of search traffic and stuff. know, messy going to Miami was a huge deal, right?\r\n\r\n\r\nNikolas Hulewsky (03:35.193)\r\nThat's awesome, okay.\r\n\r\n\r\nNikolas Hulewsky (03:46.693)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (03:51.533)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (03:56.643)\r\nYeah, massive deal.\r\n\r\n\r\nJames Camp (03:57.801)\r\nAnd then we have the World Cup coming to North America, which is going to be just a huge, huge, huge deal. And I don't run that now. I have a partner in that. He was a goalie, played soccer in the US. His name is Bart Kreisman. He's the man. But so he runs that.\r\n\r\n\r\nNikolas Hulewsky (04:07.662)\r\nWhere?\r\n\r\n\r\nNikolas Hulewsky (04:13.849)\r\nMy, by the way, my dad was a professional soccer player. Yeah, he played.\r\n\r\n\r\nJames Camp (04:16.206)\r\nOh, really? Dude, I think the MLS is going to become massive, dude. I think it really, and so then I also thought to line up with that, that the next dominant fall was sports betting in the U.S. I played in the Canada sector 2015 to 2020. I love a nation industry. I love gray markets. I love things where people are a little afraid to touch them. It just means there's a ton of opportunity. Although I have mixed feelings about sports betting, I think that there's a huge opportunity.\r\n\r\n\r\nto, you we saw this soccer blog that was selling cleats, you know, and I was like, well, I mean, there's probably more money in affiliate sports betting stuff. Anyway, so we have that. Then I have a small SEO agency where we help people, I've been involved in the SEO space like 15 years, God, 15 years, sorry, a long time now, give or take, maybe more. And we crushed that for a few clients that love that just because it's very...\r\n\r\n\r\nI like people that work in Meduo there. And then I bought a, last summer I bought a database, SAS, DAS if you will, Database as a Service, Database as a Service, called Offmarket, that's Offmarket.so. We basically just pull database, we pull data on like Shopify apps and Shopify brands and content sites and all these different sources of businesses that are not listed in marketplaces for sale. And then aggregate, we're about to relaunch this next week, so maybe this is.\r\n\r\n\r\nNikolas Hulewsky (05:20.367)\r\nOkay.\r\n\r\n\r\nJames Camp (05:40.494)\r\nMaybe this is a good time to talk about it. Anyway, aggregate all the information on them, what industry they're in, how they're growing, et cetera, and then put together their contact information so that people can reach out to the buyers and to the owners and try and buy them in off-market deals. Then I got a newsletter. That's it.\r\n\r\n\r\nNikolas Hulewsky (05:55.471)\r\nDo own all of these or are you an investor in these?\r\n\r\n\r\nJames Camp (05:57.866)\r\nI mean, those are all things I own. Well, the soccer side, don't own fully anymore. Everything else I own fully. have someone who's working with me on the database SAS. think probably will, if things go right next week on the launch, I will probably ask them to come in and operate it with me because I think it can scale out to be something much bigger. The newsletter I run fully on my own, the advisory arm of that as well, fully on my own. the agency, you\r\n\r\n\r\nNikolas Hulewsky (06:20.035)\r\nAre you comfortable sharing like, okay, just though that portfolio of businesses, like what's kind of top line revenue.\r\n\r\n\r\nJames Camp (06:22.968)\r\nSure. So that, mean, a million dollars a year, mean, not, you know, very, very sort of small. And this is where the, this is where the wall gets, I mean, they're all nice margin businesses, but part of the problem becomes trying to, I had this thesis a couple of years ago that was wrong. And I learned it the hard way that these was like, you could buy 40 small businesses and grow them out. Right. And it just doesn't, the OPEX doesn't work in that way. Right. it doesn't. so, because you have to be the operator of said businesses because\r\n\r\n\r\nNikolas Hulewsky (06:47.779)\r\nYeah. No, doesn't.\r\n\r\n\r\nEh.\r\n\r\n\r\nJames Camp (06:52.482)\r\nThe businesses cannot support hiring a fantastic operator on their own.\r\n\r\n\r\nNikolas Hulewsky (06:56.311)\r\nYeah, it's hard to buy and integrate 40 disparate businesses. If there are 40 businesses in the same vertical or the same industry, like, of course, there's economies of scale, but it's very difficult to have.\r\n\r\n\r\nJames Camp (07:08.478)\r\nI mean, bought in 2021 and bought a hearing aid brand that was doing, I mean, we grew that brand to about three million a year. Dude, it's so random. We grew that brand about three million a year and sold that. But like when I, I'd put a board together because I wanted to, me and every e-combro thought we could run an aggregator at the time. like, we'll just roll up all these Shopify brands. Thrasio's doing it with Amazon. Well, Thrasio just declared bankruptcy and half the people that sold to Thrasio will never see a penny because they're all on earnouts. But,\r\n\r\n\r\nNikolas Hulewsky (07:14.745)\r\nso random.\r\n\r\n\r\nHow the freak?\r\n\r\n\r\nNikolas Hulewsky (07:28.771)\r\nYeah.\r\n\r\n\r\nJames Camp (07:38.446)\r\nI had first brand I bought was Blue Angels Hearing and it was doing 50K a month or something. grew it to like 250 a month. And my friend David, who was on my board, who was like ex big private equity guy, CFO of a big, big, big consumer brand doing about two billion a year. He was like, well, now you have to buy SilverTech. And I was like, what? I don't want to just buy SilverTech brand. He's like, no, no, dude, this is like technology for the elderly, right?\r\n\r\n\r\nNikolas Hulewsky (08:00.879)\r\nWhat the frick is Silver Tech?\r\n\r\n\r\nmy, really?\r\n\r\n\r\nJames Camp (08:06.668)\r\nWell, once I bought the hearing aid brand, he was like, dude, you got to stay in silver tech. You'll it'd be, you know, it's like you can stay.\r\n\r\n\r\nNikolas Hulewsky (08:11.855)\r\nI feel so cool. just learned a new term. it's my back. My background is healthcare. I should know what silver tech is, but he's freaking Tommy's. That's amazing. No, it makes total sense. Silver tech.\r\n\r\n\r\nJames Camp (08:17.07)\r\nWell, there you go. mean, maybe he made it up, but it's stuck in my brain three years ago. So he's like, you got to buy SilverTech, right? And like that, cause he's like, it'll be much easier to exit this portfolio to a PE shop, much bigger later on, if they're all sort of in the same niche industry. Point is I didn't do any of that. And so what I've learned is that over the couple of years, we sold that and I closed down that aggregator that I was trying to run that hold code was trying to run because it wasn't going to work. But the next thing for me is either go build something very big again, off the back of one of these things that I own, which I.\r\n\r\n\r\nmaybe off market, which is at all all roads lead to owning an investment bank. the that's a whole different story. Or, or buying something much, much bigger, right? Because the reality is, I'm, you know, more like two to three million EBITDA businesses, $20 million businesses, $15 $20 million businesses, because I want to be able to pay an operator 350 grand and a couple points on the business to really leave an amazing job and be great at running the business.\r\n\r\n\r\nNikolas Hulewsky (09:03.523)\r\nYep. Yep.\r\n\r\n\r\nNikolas Hulewsky (09:10.735)\r\nSo, I have so many questions for you. Okay, so what's interesting to me is that all the businesses that you described, the blog, the SEO, I'm blanking on some of the others, like they're not sexy. These are not tech companies. It's like I developed this new app in marketplace and that takes hundreds of millions of dollars in investment. These are real businesses that happen to be tech-based, I guess. I don't even know what the right word is, but internet, okay.\r\n\r\n\r\nJames Camp (09:22.902)\r\nNot at all.\r\n\r\n\r\nJames Camp (09:36.526)\r\nSure, yeah, yeah, yeah. I'd say internet-based is what I would say. But to that point, I think what's funny is when I first started talking about all this stuff, people used to say to me, how do I get into e-commerce? And I was like, that's so vague, man. Imagine taking away the E and asking me how to get into commerce. mean, it covers everything, right? These are all technically e-commerce. We're selling something through E, through the internet, right? You know what I mean? On some level, they're all e-commerce-based.\r\n\r\n\r\nNikolas Hulewsky (09:49.699)\r\nhead into commerce.\r\n\r\n\r\nNikolas Hulewsky (09:56.975)\r\nYeah, yeah. So what I want to know is, like I said, you were doing SEO stuff in high school, apparently. Was that the first real business that you had that was like, all right, I'm generating cash flow. This is a thing.\r\n\r\n\r\nJames Camp (10:10.35)\r\nYeah, real is relative, right? As you get older, burn becomes much bigger. Your lifestyle calls for a way up. So I started blogging when I was 15. And I remember I had a blog called goldpiecexl.com. I'm sure I should re-buy that domain. It was so random, dude. I was into sneaker culture. And I thought I was going to start smelting down gold in my bedroom on the 12th story in Manhattan in my mom's little apartment. And I was trying to hustle like that.\r\n\r\n\r\nNikolas Hulewsky (10:14.265)\r\nSure. I guess, how long did you do that business for?\r\n\r\n\r\nNikolas Hulewsky (10:25.967)\r\nGO PEACE!\r\n\r\n\r\nNikolas Hulewsky (10:30.681)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (10:37.055)\r\nlove this story.\r\n\r\n\r\nJames Camp (10:40.366)\r\nAnd I was like writing these articles and just like spamming them into the blogging communities in DMs every day. Like you should read my article, read my article. And like one or two went viral on StumbleUpon and Dig and it made like 35 bucks. And I was like, what? On AdSense. And I was like, my mind was blown. I was like 15 or 16. And then it just sent me down a path of figuring out advertising and sort of programmatic display advertising and sort of then affiliate marketing. And then it became a decently sized publisher in the affiliate marketing world.\r\n\r\n\r\nThere's advertisers and publishers publishers place ads advertisers have pay-per-loshers to place ads and I was running I was a moderator on this forum called black hat world at the time I was like 17 18 which was like a very big SEO forum and it was cool at the time everyone's anonymous it was forms, right? this is 20 years ago and and I was a Super admin on another form called moneymaker discussion. We're just talking about intermarketing stuff\r\n\r\n\r\nAnd I realized I was getting paid $45 a lead on an offer called fcrfuturecreditport.com. And most networks are paying at like 28, 25, something like that in that range. So I just partnered up with one of the owners of one of these forums and was like, dude, let's just build an affiliate network and let's just broker these offers. Cause that's what ad networks do. They just broker between advertisers. And we built a little company called Liquid Offers and we started this little affiliate network and we just started broker. That was the first offer we brokered. Cause I was getting paid $20 more in every lead than we were paying out.\r\n\r\n\r\nNikolas Hulewsky (11:51.577)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nJames Camp (12:04.75)\r\nAnd then we bought an old content locking website called Upload Forever. So for anyone who's younger, maybe you'll know. I mean, I was 19. I mean, it was small. It was like seven or eight grand, but it was just like, was a file hosting website. Sorry. I remember back in the day, like if you want to download a song, you had to like go and go to like a file. You know, this is like Napster era, lime wire kind of stuff.\r\n\r\n\r\nNikolas Hulewsky (12:13.327)\r\nHow old were you?\r\n\r\n\r\nNikolas Hulewsky (12:25.775)\r\nArasha.\r\n\r\n\r\nJames Camp (12:30.476)\r\nAnd so we just bought this file hosting website and then just locked all the downloads with a CPA offer. So if you want to download like this song, you'd have put in your email into a win a free iPhone offer, right? Cost per action. like, so like, you know, we would get paid every time someone took an action. So they'd be like, so. You know, Nick would say like, I want to host. I'm hosting world of warcraft.\r\n\r\n\r\nNikolas Hulewsky (12:41.123)\r\nWhat's a CPA offer? Okay.\r\n\r\n\r\nJames Camp (12:55.758)\r\nthe game, right? If you want to download it for free, can download it here, but you have to enter in your email to get it. And then the sweepstakes people that would pay us $2 for every email entered and we pay you out a dollar for every email and we take the big of that, And then we pull that. So.\r\n\r\n\r\nNikolas Hulewsky (13:09.988)\r\nWere you going to school at the time? Did you go to college?\r\n\r\n\r\nJames Camp (13:13.966)\r\nI took a year off before college. mean, dude, had my, I think my tagline on Twitter is two exits, a thousand failures. mean, I mean, obviously it's an exaggeration. I'm being hyperbolic with a thousand, but like, yeah, I almost didn't graduate high school. I went to five high schools. God bless my mom for putting up with me. I mean, I was in the ultimate nightmare. And I told her would, if I had to be a super senior, I was never going to go back. And I graduated by the skin of my teeth. I was running a, I had a clothing company with a friend that never went anywhere. And I mean, like we were like.\r\n\r\n\r\nNikolas Hulewsky (13:33.283)\r\nHahaha\r\n\r\n\r\nJames Camp (13:42.03)\r\nYou know, maybe so like $10,000 a year of clothes or something. Took a year off and went to college. Took the money from the internet marketing stuff, started running around nightclubs, blew it all at nightclubs. Realized you get paid to be in a nightclub, became a nightclub promoter, dropped out of college, second semester, senior year, I have eight credits left to this day. I went to Hunter in Manhattan, a small school in\r\n\r\n\r\nNikolas Hulewsky (13:54.813)\r\ngood.\r\n\r\n\r\nNikolas Hulewsky (14:02.543)\r\nWhere were you going to school?\r\n\r\n\r\nJames Camp (14:07.192)\r\nBut I mean, I'd come from this very educated, albeit not wealthy, very educated family. My mom went to Harvard, my dad went to Yale. I actually think that was the reason that pushed me a lot towards entrepreneurship was I realized that education was not the way to make lots of money. And I was always worried about money growing up. So anyway, I digress. But yeah, that was my first thing. We sold that little business, sold that little affiliate network to another network called Empire Media. And it was small. was like,\r\n\r\n\r\nNikolas Hulewsky (14:14.585)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (14:26.585)\r\nNo, I...\r\n\r\n\r\nJames Camp (14:35.758)\r\n60 grand, just put it two ways, pay taxes. But I thought I was like a god, you know what I mean? I thought I was like the coolest.\r\n\r\n\r\nNikolas Hulewsky (14:39.875)\r\nWell, think a lot of times we think that entrepreneurship or getting into entrepreneurship has to be this grand plan. All right, I have the skill set. This is what I'm going to do. mean, that's how I like approach things. But there's many other instances where it's kind of just this series of events that makes sense. Like one thing led to another led to another led to another. And then five years later, I'm in a nightclub getting paid to promote it. You know what I mean? Like it's not like you\r\n\r\n\r\nJames Camp (15:04.814)\r\nYeah, yeah, yeah. mean, by the way, then when I left the nightclub world, which I've ran away from so fast at 26 and like, I remember my resume, I got an opportunity to like help launch an SVOD subscription video on demand channel for Lions Gate called Tribeca Shortlist. And I remember like putting on my resume, I mean, I don't have a resume now. It's been forever since I resume. I remember putting my resume, like, oh, marketing for Tal Group and Butter Group, you know what mean? Like, they're like, no, I was texting girls and selling bottles. I mean, it was not, it was a very different kind of\r\n\r\n\r\nNikolas Hulewsky (15:28.759)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nJames Camp (15:33.454)\r\nI mean marketing than other stuff.\r\n\r\n\r\nNikolas Hulewsky (15:36.835)\r\nWell, so I'm in a similar boat. barely graduated high school. And before I met my wife, I went to community college and just dicked around, like took tennis classes. I had like five F's on my transcripts and somehow the only reason I went to UCLA to get my MBA was because both of my brothers are Oxford educated lawyers and I just felt like the freaking black sheep of the family. So I'm like, I should probably get an MBA from somewhere. I...\r\n\r\n\r\nJames Camp (15:45.123)\r\nThere we go.\r\n\r\n\r\nBeautiful. And now you made it.\r\n\r\n\r\nJames Camp (16:02.882)\r\nI mean, I got two sisters both with walls of degrees and I do not have a bachelor's. I know because when I was, I mean, I'll tell the story now because it doesn't matter. When I sold DMO in 2020, I was like tired of the ride. was, you know, I mean, I had some money, but I was like tired of this. I mean, I think that like that's where I paid myself $2,000 a month for the first two years living in my ex-girlfriend's studio with her. I mean, it was a grind in the beginning.\r\n\r\n\r\nNikolas Hulewsky (16:29.433)\r\nCheers.\r\n\r\n\r\nJames Camp (16:30.233)\r\nin Manhattan. mean, $2,000 a month in New York City is nothing. You know, taking my laundry to my mom's house so I could get it done. I mean, Cry Me A River, whatever. And I mean, it's like I couldn't eat, you know, like I wasn't someone like that. But, you know, please, just go ahead. No, okay, well, that was gonna say, think that like, oh yeah, so when I sold the company, my sister introduced me to some people. I was talking to these guys that run a practice at McKinsey called Leap.\r\n\r\n\r\nNikolas Hulewsky (16:44.344)\r\nHere's my... sorry, finish your thought. No?\r\n\r\n\r\nJames Camp (16:57.742)\r\nwhich is like they're basically build startups inside bigger companies. I they may have built a Domino's app. think they built Marcus for Goldman. Like they basically build these startups underneath the umbrella of these massive. Yes, exactly. It's a great way to put it. And Ari was the senior partner who ran that practice. And he was like, dude, why don't you come work at this practice? And I was like, dude, I don't want to be an analyst in McKinsey. It wasn't the vibe for me. Cause I watched people go through that.\r\n\r\n\r\nNikolas Hulewsky (17:07.919)\r\nThey're like an outsourced incubator within these companies.\r\n\r\n\r\nJames Camp (17:26.478)\r\nHe was like, no, would you do an AP role, right? Associate partner role. was like, I would do an AP role, know, start the base is like 450. You know what I mean? Like all of sudden, you know, and I know people who are partners and senior partners. I thought maybe I could go that route.\r\n\r\n\r\nNikolas Hulewsky (17:37.839)\r\nDid you say you're like AP? I don't know if I have a penis or not. just.\r\n\r\n\r\nJames Camp (17:42.478)\r\nI did it. I did. I didn't. didn't. should have. should have. But the way that connects is fourth round of interviews. Everyone's like, dude, you don't have to run a case. All the senior partners love you. Fourth round of interviews, filling out a GDPR compliance thing. And it says, what is your highest level of education? And I said, high school, because that's it. And so then I emailed the recruiter and I said, hey, just want to flag this for you, know, consultant speak. I want to flag this for you.\r\n\r\n\r\nNikolas Hulewsky (17:47.023)\r\nSorry, sorry.\r\n\r\n\r\nNikolas Hulewsky (18:09.108)\r\nman.\r\n\r\n\r\nJames Camp (18:10.35)\r\nI didn't actually graduate college. My resume says I went to college for four years. It does not say I have a bachelor's. It says Hunter College, media major these four years. It's true. I just ended up not graduating. She goes, don't think it'll be a problem. I get an email a day later and I'm really sorry. I don't think it's going to be a fit. Some of the senior partners don't want to take a risk on you. And of course I was so sassy about it. I was like, well, obviously if Mark Zuckerberg or Bill Gates came up in here and want to be an associate partner McKinsey, you wouldn't really worry about how many degrees they had. Anyway, so it wasn't a fit. Thank God.\r\n\r\n\r\nNikolas Hulewsky (18:22.607)\r\nfamous last words.\r\n\r\n\r\nJames Camp (18:39.539)\r\nit wasn't, but now I've now I've been ranting. I apologize.\r\n\r\n\r\nNikolas Hulewsky (18:41.081)\r\nyou. No, that's awesome. I think what's really interesting about your background, your history is like, you've, I don't know this is a thesis that I've actually formulated, but it's something that hearing you talk makes me think like there are tech companies where you're developing a product, an app, something for people to use. And then there's a lot of tech companies, I guess tech is the word e commerce companies.\r\n\r\n\r\nthat are just really good at capturing and finding attention. Whether that's social media where you're like, I have views and I have a distribution channel, or it's like, I figured out how to do the customer acquisition. like, that is like the driving thesis for these businesses. Cause like what I'm hearing you say is, we figured out this was our cost per lead and this, we also figured out this really cool channel, et cetera. Is that been a constant theme for you? It's like, I figured out the distribution almost first.\r\n\r\n\r\nJames Camp (19:11.928)\r\nSure.\r\n\r\n\r\nJames Camp (19:35.63)\r\nYeah, I mean, think from here on out, I kind of only want to sell into what I call latent demand, right? But I think that like, I think that people get afraid of competition when competition just implies there's latent demand, right? Like if there's a bunch of competitors, it says to me there is demand that is sitting there looking to, you know, to buy said product. To answer your question, yes. B, I sort of believe that we can, there is not a single business on the planet that through following the right steps, a little bit of luck.\r\n\r\n\r\nBut like get into a couple million dollars a year is not, I don't want to like downplay the difficulty of it, but it's also not impossible, right? Like there's no industry or niche that it's not possible to get to like a million or $2 million a year.\r\n\r\n\r\nNikolas Hulewsky (20:17.827)\r\nYeah, it's a pretty replicable blueprint that you follow and you can get to that number.\r\n\r\n\r\nJames Camp (20:21.198)\r\nYeah, 10, 20, 50, 100, I can't promise that. know, one or two for sure. mean, before we started recording, told you, you know, I've seen people doing handstand courses, doing $70,000 a month on how to do a handstand. You know, I think it's people are sort of underestimating distribution, right? And underestimating just figuring out CAC versus LTV, right? Like your cost to acquire a customer versus the lifetime value of said customer.\r\n\r\n\r\nNikolas Hulewsky (20:47.567)\r\nI worked in healthcare. I did not know what CAC or LTV was until I got on Twitter, like genuinely. Yeah, yeah. Because I mean, just, this is going to sound weird to say. There's like, there's so much demand that you almost don't need to worry about your CAC or your LTV.\r\n\r\n\r\nJames Camp (20:52.726)\r\nInteresting.\r\n\r\n\r\nJames Camp (21:03.234)\r\nSure. Well, there's a weird, when I, this is in the, when I sold DMO as part of that sale, became an SVP of a telemedicine company for a little bit. It was very weird, but you start learning about like PBMs and it's like this very, it's co, it's a crazy industry in which money is like abundant. you know what mean? Like in certain regards and like adjudications and market, it's just like,\r\n\r\n\r\nNikolas Hulewsky (21:18.191)\r\nMm-hmm. It's crazy.\r\n\r\n\r\nJames Camp (21:31.382)\r\nIt's a wild space. so, yeah.\r\n\r\n\r\nNikolas Hulewsky (21:33.869)\r\nYeah. So like what I think is crazy, I'm not a big venture investor. I don't have any venture investments, but one of the sayings that I've heard as I've been learning about it is like first time founders focus on product. Second time founders focus on distribution because they realize how hard it is to get that product to market. And I don't know if you probably know this 50 % of all VC money ends up being spent on Google or Facebook. They're acquiring customers. That's it. Like it's CAC. It's customer acquisition costs.\r\n\r\n\r\nJames Camp (21:56.974)\r\nYeah, it's crazy.\r\n\r\n\r\nNikolas Hulewsky (22:02.511)\r\nAnd that blows my freaking mind that we don't talk more about distribution or that, James is an influencer. Wow. Why is he on this channel, et cetera, et cetera. It's like, yeah. And his brand is probably worth 10 X what you would, what you think it's worth.\r\n\r\n\r\nJames Camp (22:17.442)\r\nDude, I mean, we bought Blue Angels Hearing through a DM on Twitter. You know what mean? Like that's, you know, that came from a consulting agreement with someone that wanted like help with convert, you know, and then I looked at their business and was like, dude, I want to roll up a bunch of businesses and eventually we'll take them public. You know, you know, that was the idea I had. mean, dude, I'll talk about all of that now with Blue Angels Hearing. I mean, we were in talks with, I won't say which bank, but with a small investment bank that was like, we were trying to comp out Blue Angels.\r\n\r\n\r\nNikolas Hulewsky (22:26.127)\r\nCheers.\r\n\r\n\r\nJames Camp (22:45.282)\r\nto Eargo on the Nise. Eargo on the Nise trades at the time was trading at a 40X price to sales.\r\n\r\n\r\nNikolas Hulewsky (22:50.871)\r\nsorry what you're going the hoozy\r\n\r\n\r\nJames Camp (22:52.59)\r\nErgo was a hearing aid company on the New York Stock Exchange. And so they were trading it on the NYSE, the NYSE, the New York Stock Exchange.\r\n\r\n\r\nNikolas Hulewsky (22:54.927)\r\nOkay, okay. You say, nicey.\r\n\r\n\r\nWhat? It's not the niece? Am I crazy?\r\n\r\n\r\nJames Camp (23:03.506)\r\nI've never heard the nice. Is it the nice? Maybe it's a nice. I want to hear I've been saying nice for like 10 years. maybe it's Nice sounds great. But it's if they wanted to come, they were like, willing to come out to another hearing aid company on New York Stock Exchange, which are trading at a 40x price to sales, right? So they were like, Okay, you guys are new 3 million this year. You know, we're going to say to\r\n\r\n\r\nNikolas Hulewsky (23:05.539)\r\nI've never heard the Nizi. This is great. I cannot wait to hear what people say. like this.\r\n\r\n\r\nJames Camp (23:31.47)\r\nclients that you're $100 million, $120 million company and we're going to go sell $20 million of stock at, you know, at a $80 million valuation, you know, saying that it's below mark, you know. Um, and so I don't even know how I got to that story, but my point is like, I guess my point is that bankers would just make money in any market, but there was a reason I was bringing that up for a reason. I, yeah. How'd I that deal? I I found that deal through a Twitter DM, you know I mean? Like distribution is king. I think that like anyone,\r\n\r\n\r\nNikolas Hulewsky (23:52.111)\r\nDistribution, how you found that deal.\r\n\r\n\r\nJames Camp (24:00.974)\r\nHere's the other thing I've also sold now a good amount of like advisory and courses. And here's, here's the funny part about all of this. And so you'll see, I told you, I love nation industries. Everyone like hates on core sellers. Oh, of course we lose or we can't sell make ask anyone who's built a real business, how hard that is. And then all of a sudden it has a little bit of a distribution and, then say, Oh, by the way, you could go make an extra $300,000. You're selling your sawdust on the side.\r\n\r\n\r\nYou would be, what kind of ego do you have to say that's a tear? No, you like as an entrepreneur, I look for competitive advantages, right? That's just, look for opportunities that other people don't have. I happen to have that opportunity. So why.\r\n\r\n\r\nNikolas Hulewsky (24:43.055)\r\nI can't freaking agree with you. Dude, I 100 % agree. You know how hard it is to run an eight figure business or even build it to that scale? And like for me in healthcare, I didn't have a million dollars per employee. Like I wasn't Google and so I like, oh, I'm doing $12 million this year and I've only got 12 employees. No, I had 250 employees because I had CNAs and nurses and doctors and physical therapists and I had to manage all those people. It's freaking hard to manage that many people and have that stress. And so yeah, if I'm sitting here looking and I'm like,\r\n\r\n\r\nJames Camp (25:01.613)\r\nYeah.\r\n\r\n\r\nJames Camp (25:05.39)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (25:12.813)\r\nI get why that guy's selling a course. don't knock him. I don't look down on him or her.\r\n\r\n\r\nJames Camp (25:16.192)\r\nA hundred percent. I think, I think one thing I've thought about, one reason I've shied away from it is because I've probably been talking about where I want to go next in my life. And, you know, I've had a lot of conversations about raising a small fund. I just sound so crappy, but two and 20 and $5 million sounds like a really poorly played hobby to me. I'm not really interested in that. And I don't think I've had enough wins for people to blank check me 50, right? Which is where the word starts becoming interesting. probably syndicate some stuff. look at doing that, but.\r\n\r\n\r\nUm, I had been afraid of being, having the personal brand, um, earlier on because of a lot of the world, I know where I felt that certain people were like, you know, that's cheesy. Why would you ever do that? I don't want to invest. I don't want to raise invest in that guy. He's cheesy. And then I realized that like, it's about being polarizing. Great marketing is about being polarizing. Hate or love Trump. Trump does well because he's incredibly polarizing. You know, I can break down funnels for you to show you where it's like,\r\n\r\n\r\nsurvival kits, when it's like the intro says, you know, the ad copy says fellow patriots, it says fellow patriots on purpose, because it wants to push liberals as far away from that funnel as possible, because it doesn't think they're going to buy. Right. And so in terms of me raising capital or doing a bigger deal in the future, I was afraid the problem is I'm trying to appease everybody. But screw it, lean into content, lean into personal brand, because yes, you will lose someone who says I don't want to write a check to that guy who's making videos on the internet.\r\n\r\n\r\nBut you're also gonna find someone that says, I wanna write a check to that guy who's making videos on the internet because I think he understands the future and distribution. And he's trying to build business models in a way that couldn't be built 10, 20, 30, 50 years ago.\r\n\r\n\r\nNikolas Hulewsky (26:55.791)\r\nYeah. Yeah. I mean, if you think about it, the stronger that people are repelled by somebody, there are people who are equally as attracted to that person. There's a balancing act to it, right? And so if you take a stake and you take a stand for something, you can attract a lot of hate, but you can also attract people who are very serious about that industry.\r\n\r\n\r\nJames Camp (27:18.414)\r\n100%, 100%. I think that's true about everything, right? mean, we can talk about dating, right? Like if you try and, know, if you're like really into online gaming or you're really into fitness, like those are both things that might turn off someone that's not into either of them. But if you lean into that, maybe you end up with a partner that loves that thing, right? Like, and what a beautiful partner, you know?\r\n\r\n\r\nNikolas Hulewsky (27:40.033)\r\nIsn't that the point? Like, and isn't that the point to be doing the thing that you enjoy? Yeah.\r\n\r\n\r\nJames Camp (27:42.742)\r\nIsn't that the point to be able to be you and be happy with being who you are? And so I feel that way about marketing and business as well.\r\n\r\n\r\nNikolas Hulewsky (27:48.377)\r\nSo I'm curious about this because I'm in a similar situation where I've sold these companies. And the whole reason that I got into content was because I didn't know what I wanted to do next. I was a little bit burnt out. I had been myopic about focusing on those companies. Then I sold and it was like, well, what's CAC? I never heard of that before. Let me do some research. for me, there are tons of opportunities. I could go raise money. I could go run a fund. Running a fund doesn't sound super interesting to me because I know what it would take.\r\n\r\n\r\nget to the $100 million. I know how hard it would be to roll these businesses up. I'm not saying I'll never do it. I'm just like right now in my life, there are some things that I want to be here for my kids when they have sports. How are you thinking about the next step? What are your parameters as you're looking at your next swing?\r\n\r\n\r\nJames Camp (28:32.526)\r\nSo I mean, to get super specific, I need a business that adds, I need some sort of venture on 36 that by like 50, adds 50 to a hundred million dollars in equity to me. mean, these are like, because I think that for me, probably 20 to 30 ends up being what I would consider true escape velocity in the U S today. Accounting for inflation that probably goes up a little bit over the next 15 years. Um, you know, and\r\n\r\n\r\nNikolas Hulewsky (28:43.556)\r\nWhy?\r\n\r\n\r\nJames Camp (29:00.526)\r\nAnd I would like to take home, this is gonna sound, I almost don't wanna say this, because it sounds so jaded, but I don't need it today. But in the future, probably two million pre-tax a year. And that's because I live in Southern California, live in LA. So it's a million in take home. And anyone who's listening to this that's gonna write me a check will recognize what actually having two or three kids in private school in LA might look like. You know what I mean? And living a decent life. And that's probably a million dollar view.\r\n\r\n\r\nNikolas Hulewsky (29:24.591)\r\nI think there's two things that you said that I have an immediate reaction to. The first thing is, I think it's hard to understand how much money $50 million is until you have it. I also think it's hard to imagine for most people how little money a couple million dollars is until you have it. And I know that sounds really weird to say, but it's like, it's...\r\n\r\n\r\nJames Camp (29:37.208)\r\nSure, which I don't.\r\n\r\n\r\nJames Camp (29:45.652)\r\ndude.\r\n\r\n\r\nJames Camp (29:50.282)\r\nNo, no, I think I tweeted something two weeks ago or three weeks ago that was like a million dollars is both a lot of money and a very little bit of money at the exact same time. And it really is true. And I was having a conversation with a Brandeis advise that was like talking about if they could get an exit versus, and I was like, you know, because it's run by these two people, they're awesome. You know, they're going to do mid six, mid seven figures this year, but take home like a hundred on it each. You know I mean? Like after\r\n\r\n\r\nThat's Ecom. Everyone thinks Ecom is this cash flowing machine. DTC is very hard and much more marginal than people think. I should keep money in the business because you have to order inventory. Right. So maybe they make 150 each on it. Right. You know, they do two and a half million. They make 150 each on it, you know? And I was like, what if you could each get a million dollars out of that? What if you could each get like, let's say I was given the example of a hundred thousand each. I was like, what if you could each get a, what if you get a $10 million exit out of this business?\r\n\r\n\r\nNikolas Hulewsky (30:21.955)\r\nYeah, definitely not anymore.\r\n\r\n\r\nJames Camp (30:43.68)\r\nin five years as opposed to trying to go for a hundred million dollar exit. They're like, I wouldn't take it. I was like, you do recognize that you, they each made more like 50 this year, right? 10 million dollar exit is 200 years of the labor that you put in this year. Right? Like, I want you to think of it that way. It is 200 years of your time. Like it's such an astronomical amount of money, you know?\r\n\r\n\r\nNikolas Hulewsky (31:06.403)\r\nDude.\r\n\r\n\r\nI think about this all the time because have you ever seen the articles where it's like, if I would have invested $10,000 in Amazon in 1997, it would be worth $400 million today. I'd have $400 million. Or like, oh man, I had shares in Nvidia 10 years ago, but I sold them and they'd be worth $100 million today. And I always say this to people, like, you wouldn't have $100 million today. No, but I would, I had shares, or if I had bought it, I would have. Like, no, you wouldn't have.\r\n\r\n\r\nJames Camp (31:19.63)\r\nSure, sure.\r\n\r\n\r\nNikolas Hulewsky (31:37.807)\r\nyou would have sold the first time that it doubled or tripled or what happened when it 10x what happens when you put $10,000 in and all of sudden you're sitting and you're looking at your brokerage account and it's a hundred thousand or it gets to a hundred thousand and then it draws down to 50 and then it gets back to the hundred thousand which all happened with amazon and you're like i should probably take some risk off the table to have the conviction to hold for that long of a period of time is insane i think that like less than one percent of people have that personality trait where they can just\r\n\r\n\r\nLet it ride.\r\n\r\n\r\nJames Camp (32:08.942)\r\n100%. In fact, this is where I think that illiquidity becomes your friend. think this is why real estate makes people rich in general in the US is because it's illiquid. That is why it is the best store value for the average Joe is because you cannot just grab a chunk of your wall and go buy a sandwich with it when you want to. It's just because you're locked up. It's just because you're locked up into a contract where you don't really own your house for 30 years. And that's why I think\r\n\r\n\r\nNikolas Hulewsky (32:18.112)\r\nMmm, because you can't.\r\n\r\n\r\nNikolas Hulewsky (32:27.673)\r\nHmm. That's really interesting.\r\n\r\n\r\nJames Camp (32:38.552)\r\nthat it works out for most people. yeah.\r\n\r\n\r\nNikolas Hulewsky (32:40.111)\r\nFor me, I had done the calculation 10 years ago. With inflation, I need $5 million when I retire. And that was the calculation that I did. And so when I sold my businesses, was cool. Retirement's done, taken care of. Everything at this point is gravy. And what's weird is I have felt that way. I've still felt that way. But recently, I've been like, I think I need to take another swing.\r\n\r\n\r\nJames Camp (32:59.63)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (33:09.743)\r\nLike why would I not take another swing?\r\n\r\n\r\nJames Camp (33:10.132)\r\nYeah, think you either. think the chase of money is we were talking about that before is kind of worthless, right? I mean, it's just you either enjoy the chase or you don't. I can tell you a lot of my existential lostness has been because I'm not chasing anything. I don't get me into a longer conversation about like my purpose and what I think humans need to feel my icky guy, right? And my humans need to feel happy. And especially often I think men and it's not even some misogynist thing. I think that I think very primordial like\r\n\r\n\r\nNikolas Hulewsky (33:25.839)\r\nHa\r\n\r\n\r\nJames Camp (33:35.566)\r\ncaveman-esque, like I need to chase something. Like I think that is very normal for me. I need to gather, I need to chase, you know?\r\n\r\n\r\nNikolas Hulewsky (33:39.567)\r\n100%. Dude, I have four boys. I have four boys, 10 and under. I'm not kidding you. Before I had kids, honestly believed it's not really that big of a difference between boys and girls. It's kind of all socialized, isn't it? Dude, my boys are like dogs. They need to run their energy out. I wrestle with them every single night. They literally will pull their pants down and pee in the back. They're just different. so I agree with you. Men have different needs, but they also are worse.\r\n\r\n\r\nJames Camp (33:51.704)\r\nSure.\r\n\r\n\r\nJames Camp (34:02.51)\r\nYeah\r\n\r\n\r\nNikolas Hulewsky (34:08.525)\r\nat having community and drive and socialization. so anyways, I think you need to have something that fills you up, that motivates you. And that's not just money driven. It's like, do I have a purpose in this?\r\n\r\n\r\nJames Camp (34:18.846)\r\ntotally. I mean, I love money. I don't want to change. You like I love money and I'm good at returning people money when they've invested in me before. The last time I brought everyone back 7x on their money in three years, right? Which was great. But my point is like when you ask me those numbers, it's partially because I like winning so much. money is just the scoreboard of capitalism. And we can...\r\n\r\n\r\nsay that it's not fulfilling and it's not. I'm not rich, but I've made enough money to recognize that money is not what makes me, you know, like super, I guess rich is relative, but you get my point, right? Like, and so, you know, I also know that the company that we sold, I owned like 27 % of and the, you know, what you hear, you you see someone, I was saying this to someone the other day, they're like, well, Jessica Alba owns the Honest Company. was like, how much of the Honest Company you think Jessica Alba owned at IPO?\r\n\r\n\r\nThey're like, oh, 50 % wrong, 40 % wrong, 30 % wrong, 6%, 6%, right? Which by the way, I'm surprised because I think it's like below, well, she probably was director, but like there's weird percentages in which with public companies, which you have to file if you sell, I think 599 is one of those numbers. Anyway, my point is, that like building a hundred million dollar company, it sounds great to own all of it. I don't think that's a likely scenario, right?\r\n\r\n\r\nNikolas Hulewsky (35:25.999)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (35:38.051)\r\nYou rarely do.\r\n\r\n\r\nJames Camp (35:39.054)\r\nYou rarely, rarely do. So when I talk about building a hundred million dollar company in the next 15 years, which I see as totally possible, I think about owning 30 % of it. you know I something, you know, something, you know, and by the way, that when you then exit, if you get cash, 50 % goes to the government. You know I mean? Like, and then you get 15 million, right? And so that's why those numbers exist. And for me, I've realized that my love of the chase so much, I need something to be big enough for it to be exciting for me to really keep chasing. And that's partially because\r\n\r\n\r\nNikolas Hulewsky (35:47.992)\r\nOkay.\r\n\r\n\r\nJames Camp (36:07.254)\r\nI have enough of a cushion that like if something gets boring to me, if the chase isn't exciting enough, I'm just like, whatever. You it's not so important.\r\n\r\n\r\nNikolas Hulewsky (36:15.097)\r\nSo it's interesting what you said. You would raise money. You're not looking at like, I'll buy a business and then bootstrap it to that number. You would go out and take down a larger deal.\r\n\r\n\r\nJames Camp (36:24.654)\r\nI think, yeah, I would be open to it. I think that the way I look at raising money is not venture style. You know, like I don't want to raise money from anyone who's looking at a hundred X on their money. You know what I mean? Like I think that there's, had a conversation very recently with a credit fund, that private credit fund that asked me basically if I wanted to do like a, a fund to fund, you know mean? Like run a small fund from them, which I would be open to doing just because I think I'll be a little boring, no better, more beautiful business model than\r\n\r\n\r\narbitrage money. know, I think take money from investors and lending it out for more money, you know, then you are returning to investors. It's just a beautiful business to run, right? In terms of simplicity. But yeah, think I would. think that, you know, but I'm much more, I'm a deal junkie. I get very excited by the structures of deals, you know. So like, would happily take money. I told you before we hopped into this call that like I once took six figures in personal debt with a 30 % equity kicker on my business.\r\n\r\n\r\nNikolas Hulewsky (37:13.007)\r\nSee ya.\r\n\r\n\r\nJames Camp (37:22.99)\r\nto fund a business. Like, yeah, like I'm super down to like take money, give someone preferred shares that has a certain payback period that then they turn into common stock afterward. You know what I mean? Like, I'm interested in taking money from people that five X's for them over three years and then they still own underlying equity. You know what mean? I would raise money in a much more creative deal structure, I think, than just like, you\r\n\r\n\r\nNikolas Hulewsky (37:45.155)\r\nWhat would be the profile of that business? What would it look like? What kind of offerings would it have? Revenue structures?\r\n\r\n\r\nJames Camp (37:50.862)\r\nI mean, think in general, if I, mean, you know, I'm going to eat my words. I'm sure tomorrow someone will call me and say, we should do this. And I'll think it's the best idea. But I mean, listen, if I would make big, if I were making bets over the next decade to like hedge risk, but also think that makes money, I would probably stay in managed services in the B2B world. I mean, I think that like, I think. So agencies work, marketing agencies work, IT management works. I think you want things to get enabled by AI.\r\n\r\n\r\nNikolas Hulewsky (38:10.073)\r\nTell me what that is.\r\n\r\n\r\nJames Camp (38:17.868)\r\nI think as opposed to disabled by AI things that have like a human layer on top of tech. I think that they become a little annoying to run, but I, know, if you can go up market, I think that most of like the Twitter world doesn't really recognize what upmarket offerings look like in, in B2B. mean, like $20 million engagements. mean, that's not the world I think I would play in, but you know, the step down. so yeah, I mean, we're working on, so the businesses that I have off market.so, which is.\r\n\r\n\r\ndatabase of businesses should be for sale. The additional we're adding to it is DealFlow as a service essentially for PE shops and family offices, right? So, first of all, everything goes back to being a better make. You know, so like we will do the outreach and find you businesses, package them up and bring them to you for X amount retainer a month plus a piece of the transaction at closing. So then all of a sudden I had a conversation with another friend about who just sold his business for 150 million, $200 million and was like, oh, well.\r\n\r\n\r\nNikolas Hulewsky (38:55.476)\r\nIs that why you said everything goes back to being an investment bank?\r\n\r\n\r\nJames Camp (39:15.64)\r\nthese bankers take $2 million, blah, blah, and it's all just can be done with AI. And we're like, well, if you layer that on top as a service, but then it starts to be like, why don't I just buy a broker dealer, which is an investment bank? Why don't I just have an investment bank and actually do these services myself? So it all leads back to having a\r\n\r\n\r\nNikolas Hulewsky (39:30.831)\r\nI didn't know this until, I don't know, maybe four or five years ago. I used to think investment banks were like this really cool, like they're literally making investments, almost like a hedge fund, right? I thought investment banks were hedge funds. And then I found out they're just a high-end brokerage. They're just, I mean, they're...\r\n\r\n\r\nJames Camp (39:40.578)\r\nMe too, 10 years.\r\n\r\n\r\nJames Camp (39:51.95)\r\nAnd some are not even licensed to sell securities, by the way. There's different kinds of licensing for it. Yeah, mean, and ever hear anyone talk about a BD, a broker dealer, that's an investment bank. And so some are just licensed for M &A to be able to take fees on M &A transactions. Some are licensed to sell securities. Some are licensed to manage money for the people, right? But like, there's really different kinds of licenses. You can go buy an investment bank today for $400,000. know what Someone has to have a Series 63, I think, don't hold me to the fire with this, to run it, you know?\r\n\r\n\r\nNikolas Hulewsky (39:55.778)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (40:18.829)\r\nYeah, sure. Yes, agreed. Someone's going to write me and be like, actually, an investment bank is very convoluted and whatever. But I'm like, no, you're just helping companies that are of a certain scale, probably $20 million plus. 20 million is like the very low end. 50 million is probably actually where it starts. Go to market and sell. That's your job.\r\n\r\n\r\nJames Camp (40:25.352)\r\nYeah, of course. You guys are wrong.\r\n\r\n\r\nJames Camp (40:38.862)\r\nAnd by the way, there are now basically white label broker dealers that will absolutely act as your backend for you and I to go use them for transacting in a totally compliant way. In the same way that like, know, here's an old Mercury, I think debit card, know, Mercury is a UI on top of Bankor. I mean, as almost every single...\r\n\r\n\r\nNikolas Hulewsky (41:00.983)\r\nYeah, they're not a bank.\r\n\r\n\r\nJames Camp (41:07.726)\r\nI mean, to be like an actual lending institution, like FINRA registered, and someone's going to dial in and say whatever, I'm an idiot for everything I'm saying. But I'm just saying that like, there are most of the millennial banks you see, Marcus is not a bank, Marcus sits on top of Goldman Sachs, right? Do mean like, these are just UIs on top of old institutions.\r\n\r\n\r\nNikolas Hulewsky (41:27.459)\r\nWell, it's same thing with a lot of this AI technology currently. They're just wrappers. They're not the LLM. They're a wrapper on top of.\r\n\r\n\r\nJames Camp (41:32.526)\r\nSure. Yeah. But I do think I saw someone tweeting about this, and Chris and talked about it the other day too. Everything's a rapper. And I do think that everything's a rapper. I saw someone say, venture is just a rapper on capital. It is just a rapper on capital, right? Every website is a rapper on HTML or JavaScript, right? Everything really is a rapper on something else. I'm not so, people that like super bearish on rappers, I'm not super bearish on rappers.\r\n\r\n\r\nNikolas Hulewsky (42:01.708)\r\nyeah, I'm not bearish on rappers at all.\r\n\r\n\r\nJames Camp (42:03.742)\r\nYes, everything is just, yeah, Mercury is just a wrapper on Bancorp. know what mean? I mean, in fact, one of my many failed businesses, I had a company called AristaCard. Basically, we were taking your credit card and we were copying it. We were in, I mean, we had some PR behind us, but we are, we had, tell you, I'll make it a brief story because I can clearly rant, but we had, basically, clients would come in, we'd copy your credit card, your magnetic strip, which is dangerously\r\n\r\n\r\nNikolas Hulewsky (42:17.999)\r\nShould I know that name? I feel like I should know. I feel like that's a name.\r\n\r\n\r\nJames Camp (42:33.358)\r\nsimple to copy magnetic strip by the way you can buy us oh you can buy for $30 on Amazon that will if you swipe it will take all the data off my negative strip and then write it onto a new card and this is why they almost move to chips because chips are a little bit more secure because my net of ships are not secure at all I mean people get card skimmers waiters will hold a card skimmer in their in their jacket pocket swipe your card and anyway doesn't matter\r\n\r\n\r\nNikolas Hulewsky (42:35.844)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (42:48.163)\r\ngot it, yeah, okay.\r\n\r\n\r\nJames Camp (42:58.83)\r\nSo we were basically copying your credit card, putting it onto a new metal credit card, and then attaching all these private services on top of it, like access to nightclubs and dinners and restaurants and just tickets. And so, yeah, it was New York City, yeah, 100%. That's so funny, that was my company. And we were competing with another, well, had like 500 users, it wasn't huge.\r\n\r\n\r\nNikolas Hulewsky (43:08.717)\r\nYes, yes, I remember this. Was this out of New York City?\r\n\r\n\r\nDude, yes, I totally remember this. This is your company. my gosh, it's so nice to meet you. I'm just kidding.\r\n\r\n\r\nJames Camp (43:25.614)\r\nBut we were competing with, was two competitors in the space. One of them just kept undercutting us with everything all the time. And I found, and we just couldn't, they were like giving tickets to like Taylor Swift for like $50. And we're like, how is this possible? And I just left nightlife. I was still one foot in nightclub. So I still could like make a phone call and get a table for 50 % off. You know what I mean? Get someone in a door. Every day I'm like calling everyone like this, this, this. And we found out that the owner of the competitor later on, after we had to close up shop was Billy McFarland.\r\n\r\n\r\nwho started Fire Festival, which went out of business because from fraud. And we found out through articles that he just was not ever giving people the tickets that he was saying were $50 for Taylor Swift tickets and stuff.\r\n\r\n\r\nNikolas Hulewsky (44:02.639)\r\nOkay, this is where I heard of you from then. like, on the Billy McFarlane documentary and then like doing more research on him, I saw you as one of his competitors. That's what that was. That's so funny, dude.\r\n\r\n\r\nJames Camp (44:13.07)\r\nThere we go. So at least I know we were competing against a fraudster. But my point is to connect it, is that we were just a wrapper, right? Like we were not, you know, we were actually not, the idea was to track spending and then be able to go to an institution later on and be like, we've got 10,000 members that spend here, here, You can underwrite them for, you know, they'll move to wherever we want them to move to. That was the plan. It didn't end up working. We had to go to business. But my point is like, that was just a wrapper. I mean, we were just a metal card from China. You know what mean? That we got engraved in the US and\r\n\r\n\r\nNikolas Hulewsky (44:26.639)\r\nMm-hmm.\r\n\r\n\r\nJames Camp (44:41.806)\r\nWe would just copy, know, that everything's a wrapper is my point. So I do.\r\n\r\n\r\nNikolas Hulewsky (44:45.179)\r\ndude, this has been amazing. want to know 2025. What am I, what am I supposed to expect from James camp this year? It feels like, it feels like there's some good stuff cooking.\r\n\r\n\r\nJames Camp (44:53.838)\r\ngreat question. So we're going to keep running everything we're running, all this little portfolio till end of Q1. mean, this is just super candid. End of Q1, it's in right here in my huge fan of Spark planners. It to be called something else, it's my Spark planner. And Appropel like equities markets is a type of order type called like a filler kill. It's not really...\r\n\r\n\r\nretailers would do it, you know, someone could execute a filler killer. So I like you either get filled or you kill it. So basically what I've decided is that I've spread, I've spent too much of my time spread apart on these little things that none are scaling and they're all cute and they're all fun. like that filler kill and if Q1 either off market leans into this. And by the way, there's a, we'll say, I don't want to talk about it here, but there's a proposal I sent out yesterday to a financial institution that I think I may become involved with, but.\r\n\r\n\r\nFiller kill. All these little projects get filter kill and a Q1. Either some become takeoff and they do well or they get killed. I don't mean to go to zero. I mean, I will find a buyer for all of them, whether it's $5,000 or $500,000. But, and then find something to go 100 % all in on again. But you'll see more content from me because I want to get back into the content game. It's you and I were talking about too much consumption last year, not enough production. And yeah, a little bit more existential. What is next?\r\n\r\n\r\nI'm 30. Someone said this to me the other day, because I think of myself as a baby at 36, despite how gray I am. And they were like, dude, you're just having a midlife crisis. And I was like, is that what this is? know? They're like, yeah, dude, you're just having a midlife crisis. So we'll figure out. That's true. That's true. Hopefully, hopefully it gets solved now. But yeah, I wish I had a better answer for you. But just more of this.\r\n\r\n\r\nNikolas Hulewsky (46:30.959)\r\nBetter to have it now than when you're 45, man.\r\n\r\n\r\nNikolas Hulewsky (46:38.093)\r\nWhat? No, we're on the same. Dude, we're on the same page. My this this year, the year of focus. That's literally that's like that's the motto this year, the year of focus. So I'm like just dialing it in getting focused. All right, dude, this was this was amazing. I'm going to stop it here. Stay on for a second.",
  "metadata": {
    "duration": "",
    "date": "2025-02-12",
    "platform_source": "Google Drive"
  }
}