{
  "episode_number": "240",
  "episode_title": "OpenAI Just Changed Everything! Sora 2 Breakdown with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:00.89)\r\nOkay, Liz, I've been giddy as a schoolboy. I can't wait. I couldn't wait to talk to you. And so I said, let's talk early this week. And so we're talking this week because some massive changes have happened. Open AI has just kind of flooded the zone. They've released Sora 2, which is this new image video generating software. Like it's insane. They've also released chat GPT five and they've released this thing called, what is it updates? Not updates pulse pulse. Yeah. so the first thing that I want to do,\r\n\r\n\r\nElizabeth Knopf (00:26.318)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (00:30.578)\r\nThe first thing I want to do is talk about Sora 2 because I do think the technology is insane, but the way that they've rolled it out is even more insane. And so I'm going to start by sharing my screen. you ready? Okay. I just saw this and the second I saw it, I said, I know for a fact, I need to have this played.\r\n\r\n\r\nElizabeth Knopf (00:43.02)\r\nYeah, I'm ready.\r\n\r\n\r\nElizabeth Knopf (01:02.99)\r\nI don't think the sound's on, I don't know if... No. No.\r\n\r\n\r\nNikolas Hulewsky (01:05.381)\r\nThe sound's not on? You can't hear it? I'm so pissed. Okay, so I'll just talk about it as we're watching. I'm watching this video and this is Liz. She's in front of a whiteboard and she's talking about how to automate yourself. The crazy thing is, Liz, is this you? Did you film this?\r\n\r\n\r\nElizabeth Knopf (01:29.26)\r\nI mean, I guess me, it's the digital clone of me, but I did not film that.\r\n\r\n\r\nNikolas Hulewsky (01:33.83)\r\nLike, this is insane. It's you standing in front of a whiteboard and you're talking about the importance of automation, but this is not you. Everyone's kind of freaking out about it. It's invite only, which we'll talk about in a second, but let me just show you kind of the way that it works. You come in here, you go to Sora, and what you do is you create a cameo. So if you see this, this is me, this was my cameo. This is what I recorded, and I recorded some numbers and I like messed around with my facial expressions.\r\n\r\n\r\nElizabeth Knopf (01:42.392)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (02:02.704)\r\nAnd then from that, I was able to generate some of these videos. Like this is me at a sporting event saying how excited I am and then cheering like that looks like me. Off like five seconds of video. It's a little it's a little heavier than I actually am. But look at that. I'm at a soccer game and I'm cheering because they just scored a goal. I have another one. This is my favorite one. I'm I'm looking into the camera and apparently I'm saying, is Sorg going to kill TikTok and content creators?\r\n\r\n\r\nElizabeth Knopf (02:16.962)\r\nYeah, that is.\r\n\r\n\r\nNikolas Hulewsky (02:33.202)\r\nI even have one with my best friend, Chris. We're sitting here talking with each other and the, the prompt is Chris and Nick are hanging out with each other, but subtly trying to one up each other and said, our whole conversation is us trying to one up each other. And then the cool part is if you make your cameo, like your profile public, other people can make remixes of your cameo. So for example, Liz has generated a bunch of cameos of her and I podcasting together.\r\n\r\n\r\nLook this. We've never actually, we've never been in the same room, but this is us apparently podcasting together.\r\n\r\n\r\nElizabeth Knopf (03:08.374)\r\nI thought we were doing that Matrix scene last week. You forgot about that, clearly.\r\n\r\n\r\nNikolas Hulewsky (03:12.156)\r\nhuh. Yeah, I forgot about us filming it. this is like, it's insane. It's insane. I don't I don't know what else to say about it, Liz. The video quality is incredible. The speed with which you can actually generate something is is nuts. I'm kind of speechless. What do think?\r\n\r\n\r\nElizabeth Knopf (03:33.538)\r\nYeah, I mean, I think you sort of hit on a few things that people always under appreciate. So number one, just you have to basically take that video for like less than 30 seconds. It's not even cameos, like not even 30 seconds of a setup process. And it's like you've done this previously with HeyGen, which is another tool that is the AI clones. were sort of the first ones to really build that out. But the fact that from a consumer angle,\r\n\r\n\r\nthe adoption is going to be so much greater because you don't have to spend much time in the setup process.\r\n\r\n\r\nNikolas Hulewsky (04:06.994)\r\nWell, the thing with Hey Jen, I don't know if you've messed with Hey Jen, I think that you have. I uploaded like hours of my podcast video. And so it took hours of my podcast video and it's got a pretty good avatar, but it's still a little bit off. This is not off and I recorded for five seconds. Now, if you're gonna go and create a cameo, you know, pro tip, it actually says if you click on the tips to speak,\r\n\r\n\r\nElizabeth Knopf (04:10.072)\r\nFire.\r\n\r\n\r\nExactly. Yeah.\r\n\r\n\r\nElizabeth Knopf (04:26.326)\r\nYes, yes.\r\n\r\n\r\nNikolas Hulewsky (04:35.772)\r\nfor the full five seconds. When you do it, this window pops up and it says, read these numbers. And so some people just read, don't know, did you read just the numbers or did you say something more?\r\n\r\n\r\nElizabeth Knopf (04:45.176)\r\nI did the numbers, my audio got screwed up initially, so I had to go back and redo it. So these are good.\r\n\r\n\r\nNikolas Hulewsky (04:47.748)\r\nOkay. Okay, so, so don't just read the numbers, like actually say something else, like have something else scripted to say. And then on top of that make facial expressions. So like, smiles, angry, surprise sad. So I did that in this like five second window. And I feel like it did a really good job of capturing, at least in one of the videos, what I look like, and what I sound like in five seconds. Hey, Jen takes hours. This was like a five second.\r\n\r\n\r\nElizabeth Knopf (05:15.309)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:18.13)\r\nyou know, I don't even know what exercise for me to actually get a really good cloning myself. So that that part was crazy. What do you think? What do think of the rollout?\r\n\r\n\r\nElizabeth Knopf (05:29.303)\r\nI mean...\r\n\r\n\r\nAgain, I think they have just nailed product every step of the way. And again, people under appreciate this, but it is one of the basic, the things that make or break a company. the adoption of it is, think it'd be dramatic. Um, I was looking for it in the app store. It isn't necessarily like the top yet. And surprisingly Gemini is probably number one, at least on my, uh, app store list. But what's interesting that they did is they pulled out some old tricks.\r\n\r\n\r\nthat always work, which is they put a velvet rope and had invitation codes. And because of the viral nature of the content, they had people putting it out and they use Sam Altman and some of their team basically rolled out some clips and said, if you want an invite code, you know, comment. And then of course that then makes their posts viral. And then people get, you know, five invite codes to then share with their friends. So, and then so forth. So like they just nailed the rollout of this app because again,\r\n\r\n\r\nNikolas Hulewsky (06:01.65)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (06:29.966)\r\nIt's not just like adding it on as a feature within chat GPT. I mean, you can go there, but really what they're going for are downloads. so, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (06:37.446)\r\nWell, and Sam Altman is all over this thing. Look at a video of Sam here. We've got a video Sam here. We've got just video after video of him. apparently he's on stage. Wow, he looks like he's a fitness instructor.\r\n\r\n\r\nElizabeth Knopf (06:54.286)\r\nAnd that's huge and going to this whole concept of like founder marketing and, you know, personal branding and stuff is because he used himself as a person in the content that then people can remix and make. so that viral element around it just again, is just making this explode.\r\n\r\n\r\nNikolas Hulewsky (07:00.594)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (07:12.604)\r\nThat's, yeah, and that, well, that's what's crazy about it is you can't post videos on this from like your camera roll. The videos that you're looking at on here are AI generated. And so you take whatever, a few minutes to create your cameo, your bio, whatever you want to call it, your avatar. And then you can prompt the system to actually make a video. So I could come here and I could say, all right, I want to make a video with me. I want to make a video with Liz.\r\n\r\n\r\nAnd I want us to be podcasting.\r\n\r\n\r\nat the beach with Sam Altman. right. And that is what is now gonna create the video. I didn't upload a video of myself and have it augmented, which I'm sure that will come at some point, but all the videos that you see here are all AI generated. it's a totally new form of social media consumption. You have Instagram, which is like picture.\r\n\r\n\r\nThen you have maybe Facebook, which was written at first, but it's written and picture. You've got Twitter, which is written. You got YouTube, which is video first. This is content that is all AI generated. It's not actually video of you. And that to me, that's very different. And so that in and of itself is it is a genius way to roll out this new technology by supercharging it with the social and organic element of it. Like like you said, the invite only. And I can't believe Google missed on this.\r\n\r\n\r\nElizabeth Knopf (08:42.446)\r\nYeah. Well, and I actually think the ones that are trying to compete with here is even in a way meta because I don't know if you remember a few months back.\r\n\r\n\r\nMeta had sort of pulled out this, like, you could do pictures and remix images and some, clips and things, and they were trying to have it as a feed with a social element to it. And these guys are doing that, which, Gemini and Google haven't done at all, but Meta is only the one that sort of, like, played footsie with this concept of AI and having a social layer on top of it. And so, again, no one's nailed this, and who knows if this will actually be a thing.\r\n\r\n\r\nfrom a social angle or if people will just again just take the stuff and put it on the existing social media form platforms but I know like at some point we're gonna see an AI social media app so I don't know\r\n\r\n\r\nNikolas Hulewsky (09:34.946)\r\nHere's why I think it's genius. Like number one, you introduce an element of scarcity. Anytime you introduce an element of scarcity in marketing, like there's just this, oh, what's going on? We saw this with Google. That's how Google got started. I don't know if you remember in 2003, four or five, like you had to get an invite from somebody in order to get a Gmail account. And it was like the cool thing. Facebook was the same way. You had to be on a college campus in order to get access to Facebook. You had to be a college student. You had to get an invite to it. So they've now introduced this element of scarcity.\r\n\r\n\r\nElizabeth Knopf (09:41.26)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (10:03.504)\r\ninteresting in and of itself. But then you add the social element onto it. For the most part, many of these tools that come out, it's like, there's agent mode. Claude now has Claude code. The vast majority of users might go on and use it for five seconds and think like, that was pretty cool or neat. Now what they've done with this though is they've introduced novelty and social interaction, which allows them to hopefully keep customers sticky. Like they're going to be using it a lot more.\r\n\r\n\r\nI don't know if anyone's ever done something like this before where they like introduce a new product. But it's almost like the social platform is secondary to it. I've seen where the social platform is primary and then maybe there's a new product that's secondary, but the social platform being secondary is new to me. I've never seen it. What about you?\r\n\r\n\r\nElizabeth Knopf (10:53.454)\r\nI mean, I think there are some apps, like I'm trying to think what comes to mind. There's some that have like viral loops that create a social dynamic.\r\n\r\n\r\nBut again, we're in sort of like just new territory because AI and the ability to create content so quickly is a new thing. So, I mean, there are again, these sort of social viral loops that exists in product launches and app launches where you just add in a social component, whether it's like, you know, sharing your stats for fitness or whatever. But again, nothing where we've seen this in the AI era. So.\r\n\r\n\r\nNikolas Hulewsky (11:14.972)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (11:30.54)\r\nand the last thing to like kind of close the loop on this is what's the use case for this? Like, like this image generation, this video generation, why would anyone use this? If you're a business owner.\r\n\r\n\r\nElizabeth Knopf (11:43.478)\r\nYeah, so I mean, yeah, we've sort of touched on this, I think, every time with Nano Banana and some of the other ones and every time there's this cool new thing. At some point, it's gonna be, again, ads, influencers, social media marketing, or just content creation for videos, for sharing like...\r\n\r\n\r\nhere's my product, here are my features, benefits, know, doing sort of informational things. You could make your training internally more human, or I shouldn't say human-like, but sort of, because you probably didn't have video SOP or something. Yeah.\r\n\r\n\r\nNikolas Hulewsky (12:17.33)\r\nWell, here's the point that I'm making is like, we have to do sort of mental gymnastics to think of any other use case beyond marketing. In my opinion, what Sam just did with this is he said, I'm not worried about your use case of marketing. I'm now turning the technology into a social platform. That inversion is a paradigm shift because otherwise you're like, oh, cool, it's a cool technology.\r\n\r\n\r\nElizabeth Knopf (12:24.396)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (12:44.53)\r\n3.1 % of people are actually gonna use it. Now it's like, oh, it's like TikTok on my phone and I can go and just see what other people have created. You are now consuming a lot of this content that's being created. And I think that kind of unlocks the capability of Sora's applications more than how can we use this in a marketing capacity? It's entertainment is what it is. And to me, that's like the genius of this launch and rollout.\r\n\r\n\r\nElizabeth Knopf (13:02.19)\r\nHmm.\r\n\r\n\r\nElizabeth Knopf (13:11.35)\r\nAnd yeah, I actually think that's a really interesting point because I'm curious from all the other launches for like image generation. think that might be probably good adoption, but I am curious the adoption curves and like at the spike and is there a major trough like VO from Google, like because it still has friction in the creation process. So,\r\n\r\n\r\nNikolas Hulewsky (13:23.442)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (13:32.01)\r\nWell, yeah, and it's like, VO with Google, if I wouldn't created something cool now, like I had it's novel. It's interesting. I might send it to a friend or two of mine. But then what do I do with it? It like lives on my photo reel on my phone. Like, what am I actually doing with it beyond just, oh, this is cool. This kind of unlocks the usage of that other people can use my likeness to create things. And all of a sudden, a friend of mine creates a whatever we're calling these reels. And it's like, oh, that's funny. That's interesting. Oh, I'm going to share that with this person. He's\r\n\r\n\r\nElizabeth Knopf (13:44.547)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:01.295)\r\nHe's crowdsourcing usefulness. I don't even know how else to say it's just it's crazy to me. Anyways, very cool.\r\n\r\n\r\nElizabeth Knopf (14:08.91)\r\nOne other thing I want to highlight, because people who haven't maybe used the product yet are probably thinking, oh my God, someone's going to use my likeness. They solved for that by enabling who you can share it with. So it could be your closest friends, just nobody, and for your own creation purposes, or you can share it with the world, and we'll see what happens.\r\n\r\n\r\nNikolas Hulewsky (14:28.346)\r\nYeah, that's a really good point. should have shown kind of what that looks like in the settings, but you can actually choose who has access to your stuff and you can make it totally public so anybody can use it or you can make it totally private. So only you can use it. If you upload an image and they identify a person in it, they will not allow you to upload it. So I do think some of these platforms are taking more and more steps to make sure that they're protecting user privacy, man, yeah.\r\n\r\n\r\nThis part was really cool. All right. that's Sora. Go play with Sora. It's really cool. I wonder if this will now become another social media platform. I personally think that it will. I don't know that it overtakes any of the other platforms, but I think it's just going to become a new new mode of creating art in much the same way that Pixar grew out of computer generated images.\r\n\r\n\r\nElizabeth Knopf (15:10.114)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (15:26.864)\r\nI'm sure there will be something else that kind of grows out of AI generated images, we'll see. Okay, so we had some other updates. Claude released an update to Sonnet 4.1. is now Sonnet 4.5. I don't know what the difference is. Like what's going on?\r\n\r\n\r\nElizabeth Knopf (15:45.856)\r\nOkay, so actually let's take a step back. Before they rolled out 4.5, there were some really cool updates that I think are under, people aren't talking about as much and are pretty awesome. So number one, they came out with a Chrome extension, which like other things we've seen earlier in the year, we had OpenAI had,\r\n\r\n\r\noperator, which went and basically worked in the browser. We then had more recently Comet by Perplexity roll out a whole browser and then a company called the browser company, which got acquired, came out with a browser called Dia. And so we started seeing these browser wars take place. And then even Google with Gemini started sort of integrating more sort of sidebar usage that integrated with Chrome. But now Claude\r\n\r\n\r\nhas enabled the ability to work within your browser and do tasks on your behalf within the browser. So.\r\n\r\n\r\nNikolas Hulewsky (16:47.538)\r\nOkay, so tell me what this is, how do I go and get it?\r\n\r\n\r\nElizabeth Knopf (16:50.72)\r\nOkay, so let me share my screen and I will show you so we can do this together.\r\n\r\n\r\nNikolas Hulewsky (16:54.93)\r\nOkay, because I want to install it now. Funnily enough, I've been going away from chat GPT. It's been really hard for me to go away from chat GPT because it has so much history on me. And I do feel like it's persistent knowledge is good. it actually does crawl all of my conversations, but I really use Claude or I use Grok for the most part for everything that I do.\r\n\r\n\r\nElizabeth Knopf (17:22.99)\r\nI mean, I'm with you. I was joking with you. didn't get an invite right away for a store. I use Claude more and I talk about Claude more on the interwebs. all right. Okay, so you're wanna go to Chrome store. No, this is not.\r\n\r\n\r\nNikolas Hulewsky (17:50.386)\r\nIs it Claude?\r\n\r\n\r\nElizabeth Knopf (17:55.454)\r\nis it not here? Hold on. How did I get this? Hang on one sec.\r\n\r\n\r\nNikolas Hulewsky (18:01.106)\r\nSo it's cloud.ai slash Chrome.\r\n\r\n\r\nElizabeth Knopf (18:12.982)\r\nOkay, so you do have to actually go to Claude.ai slash Chrome. Yep. Okay. Then meet Claude for Chrome and then add to Chrome. I already have it. So it's basically already in here.\r\n\r\n\r\nNikolas Hulewsky (18:26.406)\r\nWait, wait, wait, wait, wait, wait. How do you already? So I'm on there. It says meet Claude for Chrome. I do that. And it says join the research preview.\r\n\r\n\r\nElizabeth Knopf (18:31.256)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (18:36.526)\r\njoin the waitlist. I may have already. Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:38.226)\r\nSo I have to get on a wait list. Dang it, you're too cool.\r\n\r\n\r\nElizabeth Knopf (18:46.382)\r\nOkay, so you're not. I have the beta. See, I didn't get it for chat. Okay, we are gonna go, I'm gonna end up using probably a spreadsheet for the use case, but let's actually do a YouTube video here. Okay, so we're gonna go up here. Do you see, oops, I'm not sharing anything anymore.\r\n\r\n\r\nNikolas Hulewsky (18:46.482)\r\nThat's awesome. So you have it, you have the beta.\r\n\r\n\r\nNikolas Hulewsky (18:53.52)\r\nNo, no, no, no, keep sharing your screen. I wanna see what it is.\r\n\r\n\r\nNikolas Hulewsky (19:09.99)\r\nNope, I don't see it.\r\n\r\n\r\nElizabeth Knopf (19:23.426)\r\nOkay, so I am in right now YouTube and I have this little clod icon up in my bookmarks bar or my sorry extension bar. And once I clicked it, it pulled up this little sidebar here. So now I'm gonna say what is this YouTube video about?\r\n\r\n\r\nElizabeth Knopf (19:59.308)\r\nAnd so the methodology too that it does for analysis of your browser page is it takes screenshots. So it's not actually scraping the data, it's taking screenshots of the whole page and then doing an analysis. So here it basically gives a summary, explains what it is, video details, I think it just pulled from stuff I have in there too.\r\n\r\n\r\nNikolas Hulewsky (20:07.698)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (20:23.854)\r\nCan you provide, it's only a one minute video, so it's not gonna be as detailed. Let's go to, okay, so let's actually do now something with this. So let's go to economics.\r\n\r\n\r\nNikolas Hulewsky (20:38.674)\r\nOK, so if you're listening, Liz has a web page pulled up. And then on the sidebar, there's the Cloud extension within Chrome. And she's asking it questions based on what she's got on her screen. What's interesting is I do this all the time. But I take the screenshot, and then I'll copy and paste it into Cloud or ChatGPT and say, hey, I was trying to do this thing. This is the output that happened. What am I doing wrong?\r\n\r\n\r\nI'd like to have more real time ability to query it and not have to like switch between windows and effectively that's what you're saying it does is because it's working off of the screenshots and it's embedded now in the the in the chrome browser. It can real time kind of give you the feedback that you otherwise would have to copy and paste for.\r\n\r\n\r\nElizabeth Knopf (21:25.516)\r\nSo what we're gonna do right now just as a quick demo of this is I'm gonna ask it to provide a summary of this video and then to input it into this little Google sheet I just created quickly and to put in the data here. So this is simple, obvious use case, but I just want you to see how it works. we're gonna do base, okay.\r\n\r\n\r\nNikolas Hulewsky (21:37.383)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (21:49.08)\r\nsummarize this video with key insights and then add the details of this video to this Google Sheet. And just I put in the link and just a quick tip, make sure that it's you can edit it as the editor. Otherwise it'll get stuck. And then\r\n\r\n\r\nNikolas Hulewsky (22:05.926)\r\nand then you put the link in.\r\n\r\n\r\nNikolas Hulewsky (22:11.366)\r\nEditable.\r\n\r\n\r\nWhoa.\r\n\r\n\r\nElizabeth Knopf (22:18.766)\r\nmake sure to include the title of the video. else did I put here? do title channel.\r\n\r\n\r\nElizabeth Knopf (22:35.446)\r\nChannel name.\r\n\r\n\r\nthe length under time, and then summary in the summary column. All right, so let's see how it does.\r\n\r\n\r\nNikolas Hulewsky (22:58.546)\r\nSo if it's not actually watching the video, what is it, like how is, what information is it pulling?\r\n\r\n\r\nElizabeth Knopf (23:06.638)\r\nIt's gonna pull the transcript from the page because it can still pull the transcript from YouTube video So it's gonna be able to do that\r\n\r\n\r\nNikolas Hulewsky (23:26.002)\r\nAnd so if I wanted to like research, could use this, I could go find 10 YouTube videos and like run them all simultaneously to populate into a consolidated spreadsheet.\r\n\r\n\r\nElizabeth Knopf (23:37.048)\r\nSo it's actually watching the video right now.\r\n\r\n\r\nSo I don't know if you could hear it a second ago, but it's watching a video. So I don't know if it's listening or not, because I had to mute it so we could talk and it doesn't, yes. And so it's taking screenshots. And I think what it's also going to do is grab the transcript somewhere. So before when I've done this, it grabbed the transcript. But yeah, just as you were saying, like you can use this for research when you're not around. I would say you still have to interact with it. And it's not going to just do the work.\r\n\r\n\r\nNikolas Hulewsky (23:44.24)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (23:49.445)\r\nYeah, yeah,\r\n\r\n\r\nElizabeth Knopf (24:09.806)\r\nunsupervised, but it does a pretty good job to do a full task and workflow.\r\n\r\n\r\nNikolas Hulewsky (24:17.042)\r\nKind of like operator.\r\n\r\n\r\nElizabeth Knopf (24:18.58)\r\nExactly. It just works a little bit better. Again, none of these are perfect yet, but I would say like any demos you saw with operator, there was just again, a lot of friction. I just feel like some of that friction again has been removed or reduced here. So.\r\n\r\n\r\nNikolas Hulewsky (24:32.77)\r\nWell, because it's like embedded in the browser. The thing with operators, like it was kind of almost remote, remoting in and controlling the browser. This is a Chrome extension, so it's embedded within the browser. It's different.\r\n\r\n\r\nElizabeth Knopf (24:40.758)\r\nExactly.\r\n\r\n\r\nElizabeth Knopf (24:45.484)\r\nYeah, and this sort of goes along with that theme of like the first people to bring about this concept was Dia, which was this company that got acquired and they had sort of like a browser bar, but they also had their own browser. And then had Gemini, which obviously from Chrome.\r\n\r\n\r\nand then you had perplexity. And so they're all sort of taking notes on each other for like the interfaces. But again, these guys, I think have just sort of nailed, like you don't have to download a whole new browser. You can really like do things a lot more smoothly without graph friction.\r\n\r\n\r\nNikolas Hulewsky (25:14.994)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (25:20.506)\r\nWhat are the updates with Cloud Code? Are there any updates?\r\n\r\n\r\nElizabeth Knopf (25:23.756)\r\nOkay, yes, so the other, not with cloud code, but a couple other updates besides just the extension while we're letting it go. So file formats, I'm a nerd. And so I get excited when I can generate a PowerPoint or an Excel spreadsheet. And so far, the only ones that I think have done an okay job or have been the best at it.\r\n\r\n\r\nNikolas Hulewsky (25:41.874)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (25:46.126)\r\nhave been on the PowerPoint side, Gamma, and then on a CSV has actually been Manus AI. No one had really nailed it well, but actually Claude now can do both. And I think they can do a pretty good job. I still think Manus has maybe a little leg up on the CSV in research, but for the most part, Claude is now able to do PDF format. Claude can do it now. So I would...\r\n\r\n\r\nNikolas Hulewsky (26:07.804)\r\nWait, Claude can do it now?\r\n\r\n\r\nmy gosh. I was just doing this two weeks ago. It was freaking frustrating because I was, I built this, it was an artifact within Claude and the output was, it needed to be in, in CSV format. And it was like, here you go. All you have to do is copy it from here and now paste it into a CSV. And it like the formatting always sucked. I think I showed this to you. I think I complained about it, but now it actually does it.\r\n\r\n\r\nElizabeth Knopf (26:20.91)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (26:32.238)\r\nYep.\r\n\r\n\r\nElizabeth Knopf (26:37.998)\r\nYeah, yeah, yeah. So while we're letting it work there, can pull up Claude here. First, let's do here. Let me pull up a project I worked on. see if I can quickly find this.\r\n\r\n\r\nElizabeth Knopf (26:55.179)\r\nI think this is it.\r\n\r\n\r\nNikolas Hulewsky (26:57.618)\r\nOr maybe I can pull up that project that's been in the pain in the butt and...\r\n\r\n\r\nElizabeth Knopf (27:00.599)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (27:04.924)\r\nLet me do it.\r\n\r\n\r\nNikolas Hulewsky (27:13.426)\r\nI have so many artifacts. I wish Claude did a better job of organizing your artifacts.\r\n\r\n\r\nElizabeth Knopf (27:17.742)\r\nYeah, I have to I agree with that. Okay, so I don't know if this is the okay. So I a couple months ago, about three months ago, I was just working on a pitch deck. And I was like, Oh, great, I'll do it in Claude. And then when I went to export it just even into PDF, it failed into PowerPoint, it failed, and I just had to use gamma, ultimately to create that. we're gonna say now based on this content.\r\n\r\n\r\ngenerate a PowerPoint pitch deck. Let's see what happens. Hopefully it works.\r\n\r\n\r\nNikolas Hulewsky (27:52.816)\r\nNow do you have to be using 4.5 in order for it to do this?\r\n\r\n\r\nElizabeth Knopf (27:55.79)\r\nNo, this was before the 4.5 rollout, which like I was really excited. Oh, okay, great. Exceeded the limit. So let me go back.\r\n\r\n\r\nElizabeth Knopf (28:11.564)\r\nAll right, I don't know if it's gonna.\r\n\r\n\r\nElizabeth Knopf (28:16.302)\r\nall right, I'm exceeding data. All right, so let me do. How do I have in here? Hold on. OK, let's do OK, create us. Let's do a CSV for OK, let's actually OK. Based on the project. Details, so I have a bunch of financial statements in here.\r\n\r\n\r\nSo based on the project details, create a financial.\r\n\r\n\r\nanalysis for this company but change and\r\n\r\n\r\nprovide this both in a PowerPoint or an investor presentation, pitch deck, and a CSV summarizing and aggregating the P &L. All right, we'll see how this, if this works. This is a little bit more complex. I haven't tried it with this, so we'll see how it goes. Yeah.\r\n\r\n\r\nNikolas Hulewsky (29:30.418)\r\nFingers crossed.\r\n\r\n\r\nNikolas Hulewsky (29:37.243)\r\nIt's stinking.\r\n\r\n\r\nElizabeth Knopf (29:37.624)\r\nBut I do have to say, if this nails this, this was like a bunch of grunt work I used to always have to do, because I would get a company sending me just PDFs and never the Excel files. And so I'd literally have to go and reformat everything and then build it all into this deck. So this actually like would be killing part of the job I used to have to do way back when.\r\n\r\n\r\nNikolas Hulewsky (29:44.208)\r\nRight.\r\n\r\n\r\nElizabeth Knopf (30:04.238)\r\nAll right, while we're waiting for that to go, let's just check in on.\r\n\r\n\r\nNikolas Hulewsky (30:08.878)\r\nyeah, the chromic tension. There it is, my gosh.\r\n\r\n\r\nElizabeth Knopf (30:10.446)\r\nBoom, it added. So it added and we needed to see it fully in progress, but this is an interview with Justin Moore, author of Sponsored Magnet and a couple of points. So obviously can tweak the prompt to make it a better summary, but it completed the interview.\r\n\r\n\r\nNikolas Hulewsky (30:22.834)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (30:29.782)\r\nNow, did you have to have that window open or that tab open in order for it to populate? Or could you have just given it the link to that Google Doc and it would have still populated?\r\n\r\n\r\nElizabeth Knopf (30:42.104)\r\nSorry, you cut out for like a minute, what did you say?\r\n\r\n\r\nNikolas Hulewsky (30:45.234)\r\nIn order for that to populate, did you have to have the Google Doc open the whole time, that tab open, or could you have just given it the link?\r\n\r\n\r\nElizabeth Knopf (30:47.298)\r\nYep.\r\n\r\n\r\nElizabeth Knopf (30:52.244)\r\nJust giving it the link it would open it up. So if I had Yeah, yeah, yeah, so it does need an interface with it like it's actually you in the browser so\r\n\r\n\r\nNikolas Hulewsky (30:55.428)\r\nOkay, it would still be open though. Okay. That makes sense.\r\n\r\n\r\nElizabeth Knopf (31:03.318)\r\nSo that's also really helpful for scraping data, even though unfortunately, Claude always is like very ethical and I've tried to scrape websites that you're not supposed to scrape and it won't. So that is unfortunate, but it can do it for, yeah. It can do it if there's no terms of service or that it's aware of. So, okay. So let's see how this is going. All right. We're still working.\r\n\r\n\r\nNikolas Hulewsky (31:03.762)\r\nThat's insane.\r\n\r\n\r\nNikolas Hulewsky (31:19.356)\r\nDarn you, Claude.\r\n\r\n\r\nStop being so ethical.\r\n\r\n\r\nNikolas Hulewsky (31:31.258)\r\nit's still thinking. It's good.\r\n\r\n\r\nElizabeth Knopf (31:32.75)\r\nWell, this is also, I'm not surprised by this because Cloud 4.5, which is one of the new updates, is it can have extended thinking for a very long time. Meaning if you have it in Cloud Code or actually I think even in just the browser here, it can do it for like just hours. I've seen as much as 30 hours, 20 hours, things like that. So it can actually process and work for long time. Yeah. I haven't yet been able\r\n\r\n\r\nNikolas Hulewsky (31:54.682)\r\nWhat?\r\n\r\n\r\nThat's a really long time.\r\n\r\n\r\nElizabeth Knopf (31:59.656)\r\nExactly. I haven't yet seen it like that, but, all right, let's see what's happening. It looks like it's doing something. This is not quite. don't know if it's creating. I think it's creating the executive summary and then I'm wondering if it's going to then put it in the format because as you can see, it's sort of doing a bunch of, okay, so it looks like it has a CSV there. It looks like you can see to create the PowerPoint. So I'd installed some stuff.\r\n\r\n\r\nSo it's going through step-by-step thinking of breaking it into tasks to know how it should perform each component of that.\r\n\r\n\r\nNikolas Hulewsky (32:34.77)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (32:39.568)\r\nI mean, similar to doing cloud code.\r\n\r\n\r\nElizabeth Knopf (32:41.965)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (32:45.986)\r\nSo we'll get into more details on the actual 4.5 updates probably on the next session because I think there's cool things with agents that we want to share. But just the extended thinking, model is actually as Sonnet is now as good as the previous Opus. So Opus was like the higher end version of the Sonnet model, but it was really expensive through the API. So now.\r\n\r\n\r\nNikolas Hulewsky (32:52.057)\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (33:08.954)\r\nWow.\r\n\r\n\r\nElizabeth Knopf (33:12.462)\r\nit's good or even better than the others. And I guess while we're waiting to, I can pull up, go ahead, good. I was gonna pull up just sort of their overview of.\r\n\r\n\r\nNikolas Hulewsky (33:17.874)\r\nOkay, here. No, no, no, what are you gonna pull up?\r\n\r\n\r\nNikolas Hulewsky (33:26.972)\r\nWell here, I wanna share something.\r\n\r\n\r\nI'm taking over, I'm taking over.\r\n\r\n\r\nOkay, I wanna show two things. The first thing is, so when you go to Claude and you go to Claude.ai backslash Chrome, if you wanna install the excuse me, the extension in your browser, you click here, you're like, me Claude for Chrome. And let's say you come here and you're like, yeah, I really wanna try this. I wanna join the research preview, because it's showing you all the different things you can do. And you click on this, it takes you to a Google doc. It takes you to a, like this, it's a survey within,\r\n\r\n\r\nwithin Google Docs. And then you fill this out. That blows my mind. big, like isn't Anthropic a big company? Haven't they raised a bunch of money?\r\n\r\n\r\nElizabeth Knopf (34:14.188)\r\nI mean, and that's, it's funny to me because this maybe brings up a whole other topic that we can talk on on a different one because it's a rabbit hole is adoption. And the reason I say that is because of internal systems. Like they're not optimizing for this workflow to be, you know, perfect, but yeah, someone should have spun up an artifact here.\r\n\r\n\r\nthat does this process, but they're gonna, they probably been using Google Docs and stuff to do this. And so the adoption or switching costs going from things that everybody knows and uses to other tools or homegrown stuff, there's a big gap and people don't.\r\n\r\n\r\nyou know, don't appreciate this. Like I had looked at some of these companies and they were hiring for people that know like ServiceNow or know Salesforce. And so it's like, they're not switching anytime soon. I wish they would, but they're not.\r\n\r\n\r\nNikolas Hulewsky (35:01.744)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (35:07.804)\r\nWell, well, what's crazy is if you take a look at any website and you're, you're worried about conversion. So what you want to do when you have a website is you want to, if there's a, somebody comes onto your site, you want to turn that person into a lead. And then hopefully at some point that, that lead turns into a sale. in order for them to turn into a lead, they've got to give you their information. And what Claude did here, open it or excuse me, anthropic, when I click this and I come here, well, guess what? I'm going to have Muhammad blur this out. My email is already in here.\r\n\r\n\r\nThey took the friction out of it because I'm already in my, my Chrome browser. And I don't know if that's why they did it, but I could definitely see like, this is just one step of removing friction that allows them to keep you within their ecosystem, which is interesting. It's interesting how the Google suite is incredibly sticky.\r\n\r\n\r\nElizabeth Knopf (35:36.776)\r\nThat's true. Yeah.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (35:58.048)\r\nYeah, no, absolutely. that's actually that is a very good point. Very good point.\r\n\r\n\r\nNikolas Hulewsky (36:02.654)\r\nAnd by the way, while we're waiting for your PowerPoint, here is me, you and Sam Altman having a conversation on the beach.\r\n\r\n\r\nElizabeth Knopf (36:09.56)\r\nWow, you sort of look like a mix between, yeah, yeah, I know. And they somehow keep giving me mom jeans and I'm like, yeah, you kind of nailed it, but you you added a few pounds and not quite my style, so.\r\n\r\n\r\nNikolas Hulewsky (36:11.698)\r\nI know, me and Sam Altman. I know it's weird, right?\r\n\r\n\r\nNikolas Hulewsky (36:21.65)\r\nYou kind of nailed it, but rude. Well, like I'm like, I'm looking at it. like, yeah, well that I do look like this mix of Sam Altman and whatever else, but that's pretty good. That's pretty good. The three of us podcasting on the beach. Uh, let's see. Did your PowerPoint come up? Let's take a look.\r\n\r\n\r\nElizabeth Knopf (36:31.586)\r\nYeah, that is really good. Very good.\r\n\r\n\r\nElizabeth Knopf (36:38.006)\r\nYeah, it's done and then we'll see if the let's take a look\r\n\r\n\r\nDid it cook is the question.\r\n\r\n\r\nElizabeth Knopf (36:48.992)\r\nAll right. Okay. So I probably could have prompted it to make it prettier because usually it does a better job to make it more aesthetically. But right now we're going for the output. So this is like much better. It's laid out with good spacing. like, you know, not pretty yet. And there needs to be some tweaks like this, you know, not pixel perfect. Perfect. This is, this is not a PDF. This is going to be, this should be in a PowerPoint.\r\n\r\n\r\nNikolas Hulewsky (36:56.386)\r\nMm-hmm. Function.\r\n\r\n\r\nNikolas Hulewsky (37:02.706)\r\nYeah, that's great.\r\n\r\n\r\nNikolas Hulewsky (37:11.964)\r\nBut is this in a PDF?\r\n\r\n\r\nElizabeth Knopf (37:18.998)\r\nAnd it is, you can see the download. Okay, let me open it now in PowerPoint and share that. yeah.\r\n\r\n\r\nNikolas Hulewsky (37:22.95)\r\nWow, okay. that's so much nicer.\r\n\r\n\r\nNikolas Hulewsky (37:30.308)\r\nno longer just the copy and paste.\r\n\r\n\r\nNikolas Hulewsky (37:36.54)\r\nThere it is, X school.\r\n\r\n\r\nThat's awesome. There it is. We did it.\r\n\r\n\r\nElizabeth Knopf (37:41.774)\r\nSo there it is. And you can edit stuff and all that. So huge improvement, huge improvement. All right, the other thing real quick though was the CSP. So let's see, let me download that and I can pop it open.\r\n\r\n\r\nNikolas Hulewsky (37:47.57)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (37:56.908)\r\nYep. All right. Look. this is, is. Okay.\r\n\r\n\r\nNikolas Hulewsky (37:59.25)\r\nOh, I gotta see it. gotta see it. Share it. I can't see it.\r\n\r\n\r\nElizabeth Knopf (38:14.146)\r\nI mean, I'm excited about this. Like anyone doing data entry or who's had to like extract data from PDFs, like, yeah. So, yeah. This is just like perfect. This is perfect. Yeah.\r\n\r\n\r\nNikolas Hulewsky (38:14.274)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (38:23.157)\r\nit's so good. Finally. I'm so excited for this.\r\n\r\n\r\nIt's Christmas. Christmas came early. OK, well, we got PDF and we got Excel. In a few days, we're going to talk about the rest of the updates, the agentic updates, as well as Cloud Code updates. OK, I'm stoked for it. Thank you, Liz. Great as usual. All right, let's let that.\r\n\r\n\r\nElizabeth Knopf (38:42.732)\r\nYeah, excited. All right. Thank you. Likewise.",
  "metadata": {
    "duration": "",
    "date": "2025-10-06",
    "platform_source": "Google Drive"
  }
}