{
  "episode_number": "217",
  "episode_title": "The #1 Rookie Entrepreneur Mistake That Can Bankrupt You in 8 Months with Nik Hulewsky",
  "guest_name": "Nik Hulewsky",
  "business_name": "Not Applicable (solo episode)",
  "transcript": "﻿Nikolas Hulewsky (00:00.91)\r\nAll right, I got two friends who wanted to get into entrepreneurship. We'll call one of them Brandon and we'll call one of them Nick. Brandon did his research. He launched a business and within four months he was doing $100,000 a month. And since that period of time, he's got now 39 locations and he's crushing it. And we'll talk about Brandon in a minute. Nick did the same thing. Did a little bit of research, launched a business and eight months later, he was bankrupt. He was out of the game. Why? Well, I've spent years.\r\n\r\n\r\nbuying, selling, launching businesses. I've failed a ton. I've also succeeded some. Nick, well, that's weird, it's my name, made the same mistake that I see many first time rookie entrepreneurs make.\r\n\r\n\r\nNikolas Hulewsky (00:51.19)\r\nAnd the mistake, he evaluated it like a 20 year veteran. Like when he'd never run anything. And today I'm going to talk to you about how to score a business like a rookie, like the rookie that you actually are. So you don't buy yourself or start yourself a business that turns into a nightmare. You're going to want to stick around for this one.\r\n\r\n\r\nNikolas Hulewsky (01:26.54)\r\nOkay, so my friend Nick, he launches this business and he does like all the analysis, right? All the analysis that you're supposed to do like when you're in your MBA program. Does it have a moat? Does it have sticky customers? Do they have pricing power? All these things. And he launches and within eight months, everything's gone. This was a restaurant business. And all of sudden he's dealing with constant staffing turnover, razor thin margins, like the health department is there, right? It's like, it's a huge mess. And\r\n\r\n\r\nThe problem that he made that I see many first-time entrepreneurs make is that he was evaluating the business assuming that he had the experience. know, when these guys who are getting their MBAs are looking at businesses and they're looking at it on paper or in a spreadsheet, it's like, this should work because of blah, blah, blah. But the truth is they don't know these businesses yet. And that's a huge factor that they never consider during their evaluation. So here are some quick examples, I guess.\r\n\r\n\r\nthat you can kind of think about, just hire good managers, right? I'm going to buy a business and I'm going to hire a good manager. Have you ever hired anyone before? You've ever managed anyone before? Or my personal favorite, I'm going to create some passive income streams when you've never actually operated the business. Do know how hard it is to create something where it's to the place where it's like passively spitting off cash? You've either got to be independently wealthy or you've built something to the point where you can step out. Or many of them, they focus on like\r\n\r\n\r\nI'm going to focus on systems, not operations, but the truth is like, you're the only system that works in this business, right? Here's the brutal truth for first time entrepreneurs and rookies. In your first business, you are the business. Your willingness to outwork everybody else is really your competitive advantage. You don't have more money. You don't have more experience. You don't have more relationships necessarily. The only thing that you can differentiate on is your willingness to just get out and get after it.\r\n\r\n\r\nevery single day. And so you can't hire your way out of that inexperience. can't systemize things or systematize things that you don't understand. You have to operate first. And what I see many first time entrepreneurs doing is this like evaluation of businesses based on theoretically what it should be. And they never add into the mix the actual differentiator in these first businesses, which is you. Do I have the skill set or do I have the experience or can I do\r\n\r\n\r\nNikolas Hulewsky (03:49.556)\r\nX, Y, Z things in order for this to be successful. So you need as a rookie, as a first-time entrepreneur, you need to be evaluating these businesses and assuming you will be doing everything, at least at first. Then you can graduate, right? Once you have more money or once you have more experience, then you can talk about like, what's my differentiator? What's my competitive advantage? But right now, for many people who trying to get into entrepreneurship and I'm getting more more questions for it, you need to assume that you're going to do everything. And that is not bad for your first business.\r\n\r\n\r\nLike, can we just dispel that right now? Can we stop talking about, I just want to get into business and hire somebody else. Cause I don't want to be like working in the business. I want to be working on the business. Like, no dude, you're not there yet. Like why do you assume that you're in a position to be working quote unquote on the business when you've never worked in the business? That is a gradual process. You can't just skip the line and get to the point where you're working on the business. You need to actually evaluate the business first. And so.\r\n\r\n\r\nI have this like evaluation framework that I usually use. It's eight points. And I typically use it for people who have experience. They're trying to get into a business, usually buying a business. But since I'm getting more and more questions about how do I just get into entrepreneurship generally, I thought I'd break this down for first time, rookie entrepreneurs, if you will. And there are four rookie realities that I've kind of broken this out into. And I've added each one of those eight evaluating criteria into. So I'm going to pull this up really quickly.\r\n\r\n\r\nAnd this is my first solo episode, so I'm both excited and nervous.\r\n\r\n\r\nNikolas Hulewsky (05:30.872)\r\nOkay, so what you're looking at here is the four rookie realities. And these are the questions that every potential entrepreneur or entrepreneur has to answer, excuse me, before they actually get into the game. So reality number one is, can I personally handle the daily operations of the business? Truth is, you're gonna be doing everything. And with that, in that, like to break it down to operational complexity and people complexity, because those are two different things. Operational complexity,\r\n\r\n\r\nSystems fulfillment, et People complexity is how many people does it take for me to actually do this job? Reality number two. Can I personally get customers? Any new business without revenue coming in is dead. It doesn't matter how smart you are. It doesn't matter how cool your systems are. If you can't get business, you're dead. I had to learn this the hard way. I'm a operator by nature. Um, and I, I had never like started a business from scratch. And the minute that I realized that first time founders focus on\r\n\r\n\r\nproduct, second time founders focus on distribution, everything switched for me because the ability to sell your product is more important in not just my opinion, many investors opinion than the product itself. So can you personally get customers and within that customer acquisition we're going to talk about and the revenue model. Number three, can you personally survive the learning curve? Every business has what's called the J curve. If you buy a business,\r\n\r\n\r\nWhat happens is you buy the business and the business dips and then there's a trough and then it comes back out of it and it shapes in this J. And usually you talk about that in the terms of working capital or cash in the business. But it's the same thing when you start a business from scratch. There's a learning curve, there's a J curve where you start out good, optimistic, and then you just kind of realize, holy crap, I don't know anything. I'm a freaking idiot and everything takes a step back. And then you come out of it. There's a J curve.\r\n\r\n\r\nIn order to survive the J curve, in order to survive that learning curve, you've got to have a business that has good margins and enough cash on hand to actually play the game. And the last reality, can I personally grow this without breaking? So we're going to look at how do you evaluate macro tailwinds and how do you evaluate scalability of these systems individually?\r\n\r\n\r\nNikolas Hulewsky (07:52.438)\r\nAs you can see, those are the eight criteria that I typically look through and they have waiting next to them. That's what those numbers are. We'll talk about this later. But I love thinking of it in these four sort of reality checks for first time entrepreneurs because they're just four easy buckets, right? Could I personally do fulfillment? Can I go out and get business? Am I able to survive this long enough as I'm learning it? And can I grow it once I've actually learned it? Okay. So this first\r\n\r\n\r\nNikolas Hulewsky (08:29.55)\r\nOkay, so reality number one, can I personally handle the daily operations? The number one rookie mistake, this is it. The number one rookie killer, I should say. It isn't market risk. It's thinking you can delegate your way out of operations in day one. That is a myth. This whole thing of, well, I'm just gonna buy a business and hire an operator, or I'm gonna start a business because I have a guy who can do the operations. Do you understand how ludicrous that sounds? You're gonna go and risk.\r\n\r\n\r\nyour capital and in many instances, your entire net worth on a business that you've potentially never run before and hire that out to somebody else. Like you, you don't realize you're betting everything on that person. It's not doable and it's not smart. You've got to really understand when you're evaluating a business opportunity, whether you're starting up a epoxy garage business or you're buying a business, how complex are the daily tasks?\r\n\r\n\r\nI personally have to master, right? Back to the restaurant story. He was dealing with like 47 different vendors, health codes, inventory. He was personally managing like 16 hour days and scheduling. Like it's an operationally complex business that you're throwing on top of being a first time entrepreneur. And you contrast that with something let's call it pressure washing. Really all you need to master like three things, driving around, spraying the ground and billing people.\r\n\r\n\r\nThat's it. It's not complex, right? So if you're a rookie, if you're a first time entrepreneur and you're looking at these two business opportunities, which one of them could you personally handle all of the operations from fulfillment to getting customers to billing and collections, all of those things. And if you can't personally execute every critical task well, then you're not ready. Complexity kills rookies because you have to do it all. You can't outsource that stuff to somebody. You don't get to a place.\r\n\r\n\r\nYou can outsource until you're doing a couple hundred thousand dollars in revenue and you really can't manage what you don't understand. So this idea of, just going to, I'll buy a business and I'll figure it out. just by offloading it to different people, it doesn't work. It doesn't work. And you can believe me or not believe me. I promise you, if you go out and do it, call me in six months and say, you were right. I mean, I just had that happen so many times. So that's number one. Or that's the first factor when it comes to whether or not you can handle the daily operations is operational.\r\n\r\n\r\nNikolas Hulewsky (10:54.222)\r\nThe second piece is people complexity, right? You need to understand how many people do you personally have to manage before this makes money? Again, back to the restaurant. In order for me to go and fulfill and sell food to people, I've got to have cooks, I've got to have servers, I've got to have bus boys. You've got to have a team in place before you can make money. If you're, again, back to the pressure washing company.\r\n\r\n\r\nI can go make money by myself. Like I need one person. I need a person. I need a truck. I need a rig and I can go. That's it. It's very simple. like think of it like this, a solo handyman, right? Your personal skills, your work ethic, that's the entire value proposition for that business. You don't need something that's like, I have a competitive advantage because I have a proprietary software. No, your competitive advantage is I have skills and I will freaking work harder than anybody else.\r\n\r\n\r\nSo every employee that you bring on kind of dilutes your competitive advantage as the hardest working person in that business. If you don't under already understand that business, right? So think about this for a second, a long care business versus a restaurant, which one do you think, lets you be the competitive advantage? It's pretty obvious the long care business. And I'm not somebody who's, who's just all in for starting business from businesses from scratch.\r\n\r\n\r\nHowever, I am somebody who's all in to this idea of that first business, you've got to understand it, period, full stop, end of story. And if you have no experience whatsoever, then go and pick something that allows you to handle everything and to be the competitive advantage because you're just gonna be outworking everybody else, right? Okay, reality number two, can I personally get customers? Oh my gosh. I'm gonna tell you a story real quick.\r\n\r\n\r\nSo I worked for this public traded company, the Enzyme Group, fantastic company. And the way that they operated, they were a healthcare company. had many different locations around the country. And when I started there, they were like a $15 million segment, this whole monthly hospice company of the overall business. And they ended up growing into like a $200 million segment. And they've since gone public. They're like a billion dollar public company. So I was one of the first employees and they threw me into this acquisition. had no experience and I get in there and I freaking crush it.\r\n\r\n\r\nNikolas Hulewsky (13:20.026)\r\nI freaking killed it, right? I mean, because I was smart. I was the smartest guy in the room. It was easy. I'm 28. And I'm the freaking wonder kid. Everybody loves me. Wow, Nick, you're so successful. How did you turn that acquisition from losing $400,000 last year to making $600,000 this year? That's a million dollar swing. I mean, my wife loved me. My friends loved me. Men wanted to be me. What's that phrase? no, no, sorry.\r\n\r\n\r\nEvery woman wanted to be with me, men wanted to be me. And I drank my own Kool-Aid and I hopped around. I ended up leaving that location and I went to Texas, Define in Texas. And then there was an opportunity to go to California because they were buying this home health agency. And everything on paper looked great. They're buying this home health agency. There were other skilled nursing facilities in the area who could refer business to them. And it was like, great, vertical integration. I'll go handle it.\r\n\r\n\r\nHere's the problem. My first stint, remember that one that I crushed it at, where I turned it from losing 600,000 to making 400 or losing 400, making 600. It was in a market where that home health and hospice was a part of a monopoly. It's called a CON state, certificate of needs state. So they only allowed like four or five competitors. So when I went in there to turn this business around, it wasn't that I was awesome. It was that the previous owner just\r\n\r\n\r\nwas billing really terribly. So they were actually not losing $600,000 before I took it over. They were riding off like $800,000 a year because their collection sucked. That's a big difference. Collection sucking versus the, you it's like cash versus accrual accounting. They weren't collecting, but they were doing the business. So I got in there and I just like fixed those processes. Boom, we're making way more money. It's great.\r\n\r\n\r\nAnd then I got full of myself and, you know, pride comes before the fall. ended up moving and I find this opportunity in Southern California. is a small agency, not a lot of people, in a massive market. And what I needed to do in order for it to be successful was to go and grow the business, but I didn't quite recognize that. Right. So I get in there, I started operating the business and I go from like, Nick, you're one of the four.\r\n\r\n\r\nNikolas Hulewsky (15:38.242)\r\nHorseman of this business you all man you're gonna come when we go public. You're gonna make so much money. It's gonna be amazing To man, we need a fire Nick. I got fired because I sucked so bad and like to this day It's one of the two probably worst Acquisitions that that company has ever done Because I was an idiot and I didn't realize and understand that going out and getting business was the most important thing for that business I I thought I could skate by on my operational skills\r\n\r\n\r\nAnd so I hunkered down and I played in the spreadsheets and I found every efficiency I could possibly find, but I got fired because I didn't turn it around. I didn't know what I needed to focus on. So for you, the number two reality as you're getting into business is can you personally get customers? You can't afford a marketing team right now. You don't have sales staff. Your personal hustle gets customers, right? And so the question is, can I personally execute?\r\n\r\n\r\ncustomer acquisition. Not just fund it, could you personally execute it? Right? This is why I love local services businesses because you have two things in your favor. Number one, I don't know if you've seen this, Meta released their earnings last week or the week before. They freaking crushed it, crushed it because Facebook ads, Meta ads are insanely, not just profitable, but insanely easy to use and effective.\r\n\r\n\r\nfor small businesses. I can target anybody. If I put a dollar in, usually I'll get $3 out, right? So the reason I bring that up is because for service businesses, home services businesses, Meta ads is amazing. I can spend a dollar on there and generate $3 in business. The second reason I like it is because, dude, if Meta's not working, I can go knock doors. And guess what? If I have a pressure washer or I'm a window cleaner or I'm a pest control guy, there's a very clear before and after. I could do the fulfillment.\r\n\r\n\r\nright then and right there. So just go knock doors. And it kind of de-risks the how do I go out and find customers. So if customer acquisition requires skills that you can't personally develop quickly, then you're going to starve. I know that sounds like weird, but it just is what it is.\r\n\r\n\r\nNikolas Hulewsky (17:55.884)\r\nThe second factor that I look at within that question, the first one is like, can I go out and acquire customers? The second one is revenue models is will customers pay me consistently while I personally learn and improve. So let's give an example of a wedding planner. It's all reputation based, right? If I go out and I get a customer and I suck, I'm not going to get any more business after that. So I'd like, I don't have a revenue stream because it's project based. I don't have a revenue stream to float me until I get it figured out.\r\n\r\n\r\nBut if I have an HVAC company and I'm doing maintenance and it's monthly maintenance and I've got recurring revenue or reoccurring revenue, well then I've got some cushion. I've got some revenue in there to kind of fund me until I can figure stuff out. Right? So recurring revenue forgives just a ton of personal mistakes while you're getting better. And\r\n\r\n\r\nNikolas Hulewsky (18:50.092)\r\nAnd a perfect example of this would be a friend of mine. name is Casey McDonald. He owns a pest control company. He went out, he started learning how to knock doors and sell, and he launched a pest control business. within the first, I want to say first year, he's doing a million dollars a year in revenue. He's on pace to do 2 million in this next year and it's highly profitable, right? But the margins are really high and he's got recurring revenue. So almost immediately he's building this book of business.\r\n\r\n\r\nthat is allowing him to make some mistakes because you're going to make a lot of mistakes. So when it comes to the revenue model, you want to find a revenue model that has enough cushion in there for you to make mistakes over time. Reality number three, like I was talking about, can I personally survive the learning curve? So the two pieces that I like to look at in this are margins and the cost to play. So like basically the cost to get in the game. So for margins, think of it like this.\r\n\r\n\r\nYour personal mistakes are going to come directly out of your bank account because you're funding it, right? And if they're going to be coming personally out of your bank account, then you need a cushion. Like you need big enough margins to be able to absorb your mistakes. Just like kind of we were talking about in the previous point. If, if you've launched a business and you've got 5 % margins, you do not have wiggle room to screw up. You just don't. If you launch a business and a digital agency and you got 50 % margins, you've got some room to screw up. Like, okay.\r\n\r\n\r\nI have some money there. So I land like one or two customers. Cool. Now I have some money in the bank where if something happens, I can tap into that and use it.\r\n\r\n\r\nNikolas Hulewsky (20:37.774)\r\nThe coolest way that I like to think of it is fat margins are rookie insurance. So they let you learn while you're still eating. It's not like one mistake kills you. High margins cover a multitude of sins. The second piece, this cost to play factor. How much does it cost for me to get in the game? So can I personally afford to be wrong and still keep going?\r\n\r\n\r\nHere's two examples. One, a manufacturing company. You gotta put maybe $500,000 in, right? You gotta buy a ton of capital. There's a ton of capital expenditures. Big machines, big equipment, inventory, et cetera. You mess up in that business, your 500 grand is gone, right? Back to Casey, my friend Casey, he's getting into pest control. There's no huge capital investment upfront. If he gets eight months down the road, sure, there's a large opportunity cost. His time cost.\r\n\r\n\r\nbut he didn't sink $500,000 into getting that business up and running. So I like services businesses where your personal tools or your truck or your time or your investment are really only the things that you may lose as opposed to first time entrepreneurs getting into capital heavy businesses or businesses with high startup costs because not only are you getting into the business for the first time and you're gonna be dealing with all those things, but now you've got a huge amount of risk associated with that. And that just adds.\r\n\r\n\r\nto the mental complexity, adds to the family dynamic, it adds to the stress that comes with running your own business.\r\n\r\n\r\nFrom a rookie standpoint, the way you should think about it is like your first business should amplify your personal work ethic, not like bet your entire future on, right? This last one, reality number four, can I personally grow this without breaking? What do I mean by this? You're going to get to a place where reality number one, can I personally handle the operations? Done, check. Sounds good. Can I personally go out and inquire customers?\r\n\r\n\r\nNikolas Hulewsky (22:43.916)\r\nYep, I'm getting customers. Great. Number three, can I survive the learning curve? Cool. I survived learning curve. Great. Like you're past all of those. And then you're at this place where it's.\r\n\r\n\r\nNikolas Hulewsky (22:55.962)\r\nI mean, it kind of sounds like an oxymoron, but it's like a cruel joke that the universe plays on you.\r\n\r\n\r\nbecause you're building something that only works when you personally do everything. But now you're to the place where you've got to not be the only one personally doing everything, right? So looking ahead, is this a business that I can nail and scale and then systematize? And this is broken down into kind of the two factors that I have on here, macro trends being one of them.\r\n\r\n\r\nWhen I say macro trends, you may or may not know what that means. Macro is like the larger environment. Micro is going to be the smaller environment. Micro triggered, but it's going to be the larger United States. How's the economy? What does the Fed look like, et cetera? I freaking love businesses with macro tailwinds. I worked in healthcare for a long time.\r\n\r\n\r\nYou can make a lot of mistakes working in healthcare because you've got this massive macro tail when pushing behind you. Think of it like this. If I started a business in any, in a given market in the United States, what is the average annual growth rate in the United States? 2 % a year, let's call it. Then on average, every business in that market will grow at 2 % a year. So I can expect my business to grow at 2 % a year. That's, that's not a ton of growth. There's not a ton of wiggle room in there. I'm probably just average competing against everybody else. What if I started a healthcare business?\r\n\r\n\r\nYou know what healthcare businesses are freaking growing at? Seven, eight, nine, 10, in some cases 20 % a year, given the specialty and industry. But healthcare businesses are double, triple, quadruple what average GDP growth is. So think about that. Again, back to what we were talking about. You've got fat margins to play with. You can make a lot of mistakes. I've got this tailwind pushing me. And in the United States, we've got a ton of aging population. The baby boomers are all retiring.\r\n\r\n\r\nNikolas Hulewsky (24:53.976)\r\nThere's a lot of scariness that comes with that because you to figure out like Medicare and Medicaid and Social Security and how we're going to care for all these people. But there's also a lot of opportunity because who's going to care for these people? How do we get in there? So the macro environment, I think, is really important. And you need to look at whatever business you're looking at. Is the market helping your personal efforts or is it fighting them? If you're a bookstore in 2010, it doesn't matter how good your personal customer service is or how passionate you are. You're playing against Amazon. You're going to lose. Period. End of story.\r\n\r\n\r\nIf you're a health home, healthcare business today, that market is amplifying your business, right? Like you're going to work hard, but you're also going to have this multiplier effect of the macro environment pushing behind you. So again, when you are the competitive advantage, you need the market pulling for you, not fighting against you. Do not, you know, there's like, there's a couple, there's one saying it's like, don't fight the fed. You can think of that here too. Don't fight the macro, go and find the path of least resistance.\r\n\r\n\r\nwhen you're looking at the macroeconomic environment. The second piece is scalability and systems. Again, when I'm looking at, I personally grow this without breaking? Can you eventually systematize what you've personally figured out? If you are a custom software development company that creates custom software solutions for different businesses, that's really hard to scale. You gotta go and find other people who are really good at writing custom software. You can only...\r\n\r\n\r\nsystematize things so much at the end of the day, you got to have somebody who can go in, identify the opportunity and create custom solutions. If you are a landscaping company, that's pretty easy to systematize. Hey, these are the tools we use. This is the I'm way out of my depth here, but you get what I'm saying. You can kind of write your SOPs to have them work for you in a business that is very easily repeatable. So again, not again.\r\n\r\n\r\nBut if you haven't personally mastered it before you go to systematize it, you can't systematize it. You don't know what you're doing. You can't scale it. For many reasons, this is why I like actually franchises more than I thought I would is because in a franchise, yeah, you're paying a little bit of money to get into it, but they've systematized everything for you. just, it's like plug and play. I just go out and find business. It's freaking great business model. Okay.\r\n\r\n\r\nNikolas Hulewsky (27:23.17)\r\nI want to show you guys what I've built. But before I do that.\r\n\r\n\r\nNikolas Hulewsky (28:39.616)\r\nOK, let me show you a kind of a real life example of how I use this framework to evaluate businesses, right? So. This is a.\r\n\r\n\r\nscore card. I don't know what to call it. I think that I built myself. I use this when I'm not only creating content, but when I'm just like looking at business to get an idea of how it works. And I put a junk removal company in here. Dude, I freaking love junk removal. How hard is that? There's junk. I throw it away. AI is not going to automate that. We're always going to have junk. It's a freaking great business. So I put it in here, junk removal, and it spits out for me a couple of things. The first thing is this like Neanderthal score.\r\n\r\n\r\nIt's exactly what it sounds like. Could a neanderthal run this business? Like, do I have to be smart? No. Junk removal? No. I see junk, I put it a truck, I throw it away. Very simple. It then outputs this cost to play. For a junk removal business, looks like $35,000 is probably the total that I need. And you can see here, like the full report is here. This is just kind of the scorecard. How easy is it to validate? This is a very easy business to validate. And what are my earnings potential?\r\n\r\n\r\nlooks like this is broken $60 you can earn $60 pretty good. Make $60 a year. Whoo. That's good money. That's good money in some places. Alright, so here's here's the rest of it. Rookie reality number one, can I personally handle the day to day operations? So what this does is it breaks down and scores each one of those operational complexity of a junk removal business. Three out of five people complexity three out of five right?\r\n\r\n\r\nSimple workflow, physically demanding, requires permits and disposal knowledge. So it's kind of difficult, but not really. People complexity, you can start solo, but you might need crews. So you see these numbers right next to it, this times 1.5 and these times 0.75. That's the weight that I've added to these scores. And at the end you'll see, or not at the end. Let's see. Yeah, at the end you'll see what the scores are. Operational complexity is pretty high.\r\n\r\n\r\nNikolas Hulewsky (30:50.262)\r\nOnly thing higher than operational complexity is customer acquisition, but it's probably the second most important thing. Can you do the fulfillment by yourself? The people complexity, it's not really in my opinion, and that's why it's scored less than a one. It's important, but I'm only going to be looking at businesses that have.\r\n\r\n\r\nthat have scores that allow me to leverage me, right? So I don't view it as that important of a thing. Reality number two, can this junk removal business get customers? So customer acquisition, yes, there's multiple proven channels, Google, referrals, social. It's got a fast sales cycle, decent LTV. cool. LTV to CAC ratios of three to five to one. Yeah, that's really good. Revenue model, so that gets a four out of five. Revenue model gets a two out of five.\r\n\r\n\r\nbecause these are one-time transactions, right? These are like project-based, it's not recurring revenue. The reason that customer acquisition is a two, right? It's like the value gets doubled in there is because that is the most, in my opinion, that is the most important thing when you're looking at these businesses. Do I understand customer acquisition? And is there a proven way that me with no experience could actually generate business if I got into this business? And you can see here when we're talking about junk removal, the answer is yes, it's a four out of five.\r\n\r\n\r\nUm, there's tons of proven channels you can freaking knock doors. You could do on Google. You can go to Metta, but yes, there are proven channels for you to go out and get business. Uh, and so the, the assessment on this is it's good. It's I don't know if I said this, but like, the higher the score, the better, the lower the score, the worse it is. So that revenue model piece was two out of five. All right. Can I personally survive the learning curve and the junk removal business?\r\n\r\n\r\nsolid 15 to 35 % net margins, fast cash collections, which is same day and predictable per job economics. We got a four out of five here. The cost to play, so this isn't actually calculated, this is just a raw number, about $35,000 that you'd need to get into this business. And so it doesn't give it to me right here, but if I go back to the top, I can go look at the full report and the full report will tell me in order to get into this business, it's about $25,000 startup plus $5,000 in working curve.\r\n\r\n\r\nNikolas Hulewsky (33:13.388)\r\ncapital plus $5,000 in an owner buffer. So the startup is going to be something like probably just your truck paid ads.\r\n\r\n\r\nNikolas Hulewsky (33:24.428)\r\nAnd then the last, the last section, can I personally grow this without breaking the macro tail ones are good four out of five and that's only has a one as the weight. we've got an aging population. So there's going to be a lot of people throwing crap away. we've also got a convenience economy. So it, it's good plays into a lot of good macro trends, scalability. It's a three out of five. So it's like right middle of the road. You got to optimize roots. You've got to have scheduling a little bit.\r\n\r\n\r\nYou can have a scheduling system, but it's inherently labor intensive, right? So it's always going to be kind of a difficult business. So takes all those scores. It puts it here. It's weighted and we get something that's called the Neanderthal score. So basically if it's a five out of five, it means a Neanderthal could run this business. And if it's a one out of five, it's stop whatever you're doing. Don't think about this business again, go find something else. Red flags in this business. Again, this is junk removal. There's no, there's no moat, right?\r\n\r\n\r\nThis is what I call the downside of the upside. So we've been talking about all the things that you should be looking at in order to get into these first time businesses. Well, inherently, if it's easy for somebody who has no experience to get into it, it's going to be easy for someone with no experience to get into it. anybody can get into it. You're to have a lot of competitors getting into the space. There's no moat. I mean, that's literally just by definition. There's no moat if it's an easy business to get in and out of. And what happens in easy businesses?\r\n\r\n\r\nCommodity service just means if something becomes a commodity or it's commoditized to pricing, bananas, apples, wheat. I'm trying to think wood, right? I get almost the same result anywhere that I go. If I go to Walmart or Target or Whole Foods, an apple's an apple. Once it becomes commoditized to pricing, then that means pricing's the same everywhere. And if you have no pricing power, you can't actually extract better margins.\r\n\r\n\r\nFrom your competitors. So everybody in that space kind of just charges the same thing. So that's why that's saying hey Look, this is a commoditized service red flag here. Just know that and then the other red flag is These are one-time transactions. So there's no recurring revenue piece to it But Nick's recommendation is exceptionally survivable rookie friendly That is one thing I didn't say in the beginning of this your whole goal year one getting an entrepreneurship survive That's it\r\n\r\n\r\nNikolas Hulewsky (35:53.654)\r\nIt's not to make a million dollars. It's not to get that lake house that you've been dreaming of. Your first year in entrepreneurship, survive. Learn the business, right? Year two, grow.\r\n\r\n\r\nAnd then years three, four and five is just continuing growth. But year one, we're not trying to double, triple, quadruple the size of the business. We're not trying to crush it, kill it. You know, just there's so many people who post, dude, I'm freaking crushing it. I did this in six months. I did this in one year. I made a million dollars in one transaction. Forget those people. Log off of Twitter. Don't go on social media again for a year. Just focus on understanding and building a business. That's it. Year two, growth.\r\n\r\n\r\nwe can start hiring, we can start pushing paid ads a little bit more. We can start kind of pulling you out of all the operational fulfillment of the business and hiring people to do that. But year one, man, you're you're head down. It's some crazy statistic, but I want to say 50 % of businesses fail in the first year. Let's go look it up.\r\n\r\n\r\nNikolas Hulewsky (37:07.958)\r\nAlright, 20 % of businesses fail in year one. 50 % of businesses fail within the first five years. 70 % of businesses fail in the first 10. So just surviving in year one is hard. 20 % fail rate, That's a lot of failure. Don't lose sight of the prize. You gotta make sure you have a little, you're baking sourdough here, right? You gotta make sure your starter works. You gotta make sure.\r\n\r\n\r\nthat that thing is going to actually be replicable over and over and over again. So like if that baby dies, it doesn't matter how cool your systems might have been. You don't have anything to systematize. So year one, you are just focusing on the business. That's it. Year two, you're growing. And then year three,\r\n\r\n\r\nYou turn it into a hold-co and you just roll up everything inside. I'm just kidding.\r\n\r\n\r\nNikolas Hulewsky (38:12.462)\r\nQuick reality check on the scoring here is like every high score means that you can be the competitive advantage. Every low score means you're fighting against yourself basically. So if it's got a high score, it means that you with just your work ethic and really no experience can out compete other people.\r\n\r\n\r\nNikolas Hulewsky (38:37.688)\r\nOkay, here's what I want you to do in the next 48 hours. Find a business that you've been looking at and run it through this framework. Okay, be honest with yourself. Can you personally make it work? Score it honestly. Like if you're not honest, it doesn't really matter. Not on the potential of the business, but on your potential to operate it, right? If you score it and anything comes under 3.5, screw it, go to the next one. If it's over four,\r\n\r\n\r\nthen we're in the ballpark of like, all right, cool. My hustle can actually get this business off of the ground. And if you're making excuses for a low score, red flag. Have you ever seen the rest of development? There's this scene where Tobias and Lindsay are having a conversation. And I think it's Tobias. can't remember who. One of them throws out having an open relationship in their marriage. So that means dating other people. And Tobias makes a joke and he goes,\r\n\r\n\r\nHe goes, no, Lindsay, Lindsay goes, what is it? Dang it.\r\n\r\n\r\nNikolas Hulewsky (39:58.862)\r\nThat's what it is. Lindsay asks Tobias, she's like, well, does it ever work? And Tobias goes, no, no, no. No, these people somehow delude themselves into thinking that it might, into thinking that it would work, but it never does. But it just might for us. So if you're at that spot where you were looking at this and you're like, oh yeah, 3.5, not gonna work, but it just might work for me. Nope, red flag, rare, hard pass, don't do it. Don't.\r\n\r\n\r\nfreaking do it. You need to find something that's like green light. All systems go. I can jump into this thing. So to wrap this up, like there needs to be a mind shift mind shift. There needs to be a mindset shift. Stop seeing the personal operation of a business as a limitation. It's actually your competitive advantage for your first business. Like while your competitors are trying to delegate and systematize\r\n\r\n\r\nYou're going to outwork them personally. You're to go out and get more customers. You're to learn the business so that when the opportunity comes to scale it, you have a reservoir of knowledge to pull on to actually create these systems and to hire people and to train them. I just, hate that people are like, I want to be working on the business, not in the business. Or they're like trying to borrow 10 steps ahead. Like you, you can't skip steps two through three. You just can't, you have to learn the business.\r\n\r\n\r\nAnd it's actually your competitive advantage when you are the business. I know it sucks, you don't want to be in that place. And eventually you'll be in a place where you can buy other businesses or do other things where you are not the linchpin. But when you first get into entrepreneurship, pick something where you can be the competitive advantage because you're betting on yourself. It's absolutely what you should be doing. master it personally first, then systematize it, then delegate it. Never skip those steps. Master it.\r\n\r\n\r\nSystematize it, delegate it, period. Find a business where like your personal effort, again, is the main competitive advantage and you won't lose. If you wanna get access to the scorecard that I was showing and you can just, you know, think around with it, I'll show it to you one more time.\r\n\r\n\r\nNikolas Hulewsky (42:22.412)\r\nHere it is. All right, so if you want access to this, so when I click new analysis, you can just hit any business that you Landscaping.\r\n\r\n\r\nNikolas Hulewsky (42:35.138)\r\nthen sign up for my newsletter and you will get a link to this and you can mess around with it all you want. It's pretty cool. Gives you like a scorecard and an output version. and if you, this is the first time that I've done a solo episode like this, so probably sucks. I'd like to hear that. cause I'm testing this out. I've gotten a lot of feedback from people that are like, we want to hear from you do a solo episode. So that's what this is. How did I do? Let me know if it was good. Share this with a friend. If it wasn't.\r\n\r\n\r\nShoot me an email and say, Nick, you're a freaking moron. Don't ever do that again. And I will cry myself to sleep, but at least I'll know that's an important thing.\r\n\r\n\r\nNikolas Hulewsky (43:14.134)\r\nYou know the ask to do at the end of all these episodes. If you like this, like, subscribe, share this with a friend and I'll see you next time on economics.",
  "metadata": {
    "duration": "",
    "date": "2025-08-13",
    "platform_source": "Google Drive"
  }
}