{
  "episode_number": "168",
  "episode_title": "How a Panic Attack Led to Entrepreneurial Success with Raleigh Williams",
  "guest_name": "Raleigh Williams",
  "business_name": "Aqua Trods Escape Games, Deal Maven",
  "transcript": "﻿Nikolas Hulewsky (00:00.142)\r\njust like so freaking buttoned up. It's irritating. Anyways, all right, Raleigh, I am stoked for this because you have been by all accounts, incredibly successful, started a couple of businesses, sold a couple of businesses. You're like living the life that you want right now. Why don't you give the people a taste? What's your background? How much are you worth? How much is in your bank account right now? Just starting right.\r\n\r\n\r\nRaleigh Williams (00:00.926)\r\nYes.\r\n\r\n\r\nRaleigh Williams (00:23.476)\r\nYou want to just see it right now you whip it out That's great That's a that's a great question I'll give you a taste of my background and then we can get as deep into net worth shit as you want to get you know, uh-huh So I started my career as an attorney at a big law firm in Dallas, Texas\r\n\r\n\r\nNikolas Hulewsky (00:27.722)\r\nNo foreplay, man. We're just like going right into it.\r\n\r\n\r\nRaleigh Williams (00:47.252)\r\nI thought I was gonna be an attorney for the rest of my life, but then 30 days into that job, I had a panic attack on my way to work and it became clear to me relatively quickly that I had spent 350 grand on a degree and a career that was a copy paste answer of what my dad wanted to do with his life. I was really doing it to please him. He was an attorney. I have a bunch of attorneys that are my older brothers and sisters and so I...\r\n\r\n\r\nI had kind of followed them into this career path and very quickly realized that I had made a mistake, but I didn't know what I wanted to do instead. That had been my answer from the time that I had returned from a Mormon mission of what I wanted to do for the rest of my life. Arcadia, California, Spanish speaking.\r\n\r\n\r\nNikolas Hulewsky (01:30.488)\r\nWhere'd you go on your mission, by the way?\r\n\r\n\r\nNikolas Hulewsky (01:34.866)\r\nAcadia, you know, Glandora's Laverne Yeah, it is it is in your mission lover. That's where that's where I lived for the last 10 years before moving to the I know. Yeah\r\n\r\n\r\nRaleigh Williams (01:36.604)\r\nYeah, Glyndora's in my mission, think. Glyndora's... Yeah.\r\n\r\n\r\nreally? Yeah, I was in East LA, Boyle Heights, baby, in the hood. And so that was a very disrupting moment for me of, you know, I don't know what to do. And so I tried a bunch of things and failed at a lot of things. I tried a YouTube channel. I tried to buy tax liens. I tried to start a senior care facility, all while practicing law. None of that stuff worked. And\r\n\r\n\r\nNikolas Hulewsky (01:48.885)\r\nThat's right, okay\r\n\r\n\r\nRaleigh Williams (02:12.04)\r\nThen I found in 2015, there was a Market Watch article that said the unbelievably lucrative business of escape rooms. that put me on to this idea of escape rooms. I went and played my first escape room that same night in Dallas and was just blown away by how simple the idea was and how insane it was that people were paying money to get locked in a room to then get back out again. And that that was...\r\n\r\n\r\nNikolas Hulewsky (02:40.43)\r\nThat's friggin' weird.\r\n\r\n\r\nRaleigh Williams (02:41.404)\r\nsomething that people were interested in doing just blew my mind. it, so anyway, fast forward nine months into my law firm job, I quit that job and I moved to Utah back where I went to college and start Aqua Trods Escape Games with my brother and one other partner who also quit his job from KPMG, the accounting firm. And we ran that for six years. at the end of it, but at the time that we sold it included trampoline parks.\r\n\r\n\r\num, axe throwing business, a business that we, that, that I had kind of developed from scratch called labyrinth, which was basically, um, automated escape rooms. So we developed software from scratch on how to automate these escape rooms where they could go and play multiple rooms. And in, uh, in 2022, it took me nine transactions to get out of that business, totally buying out partners, selling off deals bit by bit. But I ultimately sold all of the locations, all the businesses for a\r\n\r\n\r\nNikolas Hulewsky (03:35.96)\r\nJeez.\r\n\r\n\r\nRaleigh Williams (03:40.884)\r\ncombined enterprise value of 26 million bucks. And that did not all go into my bank account. I had partners, we had some debt on some real estate. So I made enough for a steak dinner at Longhorn's steakhouse and couldn't afford Ruth Chris. No, made, yeah, I couldn't get the surf and turf. I couldn't get the surf and turf special, but the turf was great. And no, I made.\r\n\r\n\r\nNikolas Hulewsky (03:57.262)\r\nNot a seafood dinner, steak dinner. Yeah, you couldn't afford the seafood.\r\n\r\n\r\nRaleigh Williams (04:08.528)\r\nmillions of dollars in that transaction. Just, didn't get all 26 million of it. and then shortly thereafter, my wife got breast cancer. Six months after selling my business, my wife was diagnosed with stage three breast cancer as a 32 year old fitness influencer. And, two months prior to her diagnosis, my mom got breast cancer. So it was this moment of, had kind of reached this pinnacle moment, you know, returning from my Mormon mission. I was like, I want to be a millionaire by 30. That's my goal. And\r\n\r\n\r\nreaching that and then very shortly thereafter realizing how unimportant all of those things are in the greater scheme of things. Dealt with breast cancer for a couple of years. My wife still has breast cancer now. It was in remission, then it came backstage for breast cancer. And so I think that's the nutshelled version of it. And yeah, that's my story and I'm sticking to it no matter what you say.\r\n\r\n\r\nNikolas Hulewsky (05:07.022)\r\nDude, be careful, because I'll find something to say to make you change your tune. I can't, just the roller coaster. So 2015 to 2022 is what? Seven years that you ran the escape room. And you were just going as your nickname, balls to the walls, Rawls. You were just like balls to the wall with these businesses. Like, yeah, I mean.\r\n\r\n\r\nRaleigh Williams (05:28.433)\r\nYeah The name precedes me yeah\r\n\r\n\r\nNikolas Hulewsky (05:34.67)\r\n$26 million, how many locations did you have?\r\n\r\n\r\nRaleigh Williams (05:37.556)\r\nseven locations.\r\n\r\n\r\nNikolas Hulewsky (05:39.866)\r\nand did you sell to private equity or did you sell them one off sort of piecemeal?\r\n\r\n\r\nRaleigh Williams (05:44.254)\r\nSold them one off to SBA buyers one by one. There was a real estate aspect of the deal that was about 12 and a half million bucks of that 26. And then the rest of were just the operating businesses which ended up being about 14 million bucks between those seven locations. My brother had started.\r\n\r\n\r\nNikolas Hulewsky (05:48.141)\r\nWhy?\r\n\r\n\r\nRaleigh Williams (06:06.868)\r\nat a single location, Trampoline Park Business that I had started with him prior to law school. So that was in 2011. So we had one location that had started as a trampoline park business in 2011. I sold it, went to law school, realized that I hated law and was like, hated. I'd like to come back and maybe do this escape room thing as something that we could do together. So that was kind of the entry point in. And so all in between all the locations, really 2011 to 2022. But we were in\r\n\r\n\r\nscale growth mode from 2015 to 2022.\r\n\r\n\r\nNikolas Hulewsky (06:43.438)\r\nI want to talk about the cancer stuff in a minute because we're not just going to gloss over that. there's a lot of people listening to this who are probably in a similar situation. I was a W-2 employee for a long time until I made the jump and you obviously went to law school to kind of freaking ton of that. Where'd you go to law school?\r\n\r\n\r\nRaleigh Williams (06:58.781)\r\nUniversity of Chicago.\r\n\r\n\r\nNikolas Hulewsky (07:00.266)\r\nOkay, great law school. I was gonna say you didn't go to the Lord's Law School because that would have been a lot less debt. I you're walking out with $350 from Brigham Young University.\r\n\r\n\r\nRaleigh Williams (07:04.148)\r\nI had a full ride at full ride at BYU so I could have gone scot-free, yeah. I can't do the beard thing. The beard thing is a bridge too far, you know?\r\n\r\n\r\nNikolas Hulewsky (07:12.674)\r\nYou're like, couldn't do it. I couldn't do it.\r\n\r\n\r\nNikolas Hulewsky (07:18.542)\r\nIt's funny. So I went to USC undergrad and then UCLA for my MBA. And the only school that rejected me was BYU for my undergrad. Yeah. Yeah. It was pretty funny. I was a transfer student and I didn't have, I wasn't going to Institute. And so I didn't have like the, I mean, I had an ecclesiastical endorsement, but I didn't have Institute. And I was like, well, I didn't want to go to BYU anyways, which I actually didn't want to go to BYU. But for those who don't know BYU is so freaking cheap. It's so cheap.\r\n\r\n\r\nRaleigh Williams (07:28.914)\r\nNo way.\r\n\r\n\r\nRaleigh Williams (07:37.172)\r\nmy gosh.\r\n\r\n\r\nOkay.\r\n\r\n\r\nRaleigh Williams (07:47.432)\r\nYeah, very cheap.\r\n\r\n\r\nNikolas Hulewsky (07:49.166)\r\nAnd relative to the quality of the education, I don't think there's a better bang for your buck than BYU in the country. Anyways.\r\n\r\n\r\nRaleigh Williams (07:53.3)\r\nI don't know why I'm doing this Matrix camera thing. Can I fix this real fast?\r\n\r\n\r\nNikolas Hulewsky (07:57.77)\r\nyeah, yeah, go for it. This matrix camera thing.\r\n\r\n\r\nRaleigh Williams (08:02.718)\r\nCan you see that? Is that just on my side or does it show like?\r\n\r\n\r\nNikolas Hulewsky (08:05.294)\r\nIt's just on your side. You look great on my side. No, uh-uh.\r\n\r\n\r\nRaleigh Williams (08:07.838)\r\nDoes it not show anything weird? doesn't like green out or like, okay, then we're good. If it's just myself.\r\n\r\n\r\nNikolas Hulewsky (08:13.742)\r\nNothing weird at all. Famous last words, but yeah, nothing weird at all. Anyways, do think there's a lot of people who have gone to school, taken on a ton of debt. They're in the job that they thought they were supposed to be in because the dad thought they were, whatever. And then really quickly they're like, oh my gosh, I got to do something different. But then they've got to pivot. I think there are those types of entrepreneurs. And then I think there are hustlers.\r\n\r\n\r\nRaleigh Williams (08:18.101)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (08:38.658)\r\nwho was like my friend Chris, it's like he's never had a job. He will never be able to have a job from anybody else. He's he's been like since he was seven, like, can I can I get that golf ball for $2 and sell it for four? That's just like always like scheming. And that wasn't me. Anyways, how long did it take you to go from panic attack to full time escape room, which again, interesting choice of business, locking yourself in a room and trying to figure out how to get out in a certain specified amount of time when you have panic attacks, but but yeah.\r\n\r\n\r\nRaleigh Williams (08:48.274)\r\nRight? Yeah.\r\n\r\n\r\nRaleigh Williams (09:05.48)\r\nYeah, not a claustrophobia induced panic attack. It was a situational circumstantial panic attack, know, an existential panic attack, not a circumstantial.\r\n\r\n\r\nNikolas Hulewsky (09:09.068)\r\nOkay, fair. Fair.\r\n\r\n\r\nNikolas Hulewsky (09:16.462)\r\nYeah, yeah, yeah, no. It wasn't one of those weird circumstantial panic attacks. It was an existential panic attack. So it was much, it much better. But yeah, but yeah, how long in between that and like, all right, I quit being a lawyer and now I'm full time.\r\n\r\n\r\nRaleigh Williams (09:20.02)\r\nYeah, much more grave.\r\n\r\n\r\nRaleigh Williams (09:29.076)\r\nEight months, was, yeah, 30 days into the job, had it. between starting and quitting, was nine months and big loss total.\r\n\r\n\r\nNikolas Hulewsky (09:42.594)\r\nBut dude, said, okay, you said like as a lawyer, you're like, I tried to start a residential healthcare facility. tried to start like three other businesses in nine months.\r\n\r\n\r\nRaleigh Williams (09:48.072)\r\nYeah. Yeah, I was, I mean, the day that I had the panic attack, I signed up to become a realtor in Texas. So I signed up to take the real estate exam. So I took the real estate exam like that next week and became a realtor. And then I met with brokers to sell residential real estate. And I was like, I hate this. I can't stand this. thought maybe I would do McKinsey consulting. mean, when I get...\r\n\r\n\r\nNikolas Hulewsky (09:52.247)\r\nJeez.\r\n\r\n\r\nRaleigh Williams (10:14.74)\r\nWhen I am unhappy in some place, I take that very seriously and I start taking action very quickly. And so on the senior care facility, there were two other guys that were a year younger than me at the University of Chicago that wanted to do senior care facilities. So we started looking at houses. I was gonna buy a residential house and then retrofit it into kind of a small senior care home-based facility, right? Yeah, tiny.\r\n\r\n\r\nNikolas Hulewsky (10:24.031)\r\nman.\r\n\r\n\r\nNikolas Hulewsky (10:40.641)\r\nYeah, yeah. Six bed facility. Yeah.\r\n\r\n\r\nRaleigh Williams (10:43.828)\r\nThat was the original idea. And the escape room thing, for whatever reason, after I had gone and done it, it felt different. It honestly felt different than all of the other things that I had tried. After I'd done the escape room that next morning, I woke up, I didn't sleep the entirety of the night. When my wife woke up, I was like, I'm quitting law and I'm gonna start an escape room business. And she's like, what are you?\r\n\r\n\r\ntalking about because before that everything I was trying to find something that fit within my life as a lawyer that I could do adjacent to it. And this was the first time that I was like, this is the opportunity that I've been waiting for. And if I don't have the courage to go all in on this, then I need to shut up about being an entrepreneur or that I'm going to do my own thing. Because if I miss this boat, then like it or if my brother goes and he does it without me and he crushes it. And I felt this\r\n\r\n\r\nNikolas Hulewsky (11:32.641)\r\neasier.\r\n\r\n\r\nRaleigh Williams (11:40.016)\r\nintuition that that was what I needed to do and I ignore it then like I just need to be quiet about being an entrepreneur from now on because this is the this is the internal signaling mechanism that I've been waiting for I have it it's requiring me to do the one thing that I promised myself I wouldn't do which was I want to figure out how to make money outside you know adjacent to my job that doesn't require me to blow everything up but then my one internal pool was you must do this and by definition it will require you to blow everything up\r\n\r\n\r\nNikolas Hulewsky (11:47.662)\r\nHmm.\r\n\r\n\r\nRaleigh Williams (12:09.448)\r\nAnd so I was like, all right, let's go for it.\r\n\r\n\r\nNikolas Hulewsky (12:12.536)\r\nDude, so graduated University of law firm. I'm gonna guess starting salary, 180 probably in that ballpark. Okay.\r\n\r\n\r\nRaleigh Williams (12:19.796)\r\nYeah, 160 back in the day. I put my two week notice in the day that they raised our salary from 160 to 180. I'm like, I gotta quit right now, otherwise I'm gonna get addicted to this extra 20 grand. I gotta be out.\r\n\r\n\r\nNikolas Hulewsky (12:31.736)\r\nWhat did your wife think? Did you have kids at the time?\r\n\r\n\r\nRaleigh Williams (12:35.348)\r\nWe had a two year old at the time, yeah, to her credit. She was supportive all of the way. Like when I told her about the panic attack and when I told her that I was quitting, she never once was worried about how we were gonna pay for anything. I mean, we moved from, I went from making what I was about to make $180,000 a year and to her parents basement with her and my two year old daughter and to Utah. And Utah's a very,\r\n\r\n\r\nkind of visual place, a lot of Instagram, a lot of people on social media. And so to go from a decent salary to in-laws basement after going to law school and a very expensive law school and to be at the very, very bottom in a place where there's a lot of young entrepreneurs that are apparently very successful was difficult for her. It's embarrassing to.\r\n\r\n\r\nNikolas Hulewsky (13:08.173)\r\nyeah, keeping up with the Joneses.\r\n\r\n\r\nRaleigh Williams (13:33.446)\r\nhave to do that. But she was always on board.\r\n\r\n\r\nNikolas Hulewsky (13:38.584)\r\nYeah, my wife would have been like, escape rooms? You better escape this room before I beat the crap out of you. Go back to work. Was she embarrassed?\r\n\r\n\r\nRaleigh Williams (13:45.564)\r\nYeah, 100%. I think that's typical, honestly. I don't think, no, I think, I don't think that she was embarrassed about what we were doing. I think she was embarrassed, again, at the situation, maybe a little bit. You know, a couple months into starting it, you know, I quit my job. We started Alcatraz in June of 2016 and\r\n\r\n\r\nby December of 2016, we still hadn't made a distribution yet. And so we hadn't made any money. so she's, and I was, I.\r\n\r\n\r\nNikolas Hulewsky (14:21.198)\r\nDude, no, you said it like it was a bad thing. think anybody listening should know. If you start a business in June and you haven't taken a distribution by December, that's very normal. That's like a very, very short timeline. But when you start, you're like, oh yeah, we should be making money in like two months. Because you're just like an idiot.\r\n\r\n\r\nRaleigh Williams (14:31.893)\r\n100%.\r\n\r\n\r\nRaleigh Williams (14:37.458)\r\nYeah, I mean, I had a partner that was the CPA. So we ran the financial model and it's like, dude, in like three months we'll be like crushing it. yeah, mean, like, dude, it's on Excel. I don't know why Excel, do we have the button that it goes from Excel to my bank account? Cause like there's something with that API, you know?\r\n\r\n\r\nNikolas Hulewsky (14:46.04)\r\nWell, if you had a financial model, like what was the problem?\r\n\r\n\r\nNikolas Hulewsky (14:55.968)\r\nI would, I always say that to people. like, it's spreadsheet porn. Cause you're like, okay, well if I just move this around and you're okay. I just, Well actually if we were to grow by 20 % that month instead of 15 % and that, you know what I mean? You like work yourself up into a lather. It's like, dude, throw that out the window. Just go freaking try to build something.\r\n\r\n\r\nRaleigh Williams (15:03.358)\r\nYeah\r\n\r\n\r\n100%. And so, because especially in a law firm where you're stuck there and you can't really go start executing because it's a physical location that you, we didn't have yet. That all feels super productive. You know, it feels productive to build the Excel model and to get the numbers out and to kind of go through what it's going to look like.\r\n\r\n\r\nNikolas Hulewsky (15:32.578)\r\nMm-hmm.\r\n\r\n\r\nRaleigh Williams (15:36.28)\r\nyou know, we, made every mistake in the book. We, we undershot how much it was going to cost to get it built. any, any operating profits needed to go back into the business to continue to build out the rest of the facility. Cause we undershot our budget by 150 grand and, you know, we undershot capacity and demand. thought that we would be full, you know, 80 % of the time, which is like, not wise. It just doesn't happen. And brick and mortar entertainment.\r\n\r\n\r\nAnd so we just made a lot of mistakes, made a lot of bad assumptions. But again, to my wife's credit, she was all, there were basically two people that supported me. One was my wife, which was really the only one that really mattered. The second one was a guy that I met in Dallas named Steve Houghton, who's a billionaire. And he had quit his job 30 or 40 years prior. And he was like, you are not meant to be a lawyer. You can be so much more than.\r\n\r\n\r\nwhat you are. And so I trusted Steve Houghton. I trusted what he saw in me before I saw it in myself. I trusted this is a smart guy that sees something in me that I can't see in myself. Everyone outside of those two people and the guys that I started it with, everyone else to a man thought that it was a objectively horrible idea. My dad and I didn't speak for many years.\r\n\r\n\r\nNikolas Hulewsky (16:42.733)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (16:57.804)\r\nHahaha\r\n\r\n\r\nRaleigh Williams (16:59.028)\r\nWe didn't speak for years after he was livid. He told me that he told me that I was throwing my life away and this was going to be the biggest mistake of my life. and so everyone within my family felt like it was, you know, that Raleigh has gone off the rails, but really I was just balls to the walls, Rawls, you know? And so like, if they don't know me, yeah, yeah, that's right.\r\n\r\n\r\nNikolas Hulewsky (17:03.578)\r\nreally?\r\n\r\n\r\nNikolas Hulewsky (17:09.446)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (17:20.398)\r\nYou can't stop. Look, if you have a nickname called Balls to the Walls Rawls, you're not going to be a corporate attorney. I'm sorry. This is not going to happen. There's a million questions I have about the business. I'm actually going to pivot and not… I don't want to talk about the bit. You're successful. $26 million exit. I don't even want to talk about that anymore. I want to talk about this part of it. I have a ton of respect for people like you because you're just like, I can't do it. I'm going to…\r\n\r\n\r\nRaleigh Williams (17:37.724)\r\nI am. Yeah.\r\n\r\n\r\nNikolas Hulewsky (17:50.67)\r\nI'm leaving right now. And my question is, how did you find the internal fortitude to do that? Like, did you know what you wanted to do or you just knew that you didn't want that?\r\n\r\n\r\nRaleigh Williams (18:05.446)\r\nI still don't know what I want to do. I just know what I don't want to do. I think, know, and in some religious traditions, there's something called via negativa, which is, you know, the negative way shows the path just as clearly as the positive way. We all want the positive way of this is your path. Let me light the way before you. Let me give you positive affirmations and lead you around this way. And that's beautiful. It's just never, unfortunately, it's never happened for me that way. It's always been, this is not the answer.\r\n\r\n\r\nNikolas Hulewsky (18:19.982)\r\nMmm.\r\n\r\n\r\nRaleigh Williams (18:33.69)\r\nare you willing to go through the pain to find what is the answer? that, so that question of how did I find that courage, was simply a function of, I knew that if I continued to practice law, that my life as I had one day envisioned it, all of my aspirations, everything, I had to either pick between appeasing the society, the crowd, the,\r\n\r\n\r\ncommunity that I had, you know, grown accustomed to or picking my own internal vision for what I had for my life, even when that vision wasn't very clear yet. And I just knew, I just knew that they were mutually exclusive. I knew that I couldn't do both anymore. And the beautiful thing about a panic attack is that, is that in that moment, you are utterly and totally alone. There is no one else that can end it for you.\r\n\r\n\r\nYou know, my dad couldn't help me, my dad's approval, my mom, my sisters, my siblings, my buddies from law school, none of them were there. It was me totally and utterly by myself. And I believe that in everyone's life, anyone's life, if you've lived, you know, for at least three or four decades, you'll go through a moment where you find yourself utterly and totally alone. And the question that you'll be faced with is,\r\n\r\n\r\nDo I want to continue doing my life the way that I'm doing it now that in this moment of me being alone, no one else is here. So who am I really living for? am I who? Because before it was like, as long as I keep my dad happy, you know, I'll always be safe. I'll always have a safety net of approval. And like if things really go poorly, he'll be there to kind of protect me and save me. And so I call all of that the default path. The default path is a path that we pick.\r\n\r\n\r\nNikolas Hulewsky (20:16.714)\r\nMm-hmm. Yeah.\r\n\r\n\r\nRaleigh Williams (20:31.024)\r\nnot because we want it, but because we unconsciously believe that it will protect us from the reality that is life of pain, uncertainty, and constant work. And when uncertainty or pain hit us, find us on the default path, we have to ask the question of like, I was only doing law because I was supposed to be the safe thing and now I'm having these panic attacks that no one can protect me from. And so I think life presents you with questions.\r\n\r\n\r\nwhere the old operating manual no longer answers it in a way that's sufficient for you to say, yeah, I'm not gonna ask any more questions anymore. And so I believe that if you find that, if you find the courage to ask that question and to just go wherever that question leads you, because it's been that same pattern now of getting into that business, of me deciding to sell that business, of my wife getting cancer, of my wife getting cancer a second time. So I've seen that pattern four or five times of,\r\n\r\n\r\nlife says, hey, your prior operating system isn't working. Do you wanna just keep pounding it? And do you wanna just keep pretending like it works and that everything's okay and just shut off part of yourself? Or are you willing to have the courage to find a new answer that maybe is more in alignment with the experience that you're having? how, go ahead.\r\n\r\n\r\nNikolas Hulewsky (21:45.326)\r\nHave you ever seen the show I Think You Should Leave?\r\n\r\n\r\nNikolas Hulewsky (21:51.916)\r\nFirst of you to watch it. But there's this it's a comedy sketch show and there's a sketch that he has where his neighbor dresses up a pig and runs it through his doggy door. But the pig has a Richard Nixon mask on it. And so when he sees the pig, he thinks it's a monster because he's been staying downstairs and he hasn't been able to sleep. And so he's in this like half sleep state when he sees it and he like imagines it's a monster. And he's like looking at he's like, what is that? That is a thing that lives on earth with us. It's like this whole thing. And he's like\r\n\r\n\r\nRaleigh Williams (22:21.62)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (22:21.998)\r\nHe's talking to the camera telling it about the experience. He's like, the first thought I had was, at least I don't have to go to work on Monday. What kind of a thought is that? What kind of a world do we live in? anyways, I think of that sometimes, because it's like, yeah, if you're having that panic attack and your first thought is like, I don't want to be a lawyer anymore, it's almost freeing because you've now identified the bogeyman. You're now like, that's the thing that is like.\r\n\r\n\r\nRaleigh Williams (22:28.756)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (22:51.502)\r\nkilling my spirit. But what's interesting for you is I don't think most people are like, all right, had the panic attack nine months later, I'm in a different business. That's a pretty fast transition. It probably didn't feel fast at the time because you're just trying to like get out. How did you make the jump so quickly? Like, were you methodical about it or were you just like anything but this? How did that work?\r\n\r\n\r\nRaleigh Williams (23:19.412)\r\nI just, I tried a bunch of things that failed and so I became very familiar with what failure felt like and where those pieces weren't in place. And so for me, I wasn't very methodical about it. At first I was like, what's an adjacent career that's safe? And so I thought maybe management consulting. So I started studying for the consulting interviews. And I,\r\n\r\n\r\nI would say one of my, I'm highly attuned to when I'm bored by something. When I'm interested, when I have curiosity around something, I am like Superman, I can run through walls. When something brings me boredom or dread or dissatisfaction, I'm pretty adamant about getting out of that relatively quickly. was the same, like I said, it was the same when I decided to sell the business, when there was a gap in insurance and a lawsuit came.\r\n\r\n\r\nand my COO called me and he's like, hey, we have this new lawsuit. It was, you I'd been running it for six years and I was like, I could feel myself pausing on answering that COO's phone call. And I'm like, this is the exact same way that I felt at my law firm. Like I built myself into a new prison. I'm out, I'm done, I'm out. And it took me three years to fully get out, right? It took a little bit of time.\r\n\r\n\r\nNikolas Hulewsky (24:37.688)\r\nHmm.\r\n\r\n\r\nRaleigh Williams (24:46.868)\r\nto have that all snake through and kind of figuring out the right path. I just, whenever, I just knew, I was, I felt totally claustrophobic to the idea of staying in a law firm and you you could see your life 10 years ahead of you and what a 10th year associate is. It's very hierarchical, it's very clear of like, this is what my life's gonna be like. Okay, I don't want a life like any of these guys. So like,\r\n\r\n\r\nI know this isn't the path, it's just a question of what is. And like, I always viewed it like, I don't need, like the metaphor that I had in my head was, I'm just looking for a piece of driftwood that's like substantial enough that like me, my wife and my two year old daughter can like ride the sea out for long enough. You know what I mean? And, and. Right.\r\n\r\n\r\nNikolas Hulewsky (25:37.614)\r\nthat this isn't gonna be like Titanic where I get let go of because there's no room on the door. We got it all fit. We got it all fit for a period of time.\r\n\r\n\r\nRaleigh Williams (25:43.828)\r\nYeah, we all have to fit and and and then what I realized six years after running that business is I had built it into kind of like a dinghy a little catamaran and I'm like I didn't actually want to be on this like this was only this only helped me get out of my old thing I didn't want this to be my the entirety of my life and so like I've overstayed my welcome here and I need to get out and Find a new thing to do and I don't know what that was and the timing of that was fortuitous with my wife's cancer, you\r\n\r\n\r\npretty shortly thereafter.\r\n\r\n\r\nNikolas Hulewsky (26:15.38)\r\nso I talk, I talked to a lot of people about this for me, I grew up as a performing, I went to performing arts high school. love creativity. Like it was just a part of my DNA. part of who I am. And there's a lot of people who are like, follow your passion, but that's not really, it's not really matched with anything practical. And then there's other people that are like your passion. That's stupid. Don't follow your passion. think, yeah, your dad's probably like that because it's like they had to\r\n\r\n\r\nThey had to kill and bury their passions. it's like everybody else has to do that same thing. For me, when I'm talking to entrepreneurs, I tell them, find what you're passionate about. And that doesn't mean, I'm passionate about music, so I should open a music store. Turns out, yes, I am passionate about music, but what I really loved was creating, problem solving, was collaboration with other people. And once you identify that, it's like there's a whole host of things that I could have done. Right. Like I didn't just tie myself into being in music.\r\n\r\n\r\nBut I went out and like, I did a lot of what do I like to do? What am I good at? Where should I spend my time? That's kind of the antithesis though of this other model that you're talking about, which is like the negative path approach, right? Which is, don't like this, I'm out. Have you switched to like, all right, let me try to find what I want to do. Or do you feel like that's just work best for you? I'm gonna find the negative path as opposed to like sitting down and like, well, what do I like and where should I spend my time?\r\n\r\n\r\nRaleigh Williams (27:43.07)\r\nthink the negative path was important for me in that time where you have to look, the negative path is a, it's not the ideal way to do it, but to find the positive path, it requires space, it requires an opening in your life. So I didn't have any opening in my life. You I woke up at six a.m., I went to the gym, and then I was at work, and then I came home, and then I went to sleep so I could get back to work again. And so there was no time or there was no space for me to, you know,\r\n\r\n\r\nponder on what my curiosity was or what I enjoyed or develop new skills or any of those things. And so if you can find, and even to that question of passion, Passion has been misconstrued to what it actually means. The root of that word means to suffer, right? The passion of Christ is the suffering of Christ. Pati means to suffer. And so we think of passion as, you know, what are the hobbies that\r\n\r\n\r\nbring me no pain or what do I do to kind of avoid my pain? I go out on the golf course, therefore I am passionate about golf. But the real meaning of passion is what is the suffering that you find, what is the suffering that is worth it to you? What is the pain that is so meaningful to you that you are willing to undergo it because it is in furtherance of an objective that you view worth bearing that pain for? And so,\r\n\r\n\r\nI didn't know what that was back then. I have a clearer idea now because I've had some time to create space for myself and space to find curiosity. And the way that I think, one of the best ways to find that space for curiosity to someone, if I was talking to my old, former self in a job that I hated without any idea of what I wanted to do in the alternative, because I wasn't like, I feel like people in the performing arts and people that grow up kind of in a more artistic,\r\n\r\n\r\nbackground are more in line with their emotions and you know They're they're more integrated with themselves than I was living my life from my head up I spent a lot of money to develop these this 18 inches right here and And so I had no internal sense whatsoever of who I was or what I enjoyed outside of the idea of I wanted to make a hundred million dollars you know that was that was the end of my kind of self analysis and so to someone who's living like that I\r\n\r\n\r\nRaleigh Williams (30:07.772)\r\nI think two tactics that are helpful. One is the truth will always set you free. So when you start telling the truth to people, really starting with yourself, right? When I told my wife that I had a panic attack, I knew, you know, for 30 days I would come home from my job that I just gotten and she'd say, how was work? And I would say, fine, I was lying. It wasn't fine. I was, I hated it, right? And I was just trying to work through, I was trying to bide my time for long enough to get to a point where I didn't hate it. I thought, there's a learning gap. It's like being a\r\n\r\n\r\nfreshman in high school where like you're getting picked on and like you just gotta kind of like you just gotta kind of find your groove over time. And so when I told her the truth about a panic attack, I was freed from having to lie that I really liked my job. So telling the truth to yourself and finding one other person that you can confide in. And then I think learning to say no.\r\n\r\n\r\nMost high achievers who have gone to great schools or in high power jobs, they're terrified of setting a boundary for themselves and their boss. You know what I mean? They're terrified of, you know, the boss says, hey, it's six o'clock on a Friday night. Can you get this to me by Monday? Most, at least new associates, self-sacrifice and they say, sure, yes. And then, sorry, wife, daughter, son, I can't.\r\n\r\n\r\ngo to your birthday, because I told my boss that I would do this thing, right? There's this terror of saying no and letting other people down. And in order to find your path, in order to find your thing, find your passion, it will require you to let people down. I let a ton of people down. I let my dad down. I let them down in terms of the former version of who they thought that I was and what they thought that I was capable of. But I couldn't continue to please them while also being true to myself.\r\n\r\n\r\neven though I didn't know who that self was. And so there's this difficult gap that anyone has to navigate. I call that gap chaos because it is a void of this old life is no longer working for me and I don't know what my new life should be. But chaos is the precondition to creating a new thing. You can't have a creation without disorganization first. so those two things I think are important, both telling the truth to yourself of\r\n\r\n\r\nNikolas Hulewsky (32:12.846)\r\nchaos.\r\n\r\n\r\nRaleigh Williams (32:21.98)\r\nyou know what, I really hate this job and I want to find a way out, I just don't know what it is yet, if that is your truth, and then saying no to create space for you to kind of realize really what you enjoy doing.\r\n\r\n\r\nNikolas Hulewsky (32:35.086)\r\nSo let's fast forward. You sold your companies. You're probably riding a little bit of a high because you're like, cool, it was successful. Sounds like kind of a messy process to get out of it all. But still, you got out of it. How long between selling the last piece of the business and your wife's diagnosis?\r\n\r\n\r\nRaleigh Williams (32:53.94)\r\nWe sold the last piece in September, October of 2021 and then wife's diagnosis was March of 2022 on my daughter's eighth birthday. So four or five months.\r\n\r\n\r\nNikolas Hulewsky (33:02.328)\r\nWow, okay.\r\n\r\n\r\nNot long, not long. All right. What was that transition like? it? Yeah, when you got that news, because it was stage three, right? I mean, it's not like it was, we found it early.\r\n\r\n\r\nRaleigh Williams (33:15.304)\r\nYes, late stage three. Right, yeah. Yeah, she, honestly, I navigated it poorly because I took an entrepreneurial approach. I'm like, I'm an entrepreneur, I sell businesses, I'm a lawyer, we're gonna make money off of this thing. It was kind of this David Goggins, like, all right, we're gonna crush cancer, right?\r\n\r\n\r\nNikolas Hulewsky (33:41.038)\r\nYeah, yeah, yeah.\r\n\r\n\r\nRaleigh Williams (33:41.872)\r\nIrrespective of the external environment, we are going to do our thing. We had a vision board to make X amount of money. And so we're going to keep going after this irrespective of what life is, what life is putting on us. And so that was, I'm an entrepreneur. Yeah. And so that was, that was my approach. And what happened with that approach was, you know,\r\n\r\n\r\nNikolas Hulewsky (33:57.582)\r\nBecause that's what successful people do. You set a goal and no matter what curve ball. Yeah.\r\n\r\n\r\nRaleigh Williams (34:09.006)\r\nthe cancer became more and more of this thing that I had no control over. And so it pushed me deeper and deeper into my work life, which is where I felt like I had more control. And that ultimately was the wrong decision. I think what I've learned, and again, I've tried to integrate this into my own experience with the chaos that I felt of trying to leave the law firm, is like your external environment\r\n\r\n\r\nisn't something that just is supposed to be conquered. There's actually important information in what's happening in your life and how you're feeling about it. even if your objective, even if the best way that you can articulate your objective is I wanna get rich, I still think even if that's all you wanna do, that paying attention to what is happening in your environment and your internal response to it, there's more signal in that than.\r\n\r\n\r\nwhat we give credit for in the world of social media and kind of talking about business ideas and what the next thing that you can do to make money is. And so within cancer, was, and again, I only learned that by pushing against it very, very hard and getting brought to my knees in terms of like, no, this is not the only way that I can try to avoid this. If I try to avoid this pain for the rest of my life,\r\n\r\n\r\nAvoid the pain of the uncontrollables of cancer if I try to if I try to cope with that through work or Substances or escapism I will destroy the entirety of my life I have to find I have to find a way to put this pain into a Meaning that makes sense to me and I have to find a way to alchemize it to turn this pain into something beautiful somehow and to have it make meaning more than\r\n\r\n\r\njust kind of luck of the draw or a cruel god or whatever. And I think that can integrate with my ambitions and all of those other things. I think that there's a path to do all of that.\r\n\r\n\r\nNikolas Hulewsky (36:18.03)\r\nSo your initial response wasn't, you've carried me for the last eight years, whatever you need, I'll carry you for the next eight years. I shouldn't say that. That was your response, but your way of showing up for her was like, I'm gonna start a new business, I'm gonna treat this like any other challenge that I've had in the past.\r\n\r\n\r\nRaleigh Williams (36:40.628)\r\nI think at the very beginning it was, know, this cancer is something that I can't control. What I can control is our financial future, making sure the kids are taking care. You I want to focus on the controllables and not focus on the uncontrollables. And then the other piece that it's hard to see from the outside is when somebody has cancer and they go through chemotherapy and they go through what, you know, the protocols that you're told to go through.\r\n\r\n\r\nthat human changes in a material way. And so from the outside, I imagined, you know, my wife's gonna be sick, she's gonna have her mouth open, she's gonna be knitting, she's gonna be like a grandma in a convalescent home, you know, that's just gonna be this pitiful thing kind of sitting up in the bed while I'm, you know, making blueberry muffins. And the actuality was within, you know, within one week of chemotherapy, I'd never heard my wife cuss ever when we went back in for the second injection at the oncologist's office.\r\n\r\n\r\nShe screams at everyone at the oncology office. She cusses out the oncologist and says, this is effing horrible. This is the worst thing that are, it gave her a rage that I'd never seen before. And so her, and really the more research that we've done, the unlabeled side effects of a lot of those cocktails are paranoia, manic depression, suicidal ideations. The person that sits in front of you is not the person that you knew prior to it.\r\n\r\n\r\nAnd so the more kind of vicious she became, the more I tried to escape to work. And so it wasn't just like, know, you got cancer. How can I make money today? It was at first it was you got cancer. We're to get through this together. This is going to give us a new opportunity to find meaning in our life. And then within a week, it was like, you know, her story was you gave me cancer because you've been working me too hard. I'm like, whoa, whoa. Like we were doing this together like a week ago.\r\n\r\n\r\nNikolas Hulewsky (38:33.89)\r\nWait, what the, wait, what? Yeah, yeah, yeah.\r\n\r\n\r\nRaleigh Williams (38:36.53)\r\nLike I'm the bat, I'm the source of the cancer of all of the potential things. Like it's me of all things. And so then it was like, if I'm the bad guy, then I'm going to go and I'm going to go spend my time someplace where I'm not the bad guy. You know, I'm going to go work on something that I can control. at the time it was, I was trying to do a, platform, a software platform called deal Maven to do partial acquisitions, buying and selling of, you know, partial, partial deals instead of buying it.\r\n\r\n\r\nNikolas Hulewsky (38:51.756)\r\nAnd what were you working on at the time?\r\n\r\n\r\nRaleigh Williams (39:05.618)\r\nan entire company buying part of it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (39:06.156)\r\nOkay. Well, and what I think is interesting after I sold most of my companies, it's like, there's this soul searching time where you're just like, okay, what do I, what do I want to do? Cause you've, you've spent so much time on the businesses, right? Like you had to be laser focused. couldn't be squirrel shiny object syndrome. And then all of sudden you can be the kid in the candy shop. Who's like, cool. What do I want to do? How did it like, what is out there? I want to find my purpose. and for you, you, you got to like jump.\r\n\r\n\r\nRaleigh Williams (39:15.517)\r\nMm-hmm.\r\n\r\n\r\nRaleigh Williams (39:21.938)\r\nRight. Yeah. Yeah.\r\n\r\n\r\nRaleigh Williams (39:29.982)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (39:35.638)\r\nright back into something. It's like cancer kind of pulled you, so to speak, back into a mission. It's like, no, we're going to hit our vision board. This is kind of related. for me, we had a son who passed away really young. And after he died, probably six months later, my wife was like, you got to go see somebody. My what? She's like, you're just not. I don't like being around you. You're mean. You know, you don't talk.\r\n\r\n\r\nRaleigh Williams (39:40.786)\r\nRight? Yeah.\r\n\r\n\r\nRaleigh Williams (39:58.227)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (40:05.504)\r\nnicely to the kids. like, I didn't realize I had a problem. I mean, of course I was, I had grief and I was sad, but like, I'd been telling myself that story of like, well, this is normal. Of course this is normal. And then I went and saw somebody, I got some medication, like, you know, I got some help. I able to work through it, but I thought I was showing up the way that she needed me to show up. was like, well, I'm just putting my head down. I'm going back to work. Like I'm figuring stuff out. it's, I know this isn't like a business\r\n\r\n\r\nRaleigh Williams (40:09.202)\r\nYeah, you're just handling it.\r\n\r\n\r\nRaleigh Williams (40:28.787)\r\nRight? Yeah.\r\n\r\n\r\nNikolas Hulewsky (40:34.924)\r\nnecessarily related, like figuring out how you are supposed to show up for other people and what makes you happy and what drives you to be your best version of yourself is actually a blessing, even though it's a really crappy situation, but it can be a blessing because it's a forcing function, right? Like it forces you to have to figure your crap out. Otherwise you're going to blow up your whole life. You just said like, you're going to blow up your whole life. Did you view it that way or,\r\n\r\n\r\nRaleigh Williams (40:52.194)\r\nYeah.\r\n\r\n\r\nRaleigh Williams (41:02.996)\r\nYeah, no, 100%. I didn't have the tools back then to be able to articulate what I was going through. when you're, something like a child dying, I assume, you're both going through an obvious pain. When it's cancer versus caretaker, it's she's going through the pain and you're the support person and you need to show up. However, the caretaker tends to be...\r\n\r\n\r\nNikolas Hulewsky (41:03.128)\r\nI mean, looking back, do you view it that way?\r\n\r\n\r\nNikolas Hulewsky (41:20.376)\r\ntogether.\r\n\r\n\r\nRaleigh Williams (41:30.578)\r\nminimize and I'm not saying that should be any other way. I'm just saying that's the actuality of how it happens. so, you know, when in a hundred phone calls after her diagnosis, the question is, how is she? And there's zero questions of how are you? then you add to that the man thing of like, we're talking about money and like how to, you know, like, you know, I didn't have guy friends really had business partners. And I didn't really have guy friends that existed outside of business that were like,\r\n\r\n\r\nhow are you doing? They were kind of in tune with their emotions and being able to ask emotional questions other than, well, she's gonna be all right, right? So like, all right, we playing pickleball today or what are we doing? And so I had to figure all that stuff out along the way.\r\n\r\n\r\nNikolas Hulewsky (42:18.71)\r\nIt's dude, that's so true. Cause like guy friends are really good about helping create an environment where you can kind of escape for a little bit. Right? Like I can imagine a scenario where my guy friends, if, my wife was diagnosed with cancer, that they're like, well, you know, at least you get to marry a new wife sometime. Like, you know, make some stupid, you know what mean? Like that's guys are just idiots. Yeah. But yeah, we don't do a good job of like, no, man, how you really do it? Like.\r\n\r\n\r\nRaleigh Williams (42:25.704)\r\nRight. Yeah. 100%.\r\n\r\n\r\nRaleigh Williams (42:35.398)\r\nYeah, make light, yeah, 100%.\r\n\r\n\r\nNikolas Hulewsky (42:45.464)\r\nWhat can I help with? How are you? Like, obviously she's going through what she's going through. How are you showing up for the family? Just because we're not equipped with that tool set necessarily.\r\n\r\n\r\nRaleigh Williams (42:53.62)\r\nAnd really the only people that were equipped were people who had been through it before, who had been like only people whose spouses had gone through something difficult and they saw the spouse change and kind of navigating that process. They had the tools and they kind of guided me into finding therapy and those things that were more helpful. yeah, it is a, I mean, it's a difficult process that everyone has to.\r\n\r\n\r\nfigure out their own way to navigate.\r\n\r\n\r\nNikolas Hulewsky (43:24.312)\r\nHow has that played into, you just wrote a book recently, right? How has that played into this book, sort of that experience and the philosophy that you pulled from it?\r\n\r\n\r\nRaleigh Williams (43:36.019)\r\nI think it's central to it, it's core to it because I think for me, the essence of the book that I tried to write was, the very first quote that I have is a common one. It's from Michener, is, the master in the art of living makes little distinction between his work and his play, his labor and his leisure, his God and his pleasure. And he doesn't...\r\n\r\n\r\nHe doesn't have these distinct areas of his life that he's showing up in a different way. And one of the difficulties of my law firm life was I showed up in a very different way than who I really was. had to put on, I had to pretend to be someone that I wasn't in order to, cause I was scared of getting fired. so scared of getting fired from the job that I didn't want to even really have. And so I think...\r\n\r\n\r\nNikolas Hulewsky (44:23.17)\r\nYou know, I'm just getting fired.\r\n\r\n\r\nRaleigh Williams (44:30.682)\r\nthe more that you can learn to make fewer and fewer distinctions in your life of who you are online or at your church or at your house or at your work, if you can be authentic in all of those areas, then I think that you're winning. think a lot of men particularly feel like they have to be someone that they are not in business to make their ambitions met or they need to do something that they don't enjoy in order to make the amount of money that they wanna make.\r\n\r\n\r\nAnd so I've found for myself that, you know, the essence of it is basically finding your, you know, your, most power that you have as a human is tied to what your personal purpose is. And that's something that you're, you're on it. You just have to re you just have to find it again. And, you know, life is pushing you to it. And the less that you push back against life and try to impose your own kind of operating system on top of life. and you.\r\n\r\n\r\nput yourself in accord with it, then you'll find your thing and you'll be more integrated and happier along the way. And you'll be able to handle the pain that comes in your life and alchemize it through the work that you do, through the work that you find enjoyable.\r\n\r\n\r\nNikolas Hulewsky (45:45.516)\r\nYou know, you, you said something earlier that resonated with me. You didn't say exactly these words, but you're like, we don't make time for white space. Like we don't make time to like sit and think and kind of contemplate things. for me, my white space time is like Saturdays. Cause I still do the yard and our house is small enough where I still can do the yard, but we're moving to a new house and it's on three acres. And I realized yesterday, I will not be able to do the yard.\r\n\r\n\r\nRaleigh Williams (45:54.204)\r\nMm-hmm. Yeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nRaleigh Williams (46:11.102)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (46:14.254)\r\nthe way that I thought I'd be able to do it. We're gonna have to hire someone to do the yard, which is fine. But I four hours blowing yesterday. Just like literally just like cleaning stuff up with the blower. And the first thought that ran through my mind the whole time was you may do my landscaping, but you will never take my blower from me. Man, I think this is so fun. This is so fun. Anyway, the leaf blower, blower? Hardly know her. No, leaf blower, yeah, yeah.\r\n\r\n\r\nRaleigh Williams (46:22.418)\r\nYeah.\r\n\r\n\r\nRaleigh Williams (46:34.74)\r\nLeaf blower, you should say leaf blower, you know?\r\n\r\n\r\nNikolas Hulewsky (46:44.578)\r\nBut the second thing was I've been having this problem and I had like thought about that problem the whole time. And it'd been a while since I didn't have headphones. Like I didn't have headphones in nothing. Usually I'm out there with like my headphones listening to a book or something. I had noticed it was just me, my thoughts. And it was like, the more I was just with my thoughts, the more worked up I got. And the more I was like, I got to do something about this, right? It was like motivating me to action. And it was just a reminder to myself, like I got to have dead time. That's not.\r\n\r\n\r\nOh, I put my AirPods in and listen to something. It's like you're just alone with your thoughts, trying to figure stuff out. Have you found that to be the same thing or like, is that something that's a commonality and. Is that meditating? I don't know. I don't have like, I don't have the vocabulary. I don't have the vocabulary for this rally.\r\n\r\n\r\nRaleigh Williams (47:16.658)\r\nRight. Yeah.\r\n\r\n\r\nRaleigh Williams (47:28.532)\r\nYeah, that is. I mean, that is something that I think particularly if it's something that you enjoy, you know, and it's not at the altar of productivity or doing it to save money. If it's a task that you enjoy that you feel like allows you to feel, to kind of be with yourself doing something that brings you pleasure in some way. I think that that is...\r\n\r\n\r\nmeditative. For me, it's writing. I can tell, like sometimes I'll try to build a schedule for myself and be like, I want to write an article about the standard of care in medicine and why it's a piece of shit and how lawyers have screwed everything up. And I'll be in front of it. then I'll be like, and then I'll feel pulled in another direction that has nothing to do with what I'd scheduled. And I just have to let myself go.\r\n\r\n\r\nand realized that I'll come back to it in some place if I want to explore. I didn't write until my wife's cancer. That was the one thing that I did that was me facing the pain, me looking at it and saying, what are you and what am I to do with you? Everything else, if I went and played pickleball, if I went to the golf course, if I went and worked out, that was all me.\r\n\r\n\r\nrunning from it, escaping it some way, trying to run away. so writing for me is my task that I do of I gotta look at this thing and this is how I slay the dragons in my life is by writing about\r\n\r\n\r\nNikolas Hulewsky (49:08.898)\r\nWhat do think is biggest obstacle for people? I guess identifying... What's the name of your book?\r\n\r\n\r\nRaleigh Williams (49:16.234)\r\nthe creator's call.\r\n\r\n\r\nNikolas Hulewsky (49:18.062)\r\nOkay, so what do you think is biggest obstacle for people finding their call?\r\n\r\n\r\nRaleigh Williams (49:23.156)\r\nA fear that their ambition won't be met by going into their heart and that their heart is going to tell them to quit all of their business pursuits and go join a mosque or go into a cave somewhere that they gotta be a monk for rest of their life. so I think there's a, it's a total fear of self. I'm scared that if I allow myself to feel my emotions that my life will fall apart and my ambition.\r\n\r\n\r\nwill not be met by finding my personal purpose. Now's not the time to go into the heart. Now's the time to make money and I'll figure out my purpose later. That's I think is a fear of, I don't wanna go in, mean the quote that's in my office is the cave you fear to enter holds the treasure that you seek. And the cave that most of us fear to enter is our heart. The difficult, losing your son, we don't go into that because we say,\r\n\r\n\r\nyou know, what does that have to do with me paying my rent this month? Like that's just this adjacent thing that has nothing to do with anything of what I'm trying to do in my life. So you try to just keep going forward, keep going forward. And life I've found will find a way to pull you back to it and have you look at it. And if you don't have the courage to do that, then you will live a life that's less full than it otherwise could be.\r\n\r\n\r\nNikolas Hulewsky (50:43.822)\r\nAny recommendations? First step, somebody who wants to like, like me, what would be the first step in going down the journey of finding the creator's?\r\n\r\n\r\nRaleigh Williams (50:55.788)\r\nI think the first step, again, I think the first step is just giving yourself a place that you feel safe, where you can tell the truth to yourself in some way of like, what call have I received that I haven't fully integrated into my life? Where are the things in my life that it just doesn't make sense to me? Why this happened to me? What are those areas? And find 10 minutes a day to just look at it and try to start making sense of it the best that you can.\r\n\r\n\r\nNikolas Hulewsky (51:24.952)\r\nSo if I was listening to this, I'd be like, yeah, must be easy for two guys that sold their companies and didn't have to go work anywhere to spend some time just figuring out what they want to do with their lives. But so what would you say to somebody? What would you say to you as a lawyer who freaking hated your life and knew that you didn't want to be a lawyer? What would be the first steps you would take to find those 10 minutes or?\r\n\r\n\r\nRaleigh Williams (51:37.3)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (51:51.726)\r\ncreate the space where you could actually be creative? Like how do you tell somebody to prioritize something that seems almost frivolous at the time?\r\n\r\n\r\nRaleigh Williams (52:00.35)\r\nI would say it's less ethereal than you think. think that there are three things that you can do on a daily basis that take an hour total. If you don't have an hour in your life, you are a slave. So you should get out of whatever hierarchy you find yourself in. If you don't have an hour within your life, if it's your wife that's telling you to do stuff, I don't care who it is that is your overlord, you have to find an hour. And so for 30 minutes of that hour, move your body, get in connection with your body. Just work out.\r\n\r\n\r\nNikolas Hulewsky (52:20.919)\r\nHmm.\r\n\r\n\r\nRaleigh Williams (52:27.806)\r\nDo something that brings you joy moving your body. Get active. So that's 30 minutes of your day gone. And then you have two other tasks. For 10 minutes of your day, start by writing. Just write to yourself. You don't have to share it. Just write whatever you want to write. That's your connection with your mind and with your spiritual higher self. Writing scientifically has shown to be basically the best practice to do that. And for the last 20 minutes, connect with someone that you haven't connected with.\r\n\r\n\r\nin a while and connect in a less perfunctory or kind of surface level way than you, you know, spend the time and be like, how are you? A lot of times men particularly don't have someone that they, they're not a safe space for somebody else. So they don't have a safe space for them and themselves. And just be like, when it's how's the job, right? Don't say good, how's your job? Say like, dude, honestly, like, I don't know that I can do this for the rest. Like, I'm kind of like, I'm like, I really don't like this. And just.\r\n\r\n\r\nNikolas Hulewsky (53:12.846)\r\nMmm.\r\n\r\n\r\nRaleigh Williams (53:26.982)\r\nAnd that's one hour of your day, 30 minutes with your body, 10 minutes with your brain, and then 20 minutes with somebody that you can connect with and just be honest with. And if you do that daily, things will start shifting for you, I promise. And you'll start having conversations and that's, it's not frou-frou, like even if you double click on my escape room thing, I had.\r\n\r\n\r\nsomebody that I could be truthful with about how I hated my job. He was the guy that did the KPMG thing. I had a partner that I did that with. I was moving my body every single day. And I didn't have the writing practice back then, but I wish that I would have because for 10 minutes a day, it's an asymmetric path.\r\n\r\n\r\nNikolas Hulewsky (54:13.422)\r\nBut what about, when do I start like dunking my face in Saratoga spring water and rubbing a banana peel on it? I thought, I didn't hear that. Aren't you supposed to be...\r\n\r\n\r\nRaleigh Williams (54:17.428)\r\nThat could be in the subset of the 30 minutes. However you spend that 30 minutes, I have no agenda. You know what I mean? Just like do whatever makes you happy. If you like that, that's great.\r\n\r\n\r\nNikolas Hulewsky (54:29.593)\r\nOkay, Raleigh, has been awesome, man. All right, once again, your book, The Creator's Call, where the best place people come find you.\r\n\r\n\r\nRaleigh Williams (54:38.386)\r\nThe creators call ya.\r\n\r\n\r\nRaleigh Williams (54:42.996)\r\nprobably Twitter, twitter at The Raleigh Will or raleighwilliams.co newsletter stuff trying to figure it out just like you, you know.\r\n\r\n\r\nNikolas Hulewsky (54:44.75)\r\nTwitter.\r\n\r\n\r\nNikolas Hulewsky (54:51.63)\r\nI'm going to need to have you come back on and we'll actually talk about your business as opposed to this stuff. This was just so cool because these are things I'm working through right now, trying to figure out. So I appreciate you being incredibly genuine and candid. Breath of fresh air. Much appreciated.\r\n\r\n\r\nRaleigh Williams (54:54.462)\r\nWe talk business class.\r\n\r\n\r\nRaleigh Williams (55:06.354)\r\nYeah, dude. Yeah, what's the point if not that, you know, I appreciate the time. We'll have to do a more business one next time.\r\n\r\n\r\nNikolas Hulewsky (55:10.68)\r\nAll right.\r\n\r\n\r\nYep, I'll",
  "metadata": {
    "duration": "",
    "date": "2025-05-12",
    "platform_source": "Google Drive"
  }
}