{
  "episode_number": "50",
  "episode_title": "Billion Dollar Lessons from a $800M Mistake with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "Not Applicable (Elizabeth is an investor)",
  "transcript": "﻿Nik (00:00.558)\r\nAll right, Elizabeth, welcome to Niconomics.\r\n\r\n\r\nElizabeth Knopf (00:04.411)\r\nHey Nick, thanks so much for having me, excited to be\r\n\r\n\r\nNik (00:06.932)\r\nI am super stoked to have you. This is a little bit of a non -traditional conversation that I've had in the past. So why don't you give people an idea, a background on who you are and what your history\r\n\r\n\r\nElizabeth Knopf (00:16.359)\r\nAbsolutely. So I'm an old gal. So I've been around tech for 15 years, started my career in venture capital and hedge funds, invested about $40 million across six deals, one of those IPO'd and had pretty successful exits across those. I co -invested alongside the fund I was working at that we basically led those deals on. Then I went to the operational side of things and scaled a bunch of startups in Latin America and the US.\r\n\r\n\r\nand then worked at a large public safety technology company before going out on my own about 18 months ago and have been actually hunting for software businesses and have sort of taken a bunch of detours along the way and looked at a bunch of different segments and markets outside of tech as well. So I'm hunting for deals right now and about to launch a business as well in the AI automation space.\r\n\r\n\r\nNik (01:09.678)\r\nOkay, so you've got, I love it. I love your background. I'm gonna try to break it down into kind of categories. You've got the initial category where you did investments. You have the second category where you led operations. And now you've got your category where you've gone out on your own. Okay, let's start with the investment piece. These were tech companies, correct? So where did you start your career?\r\n\r\n\r\nElizabeth Knopf (01:27.249)\r\nYes.\r\n\r\n\r\nYeah. Yes, correct.\r\n\r\n\r\nYeah, so I actually started working at hedge funds covering tech companies. I worked summers on Wall Street. I sort of got exposure to that. I've always been a tech geek ever since I was young, but always knew I wanted to go in. Yeah, go ahead.\r\n\r\n\r\nNik (01:49.824)\r\nRight. Let me back you up there because you know, there are venture capital funds, hedge funds are not typically investing in venture capital, are they? okay.\r\n\r\n\r\nElizabeth Knopf (01:59.097)\r\nno, no, no, totally separate. So hedge funds are public equities. So and even when I was working there, you know, I was at the bottom of the food chain. So, you know, there's not really much to talk about. I was just analyzing public equities, which is a very different approach than going into venture capital. I remember I had a quick conversation with someone and I was like, should I go work at a hedge fund or work in venture capital? If I had that, this was me not knowing anything. And I had the opportunity to go work in V .C. And they said, definitely do that. And so I went down\r\n\r\n\r\ndown that path without actually knowing fully that I had sort of, I guess, won the lottery in certain respects because it was very early on in my career. And this was about, you know, long time ago when that was very atypical. So that's where I started.\r\n\r\n\r\nNik (02:41.422)\r\nOkay, so you were at a hedge fund and then you had the opportunity to go switch to VC. Where was that venture capital fund located?\r\n\r\n\r\nElizabeth Knopf (02:45.967)\r\nYes, yes.\r\n\r\n\r\nSo was out in Boston. So it was called OpenFU Venture Partners, a great firm. At the time, it was a very different approach and strategy than what is commonplace now. At the time, we were basically looking at deals globally. We were looking at software companies that had about 2 million annual revenue and growing about 100 % year over year. So we were looking for needles in the haystack. And then our model, since money is a commodity,\r\n\r\n\r\nwas to actually provide value add. And so I know everyone says like, VCs always say that, but we actually had a consulting arm. And so I sort of got exposure through working at the VC on the deal side, also on how you actually scale operations for companies at that stage.\r\n\r\n\r\nNik (03:30.158)\r\nOne of the one of the interesting things I find about venture capital is that in private equity, you're investing in 10 companies, eight of those companies are successful and two of those companies probably just break even. Venture capital, you invest in 10 companies, eight of them go belly up and maybe two of them are home runs. When when you went to the venture capital fund, were you the one who was sourcing deals? Like what was your role?\r\n\r\n\r\nElizabeth Knopf (03:47.655)\r\nCorrect. Correct.\r\n\r\n\r\nYes. Yes. Yeah. Yeah. So we actually sort of out, we outsourced and tried to automate actually our deal sourcing process. And so it's funny because I now see software tools that sort of help do this. But at the time, like it was literally, you would, you know, Google a couple key search terms you would be looking for, do a ton of market research, develop a thesis, and then talk to a ton of, ton, a ton of companies. So I've talked\r\n\r\n\r\nAt the time I talked to maybe like 4 ,000 software founders of all different stages. Yeah, 4 ,000. yeah, yeah, yeah, yeah. I mean, not all of those were good conversations, mind you, but I was cold calling. It was basically sales just for selling capital essentially. So we did outbound. So that's where I actually learned how to do outbound and\r\n\r\n\r\nNik (04:25.838)\r\nI was\r\n\r\n\r\nOkay, there's 365 days in a year and there's 4 ,000 people, we're talking like 10 people a day. Holy shit.\r\n\r\n\r\nNik (04:42.733)\r\nMmm!\r\n\r\n\r\nElizabeth Knopf (04:50.171)\r\nwas cold calling companies and then, yep.\r\n\r\n\r\nNik (04:51.864)\r\nDid you come up with the thesis or was this like in concert with the partners at the Venture Fund?\r\n\r\n\r\nElizabeth Knopf (04:57.135)\r\nIt was both, it was both. I would come up with certain theses and I have, we'll just say I have a massive, not just a chip, but a massive shoulder, a boulder on my shoulder because I had, I'll give you a couple of the deals that I had sourced that we didn't get over the finish line. So Shopify, I found them when they were doing a million in revenue. Yeah, annual revenue. Eventbrite, Unity, which is sort of a software development company for gaming.\r\n\r\n\r\nNik (05:08.642)\r\nYeah.\r\n\r\n\r\nNik (05:15.636)\r\nmy gosh.\r\n\r\n\r\nNik (05:20.93)\r\nYeah,\r\n\r\n\r\nElizabeth Knopf (05:24.455)\r\nMarketto, which is a marketing automation tool. I know I'm missing a couple that were sort of like big ones as well. But yeah, so we had some like really good deals on the table. A lot of reasons why they didn't basically get over the finish line, because we had a very strict model in our investment criteria. And so things that sort of deviated were really hard to get the partners excited about.\r\n\r\n\r\nNik (05:32.76)\r\nHoly\r\n\r\n\r\nNik (05:49.738)\r\nSo did you have a lot of latitude in this position? That's weird. I just find that interesting because, you know, I think of a venture capital fund. don't necessarily think of them hiring young individuals and then saying, all right, help us make these investment decisions. How did you, how did you handle passing on Shopify?\r\n\r\n\r\nElizabeth Knopf (05:53.819)\r\nYes. Well, yes. Yes.\r\n\r\n\r\nElizabeth Knopf (06:06.651)\r\nYup.\r\n\r\n\r\nElizabeth Knopf (06:11.559)\r\nI mean, I was, so I had done a deep dive on the e -commerce market. And so I would say at the firm at the time, I was probably, you I don't want to say I was the expert or anything like that, but I had done probably the most research on where e -commerce was going. And, you know, I was very devastated because I was like, I know this is a good company. And then they ended up, you know, raising a round. And then at that point, based on our investment criteria, we couldn't do another round or come back to them.\r\n\r\n\r\nIn retrospect, it's very gut -wrenching to see. But at the same time, I didn't try to go and pursue and invest later. And so I've kicked myself a lot of times. But I think that's a huge, hard lesson that I've learned is when you see an opportunity, just take the risk and find capital however you can.\r\n\r\n\r\nNik (06:56.435)\r\nHey, tell me about Shopify. So when you found them, were doing a million dollars a year in revenue. What were they raising at? What round was it for them and what were they raising\r\n\r\n\r\nElizabeth Knopf (06:59.483)\r\nYup. Yup. Yup.\r\n\r\n\r\nElizabeth Knopf (07:04.519)\r\nOh gosh, I have to remember what the deal terms were. mean, so I'll give you sort of more broad because I don't remember. talked again. We've done, I did done a ton of deals. So yeah. Yeah. Yeah. So valuations, this was back in like 2000, between 2008 and 2011 that I was doing this. So basically valuations were five X on revenue. So exactly, exactly. So ridiculously like\r\n\r\n\r\nNik (07:12.236)\r\nYeah, that's fine. I'm just curious like ballpark how big were like what were the reason\r\n\r\n\r\nElizabeth Knopf (07:33.351)\r\nyou wouldn't get like you don't get these deals today. Like you don't get these types of multiples. And we were investing anywhere from five to $7 million. And you know, an average valuation, you know, would be anywhere from five to $10 million pre money.\r\n\r\n\r\nNik (07:47.342)\r\nSo let's just say Shopify, million dollars in revenue, they were probably raising at a five to $10 million valuation.\r\n\r\n\r\nElizabeth Knopf (07:51.665)\r\nMm -hmm.\r\n\r\n\r\nElizabeth Knopf (07:55.655)\r\nYeah, I think they might've been a slightly higher, like definitely, you know, something in that ballpark when it was about a million in error. Yeah, yeah, exactly. Oh yeah, it's like, like I think, I don't know. have, I don't look cause it's masochistic, but like, think it's like what 70 billion or something or 35, don't know. Ridiculous. Yeah, there you go. Yeah.\r\n\r\n\r\nNik (08:01.358)\r\nlet's say $10 million valuation. Do you know what the value of that today?\r\n\r\n\r\nNik (08:16.782)\r\n$82 billion. Holy crap. I invested, I invested in Shopify 10 years ago, and I made really good money, just in the public markets, right? And I made, for me really good money. I think I turned like $500 into like 10 grand or something like that. And I kicked myself forever selling Shopify. Holy crap. What? Okay.\r\n\r\n\r\nElizabeth Knopf (08:28.379)\r\nYeah, yeah, yeah.\r\n\r\n\r\nYup, yup,\r\n\r\n\r\nElizabeth Knopf (08:37.969)\r\nYup. Yeah, yeah. So it's painful.\r\n\r\n\r\nNik (08:42.038)\r\nWhat did you learn from those experiences you passed on event bright? That's another really big company. Unity software is a very big company. Shopify obviously is really large. I think some of our best lessons come from our biggest misses. Just because you missed is not a bad thing. What do feel like you learned from those?\r\n\r\n\r\nElizabeth Knopf (08:45.339)\r\nYup. Mm -hmm. Yup.\r\n\r\n\r\nElizabeth Knopf (08:54.471)\r\nA thousand percent.\r\n\r\n\r\nElizabeth Knopf (09:01.733)\r\nwhen you find an opportunity, figure out how you can actually do the deal. Because at the time it was like, you know, we were actually as analysts, the other sort of unique thing, and associates, we were able to co -invest alongside the fund. So it was my capital also. So we were able to take our own money and put it into the investment versus like there's a whole bunch of different models for when VCs, typically it's just the partners that\r\n\r\n\r\nNik (09:15.256)\r\nWhat does that mean?\r\n\r\n\r\nElizabeth Knopf (09:27.687)\r\ninvest as GPs. But if you want to participate in the fund, I was technically an LP. And so I invested in the fund that invested in those deals. And then also for deals you sourced, you got equity in those deals. So all interests were aligned. And again, that was very unique and still is unique in the VC\r\n\r\n\r\nNik (09:47.022)\r\nSo you probably still have equity in a lot of deals that you haven't worked on in 10 years.\r\n\r\n\r\nElizabeth Knopf (09:54.865)\r\nCorrect. I just started getting liquid from those. We had a good one that I PO'd called Instructure, which is basically learning management software that caters to universities. And that was not mine. That was not mine, so can't take credit. But I had exposure to that. I had good results from that one. And then the other ones were decent exits, most private acquisitions. But yeah. But I would say the lessons learned\r\n\r\n\r\nNik (10:06.062)\r\nDid you find that one?\r\n\r\n\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (10:25.233)\r\nWhen you find a deal, you find an opportunity, just like figure out a way to get capital to make the investment. Because there's a lot more creativity that I've learned that you don't need to be the one with the money. You can find the money. You can structure deals in a lot of different ways. You can be a person that has other resources or assets you can utilize to get equity. And so I think being creative is really the biggest takeaway.\r\n\r\n\r\nNik (10:50.648)\r\nWarren Buffett talks about this. He talks about waiting for the fat pitch. And you'll see there are years where Berkshire makes no investments in their years where they make a number of investments. But when they invest, they invest billions. They're not investing, you know, single figure million dollar. My question in that though is how do you know when it's the fat pitch? Like, did you know that those companies were gonna be great? Did you have other companies that you passed on that you're like, dang it, I know that one's gonna be great. And it's like, yeah, that did end up turning out to be a dog. Like, how do you\r\n\r\n\r\nElizabeth Knopf (11:01.052)\r\nYes.\r\n\r\n\r\nNik (11:20.322)\r\nwhen it's the right time to do\r\n\r\n\r\nElizabeth Knopf (11:22.395)\r\nYeah, so it takes a lot of practice. it's, know, what people say in DC is like pattern recognition. That's not an understatement. I would say at the time, no, I didn't necessarily know that they were going to be as large as they were. Otherwise, I would have probably made different decisions after the fact, even having missed those. In retrospect, though, now, I think I have still a very good lens for when there is a good business. And that really comes down to\r\n\r\n\r\nthe customer acquisition economics, at least that's for my thesis and the way I approach things, is do they have good, their lifetime value relative to the customer acquisition costs? What is that ratio? What does that look like? And yes. Okay. So, we basically had sort of in software as a service, so you have recurring revenue. Typically you raise capital because you're building a product, so you make that investment.\r\n\r\n\r\nNik (12:08.302)\r\nTell me more about that.\r\n\r\n\r\nElizabeth Knopf (12:22.279)\r\nOnce you launch the product, you have to find ways to actually sell it. And so once you get to product market fit, you want to start looking at does the lifetime value of a customer, which basically means how long a customer is going to be paying you. So it could be three years, one year, 10 years. What does the churn look like? So if customers are dropping off and you can't retain them. So what is that actual dollar value and what is that relative to how much it costs to acquire a customer?\r\n\r\n\r\nSo if you're spending money on marketing, if you're spending money on sales, all of that is included in your customer acquisition costs. And so really that is sort of the key equation, at least for software to understand is this company doing well. Now, of course, at certain sizes, you want to start accounting for disruptors and our other technology is going to take the market, but still you can start sort of seeing that trend when you look at that ratio. so, yep. So for software as a service,\r\n\r\n\r\nNik (13:10.838)\r\nWhat's a ratio you like to see? I'm sorry, your toes. I'm sorry.\r\n\r\n\r\nElizabeth Knopf (13:15.751)\r\nAll good. All good. Absolutely. this, I, hey, I'm nerded out. I love this stuff. So for, for SAS, the bare minimum you can have is a customer acquisition cost of, of one to lifetime value of three. When you dip below that, you're just going to lose money. And that accounts for some assumptions on churn. You want to see a lot higher. The best companies I have seen are like 20 to\r\n\r\n\r\nAnd I can give you a nut here's actually I'll give you another cool company. And I think the guys on Twitter, I haven't or X, I haven't followed up with him. But there's a company called Business Catalyst. They have the they had the best economics I've ever seen. And I'll sort of give you the model. And I think is very replicable today. They were basically sort of simplified marketing tools for small businesses. was a software as a service. But the interesting thing about their model is they sold\r\n\r\n\r\nlike web developers. And so those web developers would actually have to pay for training to be certified. And so you basically recoup the cost of your customer acquisition through that certification. And then they became the salespeople. So they were basically referring this out. So you see there's a number of companies right now that have sort of replicated this model. And I don't know the numbers, but I would assume they're crushing it in terms of this ratio. So it's basically like, if you can sell to someone that then can resell your product, like the numbers are going to look really good.\r\n\r\n\r\nNik (14:37.55)\r\nWhat's the difference between that, the LTC to CAC ratio and ROAS, return on ad spend?\r\n\r\n\r\nElizabeth Knopf (14:45.775)\r\nYeah, so ads I don't have as much experience with, so I can't sort of speak to that, but that would be included in the calculation. But if you have more than one channel, like let's say you have like return on ad spend or your ad spend plus if you have outbound, plus if you have anyone included and you know, people have different definitions of like, do you include?\r\n\r\n\r\nNik (14:52.073)\r\nOkay,\r\n\r\n\r\nNik (15:01.294)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (15:08.007)\r\nIf there's someone customer support, how do you calculate that? We don't usually calculate that in, but maybe there could be some arguments of how you really look at the economics of it. And the one other factor, sorry, I forgot to clarify with lifetime value is this is specific to SaaS where the margins are 80 % minimum. So if you're looking at a lower gross margin business, you'd actually want to look at what\r\n\r\n\r\ngross profit would be versus sort of just the lifetime value. So it's sort of the lifetime gross profit of that. So if you have like a pest control company, you could still look at these economics and sort of use that as a way to understand the business. But you would want to account for there's going to be lower margins on that, the nature of that business.\r\n\r\n\r\nNik (15:53.01)\r\nYeah, I mean, so my background is more in the small business side and yours is in tech. So some of the ratios may be different, but fundamentally, you're looking at businesses the same way. But there is something that you said you rolled your eyes at, which is fine. But you talked to 4000 founders in whatever period of time, let's say it's two years or a year. And which is still freaking an insane, insane number of founders to talk to.\r\n\r\n\r\nElizabeth Knopf (16:11.899)\r\nYes. Yeah. was a little bit longer than that. was like, I think, four years or\r\n\r\n\r\nElizabeth Knopf (16:20.199)\r\nYeah.\r\n\r\n\r\nNik (16:21.536)\r\nAnd then you said, for you to make these investment decisions, there's a lot of pattern recognition. And I think you highlighted that. You had to get a lot of reps in. And so you saw a lot. You had a lot of experiences that you could then draw on when you needed to make those decisions. And I don't think it's something that you should minimize. That's a lot of work you put into building your personal algorithm.\r\n\r\n\r\nElizabeth Knopf (16:37.425)\r\nMm -hmm. Mm -hmm.\r\n\r\n\r\nElizabeth Knopf (16:45.035)\r\nYes. Yeah, that's actually very, thank you. Yeah, I did put in a lot of blood, sweat and tears had a lot of people yell at me and say, you know, what is this 20 something talking to me or, you know, lot of interesting personalities. But yeah. And I mean, I would even say now like I haven't decided to try to get back into VC and it's much more accessible, I would say to people, but I haven't gone back there because also I would say pattern recognition and\r\n\r\n\r\nThey're sort of like macro trends that you can take away, but looking at other sort of pieces you have to stay in the game. And so I would say like there has been some depreciation maybe of that pattern recognition on certain tech technologies and markets. But I would say, you overall thematically like understanding sort of these large waves like right now we're obviously I think in probably one of the largest macro trends with AI.\r\n\r\n\r\nthan a lot of the other ones with mobile, internet, cloud, like all of those, think this is gonna be much more massive.\r\n\r\n\r\nNik (17:47.778)\r\nWhat do you tell me about your experience? So you you come out of college, you get a job with a hedge fund, then you go to a venture capital firm where you're kind of on the analyst side or you know, make making the investments and then you said you switched to operations. Why?\r\n\r\n\r\nElizabeth Knopf (18:02.821)\r\nYes. Yeah. Yeah. Why? Why? So, you know, I've I so the other things I didn't mention is during college, I actually started some small businesses with some of my classmates. And yeah, so we'd like cleaning business. You know, we had self storage or off campus storage and grocery delivery. Yeah, exactly. Which, you know, we didn't have the access of the Internet. We didn't have, you know, people, you know, we were handing out flyers and hustling. We weren't using mobile apps\r\n\r\n\r\nNik (18:14.694)\r\ncool.\r\n\r\n\r\nNik (18:21.858)\r\nYou're all that before it was cool.\r\n\r\n\r\nElizabeth Knopf (18:32.647)\r\ncool models. And so, you know, I got a flavor of just entrepreneurship. My parents were entrepreneurs, so I've just been always exposed to that. So I think there's like a piece of DNA. Also, starting in finance, I think was a good place to start. But at the same time, you are a better investor if you have operational experience. But I actually think starting on the finance side was more helpful in the way I then went about choosing my opportunities and the way I approached\r\n\r\n\r\noperations in general, because even looking at what are the revenue strategies or how do we actually grow a business, you can have this investment lens that I think was very beneficial starting in finance.\r\n\r\n\r\nNik (19:04.142)\r\nYeah.\r\n\r\n\r\nNik (19:17.964)\r\nWas it operations at the same fund or did you go to a different?\r\n\r\n\r\nElizabeth Knopf (19:21.447)\r\nNo. So for ops, actually start with it. Let me just get my timeline right. OK, so I went to a startup that was a fintech startup. We were trading secondaries. So at the time of right before the Facebook IPO, this is another another big part of the boulder. We were trading Facebook shares when they were like, you know, five dollars up to fifteen dollars a share prior to the IPO Groupon at the time we were trading those. So it was all secondaries basically. And what secondaries are just for the audience.\r\n\r\n\r\nis if you are working at a startup, you get equity typically or options and those don't become sellable until you have a liquidity event. So either a sale to another company or going public. So at the time, there weren't a lot of opportunities to actually sell your shares to another private individual. That basically made it illiquid. And there's a lot of sort of structural things that makes that difficult.\r\n\r\n\r\nBut we were essentially trying to create marketplaces to create liquidity for those individuals and employees or founders or whomever. So that was working at basically a fintech startup called Second Market that ended up selling to the NASDAQ eventually. So I went there, got sort of startup experience and then ended up starting my own B2B e -commerce business after that. So I got two years of just\r\n\r\n\r\nlearning all the things, learning how to code, realizing I suck at coding, finding a partner who actually knew what he was doing and was a Google developer and all the other sort of operational things you have to do when you are first developing a software product and trying to find product market fit. And then I ended up sort of getting additional experience, moving down to Latin America and scaling a rocket internet company, which was basically copy. Yeah. So I moved down to Panama.\r\n\r\n\r\nNik (21:11.81)\r\nYou moved?\r\n\r\n\r\nElizabeth Knopf (21:15.243)\r\nSo I lived in Panama for about five years before moving back to the States. So yeah, so we were basically sort of doing Amazon for Latin America because the rocket internet model was to take business models that were successful in the US and apply them globally. And so I was trying to build that up. So that was sort of additional operational experience and then got sort of large company experience working at a public safety technology company called Axon.\r\n\r\n\r\nwhere I would say we basically scaled the company, when I was there, we scaled the company from 300 million to over a billion dollars in recurring revenue.\r\n\r\n\r\nNik (21:49.708)\r\nWhat happened to the company in Panama? Did Marcado Libre eat your lunch or\r\n\r\n\r\nElizabeth Knopf (21:53.415)\r\nSo that was definitely an issue. I was overseeing our Panama market. So we had to think of a different strategy because the Panama market is super small, even though it's an interesting place to do business and sort of the key central place for trade, even though a lot of things are changing in that market. So whereas other sort of countries were doing domestic sales, we actually started doing international cross -border, which whole other can of worms.\r\n\r\n\r\nreally super interesting, but we weren't going to be able to make a ton of money by just catering to a market that at the time didn't have really any sort of e -commerce infrastructure. were literally delivering goods to people and they were paying us cash on delivery, which is a nightmare. And so, but we had to deal with all of those, you know, it's like there's an order of operations when you actually can enter a market. And if you don't have sort of a layer of infrastructure, things just don't go well. So they're still around. The company was called Lineo.\r\n\r\n\r\nThey're still around, you know, the Panama market. haven't really followed that much, but it's not, you know, not doing great just because there were so many different hurdles.\r\n\r\n\r\nNik (22:59.726)\r\nSo you started on the finance side. I mean, you're obviously exceptionally bright. So I'm sure you caught on very quickly. And then you went into operations and were very smart and strategic about just trying to figure out how these businesses work, how they function, how they scaled. You worked at small companies, you worked at big companies. When, cause you said in the beginning that you spent the last 18 months kind of trying to find your next thing. When did you leave? Like what was that decision like? And like, and what are you doing now?\r\n\r\n\r\nElizabeth Knopf (23:23.185)\r\nYes. Yeah.\r\n\r\n\r\nYeah, yeah, yeah. So let's see. Okay. So I left Axon. It's an incredible company. I only have wonderful things to say about it and it's doing exceptionally well. So I've always been an entrepreneur. So even at Axon, I was the one sort of coming up with like, what are the new things we should be doing? What's the new revenue strategy? What are the new products? Testing out a bunch of different services and sort of doing.\r\n\r\n\r\nNik (23:53.272)\r\nSo you were in an executive role\r\n\r\n\r\nElizabeth Knopf (23:56.129)\r\nNo, I was not an executive. It's a very large company. I was, yeah.\r\n\r\n\r\nNik (23:58.722)\r\nBut I mean, by executive, I just mean you were in a role that you had influence. Okay. That's\r\n\r\n\r\nElizabeth Knopf (24:04.433)\r\nhad a lot of influence, yes. I had a lot of influence, yeah. So, let's see. Okay. So, yeah, it's okay. All good. All good. So, I decided to leave because I was just like, you know, I've always wanted to do something. It was sort of right after the pandemic. And I had actually found some interesting technologies as a result of the pandemic because I'm a nerd and I sort of go down rabbit holes.\r\n\r\n\r\nNik (24:11.629)\r\nstarted.\r\n\r\n\r\nElizabeth Knopf (24:30.439)\r\nand decided to actually partner with a university professor who had developed some technology that just really hadn't made it into the market. And so as a result was like, hey, let's go give this a try. And so first sort of took this model of looking at interesting technologies that really just haven't sort of made the leap in identifying distribution channels to match product with distribution. And so as a result of that, that sounded\r\n\r\n\r\nwent down that path, realized it would be better if we actually bought distribution. So that sort of kicked me off on the &A journey. And I had had so many sort of just burns from zero to one that I was like, I need cash flow. Like I want to find cash flow. I want actual money versus waiting a year or two years or whatever to actually start.\r\n\r\n\r\nNik (25:20.526)\r\nWhen did that flip in your\r\n\r\n\r\nElizabeth Knopf (25:24.647)\r\nI would say probably like really deeply after sort of doing these partnerships, it really crystallized. I mean, I think I sort of, this was like a couple of years ago, like two years ago because yeah, so that really, really crystallized. Yeah, yeah,\r\n\r\n\r\nNik (25:32.312)\r\nLike what year?\r\n\r\n\r\nNik (25:39.918)\r\nBecause that's been the big turn in tech over the last year in particular is like, okay, cashflow, not revenue growth at all costs. What's the profitability of this business? You kind of caught that wave early.\r\n\r\n\r\nElizabeth Knopf (25:49.179)\r\nYes, exactly. A little bit, Because at the time it was also, I don't like seeing my bank account down even though I'm fine being on my own and not stressed, but it's always good to have money coming in to your businesses.\r\n\r\n\r\nNik (26:04.302)\r\nThat's everything. So your thesis is amazing, right? Like you've got the experience, you're very sure about what you want to do and it all makes sense. But how did you live? when you make that jump and you no longer have a job at a tech company, did you just, your investments paid off really well or did you go raise money? Where,\r\n\r\n\r\nElizabeth Knopf (26:26.303)\r\nYes. Yeah. Yeah. So I, yeah, yeah. I've been investing for a while. So I was, I was fine to take that leap and have that comfort, that luxury. Earlier on in my career, was not that way. I had started companies with very little capital in my pocket. So I\r\n\r\n\r\nNik (26:30.764)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (26:48.527)\r\nI did crazy things like I slept at the office sometimes. I would do, you know, slept in the car or whatever. Like, you know, I did wild things like that at the time. But, you know, now I'm, I have kids, I have a family. I also have a husband that, you know, does fine. So there's, there's sort of elements that allowed for me to take some bigger risks and be disciplined and not fearful to make mistakes, I guess, if that makes\r\n\r\n\r\nNik (27:13.762)\r\nAnd so are you looking right now, you're looking at buying existing businesses, buying the distribution?\r\n\r\n\r\nElizabeth Knopf (27:18.599)\r\nYes, yes, yes and no. So I went sort of flip -flops from zero to one to then fully, okay, I'm only gonna buy. I started down the path of looking at software companies since that's my wheelhouse. The challenge has been, I started looking in, you know, early 23, I would say, yeah, early 23 or mid 23. So this is, I don't know, whatever 18 months ago was. Yeah.\r\n\r\n\r\nNik (27:45.038)\r\nearly 2023.\r\n\r\n\r\nElizabeth Knopf (27:47.107)\r\nSo I started looking and multiples were still ridiculous and me having come from a place where, you know, 5X on ARR is like the love, you know, where I would use, was, it used to be investing at, it was, it's just very hard pill to swallow. And then sort of taking.\r\n\r\n\r\nNik (28:02.286)\r\nGive people some context. So from 5x ARR, where was it a year and a half\r\n\r\n\r\nElizabeth Knopf (28:07.034)\r\nOh, a and a half ago, think it was, it had come down at that point because in 22 it was like even more absurd, but a year and a half ago it was like 8X. And those are not uneven, large size businesses and they're burning cash and, you know, developing and maintaining software can be challenging, even though going forward, I think that's going to be changing pretty dramatically. But,\r\n\r\n\r\nyou know, to pay for that, it's like the only thing you can really finance there. It's like you either give up equity by raising capital or you, you know, you pay for it, wish for the best. And, you know, you just are basically playing a multiple arbitrage game because you're really not going to be able to use cashflow to pay that off for the most part, unless you have incredible growth. But the companies I was also looking at, I was not looking for high growth necessarily. I was looking for cashflow companies and even cashflow and companies were looking for\r\n\r\n\r\nridiculous multiples like\r\n\r\n\r\nNik (29:01.442)\r\nAnd what kinds of sorry, what kinds of investments these angel investments or were you looking to buy these\r\n\r\n\r\nElizabeth Knopf (29:03.333)\r\nYeah. No, I was looking for to buy these companies. So I'm sort of done with angel investing. I've done a bunch of angel investing throughout the years, but I'm looking for ones that actually have product market fit, slow growth, weird markets, like very niche markets, vertical, like, you know, compliance software or like a feature for some kind of tax thing, you know, things that like are really unsexy and boring that people aren't going to be\r\n\r\n\r\ntrying to jump in on and it's gonna be, like, it's not gonna be a billion dollar company. Like, that's not what I'm looking. I'm looking for a cashflow high margin. And so I'm looking at ones that are, you I looked at one and got very close on a government tech company that was essentially like agenda management for the government. And they were doing really great, but it was just too small. And so to finance it, we were gonna have to raise capital. And then I looked at sort of the equity number and even me considering\r\n\r\n\r\nLike one, should I buy it? That was a consideration. There was just a lot of like hair on the deal that it was like, it's just too small. If I'm going to also be taking a much more active role in whatever investment I do, because just knowing me, probably will. So, yeah, go\r\n\r\n\r\nNik (30:17.42)\r\nRun it down for me again, because when we talking a little bit on the pre -call, I know you love AI, artificial intelligence, but what does your investment profile look like right now? You said you used to use so I kind of got a broad idea,\r\n\r\n\r\nElizabeth Knopf (30:20.665)\r\nMm -hmm. Yeah. Yes. Yes.\r\n\r\n\r\nElizabeth Knopf (30:28.487)\r\nYeah, so I have about, yeah, yeah. So I have right now, I would say seven figures exposed to software. that's, know, check sizes anywhere from as little as $10 ,000 for an angel investment all the way up to, would say, where's my largest concentration? I would say like six figures on some of them. So I have like a decent portfolio of those. And then I have some that I've just held from\r\n\r\n\r\nNik (30:37.614)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (30:57.767)\r\nprior when I was working at OpenView that I haven't sold\r\n\r\n\r\nNik (31:01.774)\r\nOkay, so you've made some investments over the last 18 months, but you're still looking.\r\n\r\n\r\nElizabeth Knopf (31:05.735)\r\nNo, no, no. Sorry. Sorry. So that was prior to the 18 months. So I've been angel investing for like my whole career. So that's sort of throughout that I had that shift to looking for actually cashflow and companies. Angel investments are not typically cash flowing. They have maybe some revenue, probably burning their capital. So they're not really profitable yet, or they shouldn't be at that stage. All good. All good. I know you're not.\r\n\r\n\r\nNik (31:27.918)\r\nI'm an idiot. So thank you for for keeping it slow for me. Okay, so over the last month, over the last eight months, you haven't pulled the trigger on any big acquisition yet. But the profile for a company that you're looking for is niche somewhere in the ballpark of like, I'm going to guess 10 to $20 million enterprise value.\r\n\r\n\r\nElizabeth Knopf (31:37.543)\r\ncracked cracked cracked cracked\r\n\r\n\r\nElizabeth Knopf (31:50.919)\r\nUm, actually smaller. I'm looking for smaller ones, um, because at 10 to 20 million enterprise value, you're most likely going to have to be raising capital. Um, I'm not going to be writing that large of a check, um, for that size of a company because the multiple on that is going to be, or sorry, if it's enterprise value, that's already, uh, assumes the actually what\r\n\r\n\r\nNik (32:10.158)\r\nAnd the reason you'd have to go out and raise capital is because these are not financeable businesses.\r\n\r\n\r\nElizabeth Knopf (32:16.369)\r\nCorrect. And the reason they're not financeable for the audience is because the only thing you really have to finance is your revenue. Whereas typically in small medium sized businesses, you have assets and other sort of creative ways to leverage financing. You could be using sort of supplier relationships, other sort of ecosystem, but really when you build software, all you have is the software and your customers. And so you're financing your revenue. And so there's only so much you can do on that. And even if it's like cash flowing, you you can, and you want to have growth, you have to allocate some\r\n\r\n\r\ngrowth, you have to allocate some to then financing, and the numbers just don't always work out, at least from what I've been looking at. So I'm looking at... Go ahead.\r\n\r\n\r\nNik (32:52.736)\r\nI love the fact. Sorry, no, no, no, I stepped on your toes. You finished that sentence.\r\n\r\n\r\nElizabeth Knopf (32:57.679)\r\nYeah, so would say like from an investment criteria, I'm looking at companies as small as I would say 500K in EBITDA, but that also like is closer to the cash number than it is like to actual EBITDA when you go through the accounting because yeah, otherwise it just gets too small. So I went through this exercise with a number of them and I'm sort of even moving my criteria up closer to like a million. And again, I'm looking more now at that and looking at sort of an average or decent multiple because also when you get to\r\n\r\n\r\na 10 to 15, 10 to $20 million enterprise value, the multiple sort of just backtracking is going to probably be higher. So you're probably looking at anywhere from, could be a 2 million EBITDA type of business. And that actually gets pretty competitive with private equity. And I don't want to compete with private equity because they just have more resources. They're going to be able to give a higher valuation. so it's not about sort of, I able to write that check? It's more\r\n\r\n\r\ndo I want to because of what I'm competing on from a multiple standpoint.\r\n\r\n\r\nNik (33:55.566)\r\nNo, I talked about this a lot. Private Equity does this. I sold one of my companies to Private Equity and I wanted to sell it Private Equity because I knew they'd pay a higher multiple. And the game that they play is if I, Nick, on my own, am I going to go buy a business and it's got $500 ,000 in EBITDA and I say, I'm willing to pay up to five times revenue because that's what it could be worth. Excuse me, five times EBITDA. So it's worth $2 .5 million.\r\n\r\n\r\nElizabeth Knopf (34:03.055)\r\nokay. Amazing.\r\n\r\n\r\nExactly.\r\n\r\n\r\nNik (34:23.95)\r\nWell, the private equity fund comes and they say, well, I could roll up 10 of these and get to 2 .5, excuse me, $5 million EBITDA. Ma I'm great at math. $5 million EBITDA. And at that EBITDA range, multiples are no longer three to five times. They're 10 to 12 times. So I can pay six or seven times and have this multiple arbitrage between seven times EBITDA. So in that case, it'd 3 .5 million to pay for all of those. And then when I buy all of\r\n\r\n\r\nElizabeth Knopf (34:38.961)\r\nRight. Exactly.\r\n\r\n\r\nElizabeth Knopf (34:48.679)\r\nMm -hmm.\r\n\r\n\r\nNik (34:53.39)\r\n12 times EBITDA, which would be a $6 million enterprise value, and that gap, that spread, two, yeah, two and a half million dollar spread is all accretive for them. They just stepped into that equity. But I can't pay six times because I don't, I can't justify that. don't, it's not accretive for me. So when you, when you're saying you don't want to go competitive into private equity, that's why. Like you're paying multiples that you can't afford.\r\n\r\n\r\nElizabeth Knopf (35:04.931)\r\nExactly. Exactly.\r\n\r\n\r\nElizabeth Knopf (35:10.203)\r\nRight.\r\n\r\n\r\nElizabeth Knopf (35:18.043)\r\nRight, exactly. And I'd rather play the arbitrage game where there's opportunity. But even now, even smaller SaaS companies, the multiples people want, I get it. They want a good multiple on ARR, not even EBITDA. But I'm not willing to pay for it.\r\n\r\n\r\nNik (35:38.478)\r\nIs that the market you're seeing right now? And I know you're looking $2 million in less in EBITDA, SaaS, niche industries, but have multiples come down significantly?\r\n\r\n\r\nElizabeth Knopf (35:44.507)\r\nYup. Yup.\r\n\r\n\r\nElizabeth Knopf (35:50.915)\r\nI wouldn't say significantly and the reason being is because of AI, because everyone has AI baked into their software. So the deal I was looking at, the GovTech company, the multiple was actually pretty reasonable. It was like three on EBITDA. It was not on ARR. And so those are the opportunities I'm looking at. That's a great deal. Again, it was just too small for going through number of the issues. So I'm looking for those opportunities where there's a motivated seller.\r\n\r\n\r\nAnd, or it's yeah, it's like basically someone that wants to sort of hand over the asset or they sort of hit a wall or it's a technical founder that doesn't know how to grow it. But the issue is, is multiples are still pretty, I mean, they're not as high as they were for sure. And I think even the, the Kool -Aid around AI has cooled just because you have now people spent, I think it was like, I heard like a trillion dollars already been invested across the market, which is absurd. But I mean, that also accounts for some of larger guys.\r\n\r\n\r\nbut they also want to start seeing returns and they got, think, lot of way ahead of the skis and it's still the early, early part of the market. So from like a long -term perspective, still a great opportunity to be investing, sort of leveraging those tools, but I'm sort of looking at it very differently on how I want to take advantage versus a pure SaaS investment. So I'm actually looking at how to, go ahead, go ahead. okay. Yeah, so I'm looking at opportunities on actually how to leverage AI and automation.\r\n\r\n\r\nNik (37:08.29)\r\nYeah. No, no, no, I'm sorry. I'm just getting with\r\n\r\n\r\nElizabeth Knopf (37:18.855)\r\nto expand margins for small medium sized businesses. This is sort of my new thesis and iteration of this because I'm just like, keep looking at these software tools and you know, none of them I'm like willing to write the check for because of just the economics of the deal. So I sort of shifted to, and I actually think there's an interesting opportunity at looking at small medium sized businesses leveraging AI and automation that really just like, it's gonna crush their, I\r\n\r\n\r\ncrush their margins in a really good way, like create more profitability because like everything I've been trying to do, it's like I go and I try to automate it and I can versus going to hire a VA even to do certain things. Like I automate before I hire. And so I've just like unlocked just such excitement around, I think the possibility here and looking at productized services. I really think that that's a huge opportunity that's just getting started. I know you've interviewed some folks.\r\n\r\n\r\nwho are doing that. And I think that's actually the opportunity because that is recurring revenue.\r\n\r\n\r\nNik (38:16.91)\r\nHave you seen, I always say his name wrong, Chamath Paliapatia? He has a fund that he just, don't know if it's a fund or a company, and I always forget the name. It's like 80 -20 or like 10 -90, but basically his thesis is you can get 90 % of the functionality with 10 % of the cost. So if your company has a CRM like Salesforce, or if you're using an ERP like, what's that big one, Oracle, that costs a lot of money to implement.\r\n\r\n\r\nElizabeth Knopf (38:23.184)\r\nyeah, yeah,\r\n\r\n\r\nElizabeth Knopf (38:36.337)\r\nYep.\r\n\r\n\r\nNik (38:45.422)\r\ncost a lot of money to roll out. But now you can build and get 90 % of the functionality for 10 % of the cost using artificial intelligence to essentially make more efficient these developers. So it's a it's a play what you're describing is a kind of a play on that thesis, right? You're just bringing it down down\r\n\r\n\r\nElizabeth Knopf (38:51.153)\r\nYup. Yup.\r\n\r\n\r\nElizabeth Knopf (39:01.275)\r\nYeah, exactly. And I'm looking because, you know, I think there's an interesting model where it's like, so back when I was I was looking at a lot of tools, it was really expensive to sell to the SMB market because really you had to sell online if you're going to be selling thirty dollars per seat per month to a customer. so you couldn't go pick up the phone. Cold outreach, sort of not really great. But now that small businesses are actually online and participating\r\n\r\n\r\ntools, like they're, easier to sell to them. And so as a result, it's easier to access them. And so I think selling these tools for them or doing it for them, essentially, one, you get more margin because you're sort of selling a service. And so typically services people are used to paying a couple thousand dollars versus $30 per seat. So you're just sort of doing an arbitrage of you're selling the service that sort of actually higher price, but still cheaper for them. And\r\n\r\n\r\nif you can structure a deal where you actually get either equity or upside on whatever growth you're creating for them or reducing costs, there's, think, an interesting way to capture more of the pie than just doing a service for a\r\n\r\n\r\nNik (40:13.644)\r\nI love this thesis, Elizabeth. think it's because five years ago when you were in the tech space, everybody's question was like, well, what's your TAM? Because it costs so much money for you to get market share. Like Facebook, that was to everybody. Uber, that's to everybody. All of these companies were catering to everybody. Why? Because they had to spend so much money to capture that market share that there had to be a significant return on the backend. But what artificial intelligence has done,\r\n\r\n\r\nis it's made it cheaper to to develop those things. So you can provide a niche offering in these spaces that have been, I guess, chronically under catered to. And it's smart of you because if I'm in the SMB space, and I don't know any different, somebody with your experience, your pattern recognition, your ability to say, hey, I think we could easily develop some software or just do automations, improve your life by doing X, Y, and Z. All of a sudden, you've unlocked the SMB space.\r\n\r\n\r\nWhereas many of these tech companies are building for the enterprise space. And those two things are not compatible. They're just not.\r\n\r\n\r\nElizabeth Knopf (41:19.025)\r\nRight. And in the enterprises, like I've sold into enterprises, I've implemented software tools in the enterprise and it is, it's painful. It is very painful. And so, and even though, you know, you're getting, you know, a hundred K deal that, know, is recurring, there's this long tail that's just more accessible and you can be getting equity in creative and doing creative things.\r\n\r\n\r\nI'm really excited about it. And I mean, I the other sort of exciting thing about AI and automation is there's things that before it would make no sense to build a product or tool for that now is so accessible. So I'll just give you sort of a quick example. Yeah. So when I was working at Axon, there was like a bunch of stuff we wanted to do. The challenge was we were using Salesforce and so we had a development team for Salesforce\r\n\r\n\r\nNik (41:58.008)\r\nYeah, it's going to say, give me an example.\r\n\r\n\r\nElizabeth Knopf (42:10.725)\r\na lot of teams couldn't get either software integrated because we didn't have a large team and we couldn't really scale that team because the cost for developers is expensive. So what I tried to do is I had a team of folks who was like, can we like build this? I had some people that were very technical and so they were able to sort of like knock out a few things. But like an example would be even for zero based budgeting. It was like a nightmare. We were using a ton of Excel spreadsheets for using\r\n\r\n\r\ningesting data from like three different systems, we couldn't use our BI team because they were off doing something else. And so being able to just build a simple tool to do our ZBB process would have been fantastic. That's one. Number two was just like maintaining awareness on what was happening in the market in terms of regulation, because that had a high impact on our sales team. And so\r\n\r\n\r\nbeing able to just easily build out a tool that would enrich data, identify when things were changing in the market, to feed to our sales team, to help prioritize leads and deals and opportunities would be massive. And so those are just two quick examples where we didn't have the manpower, so we had people using Excel spreadsheets to pull that information together, but it was\r\n\r\n\r\nNik (43:10.894)\r\nIs that me?\r\n\r\n\r\nElizabeth Knopf (43:26.555)\r\ntedious to do. So those are two examples. There's like a ton more, whether it's like some kind of visualization where again, if you can't use a certain team, you can just sort of build it out yourself and do very creative things\r\n\r\n\r\nNik (00:00.12)\r\nhappened.\r\n\r\n\r\nElizabeth Knopf (00:00.961)\r\nThat's okay. All good. I'm used to it. Issue the tech. So yeah, so some easy examples for AI automation. So in the enterprise is a little bit different, but for illustrating some points here, having we had we were users of Salesforce. And so to try to build tools that integrated with Salesforce or even like integrating other software tools is very painful because you need\r\n\r\n\r\nYour Salesforce developers, those are really expensive, so you can't really scale that out. And there's sort of like a way to, like, you need to prioritize what you're implementing. So a couple examples that we wanted to build that we just didn't have the resources to do was like simple, like a market research tool that could pull in all the different regulation that was changing on a state by state basis, on a city by city basis that would help impact and influence the prioritization of leads for our sales\r\n\r\n\r\nSo now that could actually be done. And I've even sort of like thought about how to build that versus before you either would have to buy really, really expensive software and then figure out how to integrate it. And that would just be a pain. So that's one example. Another example is like our ZBB process or zero -based budgeting process was just like a nightmare. So pulling data from a bunch of different resources and then how we even\r\n\r\n\r\nput it all into Excel spreadsheets and then had the teams doing this discussion and then trying to like dedupo. It was just painful versus like now you could actually build a simple tool to help make that process much more simplified. So that's more on the enterprise side. I would say for small medium sized businesses, what you could do now, even there's just sort of the basics. Most small medium sized businesses just sort of even need the basics out there of like, you know, how do they automate aspects of their CRM and their whole sales flow.\r\n\r\n\r\nBut visualizing data in a lot of sort of interesting ways that's pulling in market research, like that's a very interesting use case that small medium -sized businesses are probably not gonna be capitalizing on. Also visualizing like market reports, that's another sort of thing that I thought about. So there's just like right now the use cases are endless. And I actually think there's gonna be like a merge between content and software where you're actually gonna start seeing more interaction\r\n\r\n\r\nElizabeth Knopf (02:14.423)\r\nlike software tools that are just free to use as either sort of lead magnets or sort of a new way to consume content. I don't know exactly what that looks like and means yet, but it's just the cost of developing software is coming to zero or as much as it would for creating a piece of content. And so those things I think are going to merge.\r\n\r\n\r\nNik (02:34.254)\r\nThis has been an amazing conversation. have some rapid fire questions to wrap up. Are you ready? Okay. What do you love about investing in software?\r\n\r\n\r\nElizabeth Knopf (02:40.077)\r\nGo for it, go for it, go for\r\n\r\n\r\nElizabeth Knopf (02:46.371)\r\nI mean, what's not to love about it? One, I'm a tech geek. So I think just sort of seeing the future evolve and removing waste and decreasing efficiency, that's sort of like more the high level. And then from an actual investor and business person, I mean, there's nothing that beats, you know, 80 plus percent margin that's recurring revenue and very sticky. So, yeah. There's always things breaking.\r\n\r\n\r\nNik (03:05.518)\r\nThis is very true. What do you hate about\r\n\r\n\r\nElizabeth Knopf (03:12.333)\r\nDealing with churn is a huge, huge challenge that cannot be sort of underestimated and that you always constantly have to be looking forward because the market is moving and changing and evolving and you always have to be on top of things.\r\n\r\n\r\nNik (03:28.75)\r\nSo this is one of my favorite questions. think I know the answer, but you have kids, right? How old are\r\n\r\n\r\nElizabeth Knopf (03:35.565)\r\nYes. I have a four year old and a seven and a half year old.\r\n\r\n\r\nNik (03:40.366)\r\nOkay, I have boys that are 10, seven, four, and two. same, it's too many Elizabeth. I'm not gonna lie to you. I made a mistake. Yeah. And for my boys who are listening 30 years from now, I'm not gonna tell you which one of you is a mistake, but I think you can figure it out. Anyways, so my question is, if you have two hours in your day, there's no work.\r\n\r\n\r\nElizabeth Knopf (03:44.695)\r\nI didn't know you had four, my gosh, handful.\r\n\r\n\r\nElizabeth Knopf (03:51.437)\r\nGood, no, good job. I've thought about that. So good job and good job to your wife too.\r\n\r\n\r\nNik (04:08.494)\r\npulling on you and there's no family obligations that you have. What are you obsessed with right now? What are you spending your time\r\n\r\n\r\nElizabeth Knopf (04:16.097)\r\nOkay, so if it's not related to my kids, then I'm literally like, okay.\r\n\r\n\r\nNik (04:18.722)\r\nIt doesn't have to It could be related, but just, yeah, what are you obsessed with right\r\n\r\n\r\nElizabeth Knopf (04:23.381)\r\nWell, am, so I am, you know, I do things family related, kid related, but I'm also sort of fusing AI tools with kids. like one of my kids, have to get a calendar because he never knows what day of the week it is. And so I'm going to have him create an AI calendar. So we're going to go through this exercise for the school year is create their own calendar and just sort of showing them the tools of how they're used. Now don't want that to like take away from them learning math or like other things,\r\n\r\n\r\nNik (04:41.87)\r\nIt's really cool.\r\n\r\n\r\nElizabeth Knopf (04:49.019)\r\nI want them to start being exposed to that and also just testing out some use cases. Health, I think, is always really important. You know, I'm getting freaked out about plastic, so I'm going down some of those microplastic rabbit holes and I'm like, everything is poisoned, all of our food. yeah, yeah. So would say those are some things I'm looking\r\n\r\n\r\nNik (05:04.05)\r\nOkay. As you are sitting here, you're in SaaS. So this is a fun question to ask. Everybody's kind of jealous of everybody else. Most everyone who I've had on is jealous of SaaS. They're like, I wish I had the recurring revenue. I'm jealous of commercial real estate. What businesses or industries are you the most jealous\r\n\r\n\r\nElizabeth Knopf (05:30.187)\r\nI mean, I would say just like large investment funds because, you know, like getting a portion of, you know, care, I mean, getting carry, you don't always have to be a good investor. I mean, they do fine. So I have a lot of friends in that market and I'm like, dude, like you're just, you know, modeling things out, coming up with fun theses and, making some good cash. So yeah. Yes, I can still hear you. You, I can't see you though.\r\n\r\n\r\nNik (05:43.17)\r\nYou just take care.\r\n\r\n\r\nNik (05:51.502)\r\nOkay, can you still hear me by the way? All right, don't know what happened to my camera. Last question, if you could give yourself advice 10 years ago, what would that advice\r\n\r\n\r\nElizabeth Knopf (06:03.277)\r\nI mean, that would be what we were talking about earlier, which is like, find a way to get a piece of the pie. Figure it out. And you don't need capital.\r\n\r\n\r\nNik (06:08.63)\r\nOkay, I love it. Okay, I love it. Where's the best place for people to come find\r\n\r\n\r\nElizabeth Knopf (06:16.972)\r\nRight now on Twitter and then LinkedIn. LinkedIn, a little bit more professional. Twitter, I say a lot of nonsense here and there, but hopefully I'll share some good gems every once in while.\r\n\r\n\r\nNik (06:28.078)\r\nOkay. All right. This is how do I say your last name by the way?\r\n\r\n\r\nElizabeth Knopf (06:31.235)\r\nNoff, it's a hard one. It's Silent K, Silent P,\r\n\r\n\r\nNik (06:34.956)\r\nAll right, sweet, Elizabeth Knopf, this was fantastic. Thank you so much.\r\n\r\n\r\nElizabeth Knopf (06:37.749)\r\nNick, it was fantastic. Thanks so much for having me. Have a good one.\r\n\r\n\r\nNik (06:40.056)\r\nYep.",
  "metadata": {
    "duration": "",
    "date": "2024-08-28",
    "platform_source": "Google Drive"
  }
}