{
  "episode_number": "60",
  "episode_title": "What I Learned From My $7M Bankruptcy with Hunter Durham",
  "guest_name": "Hunter Durham",
  "business_name": "Furniture USA Distribution",
  "transcript": "﻿Hunter Durham (00:00.539)\r\nwith a white wall.\r\n\r\n\r\nNik (00:02.296)\r\nHunter Durham, welcome to Nekonomics, my\r\n\r\n\r\nHunter Durham (00:05.762)\r\nThank you. It's been great. I haven't got to to you in a while.\r\n\r\n\r\nNik (00:07.111)\r\nAll right. I know. Here's my first question. Are you ready?\r\n\r\n\r\nHunter Durham (00:12.535)\r\nI'm ready.\r\n\r\n\r\nNik (00:13.949)\r\nTell me about the time you went bankrupt.\r\n\r\n\r\nHunter Durham (00:18.51)\r\nYeah, there's a lot. So September 9th is when I posted about it. That's when the world found out I was going bankrupt. About seven days before that, my largest customer, Mitchell Gold, Bob Williams, officially ceased operations. And in that moment, I knew I was heading towards bankruptcy as well. So they represented over 50 % of my revenue at the time that they said they ceased operations.\r\n\r\n\r\nAnd then I worked with the bank for about two months and officially filed bankruptcy on November 17th of last year. And so it was a wild story to get\r\n\r\n\r\nNik (00:56.211)\r\nSo September, what was the timeline between that September post and bankruptcy? Was it two months or was it like September, 2022, November, 2023?\r\n\r\n\r\nHunter Durham (01:07.854)\r\nNo, it was about two months. Yeah, so was basically I started, you know, the liquidation process in September. I let the bank know, then worked with the bank for about two months to liquidate all the hard assets. Then when the hard assets were officially liquidated, then I officially filed personal bankruptcy shortly after that.\r\n\r\n\r\nNik (01:28.487)\r\nDude, and what was your company at the\r\n\r\n\r\nHunter Durham (01:33.666)\r\nSo that company was Furniture USA Distribution. I mean, actually it was all the company. I started a successful marketing agency. That's what eventually allowed me to buy an online e -commerce furniture store that sold high end couches. Then we kind of vertically integrated the online e -commerce store with the shipping and distribution company in North Carolina. And the shipping and distribution company ended up being the largest business. And so basically,\r\n\r\n\r\nSo the shipping and distribution was like 5 .5 million. All three of them did about 7 million in 2022. Total top line. So yeah, it was basically, I went from zero in 2019 to top line revenues of 7 million in 2022 profitably. then yeah, downfall in 2023.\r\n\r\n\r\nNik (02:27.899)\r\nAll right, we're gonna talk about the bankruptcy. I'm gonna ask you a million questions, but I think one of the things I really appreciate about you is how open you've been on Twitter. Like you just have shared your story like, hey, this is what's happening and I'm going through bankruptcy. And because it was such a big part of your life for that period of time, I feel like a lot of people have just gotten to know you as the bankruptcy guy. Like the first time I met you, I made the joke. I'm like, dude, when are you gonna change your name to the bankruptcy guy? And then,\r\n\r\n\r\nHunter Durham (02:37.72)\r\nMm.\r\n\r\n\r\nHunter Durham (02:46.016)\r\nHmm.\r\n\r\n\r\nHunter Durham (02:50.797)\r\nMm.\r\n\r\n\r\nHunter Durham (02:55.502)\r\nYeah.\r\n\r\n\r\nNik (02:57.683)\r\nAnd then we talked for like three hours and I heard your whole story and it was eye opening for me to like hear about your background, hear about you and who you are. So I think there's a lot of recency bias to what just happened as well as a lot of social media that's just kind of been your personality and you've been open and shared about that. I would love it if we talked about pre -bankruptcy guy.\r\n\r\n\r\nHunter Durham (03:23.148)\r\nYeah.\r\n\r\n\r\nNik (03:23.803)\r\nWhere did you start? Like what was, what's your history? How did you get in? What industry did you start with? It sounds like a digital marketing agency.\r\n\r\n\r\nHunter Durham (03:29.472)\r\nYeah, I mean, it's really funny. So like I cut my teeth at Red Bull. So in college, I was working with Red Bull for about two years as like the student brand manager. mean, the core of that role is literally to just like give away Red Bulls on campus. And that was like my very first job. like, yeah, you, I did cutco. Yeah. Out of high school. Yeah. Out high school, did cutco, sold knives. And then, yeah, when I got to college, I started with Red Bull. Did that for about two years. And\r\n\r\n\r\nNik (03:34.428)\r\nReally?\r\n\r\n\r\nNik (03:46.429)\r\nDidn't you do cutco as well?\r\n\r\n\r\nHunter Durham (03:59.424)\r\ninternship with Dell, internship with Microsoft, so I was in like big tech and then eventually made my way over to Facebook where I was an e -commerce and account manager. And so that's where I really got the digital marketing skills that essentially led to creating the agency.\r\n\r\n\r\nNik (04:14.899)\r\nso you've always been in sales.\r\n\r\n\r\nHunter Durham (04:18.326)\r\nI've always been sales or some way some sales and marketing. Yeah, marketing and sales have always been a lot of what I've\r\n\r\n\r\nNik (04:22.931)\r\nI don't know why for some reason I just thought like he worked at Facebook and then he had a digital agency like he was the guy he was the tech guy doing all the work and fulfillment\r\n\r\n\r\nHunter Durham (04:33.138)\r\nNo, I mean, I've never done tech. mean, even at Facebook, we didn't do a lot of fulfillment. We didn't do any fulfillment at Facebook. I mean, that's why I love that job is because when I came into Facebook, we had a cross vertical book. Everybody was verticalized at Facebook except our little meaning like they had e -commerce and they only had e -commerce clients. but when we came into Facebook, they were doing like a test. were like guinea pigs. So we had every single vertical. We had e -commerce, we had\r\n\r\n\r\nNik (04:47.357)\r\nWhat does that\r\n\r\n\r\nHunter Durham (05:02.57)\r\nCPG, had finance, basically had any client could be in our book. And so what that did was if you could drink from the fire hoses, amazing. Cause I had like, when I came in, had a hundred clients in my book. So literally I broke down a hundred different businesses of like, here's their top line revenue. Here's what they're spending on marketing. Here's their margins. Here's where they're profitable. Here's their goals. Like one of my clients is Johnsonville sausages.\r\n\r\n\r\nNik (05:04.933)\r\nOkay.\r\n\r\n\r\nHunter Durham (05:30.86)\r\nI had Pacific Life Insurance, I had some really big clients who wouldn't be considered small and medium business, but they were all in my book of business.\r\n\r\n\r\nNik (05:40.403)\r\nHow? You graduate college, you get an offer from Facebook, and all of a sudden they're like, go and hire Pacific Life. Go manage their book of business.\r\n\r\n\r\nHunter Durham (05:46.478)\r\nYeah, well, yeah, I mean, it was really weird because Facebook's model was based on how much you spent on Facebook. And so a lot of these big bigger brands like Johnsonville sausages, they didn't spend that much because they didn't really have like a direct response, you know, side of their business. So a lot of people who are this is 2017 was what I\r\n\r\n\r\nNik (06:03.677)\r\nWhat year was this?\r\n\r\n\r\nNik (06:08.147)\r\nHas that changed a lot since 2017? Like are they spending a lot more\r\n\r\n\r\nHunter Durham (06:12.425)\r\nI would assume, yeah. mean, during the time that I was there, a lot of the big brands continued to accept it pretty rapidly. I mean, that's, think, why you see a lot of Facebook acquisition costs continuing to rise as well, is because a lot of the big players started to really enter into the space. And, you know, they were taking their $100 million marketing budgets that they had outside of Facebook, and now they're, you know, dumping them into a more digitally native platform as kind of TV and other spending started to decrease.\r\n\r\n\r\nNik (06:39.165)\r\nSo you get into Facebook at a time where marketing spend wasn't necessarily crazy, but the wave started and you were managing these larger accounts, I should say, and you really got insights into how they operated, how they worked. At what point did you make the decision to say, I'm just gonna do this by myself?\r\n\r\n\r\nHunter Durham (06:51.5)\r\nI should say.\r\n\r\n\r\nHunter Durham (06:56.284)\r\nyeah.\r\n\r\n\r\nHunter Durham (07:01.23)\r\nUh, not for a little bit. I, they eventually decided it was a terrible idea to have a cross, a non -verticalized book. And they pushed us all into the e -commerce vertical. And this was when, you know, Facebook was still pumping. You could put money in, get money out. I was managing about $9 million a quarter during that time period.\r\n\r\n\r\nNik (07:03.655)\r\nThank you.\r\n\r\n\r\nNik (07:22.085)\r\nAll right, nine million dollars a quarter of revenue. I don't know what that is. Holy.\r\n\r\n\r\nHunter Durham (07:25.12)\r\nA Facebook spend. A Facebook spend. So like my clients, my clients were spending nine million dollars a quarter on Facebook during the time that I was there. Thirty -six million dollars a year. Yeah. It was insane. And that was across fifty clients, you know. So my largest client was spending like three million dollars almost a quarter at some points. And then they got raided by the FBI. But that's a different story.\r\n\r\n\r\nNik (07:34.035)\r\n$36 million a year on Facebook.\r\n\r\n\r\nNik (07:50.291)\r\nWas it Pablo Escobar? Was he advertising on Facebook?\r\n\r\n\r\nHunter Durham (07:52.75)\r\nNo, was you buy them. You could search them on Google and they just come up. It was a health tech company basically where they tested your gut. So you literally sent them your poop and then they would give you You literally sent them your poop and they would give you this report about your biome, your health and your gut.\r\n\r\n\r\nNik (08:14.481)\r\nWhat a crappy business. See what I did there?\r\n\r\n\r\nHunter Durham (08:17.684)\r\nI know. It was a crappy business. They were like double billing people from Chile and they ended up getting raided by the FBI.\r\n\r\n\r\nNik (08:28.947)\r\nOkay, so this is the Wild West. This is the Wild West days of Facebook marketing. You're managing this book when you first get in $9 million a quarter. When were you thinking, hey, I could do this?\r\n\r\n\r\nHunter Durham (08:37.014)\r\nYeah, yeah.\r\n\r\n\r\nYeah, I mean, it actually came down to like, really wasn't even, Hey, I could do this on my own yet. was. I got promoted my first performance cycle review. And then, you know, I got like a greatly exceeds, which is like a 200 % bonus. And then I, the next quarter I exceeded my goals by like $3 million. Uh, and I actually made less that quarter because of like Facebook's like ranking system. It was like, I got promoted.\r\n\r\n\r\nNik (09:04.083)\r\nChief.\r\n\r\n\r\nHunter Durham (09:10.112)\r\nNow you're promoted with people who've been there for like in like level two for three years. And then it's just like the worst system ever. But, and so I ended up making less, even though I like smashed my goals. I was like, what am I doing with my life? Why am I working so hard? Like, and getting paid less. And I absolutely, you know, made more money for the business.\r\n\r\n\r\nNik (09:27.953)\r\nAnd where were you, by the way, living? Okay.\r\n\r\n\r\nHunter Durham (09:30.83)\r\nin Austin, Texas. And, um, and so one of my, I become known as like very trusted by my clients. Like they really, my role was about 10 % Facebook and 90 % like their business because it usually was like Facebook was working, but their creative processes weren't working. Their inventory processes weren't working. Their, you know, staff processes weren't working. And so in order for me,\r\n\r\n\r\nNik (09:55.293)\r\nHmm.\r\n\r\n\r\nHunter Durham (09:59.394)\r\nto get them to spend more money, had to unlock these other parts of their business. so, you know, my clients were on like a, you know, texting basis with me. And, you know, one was just kind of giving me like, you know, asking me for advice one day. And I was like, like, maybe you'll get to like a hundred million, but you'll never be like a billion dollar business. And he ended up like hiring me. And so I went and joined his company.\r\n\r\n\r\nFacebook, quit and then like a couple weeks later I went and joined one my largest clients who's crushing it now. He like stays under the radar but still one of my best friends and and yeah so that's what I left for.\r\n\r\n\r\nNik (10:37.585)\r\nWhy? Why? Like, why'd you leave?\r\n\r\n\r\nHunter Durham (10:39.758)\r\nYeah, I mean, they were, they were similar age to me. Um, and they were looking to build more sustainable businesses. So they were drop shippers. So they would like, I mean, one campaign that year, we started budgets at like $5 ,000. It was like, it actually a week or two after Christmas. And it was like every day I was like, all right, increase this. So we went from like 5 ,000 to 7 ,500. I was like, nah, like numbers still look good. Like 7 ,500 to like 15\r\n\r\n\r\nAnd I was like, no, numbers are still holding tight. And like, we got that campaign all the way up to like $35 ,000 a day. And these kids are like 24. Like they're my age.\r\n\r\n\r\nNik (11:11.955)\r\nOkay, what does that mean? Okay, it's $5 ,000 a day. Numbers still look good, so let's up it. Like, what are you talking about in there?\r\n\r\n\r\nHunter Durham (11:19.942)\r\nYeah, so I mean back then is like this is pre iOS like shutting down privacy so like Facebook's pixel was so good at collecting all the data like I had data and this was before Facebook would even like they hadn't shut down their CRM or locked it down pretty heavily like I could get that into like Adidas revenue and so like it was so good at being able to track every single transaction on the web\r\n\r\n\r\nthat you could get the exact information you needed to on revenue and which campaigns drove that revenue. When numbers looked good, was basically like they were spending $5 ,000 a day on this campaign and they needed to maintain a 2X ROAS. They were dropshippers. So they didn't have any inventory, they didn't have any overhead. It was like you could scale as much as possible.\r\n\r\n\r\nNik (12:11.453)\r\nin Roas being.\r\n\r\n\r\nHunter Durham (12:13.838)\r\nreturn on ads been being like, you know, for every dollar you put in, you're getting $2, um, you know, back in revenue. Um, and so, you know, I knew all my clients margins at that point too. So it's like, when I'm looking at their ROAS, I know what exactly they're making, you know, on a profit basis as well. And so I was like, Hey, we still have room to grow because as you scale, there's always going to be like a law diminishing return. So it's like, are we still hitting our numbers at scale?\r\n\r\n\r\neven if we're making a little less on like a pure ROAS basis, we're still making more overall. so, so yeah, we.\r\n\r\n\r\nNik (12:45.427)\r\nWow. And you don't you don't want to go like, oh, 5000. The numbers look good. Let's do 15 ,000. Because there may be some diminishing returns there and it just you just blew a bunch of money. So you want to incrementally ratchet ratchet it\r\n\r\n\r\nHunter Durham (12:52.139)\r\nYes, there may be\r\n\r\n\r\nHunter Durham (12:56.942)\r\nYeah, you want to incrementally ratchet up and then see like what is the efficiency at that level. And usually at that time period we were having, we could get so much data on the backend, especially internally at Facebook that, you know, I was able to see almost in real time that things were looking great, purchases were coming in, and they were confirming it on their backend as well.\r\n\r\n\r\nNik (13:20.211)\r\nOkay, so you leave Facebook, you go to this company and you're sales, right? Like you're focusing on just blowing up their product and specifically through Facebook.\r\n\r\n\r\nHunter Durham (13:29.885)\r\nYeah, I was not I came in to actually like Not be the adult but that's probably the best way that I can explain it is like is three guys who had just been in the kind of direct response space since they were like 16 and They had never gone to college They didn't go to you know any sort of like formal training and you sort of like business training and so you know they were kind of just like\r\n\r\n\r\nFacebook was so good at that time and they were so good at picking products from China that they could just, you know, kind of create an arbitrage on, um, that there was no idea or concept of them of like, you know, lifetime value or, you know, repeat customers. so like the, the reason the guy brought me in was like, Hey, I needed to build more sustainable businesses. I mean, obviously I hadn't built sustainable businesses, but I had consulted with 50 plus. And so you\r\n\r\n\r\nkind of get your reps in a lot quicker when you're in a situation like I was at Facebook. And so that was ultimately why they had brought me\r\n\r\n\r\nNik (14:33.543)\r\nAnd how long were you there?\r\n\r\n\r\nHunter Durham (14:35.202)\r\nI was there only about six months. there were two brothers and then the main guy. And, as we were transitioning to this more sustainable business model, you know, lot of that is like having good products and most products that drop shipped out of China were like cheap crappy products. and so one day I walked into the meeting and I was just like, you guys don't care about customers. And we had this huge fight and the two brothers were like, I don't want Hunter to come to Canada. And the other guy was\r\n\r\n\r\nI don't know what to do because I gave these other two guys two pieces of my business. And so anyways, they're like, it probably makes sense for us to just part ways. And so ended up leaving, but I had already been kind of consulting with two other clients on the side that I also had from Facebook as well. And so that was kind of the start of the agency.\r\n\r\n\r\nNik (15:26.291)\r\nSo that's when you first launched into entrepreneurship. What year was\r\n\r\n\r\nHunter Durham (15:29.934)\r\nThat was 2019. End of 2019 basically was when I officially went out on my\r\n\r\n\r\nNik (15:32.211)\r\nCough\r\n\r\n\r\nNik (15:36.243)\r\nWin. Win in 2019.\r\n\r\n\r\nHunter Durham (15:38.519)\r\nNovember. November almost exactly.\r\n\r\n\r\nNik (15:41.795)\r\nSo November 2019 and then like three months later COVID hits. What was that\r\n\r\n\r\nHunter Durham (15:46.208)\r\nYeah, yeah, exactly. Well, it's funny because I, so I get fired, quit, whatever you can kind of put it in. I was like, what do I want to do with my life? What type of business do I want to build? And that was like where this whole idea of impact industry, which no longer exists on my Twitter profile, but what most people saw for a really long time. And they saw it was like the original thesis was like, how do I build a business that makes above average returns?\r\n\r\n\r\npays people above average wages and then still has money left over to go impact the world. And so that's when I had like my Warren Buffett, you know, moment, right? Where I go down the rabbit hole and then I'm like, who aggregates the most amount of capital or resources? And so that's where I actually found the search funder community, like a search fund was back in 2019. This is like pre it blowing up on Twitter. And so I literally put everything in place to kind of go after\r\n\r\n\r\nAnd then COVID hit and it was like, you know, but that point is still kind of like in -person service business, but COVID hit e -commerce blew up for those first six months. And so my agency blew up as well. so really I just basically switched all my focus in the agency and like the first three months of COVID were, were amazing for that. I mean, we grew from like, I was already kind of pulling in like $10 ,000 a month to like $5 ,000 retainers. And then\r\n\r\n\r\nGot to like $40 ,000 a month, I think by September. We we landed our first like four figure contract. And then it just kind of kept growing from there. So. It got up to 750 ,000 top line revenue in basically 2022. That last, the last year before everything.\r\n\r\n\r\nNik (17:24.883)\r\nHow large did the agency get?\r\n\r\n\r\nNik (17:34.087)\r\nAnd what does bottom line performance look like on an agency like\r\n\r\n\r\nHunter Durham (17:38.83)\r\nlike sixty percent like is great but like it was it was great like i had to really good guys that were taking care of most fulfillment you know they were u .s. based on product to make a little bit more but i mean i i made the mistake of looking at my agency piano the other day and that's that's a mistake to look at just looking at my agency piano the other day of like\r\n\r\n\r\nNik (17:59.847)\r\nYou made the mistake of what?\r\n\r\n\r\nNik (18:09.491)\r\nYeah, yeah, that might that might be a mistake. So 60 % net, you've got this agency, did you do any acquisitions? Was that all organic? Or how did you grow the agency? Okay. At what point did you make the decision? But because let's just say you're doing $500 ,000 a year, 60 % net margins are going to be $300 ,000 a year you're pocketing, you're living a good life. At some point in there, you move to Puerto Rico, you guys are living on the beach, you'd like your\r\n\r\n\r\nHunter Durham (18:16.076)\r\nMm -hmm.\r\n\r\n\r\nHunter Durham (18:21.688)\r\nwas all organic. mean, all of it was organic.\r\n\r\n\r\nHunter Durham (18:29.731)\r\nYeah.\r\n\r\n\r\nNik (18:39.249)\r\nbeautiful, why did you say, you know what I really want to do? I want to buy a shipping company on the East Coast that ships high -end furniture. Like, how did you make that decision? What was that thought process\r\n\r\n\r\nHunter Durham (18:51.2)\r\nYeah.\r\n\r\n\r\nHunter Durham (18:54.894)\r\nYeah. I mean, it was a mistake. think if I like holistically look at it, it was a mistake, but the, the reason was I was just like blinded by the vision, like 2019. mean, we're only like a year ahead when things started like really working out well. So it's like 2019 was, I had this, you know, kind of put together this plan to go buy businesses. Agency takes off. No longer do I actually need other people's capital. Now I have my own capital.\r\n\r\n\r\nNik (19:22.845)\r\nMmm.\r\n\r\n\r\nHunter Durham (19:24.598)\r\nAnd so like, I viewed the agency as basically like, this is actually is what I needed to, you know, kind of achieve my original plan. And so like, I was honestly blinded by that vision, you know, that I had only like nine months before per se, but it's like, if I hadn't done that and the agency just blew up and I hadn't, you know, already kind of put in some of the\r\n\r\n\r\npieces in place to go buy a business, you know, I probably wouldn't have made that. And so then I bought, you know, the online e -commerce store. went under contract that year in 2020 closed early 2021. Um, we started shipping our furniture, realized we didn't have any control over the customer experience. You know, this is like two people walking into your house. They're shaking your hand. And I was like, Oh, we have no control over like the most important part of our customer experience process. And so then, um, ended\r\n\r\n\r\ngoing under contract with them at the end of 2021. And that turned into kind of two acquisitions at the same time. And then we closed that at the beginning of 2022. So it was like all super quick. And I mean, it was just like, yeah,\r\n\r\n\r\nNik (20:34.227)\r\nOkay, let me unpack that. All right, so 2019 November, you're like, I'm going into the agency, launch the agency. Whoa!\r\n\r\n\r\nHunter Durham (20:43.958)\r\nIt is a sick\r\n\r\n\r\nNik (20:45.479)\r\nHey, you launch the agency, the agency takes off, you start getting cash, but you've already you had had this thesis of like, I want to buy businesses on a buying hold businesses. Now you've got the cash flowing asset to be able to buy these businesses. And it's similar. Andrew Wilkinson did this with tiny Warren Buffett, know, who you already mentioned here did that like Geico and the float from Geico really served as an opportunity for them to go out and buy businesses. So it's not uncommon to have like that cash cow that allows you to grow.\r\n\r\n\r\nHunter Durham (20:50.061)\r\nMm.\r\n\r\n\r\nHunter Durham (21:02.296)\r\nYeah.\r\n\r\n\r\nHunter Durham (21:14.06)\r\nYeah.\r\n\r\n\r\nNik (21:15.687)\r\nSo you first buy an e -commerce business. And what was that business?\r\n\r\n\r\nHunter Durham (21:21.518)\r\nThat was basically a custom couch seller. So I high end, like $5 ,000 custom couches.\r\n\r\n\r\nNik (21:28.957)\r\nSo you buy an e -commerce business doing custom catches. How big was\r\n\r\n\r\nHunter Durham (21:32.398)\r\nIt was doing the purchase price is 1 .2 million. So it's doing about 400 ,000 bottom\r\n\r\n\r\nNik (21:39.847)\r\nOkay, so you buy a niche couch ecommerce company, and then you see, the customer experience sucks. So I'm gonna I'm gonna go buy and I'm gonna own the distribution, I'm gonna buy the company that's actually shipping these. And you close on not one but two shipping companies. Why\r\n\r\n\r\nHunter Durham (21:45.634)\r\nYep.\r\n\r\n\r\nHunter Durham (21:50.211)\r\nMm -hmm.\r\n\r\n\r\nHunter Durham (21:55.662)\r\nYep. Yeah. So we basically, so, uh, I, our original guy was servicing like 36 states. Uh, and so I got him under contract and, uh, that would be July, uh, or August of 2021. Um, and so he was doing all of our distribution for those 36 states.\r\n\r\n\r\nDuring the process of me having him under LOI, he signs this large customer that eventually is the downfall. He signs Mitchell Gold Bob Williams, which is like a hundred million dollar plus like furniture company.\r\n\r\n\r\nNik (22:39.357)\r\nSay their name again. I love\r\n\r\n\r\nHunter Durham (22:41.056)\r\nThe mythical Bob Williams.\r\n\r\n\r\nNik (22:43.013)\r\nMitchell Gold Bob Williams is the most made up name I've ever heard. That should have been red flags numbers one, two, and\r\n\r\n\r\nHunter Durham (22:46.356)\r\nYeah. I mean, it's, two namesakes. It's two namesakes. And, and so he, he gets them as a client and they needed to increase the service level, but also they were going to pay double than like normal clients. So like on a pure margin basis, it made a lot of sense for him to, you know, acquire them as a customer, but in order to kind\r\n\r\n\r\nNik (22:56.125)\r\nNo, I know, I know, I know.\r\n\r\n\r\nHunter Durham (23:16.014)\r\nincrease his service level, he got rid of almost 14 states. So like almost kind of like half the amount of coverage. Exactly. Exactly. And so he owned the building of a competitor in town. That's how kind of close things are in North Carolina. You know, there's just like everything kind of like, you know, everything just kind of like meld together and yeah.\r\n\r\n\r\nNik (23:23.111)\r\nHe consolidated. He consolidated to take on this client.\r\n\r\n\r\nNik (23:35.015)\r\nHmm.\r\n\r\n\r\nNik (23:40.221)\r\nRight, right. Yeah, I'm married to my sister. She's also my cousin and my aunt.\r\n\r\n\r\nHunter Durham (23:45.957)\r\nSomething like that. Sorry to all the North Carolina people. So he owned the building to competitor in town, same exact business model, same exact revenue model. All the operations and processes were basically the same. Some of the technology was different. And so we were trying to be furniture USA. We had furnitureusa .com and it was like, how are we going to be furniture USA if we only ship to like 22 states?\r\n\r\n\r\nNik (23:48.989)\r\nJust kidding.\r\n\r\n\r\nHunter Durham (24:15.374)\r\nHe was like, was like, do you think this guy's interested? And he's like, I think so. And he's like, let me call him real quick. So he calls me back like 15 minutes later. He's like, this guy's interested. And I was like, okay. So I call the guy and he's like, I wish you would have done this a month ago. And I was like, like, oh, dang it. Like why? He's like, I have a broker letter on my desk and like another like $50 million trucking company flew in that morning to close a cash deal.\r\n\r\n\r\nAnd all I had to do was sign at this point. Like it was all ready to go. And I was like, here's who I am. Here's what we're trying to do. You know, he's like, well, if you can move quickly, like I'll give you a chance because that guy, you know, was just going to take the assets, merge it with his, you know, assets and fire all the employees. And so the legacy thing does actually hold true in a lot of scenarios. It's like a lot of times people don't want to see their employees just let go. And so one, one acquisition turned into\r\n\r\n\r\nacquisition of two trucking companies, which is ultimately what created the largest company we had.\r\n\r\n\r\nNik (25:17.235)\r\nSo at the time when you bought it, how big was it? Like how much revenue was it doing?\r\n\r\n\r\nHunter Durham (25:22.389)\r\nYeah, I was doing the 5 .5 million. So it was like a little less than that before I bought it, like when we, you know, that was what the combined revenue saw equal.\r\n\r\n\r\nNik (25:25.395)\r\nOkay, so\r\n\r\n\r\nNik (25:32.243)\r\nOkay, so you buy these two companies, 5 .5 million. What was the purchase price? Are you able to share?\r\n\r\n\r\nHunter Durham (25:35.278)\r\nMm -hmm 3 .8. Yeah, 3 .6 million\r\n\r\n\r\nNik (25:39.571)\r\nOkay, so you buy 5 .5 million of top line revenue for 3 .6 million, finance it through the SBA. At that time, what was the customer concentration of Alan Bob, Jerry Williams, whatever, whatever the name is? Yeah, miserable, horrible Bob.\r\n\r\n\r\nHunter Durham (25:45.644)\r\nMm -hmm.\r\n\r\n\r\nHunter Durham (25:58.926)\r\nIt was less than 20%. I didn't have customer concentration when I bought it. know, like this is like rule number one when you're like buying businesses is like don't have customer concentration. And so like, especially with combined entities.\r\n\r\n\r\nNik (26:11.187)\r\nBut he'd already made the decision to essentially go all in on, not go all in on them, but to service them. Like, did it shift really quickly from 20 % to 40 % or was it gradual?\r\n\r\n\r\nHunter Durham (26:25.102)\r\nIt was pretty gradual. So we had like another million dollar customer that came. We had basically two other million dollar customers that kind of came with the other business. You know, so it was gradual. was, it was not, it was not like overnight. They ended up being 50%. We grew into that pretty quickly though, over the first six\r\n\r\n\r\nNik (26:46.227)\r\nSo you buy this business in 2021, agency is still firing on all cylinders. You've got the e -commerce business. You now got the shipping business. Things are going well for a little while, I'm assuming. Or was it just like utter chaos from day\r\n\r\n\r\nHunter Durham (26:49.976)\r\nagency is still firing on us.\r\n\r\n\r\nHunter Durham (26:57.602)\r\nMm -hmm.\r\n\r\n\r\nHunter Durham (27:02.796)\r\nI mean, it was still utter chaos from day one. mean, one of the big things was just cash flow and like cash conversion cycle of like this large. One of the things that I did miss in underwriting is they weren't that big at the beginning. They were like maybe a hundred thousand dollars a month is what we were doing with them. being? Nitricle. Yeah. Yeah. Yeah. Yeah. It was like slowly starting to ratchet\r\n\r\n\r\nNik (27:25.811)\r\nwith them being Mitchell Bob Gold Williams.\r\n\r\n\r\nHunter Durham (27:32.302)\r\nBut they were one of the only ones on terms. And so basically our working capital exploded because once they start getting to $300 ,000 a month, and now they're on 30 -day terms, and now we're paying truck drivers and everybody else pretty quickly. so was like, I mean, we ended up having to, I mean, there were many gymnastics I did across the businesses, really.\r\n\r\n\r\nNik (27:57.063)\r\nWell, and you're and you're going from a business that is almost a negative cash conversion cycle in the agency business and the ecommerce business, right? Like you're getting payment almost at point of sale to a business that has terms and has collections and okay, what is our cash conversion cycle? How long does it take us to collect?\r\n\r\n\r\nHunter Durham (28:05.09)\r\nYeah. Yeah.\r\n\r\n\r\nHunter Durham (28:10.766)\r\nMm -hmm. Well, it wasn't even it wasn't a cash conversion cycle most of the business when I bought it but also there was like $5 ,000 in cash that was coming home with truckers and I was like, ah, that's not a good idea anymore. I don't think I want that happening anymore. So it's like we changed some cash terms on top of the fact that we also extended terms to a corporate client. Let's just like view them as a corporate client. They were the first corporate client\r\n\r\n\r\nyou we had. And so, you know, when you strap the debt on and then have this corporate client and then try to go factor receivables or anything else, they're like, no, you have like a giant debt load. We're not going to factor anything for you. And so, yeah.\r\n\r\n\r\nNik (28:55.443)\r\nSo the receivables for them grew from 100 ,000 to 300\r\n\r\n\r\nHunter Durham (28:59.81)\r\nYeah, a month, A month, yeah.\r\n\r\n\r\nNik (29:01.628)\r\na month.\r\n\r\n\r\nmy gosh. At what point did you realize it was a problem?\r\n\r\n\r\nHunter Durham (29:12.558)\r\npretty quickly like three or four months down the road but when they really start ramping up is like three or four months down the road is when it really started to like hurt the cash flow cycle\r\n\r\n\r\nNik (29:24.805)\r\nAnd why? Why at that point? Because again, you've got the agency that's printing cash. The ecommerce business was probably fine. Why not at that point say, Yeah, I'm not doing this anymore. I can't float you guys. Sorry, I'll take the right off. And the reason I'm asking is because unless you go through it, it's anyways, it's very hard to say no, go for\r\n\r\n\r\nHunter Durham (29:39.51)\r\nYeah.\r\n\r\n\r\nHunter Durham (29:49.123)\r\nYeah. Yeah. mean, I actually took the different approach of like, let's go raise some more capital. Like we tried to raise capital, but this is like right when capital started to squeeze. It's like, this is like right when everything kind of shut down in the VC markets. People were uncertain. Everything was like kind of on the downhill\r\n\r\n\r\nof COVID. And I mean, honestly, it was just one of those things where it's like, you don't buy businesses to...\r\n\r\n\r\nIt's like the buy and hold model. like your idea is not that you're just going to buy it and get rid of it in less than a year. It's like how do you continue to grow it? That's kind of like the upside because you, you know, so it's like, I don't even think.\r\n\r\n\r\nNik (30:36.435)\r\nYeah, no, I'm not saying you should have gotten rid of that business. I'm saying why not at some point say like, okay, Mitchell Gold, Bob Williams, we're done with you. 500 ,000 in debt.\r\n\r\n\r\nHunter Durham (30:46.158)\r\nYeah. Well, at that point now they're like, you know, they're, they're rapidly increasing in, you know, the, um, the, the size of like their customer concentration. And so then it's like, Oh, do we cut off 30 % of our business like that and downsize and fire the truck drivers and you know, like they were rapidly increasing as we continue to bring them on board. we're like, I mean, we continue to grow with them pretty quickly.\r\n\r\n\r\nover that year. so, I mean, the size, we were doing 3 million with them at the end of it, but like their freight and logistics budget was like 10 million. And so was like, it wasn't like they could have tripled our business alone, which is not, wouldn't have been great. They would have been like 90 % at that point. But you know, there's, there is, I think this like feeling\r\n\r\n\r\nIt's growth, it's our most profitable revenue because they're the most premium. So it means we can drive, you know, a larger margin on it. And so there's just a lot of things where it was like a lot of good things to have them as a customer. And I think it's like an entrepreneur sometimes you're like, well, as long as it looks good on the P and L, like you can figure out the cashflow side of the equation.\r\n\r\n\r\nNik (32:03.731)\r\nHow large did their outstanding receivables grow to\r\n\r\n\r\nHunter Durham (32:09.294)\r\nOh, when they didn't pay for a couple of months, we were, I mean, at the end of it all, they owed us like $750 ,000.\r\n\r\n\r\nNik (32:20.499)\r\n$750 ,000. Did that, did like that distraction lead to your agency falling into, into issues or, or did the business dynamic change there as\r\n\r\n\r\nHunter Durham (32:22.53)\r\nYeah.\r\n\r\n\r\nHunter Durham (32:32.018)\r\nyeah.\r\n\r\n\r\nHunter Durham (32:36.078)\r\nOh yeah, mean, the agency was humming along. We signed a big public client, but you know, with agency, there's just natural churn. It's just the name of the game. Your employees churn and your customers churn. And so if you haven't put in a really good sales cycle and process, which is, know, margins get squeezed. Not everybody runs at 60 % forever.\r\n\r\n\r\nAnd that's usually when you have to add HR and sales and all these other things. But usually when you're small, you can kind of get close to that. but yeah, I mean, my focus had to fully shift over into furniture and dealing with my business partner getting sick and him not being there. And you know, there's just, there's a lot of things that just, I had cashflow coming in on the agency that took care of a lot of things, but it also was not receiving\r\n\r\n\r\nsales attention for me going out and getting more clients and doing the things that needed to be a little bit more sustainable of a business.\r\n\r\n\r\nNik (33:40.263)\r\nYeah. Yeah. Okay. My wife is frantically texting me apparently there's an emergency in my house. Can we we need to finish this up. Let's do a part two. Okay, this was this was awesome. I gotta run but love you. Good to see you. We'll talk later. See it.\r\n\r\n\r\nHunter Durham (33:45.661)\r\nno,\r\n\r\n\r\nWe can do part two. We can do part two. Yeah, let's do part\r\n\r\n\r\nHunter Durham (33:58.4)\r\nLove you too. Talk soon. Alright, bye.\r\n\r\n\r\nNik (00:01.21)\r\nSo, okay, so your agency is suffering now because you've got this massive debt that is never gonna be paid back. They've just entered into bankruptcy. What for you were like the next steps as you realized, crap, I'm never gonna get paid by John Michael Bob Ralph?\r\n\r\n\r\nNik (02:09.69)\r\nI have like I have a ton of questions around bankruptcy, but I'm not going to ask them because I just find it fascinating. You know, I mean, like, who do you notify and how does it like, have you ever seen the office when Michael Scott declares bankruptcy?\r\n\r\n\r\nNik (02:44.866)\r\nOkay. So, but moving on from that, when was that? When did you declare bankruptcy?\r\n\r\n\r\nNik (02:58.234)\r\nonly 23.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNik (03:06.552)\r\nOkay, so we're talking less than a year.\r\n\r\n\r\nand this is all happened. Walk me through the period of time after knowing that you have to declare bankruptcy and figuring out what you were doing next, or even, I guess, knowing you needed to declare bankruptcy and before you even started thinking about what was next. What were those months like? What were the conversations like with your wife, the investors?\r\n\r\n\r\nWhat was the temperature like in your\r\n\r\n\r\nNik (00:01.243)\r\nAs an\r\n\r\n\r\nmy microphone batteries died for whatever reason. so at the time that you filed bankruptcy, you had to file bankruptcy for all your entities, including the agency.\r\n\r\n\r\nNik (01:29.563)\r\nSo what were you thinking at this time? You had been hyper successful, right? You launched an agency, things are going well, you bought all these businesses and then all of a sudden you're bankrupt. Like how are you thinking about the next three months, six months, years? Like what are you and your wife talking about? What was the thought process going on in your head? What did you think you were gonna do\r\n\r\n\r\nNik (03:23.821)\r\nOne of my favorite songs has a lyric that says, the storm before the calm. So like not the calm before the storm, but the storm before the calm. And that's totally true, What, for you, as you were doing that self -reflection, what were the learnings? Coming out of this, what do you feel like you can actually share with people that you learned\r\n\r\n\r\nHopefully people don't have to go through, they can learn from your experience to avoid some of the pains you hit.\r\n\r\n\r\nNik (05:29.563)\r\nSo, okay, so you said, maybe I didn't understand you right. Did you say I wouldn't recommend buying a business to someone who hasn't bought a business before?\r\n\r\n\r\nNik (05:43.131)\r\nreally?\r\n\r\n\r\nNik (06:09.615)\r\nFor you, like let's drill into this. What do you feel like, man, looking back, if I could do it over again, I would have focused on certain areas. What are those areas?\r\n\r\n\r\nNik (07:27.963)\r\nOkay, I think that's really good advice.\r\n\r\n\r\nNik (08:50.437)\r\nI really like the way you're framing it. Know thyself, know what you're good at, what you're not good at, be comfortable with yourself. Stay within your core competency. That's such good advice. What about on the deals themselves? Was there anything, or as the business was operating, was there anything that really stands out to you as maybe operational mistakes that you made?\r\n\r\n\r\nNik (10:20.186)\r\nYeah.\r\n\r\n\r\nNik (10:46.139)\r\nOkay, well, look man, you're very smart. You're super thoughtful. I love how transparent you've been. I'm excited we got to talk about your successes a little more than just your bankruptcy because I have no doubt you're gonna be successful in the next iteration that you do. I think you're gonna be even more successful now that you've had a big loss under your belt because now you know landmines to sort of sidestep and move forward with. So I really, really appreciate.\r\n\r\n\r\nyour transparency. Do you mind if we end with some rapid fire questions? Okay, here's question number one. What industry are you the most jealous of right\r\n\r\n\r\nNik (11:29.377)\r\nI'm the most jealous of commercial real estate because I feel like, dude, triple net lease money just comes mailbox money. I don't even need to work for it. It's friggin amazing. So I'm jealous of those guys.\r\n\r\n\r\nNik (11:56.25)\r\nI agree.\r\n\r\n\r\nNik (12:22.533)\r\nI love it. All right. If you have two hours in your day and there's no kid responsibilities and no work responsibilities, what are you obsessed with? What are you working on right\r\n\r\n\r\nNik (12:39.471)\r\nI love it. I love\r\n\r\n\r\nNik (13:19.259)\r\nI suck at surfing, so I'll live like Gary's. I know dude, I know. All right, last question. What advice would you give to your pre -entrepreneurial self?\r\n\r\n\r\nNik (13:38.373)\r\nDid I freeze? Yeah.\r\n\r\n\r\nNik (13:46.896)\r\nOkay, are you ready? What advice would you give to your pre entrepreneurial self?\r\n\r\n\r\nNik (14:09.499)\r\nDude, that's so funny. I guarantee in a year from now you're gonna be like, take a breath, I gave that advice. Stupid, don't do it. No, it is good advice.\r\n\r\n\r\nNik (14:38.681)\r\nLove it. All right, man. Well, this has been has been a great conversation. Tell me where is the best place for people to come find\r\n\r\n\r\nNik (14:59.291)\r\nAll right, and we need to get you back on here to talk about cacao .pr.\r\n\r\n\r\nIt's amazing. All right, man. It was good talking to you. right, see you.\r\n\r\n\r\nNik (00:00.704)\r\nLet's just talk. How's life,\r\n\r\n\r\nNik (00:27.21)\r\nReally.\r\n\r\n\r\nNik (00:53.78)\r\nDude, I'm in agreement. No, no, no, I'm in total agreement.\r\n\r\n\r\nNik (02:00.084)\r\nThe Godfather.\r\n\r\n\r\nNik (02:11.52)\r\nYou don't have the guts because you've built a great personal relationship with him or because his position is unassailable.\r\n\r\n\r\nNik (03:35.008)\r\nSo you don't think there's a viable option with partnering with Juan.\r\n\r\n\r\nHow\r\n\r\n\r\nNik (03:59.092)\r\nWhat if you bought a controlling stake in his company?\r\n\r\n\r\nNik (05:27.008)\r\nWhat would that be?\r\n\r\n\r\nNik (05:32.286)\r\nNo, just no, like what you said, building a scalable profitable, whatever.\r\n\r\n\r\nNik (05:58.816)\r\nSo first of all, admirable that you would like just take a 180 and confront it. So thank you for doing that. What changed for you though? Because none of what you're saying is new. Like those are all the concerns I had, right? Like it was gonna take a sheer force of personality to really push this through. Like we knew about the regulatory constraints. We knew about the infrastructure.\r\n\r\n\r\nconstraints, all that stuff. So the stuff you're citing isn't necessarily new, but it's obviously that there's been a shift in your mind. What was that for you? And we don't have to release this, by the way. So.\r\n\r\n\r\nNik (07:09.152)\r\nCheers.\r\n\r\n\r\nNik (08:13.728)\r\nSo here's the thing. You don't have to convince me on how hard the market is. Cause like I already thought this was a crazy bet, right? But Hey, if you're willing to make it into 15 year timeline bet, like maybe this pans out. So I'm good with that part portion of it. What happens to the farm?\r\n\r\n\r\nNik (08:50.154)\r\nSo do we still own the lease to those trees?\r\n\r\n\r\nFor how\r\n\r\n\r\nNik (09:11.082)\r\nSo can that make us money? Is there any asset value there?\r\n\r\n\r\nNik (09:32.936)\r\nKakao PR brand. Got it. Yeah.\r\n\r\n\r\nNik (10:16.736)\r\nSo the 350 that was spent, that was just on about $170 ,000 worth of cacao. And\r\n\r\n\r\nNik (10:34.122)\r\nGreat time to pause.\r\n\r\n\r\nYou pause right when you're like the 250.\r\n\r\n\r\nNik (11:14.528)\r\nYeah, you paid them like 60 grand,\r\n\r\n\r\nNik (11:19.316)\r\nSo could you use them before the end of the\r\n\r\n\r\nNik (11:52.124)\r\nI agree. I totally agree with that. I was trying to convince you to do this from the jump and you wanted to frigging buy chocolate.\r\n\r\n\r\nI look, I think it's to be honest, independent of my feelings about, you know, lighting money on fire, but like, I think it's the right move for you. I totally, I think you're incredibly talented. You're very charismatic. You're smart. You connect exceptionally well with people and an agency business will make you a ton of money.\r\n\r\n\r\nAnd you have some very, very good connections that you could leverage in this space. like, it's a no brainer for me. Are you looking for advice on how to do it? like, how do you now communicate this out to people who invested in you? like, what kind of where's your headspace?\r\n\r\n\r\nNik (13:27.774)\r\nYeah. So would this just roll?\r\n\r\n\r\nWould it like for me, I'm like selfishly first for me, would this just roll into an agency? Play?\r\n\r\n\r\nNik (13:48.946)\r\nI would love that. I would love that because I would like, we would talk way\r\n\r\n\r\nNik (13:59.68)\r\nPersonally, selfishly, that's how I, because I'm obsessed with this stuff right now. I'm obsessed with media.\r\n\r\n\r\nNik (15:01.76)\r\nTotally,\r\n\r\n\r\nNik (15:10.25)\r\nTell me, what are you the most worried about posting on Twitter? Just people thinking failure number two or I called my shot, we're gonna be a sponsor of the World Cup and now I look like an idiot, like\r\n\r\n\r\nNik (15:55.72)\r\nWhat's your what's your ideal customer? Is your current audience your ideal customer?\r\n\r\n\r\nNik (16:10.494)\r\nAre you doing marketing? Like, what are you doing?\r\n\r\n\r\nNik (16:28.672)\r\nFascinating.\r\n\r\n\r\nNik (17:17.472)\r\nLook man, Chris and I literally just had this conversation. Chris has, I think he passed 100 ,000 on Twitter. I think he's at 120 on Instagram, 20 on TikTok. And he's like, I have yet to get a DM from somebody asking me to sponsor a product. And he's like, that seems weird, right? I'm like, yeah, it does seem weird. He's like, I don't, like we just think, man, once I get to a certain level, I'm gonna get all these brand deals, but there's nobody going out.\r\n\r\n\r\nunless you have an agent of some sort or like there's nobody going out and finding these influencers at a certain threshold. And so anyways, you're kind of describing what we've been talking a lot\r\n\r\n\r\nNik (18:22.112)\r\nSo I have to go in a few minutes. I love this conversation. Let's keep having this conversation, especially over text. What I would say to you about Twitter or just like a public persona would be like performance kind of just erases a lot of sins. So yeah, people will be like, well, are you serious? But if you do a good job,\r\n\r\n\r\npeople forget about crap in the past. I don't think that but I don't also don't think that you have to come out and be like, cacao .pr is dead.\r\n\r\n\r\nNik (19:38.252)\r\nI would, that's possibly one thing I like, you could do it easier. Maybe you license out cacao .pr maybe, maybe like cacao .pr does end up selling chocolate, but it's all white labeled to people who are doing other things. Or maybe cacao .pr pivots into a cacao marketing agency where you're helping Juan and these other companies get more exposure in the mainland\r\n\r\n\r\nI don't think you have to just go full scale, burn the boats, it's dead. But you could do it in a way where there's no overhead. It's still like fulfilling the mission of cacao .pr. And then you're still using it as a credibility vehicle for your audience.\r\n\r\n\r\nNik (21:03.488)\r\nAnd I think 90 % of people don't even know what Kakao .pr is. I I'm invested in it and I'm not even sure I'm an expert. Like, you could literally pivot into a newsletter. We have a Kakao newsletter just for Puerto Rico and then sell that to equities or commodities traders, right? Like, it could be a host of things. It could just be the network for local Puerto Rican Kakao growers to have, right?\r\n\r\n\r\nThere's so many things you could pivot into without having to like go out on Twitter and have a mea culpa, you\r\n\r\n\r\nNik (21:41.62)\r\nCome\r\n\r\n\r\nNik (22:02.952)\r\nYeah, especially if you like, if you bring the Kakao .pr into the media fold, if you're like, look, we thought about doing this, but we'd have to go through all these verticals, we'd have to create the infrastructure, all that stuff. We're turning Kakao .pr into part of our media brand. It's going to be one of the properties that we have. And we're going to build a full, a full scale media company that will promote PR. And so there's Kakao .pr, there's finance .pr, there's, you know, whatever .pr, but the thrust and focus is,\r\n\r\n\r\nYeah, to be a media brand. So I guess.\r\n\r\n\r\nNik (22:59.774)\r\nWell, and if we start experimenting with it and showing results, then like it makes it lot easier to do that pivot into what you want to do. So I like it. Okay. Hey, always good to see\r\n\r\n\r\nTalk later. Bye.",
  "metadata": {
    "duration": "",
    "date": "2024-09-20",
    "platform_source": "Google Drive"
  }
}