{
  "episode_number": "211",
  "episode_title": "AI SERIES: 19 - You're Using AI Wrong, Here's How to Fix It with Amanda Orson",
  "guest_name": "Amanda Orson",
  "business_name": "Galleon",
  "transcript": "﻿Nikolas Hulewsky (00:00.475)\r\nIt's my poor planning. Okay, Amanda Orson, I am so excited to have you back. We talked, I don't know, six months ago and your episode on AI and how you're utilizing AI kicked off this like curiosity driven state that I've been in, in trying to figure out AI. And so thank you for that. And for people who don't remember you, you are a serial entrepreneur, serial founder. You've most recently founded this company called Galleon, which is a marketplace for buyers and sellers in real estate that eliminates the need.\r\n\r\n\r\nfor a real estate agent. It's a freaking phenomenal platform. That's a company you've been able to scale up to about $60,000 a month in monthly recurring revenue by leveraging AI and not building out a massive team. we're talking about more AI today. You're someone who walks the walk, talks the talk. And I couldn't be more excited to talk to you. Give me just a brief like, Hey, what's going on at Galleon? Cause you were just talking to me how you're focusing, you're shifting your focus to Galleon to really drive home the point that you're all in on AI.\r\n\r\n\r\nAmanda Orson (01:00.098)\r\nYeah. So I think a lot of people have thought about AI and its application to business, mostly in B2B applications. And we're obviously a very consumer focused. So a lot of our early, I would say embeddings of AI were around how we actually develop the product. And now we're trying to think about how we do make our navigator product agentic. So navigator for Galleon is basically how do I transact with no middlemen? And\r\n\r\n\r\nThe core of our focus is taking this software application and actually doing the deep dive R &D to not only make it, you know, conventionally agentic in the way that we're currently thinking about it, which is mostly a chat GPT wrapper, but actually interact with your documents, the details about your home or the contextually relevant details about the homes that you might be putting offers in on. And one step further, as I was just talking about late last night, I'm thinking about how do we make it not only agentic,\r\n\r\n\r\nBut how do we incorporate voice AI really quickly? Because one of the most important objections that I heard from pre-seed investors in 23, when we first got started, was that real estate is highly emotional. Buying a home is highly emotional. And a lot of what real estate agents do is emotion management. My observation has been, like reading the feed on Twitter, a lot of people are using AI to validate.\r\n\r\n\r\nor in a therapeutic capacity or that one guy on the subway, I think has fallen in love with chat GPT. I'm not sure. but people are definitely using it in ways that I don't think it was originally intended to that are emotional. And I think that if you actually incorporate voice, it becomes that much more, trustworthy and it sounds, it's easier to form sort of this like connection with it. And I think that if you have the practical application of software,\r\n\r\n\r\nNikolas Hulewsky (02:41.072)\r\nYeah.\r\n\r\n\r\nAmanda Orson (02:55.758)\r\nplus voice, then you can actually get real-time, personalized, contextually relevant, and legally sound recommendations for whatever the context is in a way that feels organic and human. I think that's the inevitable future.\r\n\r\n\r\nNikolas Hulewsky (03:08.911)\r\nYeah. tell me what we're going to talk about today is sort of building out AI in a way that doesn't just validate, but it also prompts you by asking you questions.\r\n\r\n\r\nBut I want to ask, which, sorry, which I think is incredibly important because many times we don't even know the right questions to ask or how to necessarily utilize AI to help us make decisions. So I'm fascinated by this whole process of like, how do I get the right prompt and how do I get it to act the right way? but there's two things I wanted to ask you about. The first thing was I think that people have gone from leveraging AI to get their team more efficient, which you just said, to now shifting their focus to a Gentic.\r\n\r\n\r\nIs that fair? Okay.\r\n\r\n\r\nAmanda Orson (03:54.252)\r\nI think that is fair. I think that's a broad, broad brush. And a lot of people have a different definition of what agentic is, but yes, I think that is where we're going.\r\n\r\n\r\nNikolas Hulewsky (04:02.559)\r\nThat's my second question. I don't feel like I've gotten like a really good definition of what a gentic means because I think that people are using it in a way that it's not actually intended to be used. What does a gentic mean to you?\r\n\r\n\r\nAmanda Orson (04:16.878)\r\nThis is like the debate on what is gen AI. I think that a Gentic really comes down to, um, uh, an interaction that is not purely reactive. So it has a non-binary output, meaning like I put X in and I'm not just getting X plus something. It's actually a conversation based on large context and should be dynamic, should be contextually relevant.\r\n\r\n\r\nNikolas Hulewsky (04:20.122)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (04:43.109)\r\nMm-hmm.\r\n\r\n\r\nAmanda Orson (04:46.55)\r\nshould be personalized. I think that you know you're interacting with something that is more agentic when the result that you get is a surprise or is net new information.\r\n\r\n\r\nNikolas Hulewsky (04:56.005)\r\nDo you think that sort of this chain of thought is actually a better way to approach agentic models as opposed to the traditional LLMs?\r\n\r\n\r\nAmanda Orson (05:05.93)\r\nI think that it depends on what it is you're trying to do. Like, are you trying to do something for which there are finite permutations or are you trying to do something for which, like, there is an infinite number of potentially good responses?\r\n\r\n\r\nNikolas Hulewsky (05:16.303)\r\nWell, OK, you're way smarter than me. So I'll just say what I'm actually thinking. I think that the current state of AI, which people usually use it for, like chat GPT, is really good at taking fairly large data sets and then spitting out some type of analysis or summary or sort of regurgitating the data. In my experience, it's not great at finding novel things, new things. I think of the agentic as\r\n\r\n\r\nAmanda Orson (05:39.64)\r\nCorrect.\r\n\r\n\r\nNikolas Hulewsky (05:44.718)\r\nit can help find the novel things. It can go out and search and sort of do some analysis and like, let me validate whether or not that's a reasonable thing. So like now when I use Grok 4 or when I use Claude or Chat2BT, I see it thinking. I see the steps that are like being permutated that it's going through. That feels more like a reasoning and chain of thought as opposed to just this regurgitated synopsis of what the data says. And that's how I think of the difference between just AI LLMs and agentic models.\r\n\r\n\r\nI don't know if that's a fair framework or not though, because I don't know that anybody's like, there's no consensus on what it means.\r\n\r\n\r\nAmanda Orson (06:21.026)\r\nSo I think that the simplest explanation is, I think, as you've just alluded to, like when you think about agency, you think about something that can actually have some independent thought or has the ability to come to conclusions other than that, which you've anticipated because it has agency. I think that that is just a helpful framework for understanding whether or not something is, you know, I added X plus Y and I got, or, you know, I added X and then I put some context in and then I got this whole new novel thing.\r\n\r\n\r\nNikolas Hulewsky (06:35.803)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:50.703)\r\nWell, for somebody who's listening that's like, okay, nerds, move on to the practical stuff. The reason that this is important, in my opinion, is because anybody think about the last time you went on ChatTPT and you entered in some data and you said, hey, what do you think of this data? It'll spit you a response. Okay, great. That doesn't really tell you whether or not the output is necessarily biased.\r\n\r\n\r\nBut then think of a time where you've used it and said, I'm trying to make this argument to this person or this legal argument, or I'm trying to do X, Y, and Z. What do you think of my idea? What do you think of my thought process? What do you think of my analysis and supporting thought? And most of the time, almost all the time actually, it sides with me. Oh, that's really smart. Yep, this is why you're right. Oh, I really like that. And it's like, it makes sense to me because you would want the AI.\r\n\r\n\r\nto make you feel good about what you're thinking, because then you're going to go back to use the AI more. So from a product standpoint, it feels like they've sort of engineered it. I don't know if they've done it on purpose, but that would make sense to me. However, when you're making high leverage decisions, I need impartial people who can be in the room to like say, no, this is where you're wrong.\r\n\r\n\r\nactually that's a terrible argument because of X, and Z. And it doesn't do that unless I explicitly prompt it. And even then there are times where it doesn't really return things in the way that I want it to be. So that's why I like to talk about this like, agentic versus LLM, synopsis versus actual reasoning, is because when I'm trying to use it in its application,\r\n\r\n\r\nI don't want something that's just going to be summarizing and saying, yeah, good job, Nick. That was a great idea. I want something that's going to be pushing back on me and saying, that's not good for x, y, z reasons, which is why I love your stuff, because you're so thoughtful in your prompts and the way that you organize things. And that's what we're going to go through today is like, how do I set this up so that I'm not always biased or the AI is not always biased in my favor?\r\n\r\n\r\nAmanda Orson (08:46.68)\r\nYeah, I don't use chat GPT or Claude to do my thinking for me. I use it as a Socratic mirror. I want it to prompt me, not the other way around. So the way that I use artificial intelligence as it applies specifically to the way that I'm thinking about things for Galleon is how do I construct sort of a living set of instructions on how to be a thought partner to me?\r\n\r\n\r\nNikolas Hulewsky (09:00.837)\r\nMmm.\r\n\r\n\r\nAmanda Orson (09:15.18)\r\nto help elevate the decision-making and the decision-making speed, the quality decision-making speed that I'm making.\r\n\r\n\r\nNikolas Hulewsky (09:19.536)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (09:23.055)\r\nYeah, that's fast. Okay, like how do I make it a board member or an advisor that's always in my pocket? Always in my pocket that I can go to. Okay, tell me how. You know the answer.\r\n\r\n\r\nAmanda Orson (09:27.118)\r\nCorrect. Yep, that's exactly it.\r\n\r\n\r\nAmanda Orson (09:33.434)\r\nSo that's, that's almost exactly what I was going to say is that it is more like a board member. And I think it's really, really important. The more senior you are within an organization or the more isolated you are, because there aren't that many people that you have the ability to, you know, have sort of this thought partnership with that, particularly that are going to be up to speed on the individual pieces of what's going on in your business. So.\r\n\r\n\r\nNikolas Hulewsky (09:34.585)\r\nI'll just...\r\n\r\n\r\nNikolas Hulewsky (09:42.203)\r\nThanks.\r\n\r\n\r\nNikolas Hulewsky (09:59.025)\r\nYeah.\r\n\r\n\r\nTotally agree.\r\n\r\n\r\nAmanda Orson (10:04.002)\r\nI think the easiest way to do it that is most approachable for everybody is not actually setting up a custom GPT. I recognize that that's probably the right solution for higher level things. You'll get more like a larger context window over time. But I think the simplest way is to use a project either within Claude or within ChatGPT. For people that are maybe more familiar with one than the other, what I will say is that on the whole,\r\n\r\n\r\nI think Claude does a better job of adhering to the instructions. And I think that it has, it's context window in your project is much larger. You can upload a lot of files and it's size limited where inside of chat GPT, it's project windows are limited to 20. So 20 files of whatever size. So it depends on what your use case is. I personally defer to Claude because I like having a lot of information in there. And then I distill the file format to.\r\n\r\n\r\nNikolas Hulewsky (10:49.723)\r\nMmm.\r\n\r\n\r\nAmanda Orson (11:00.802)\r\nthe simplest lowest like size file possible, which is almost always RTF or a text file if I can get it. Inside that context window, I have very specific project instructions to, yeah.\r\n\r\n\r\nNikolas Hulewsky (11:13.765)\r\nCan you show us? you just pull up what Claude looks like? And while she's pulling that up, you said a GPT versus a project. So what you can do is you can actually create a GPT that has specific set of instructions, which is effectively like a really long prompt, that will function as, you're a trusted advisor and I need you to give me.\r\n\r\n\r\nAmanda Orson (11:17.656)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (11:35.224)\r\nunbiased feedback and I need you to find these pitfalls and you're an expert in whatever biology yada yada yada. The problem with a GPT is that information can be static and is more difficult to change but in my experience at least the cool thing about projects is I can go and change that project knowledge quote unquote fairly easily and it automatically just updates. So what we're looking at here this is Claude and cool I have my own project called Next Podcast.\r\n\r\n\r\nAmanda Orson (12:04.302)\r\nthis is the project and in here you can see there's a context window. is your normal, the normal place that you would chat and ask for instructions or help or, you know, whatever it is you need. And then this is the project knowledge. And this is what I'm talking about with Claude. You have a lot more space to put a lot more context in and it tends to adhere to your instructions better, in my opinion.\r\n\r\n\r\nthan chat GPT. It also is better at just not throwing random emojis, dashes, and horizontal rules into things, which I appreciate.\r\n\r\n\r\nNikolas Hulewsky (12:33.851)\r\nSo, so if you're a business owner, project knowledge would be something like, I have a medical billing company, one of my coders is using a specific project, let's call it healthcare coding as the project. I could upload all the ICD-10 codes. I could upload all of the diagnosis definitions. If I own a company that does, I don't know, electrical contracting, and I have a contractor out in the field, I could have them\r\n\r\n\r\nuploaded here a specific SOP for how they actually go out and price different projects, what they take into account, what's important, et cetera, just as a reference for them so that they can come to this and be like, hey, I can't remember if we're using, I'm way out of my depth here, if we're using copper versus silicon, how do I price this? And it can give a specific answer because the knowledge set from the company is included here in the project. So that's typically where the project knowledge will sit is in that set. But there is also the\r\n\r\n\r\nprompt, not prompt, instructions, right? How do you differentiate between the instructions and the project knowledge?\r\n\r\n\r\nAmanda Orson (13:35.022)\r\nMm-hmm. Yep. So.\r\n\r\n\r\nAmanda Orson (13:40.536)\r\nI would say that instructions are persistent and always on, meaning that no matter what it is that you're actually engaging with, the instructions are always the instructions. For the actual context, especially if you're in a business, I highly, highly, highly advise these two that I've added. Now your strategic context is going to completely vary, but I have what I call a strategic context prompt. And in the strategic context prompt,\r\n\r\n\r\nNikolas Hulewsky (13:46.715)\r\nThanks\r\n\r\n\r\nAmanda Orson (14:08.138)\r\nIt gives very specific information, in the context of a startup, your cash position, your monthly burn, your critical milestones, what your team looks like, who's on your team, your revenue engine. I mean, it goes into very specific detail here. And again, this is going to vary depending on your industry, but I highly recommend having a strategic context prompt for your business or whatever project it is. You want to be able to use this kind of thought partner, second brain board advisor.\r\n\r\n\r\nNikolas Hulewsky (14:28.389)\r\nMm-hmm.\r\n\r\n\r\nAmanda Orson (14:38.05)\r\nmake sure that you have like persistent strategic context. And this is the file that I will update most often inside of any project because the strategic context changes all the time. Your team members change.\r\n\r\n\r\nNikolas Hulewsky (14:49.157)\r\nSo you're actually naming it that. You're naming it strategic context.\r\n\r\n\r\nAmanda Orson (14:52.161)\r\nMm-hmm. Yep.\r\n\r\n\r\nNikolas Hulewsky (14:55.099)\r\nDo you have a format for it or are like, okay, these are the five things? Okay, of course you do.\r\n\r\n\r\nAmanda Orson (14:55.329)\r\nAnd this is\r\n\r\n\r\nAmanda Orson (14:59.244)\r\nYep. I'm happy to actually share this prompt with you, so that you can give it to the, the watchers on this or the listeners on this. And the second one that I do is actually a tweet and I will credit that person with the link at the end, but it's what I call my anti-sycophant prompt. So a big part of the problem. Yeah. Huge part of the problem with, using NALLM is that it's validating. Like, and that's unfortunately not.\r\n\r\n\r\nNikolas Hulewsky (15:02.715)\r\nwould be amazing.\r\n\r\n\r\nNikolas Hulewsky (15:15.926)\r\nyes!\r\n\r\n\r\nAmanda Orson (15:25.122)\r\nwhat you need, especially in a leadership position, particularly in the most senior leadership position. as I was saying to Nick, before we actually jumped onto this video, the big part of the problem with LLMs is that it helps you go really fast, but going fast and in the wrong direction is not actually going to help. this, this is clutch. This actually allows, you know, Claude and to a lesser extent, chat GBT to like gut check you.\r\n\r\n\r\nNikolas Hulewsky (15:40.492)\r\nMmm, yeah, yeah, yeah.\r\n\r\n\r\nAmanda Orson (15:50.024)\r\nAnd make sure that it's not just telling you what it thinks or has been programmed to think you want to hear. So the two things that I start every single project with are the strategic context prompt and the anti-sycophant prompt just to sort of set the table.\r\n\r\n\r\nNikolas Hulewsky (16:03.712)\r\nlove that. How long is that the total prompt? Is it just that paragraph?\r\n\r\n\r\nAmanda Orson (16:08.174)\r\nIt's just that paragraph. And it really works.\r\n\r\n\r\nNikolas Hulewsky (16:10.491)\r\nOkay? And you just upload these to the project knowledge right away.\r\n\r\n\r\nNikolas Hulewsky (16:17.071)\r\nAnd how often do you update the, sorry, the strategic context, you said how often do you update that?\r\n\r\n\r\nAmanda Orson (16:17.196)\r\nNow I actually.\r\n\r\n\r\nAmanda Orson (16:21.322)\r\nI update it as needed. again, mine varies a little bit. I'm going to stop sharing Claude for a second so I can actually share my window. But I think that it's really important to keep that one as up to date as possible because making decisions based on last week's information may not be what you need for next week. It just changes so fast. It's really, really important.\r\n\r\n\r\nNikolas Hulewsky (16:43.022)\r\nYeah.\r\n\r\n\r\nYeah, I've been thinking about this a lot. I've been using Grok recently, Grok 4, which is fantastic. One of my favorite features about Chat GPT though is the persistent memory. And I've been thinking as I'm using Grok, it doesn't have that persistent memory feature. It's like, how do I keep it up to date? How do I make sure that it understands? Because within a chat, it will hold that context. But if I go to a new chat, I'm starting over again. It doesn't know who I am. It doesn't know anything about my business.\r\n\r\n\r\nEt cetera. that, what you're just talking about right there, that context, strategic context, I think is going to be very useful for somebody like me who's using another LLM that doesn't have this persistent memory that ChatTPT does.\r\n\r\n\r\nAmanda Orson (17:28.822)\r\nExactly. So this is the document that I'm actually going to use to form the project instructions. And you'll see it is not a short document, but it gives very, very specific instructions on what I want us to be focused on from a company like Optempo perspective. What are the core principles of the way that I think about things based on reading, based on understanding best principles and certainly based on experience.\r\n\r\n\r\nNikolas Hulewsky (17:43.621)\r\nMm-hmm.\r\n\r\n\r\nAmanda Orson (17:57.346)\r\nHow do I want the team to be held accountable? And then, you know, obviously what the sort of core principles are. Again, you'll see that I do a lot of coaching within the project instructions on making sure that it is not sycophantic. It's really, really important. And it is the bias of all of the LLMs. Like you should assume that the LLM is engineered to tell you what it thinks you want to hear unless you specifically instruct it otherwise. But I wanted to actually show\r\n\r\n\r\nNikolas Hulewsky (18:09.093)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:25.339)\r\nAnd even then, how long did it take you to create this prompt?\r\n\r\n\r\nAmanda Orson (18:27.118)\r\nEven then, even then, gotta check it.\r\n\r\n\r\nAmanda Orson (18:34.606)\r\nUh, it's tough to say because I, probably wrote it once, twice, three times and, know, have revised it and rewritten it several more times over since then. So I'm actually going to cut and paste it and make sure that that is inside.\r\n\r\n\r\nNikolas Hulewsky (18:45.797)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:54.075)\r\nBecause that's one my things that I've spent a ton of time on, in JAT GPT in particular. I've set up different projects, I've created GPTs, but it's all about instructing it so that it's the most helpful. Because I can have all the data in the world, could show it all of my CSV files and my emails between people and ask it for analysis.\r\n\r\n\r\nBut if it doesn't know what's important to me or what I'm looking for or what lens I evaluate decisions through, it's not the best that it could be. And so I've spent a lot of time like, okay, this is who I am. This is how I think, this is how I operate. And I have a context document that I use for that, but it's been a lot of time and energy and effort. And frankly, with now the persistent memory across Chat TV, I'll even ask it. like, what is important to me? Please write me a context document. You know what I mean? So it's like, that's been helpful.\r\n\r\n\r\nYeah, it takes a long time. Like it's not, it isn't just a quick fix. Like you do need to sit down and really think through this stuff.\r\n\r\n\r\nAmanda Orson (19:55.126)\r\nYes, absolutely. I mean, the quality of the output is dependent entirely on the quality of your input, right? It's garbage in, garbage out. But it's why thinking through this and reiterating or iterating on your initial context prompts or your initial project instructions is so valuable because as the quality of the output you receive improves,\r\n\r\n\r\nNikolas Hulewsky (19:59.739)\r\nRight.\r\n\r\n\r\nAmanda Orson (20:20.044)\r\nSo does your quality of decision-making or the quality of your product or the quality of your customer experience or whatever it is that you're working on. So you'll see it in real time. And for me, it's a product of the quality and the velocity. Like I can go much faster this way. And I don't second guess myself as much because I've spent so much time, so much rigor in sort of thinking about things from all aspects. And this is where I would love to actually show you. I spend a lot of time thinking about\r\n\r\n\r\nWho would I call if I had the ability to call anybody? And it's not just, you know, living entrepreneurs, it's dead entrepreneurs. It's everybody that I can possibly think of. Like who has already solved a problem that is either similar to this or who would have an interesting perspective? And that's, think, where I can really get some cool results that I don't think a lot of people are doing right now. Maybe they are. But I spend a lot of time actually\r\n\r\n\r\nNikolas Hulewsky (21:02.266)\r\nYeah.\r\n\r\n\r\nAmanda Orson (21:18.082)\r\ngoing through and either transcribing or downloading the transcriptions or gathering quotes, whatever, from specific entrepreneurs. The two that I prepared here are actually, one's not an entrepreneur, but I grabbed some stuff from Chris Jenner and some stuff from Chris Voss who wrote, never split the difference on negotiation. These are the kinds of things that I will commonly update into project knowledge so that I can ask specific questions.\r\n\r\n\r\nas if I am prompting or asking them. So, I mean,\r\n\r\n\r\nNikolas Hulewsky (21:51.132)\r\nOkay, so you've created this project. We have the two that you always put in there, the strategic context as well as the antisycophant prompt. You've also got the instructions for the project. Now what we're talking about is, that's, we've got the table stakes for the game. Now let's go and get the context that we want in order for this to turn into the project that we need for our business.\r\n\r\n\r\nAmanda Orson (21:55.948)\r\nMm-hmm.\r\n\r\n\r\nAmanda Orson (22:17.73)\r\nYeah, correct.\r\n\r\n\r\nNikolas Hulewsky (22:17.811)\r\nAnd you're talking about going to find people who have philosophies that might give us insights or evaluate our decision making in order for us to make good decisions. Can you show your desktop? Is that okay? Because I think that was really interesting to show.\r\n\r\n\r\nAmanda Orson (22:30.737)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (22:35.065)\r\nI just thought that was fascinating, the way you had organized stuff.\r\n\r\n\r\nNikolas Hulewsky (22:41.391)\r\nAnd it was the cleanest desktop I've ever seen. Mine's like, you don't want to be on my desktop. It'd give you anxiety instantly.\r\n\r\n\r\nAmanda Orson (22:47.878)\r\nthat's really funny.\r\n\r\n\r\nSo for this one, to be clear, I actually have more things usually when I'm not recording a podcast. But what I had done was I created folders just with some quick context for.\r\n\r\n\r\nNikolas Hulewsky (22:57.443)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (23:01.665)\r\nHold on. I only see, yeah, I only see the riverside screen.\r\n\r\n\r\nAmanda Orson (23:07.417)\r\nno.\r\n\r\n\r\nNikolas Hulewsky (23:10.745)\r\nI know we showed it before.\r\n\r\n\r\nAmanda Orson (23:12.844)\r\nYep. Sorry. Cut this.\r\n\r\n\r\nNikolas Hulewsky (23:14.139)\r\nAnd it's, mean, if... Okay.\r\n\r\n\r\nAmanda Orson (23:19.512)\r\nLet's see, try it again.\r\n\r\n\r\nAmanda Orson (23:27.17)\r\nLet's see.\r\n\r\n\r\nNikolas Hulewsky (23:29.851)\r\nI see it. you minimize, I think if you minimize the screen, it'll, yeah, there we go. There it is. Okay. Yes. Perfect. Yep. Perfect.\r\n\r\n\r\nAmanda Orson (23:33.966)\r\nCan you see it now? Alright.\r\n\r\n\r\nSo again, this is not my typical screen. I actually normally have a lot of other things up here, but for the purposes of this podcast, I wanted to just highlight. So I will go and grab transcripts. That's my favorite source. I like getting primary sources. I think that's actually really valuable if you can get people in their own words. I'm happy to go and grab stuff from individual books if they've written books, but I really, I think that people tend to say more things honestly off the cuff when they're being interviewed.\r\n\r\n\r\nSo if I can grab interview transcripts, I will grab interview transcripts. I really like to use a tool called Yes.\r\n\r\n\r\nNikolas Hulewsky (24:08.922)\r\nYeah.\r\n\r\n\r\nI'll go to YouTube and get the transcriptions of people's conversations. Sorry, what was the tool?\r\n\r\n\r\nAmanda Orson (24:18.134)\r\nAbsolutely. That's actually one of, I was going to say nada, but it doesn't matter what the tool is. There are multiple tools that will do this for you. But I think that YouTube into a tool that actually gets the transcript, if it's not already there organically under YouTube, that is the way. So that's literally, this is a transcript. And I will add one of the really valuable things that you can do if you're inside a company is to go and grab your meeting transcript.\r\n\r\n\r\nMaybe that's not cool to say, but like it's fantastic. It's such a good output. Like if you want to just distill what were the actionable takeaways, what were the deliverables, who said they were going to do what by when, like meeting transcripts all day long, and then upload them into your project.\r\n\r\n\r\nNikolas Hulewsky (24:44.645)\r\nTotally agree.\r\n\r\n\r\nNikolas Hulewsky (25:00.33)\r\nSo is this the transcript or is it the analysis of the conversation? Is it, you know what I mean? Okay.\r\n\r\n\r\nAmanda Orson (25:04.77)\r\nThis is actually the transcript. This is combined analysis. think I asked actually perplexity and chat GPT to distill a whole bunch of information. You could see it's black. Distill a whole bunch of information into its essence for Chris Voss, for Chris Jenner. Unfortunately, this transcript actually failed, but I do have the other one. I was doing this quickly. I do have the other context window. So typically for my own projects, I will have a person or a company\r\n\r\n\r\nit doesn't matter, but I'll have like large volumes of text. So I got really into the industrialists at the top of the year. And I have like reams of data on transcriptions from podcasts and you name it on how the early industrialists did what they did because they had a greenfield experience in much the same way that I think a lot of entrepreneurs do right now with AI. So I really wanted to think about how they thought about doing something that had never been done before. And that was how I sort of trained my own brain to think.\r\n\r\n\r\nNikolas Hulewsky (26:02.587)\r\nOkay, so you'll take the transcripts and now you've uploaded them to Clot. Just the transcripts.\r\n\r\n\r\nAmanda Orson (26:07.906)\r\nYeah. I'm gonna- correct. And now I'm gonna stop sharing and go back to Claude.\r\n\r\n\r\nNikolas Hulewsky (26:14.843)\r\nSo when I do it, I usually will take the transcripts and I'll take multiple transcripts and then I'll upload it either to Claude. My favorite recently has been Notebook LM. I love Notebook LM for large written datasets. And then I'll ask it to write me like a really in-depth summary of the essence to to steal your word. And then I'll take that and I'll upload that to my project knowledge because then I'm not taking up as much, I guess, space.\r\n\r\n\r\nfor that context window. Do you do that or do you just upload the transcripts?\r\n\r\n\r\nAmanda Orson (26:48.142)\r\nas far as possible upload transcripts. definitely if you have a finite context window, because when I, especially if you summarize things with chat GPT, I'm going to beat up on open AI here. It gives you like the 30,000 foot view, but it's not doing you the service of like the really super tactical takeaways. Like I just reread Essentialism by Greg McKeown over the weekend and I'd read that book probably 15 years ago, or excuse me, 10 years ago when it first came out.\r\n\r\n\r\nNikolas Hulewsky (26:52.101)\r\nReally? Okay.\r\n\r\n\r\nNikolas Hulewsky (27:08.559)\r\nNo.\r\n\r\n\r\nAmanda Orson (27:18.262)\r\nAnd I missed some details in there. And one of the great details that if you go to Goodreads or any of the other places that have created transcripts and quotes about that book that I hadn't picked up on was he says, no matter what it is you're doing, add 50%. Like add 50 % of the time that you think it's going to complete or take to complete. And then he gives all the scientific and statistical analysis on why you should always do that. I completely missed it.\r\n\r\n\r\nAnd in no recap did I see it. And that's the kind of stuff that you're going to miss when you get just like the 30,000 foot overview and ask ChachiBT to synthesize the most salient takeaways from a transcript, where if you actually upload the transcript, it'll pull it out.\r\n\r\n\r\nNikolas Hulewsky (27:56.761)\r\nYeah.\r\n\r\n\r\nThat's why I look do you use notebook LM at all?\r\n\r\n\r\nNikolas Hulewsky (28:05.679)\r\nYeah, I love Notebook LM because it doesn't hallucinate and it cites everything that it says. However, that's a really good point. How do you get the transcripts of books?\r\n\r\n\r\nAmanda Orson (28:17.186)\r\nThat's a good question. I mean, do you want to talk about the white hat way or do you want to talk about the not white hat way? So I would say I'm going to stop sharing.\r\n\r\n\r\nNikolas Hulewsky (28:24.827)\r\nTell me then.\r\n\r\n\r\nAmanda Orson (28:29.467)\r\nyou can definitely grab-\r\n\r\n\r\nNikolas Hulewsky (28:30.587)\r\nTell me the white hat way and then tell me the non white hat way.\r\n\r\n\r\nAmanda Orson (28:35.266)\r\nSo you can definitely grab a book and you can do something called non-destructive or a destructive scanning. So you can buy the book and then go and get it destructively scanned individually into a PDF. And then you convert the PDF into text. That's one way. The other way, and Amazon has done a lot to try and...\r\n\r\n\r\nNikolas Hulewsky (28:54.213)\r\nAre there tools for that? Because I have lots of books that I've...\r\n\r\n\r\nSorry, I'm cutting you off. You keep going.\r\n\r\n\r\nAmanda Orson (29:00.204)\r\nNo, no, no, it's fine. There's a delay.\r\n\r\n\r\nNikolas Hulewsky (29:05.339)\r\nI know, I know. It's new, it is new, but.\r\n\r\n\r\nOkay, keep going on the second way.\r\n\r\n\r\nAmanda Orson (29:13.646)\r\nOkay, the second way is that Amazon obviously has Kindle and you're not supposed to be able to take EPUBs and pull them off and get them transcribed or whatever into a text file, but it absolutely is possible and there are niche contractors or communities that you can find on Reddit that will do that as a service for you.\r\n\r\n\r\nIt is more complicated, but it goes a lot faster than manually taking a book and sending it off to get destructively scanned and then waiting for the PDF to turn around and then taking the PDF and turning it into .txt.\r\n\r\n\r\nNikolas Hulewsky (29:55.75)\r\nYeah, okay. One thing I have done, again, this is not White Hat, is I have audiobooks of a lot of things. And so I've actually done the screen recording on the iPhone where I'll record the audio and then I'll transcribe it. So I don't think you can do that for like 10 hours of a book, but if there's key sections that I'm like, I really like the way it said this, that's what I'll do on that side. anyways, that was more of a curiosity.\r\n\r\n\r\nAmanda Orson (30:08.94)\r\nMmm.\r\n\r\n\r\nAmanda Orson (30:21.666)\r\nI think that's the most valuable part though.\r\n\r\n\r\nI think that you need to be able to, like the essence of things, you don't care so much about the theoretical or the pontification. You care about like, how did they practically do something? So yeah, do that all day long.\r\n\r\n\r\nNikolas Hulewsky (30:26.997)\r\nyeah, I totally agree.\r\n\r\n\r\nNikolas Hulewsky (30:39.993)\r\nI totally agree. Okay, so you upload all the transcripts and keep going.\r\n\r\n\r\nAmanda Orson (30:41.388)\r\nAll right, so let's.\r\n\r\n\r\nAmanda Orson (30:46.796)\r\nLet's come up with a scenario where we would want to get what Chris Jenner's opinion is or how Chris Voss would handle a negotiation.\r\n\r\n\r\nAmanda Orson (31:01.73)\r\nAnd bear in mind that this strategic context is not actually populated. So I didn't give it the specific information about our company, but let's think about a potential scenario for maybe a popular company right now that we would want to understand kind of what they think their feedback would be.\r\n\r\n\r\nNikolas Hulewsky (31:03.675)\r\nI have to know why you chose Kris Jenner.\r\n\r\n\r\nNikolas Hulewsky (31:20.283)\r\nopen AI.\r\n\r\n\r\nAmanda Orson (31:25.814)\r\nOkay, what about OpenAI?\r\n\r\n\r\nNikolas Hulewsky (31:29.531)\r\nIf I was opening, I would want to know how their users view them.\r\n\r\n\r\nWhat I'm seeing right now is like this shift from Golden Boy to Mark Zuckerberg. Like, there's a lot of distrust with Mark Zuckerberg. There's a lot of people who look at Mark Zuckerberg sideways. And I feel like Sam Altman burst onto the scene as a Golden Boy and now has done a number of things that people are like, that's weird. You know, like they don't fully trust him, especially in the tech community. They're very leery of him. But outside the tech community, I think people are just like getting this perception of, he's going to do anything he can.\r\n\r\n\r\nAmanda Orson (31:47.566)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (32:10.755)\r\nto win and if that's the case then what does that mean for AI and is he going to do things that are potentially dangerous? So if I was them and I was looking at the future I would want to know what is our brand perception? How do people view us in the market?\r\n\r\n\r\nAmanda Orson (32:31.694)\r\nOkay, so the scenario that we want to feed back and ironically we're putting this into Claude is that I am Sam Altman. The public perception of my personal brand may be, let's call it,\r\n\r\n\r\ndistracting from the growth of the professional brand.\r\n\r\n\r\nNikolas Hulewsky (32:55.747)\r\nMm-hmm. Yep.\r\n\r\n\r\nAmanda Orson (33:11.794)\r\nwhat are ways to think about repositioning or pivoting this brand or what are ways in which, you know, I could, if, if I was talking to say, Chris Jenner, what are ways in which she would think about repositioning?\r\n\r\n\r\nNikolas Hulewsky (33:26.415)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (33:35.557)\r\nMan, you've got my head spinning with uploading the transcripts. I think that's amazing. I'm definitely gonna start doing that.\r\n\r\n\r\nAmanda Orson (33:51.022)\r\nand let's see what it comes up with. I genuinely, this is all Greenfield. I have no idea. And we did not open up a lot of context here from Chris.\r\n\r\n\r\nNikolas Hulewsky (33:58.192)\r\nYeah.\r\n\r\n\r\nAmanda Orson (34:04.226)\r\nYou can see the anti-circuit fan.\r\n\r\n\r\nNikolas Hulewsky (34:04.421)\r\nSo is it actually,\r\n\r\n\r\nAmanda Orson (34:07.726)\r\nThis is.\r\n\r\n\r\nNikolas Hulewsky (34:07.909)\r\nDoes it actually go to just Chris Jenner's transcripts or is it going to all the transcripts?\r\n\r\n\r\nAmanda Orson (34:13.432)\r\nSo it's going through all, but I've specifically asked it to tap the stuff that we have uploaded from Chris. And.\r\n\r\n\r\nIt's actually pretty, it's pretty good. love the call out. Okay. So first of all, Claude opens up as Chris here, which I'm sure Chris would not approve of. So apologies in advance. Please do not sue us, Chris Jenner. Your personal brand isn't just distracting from open AI. is actively undermining the company's potential. The hard truth is that you've become the story instead of open AI being the story.\r\n\r\n\r\nNikolas Hulewsky (34:25.851)\r\nOkay, read some of it, I can't read it.\r\n\r\n\r\nAmanda Orson (34:51.904)\r\nEvery controversy, every controversy, every board drama, every cryptic tweet is bandwidth stolen from your company's mission. It's true. And then goes into some very tactical things that you should start fixing. One redirect the stop the spotlight. Stop being the face of every AI announcement. Like give some of that power back to your engineers and your researchers and actual innovation. That's fantastic. strategic vulnerability, the whole boy genius saves the world narrative, which is funny because it just.\r\n\r\n\r\nNikolas Hulewsky (35:02.128)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (35:10.011)\r\nMmm!\r\n\r\n\r\nAmanda Orson (35:20.536)\r\ntotally anticipated what you had said, but it did not have project context on, is undermining and it's played out. The third point, boring is profitable. Your Twitter needs to become ruthlessly focused on open AI's mission and progress. No philosophical musings, no industry hot takes, pure business value. Yeah. So I mean, it is really good. And a lot of this stuff.\r\n\r\n\r\nNikolas Hulewsky (35:38.714)\r\nDude.\r\n\r\n\r\nThe antisycophant is so good!\r\n\r\n\r\nAmanda Orson (35:46.89)\r\nSo some of this, the hard truth, and here's what we're fixing immediately. That's actually in the project instructions that I gave this particular project. But this is like the pithiest, lowest effort possible output from a completely like greenfield. This wasn't even a good prompt. We just totally shipped it, but this is what I mean. Like if you actually train it.\r\n\r\n\r\nNikolas Hulewsky (36:05.467)\r\nOkay, well the weird part, the weird part is she doesn't say you should make a sex tape. So I don't know if this is really Kris Jenner. I'm just kidding.\r\n\r\n\r\nAmanda Orson (36:14.294)\r\nNo, that's left out. Again, don't sue us.\r\n\r\n\r\nNikolas Hulewsky (36:20.315)\r\nSorry, Just kidding. I'm just kidding. Yeah, dude, this is so cool, Amanda. Wow. Because you're like, hey, I want to know what would Steve Jobs say to me or what would, I don't know, Andrew Carnegie or what would name your person? Dude, that is...\r\n\r\n\r\nAmanda Orson (36:33.513)\r\nExactly. Exactly. So actually on that note, I will give a shout out David Sentra at Founders Podcast has his own AI that has actually been trained on the transcripts from his own podcasts over many years now and the notes that he's taken from those individual books. So that is a great way to like go and tap and seek, I would say like, new discovery knowledge that you may not already know about.\r\n\r\n\r\nNikolas Hulewsky (36:55.589)\r\nVery cool.\r\n\r\n\r\nAmanda Orson (37:02.978)\r\nBut if you want to go deep on a specific brand or a situation or a character, like if you wanted to go really deep on, let's talk about innovators dilemma. Like go and look up every single time a company has hit the innovators dilemma and failed. Like I want to know everything about Kodak. I want to know everything about Blockbuster. I want to know everything about all of those companies and the strategic missteps that led them to that place.\r\n\r\n\r\nNikolas Hulewsky (37:24.859)\r\nMm.\r\n\r\n\r\nAmanda Orson (37:30.808)\r\nKodak famously had almost all of the digital photography patents, and it's still missed out on digital photography.\r\n\r\n\r\nNikolas Hulewsky (37:36.645)\r\nYeah, Kodak invented digital, they invented the digital camera in the 70s. Yeah.\r\n\r\n\r\nAmanda Orson (37:41.868)\r\nYeah, exactly. I'm going to stop sharing. yeah, this is where I think that you can take an idea or a person or a book or, a company and grab all of the information you can. And in my opinion, the most important thing is that it's first party as far as you can possibly get it first party and then use that and prompt that into your project knowledge or your custom GPT and then prompt away from there.\r\n\r\n\r\nNikolas Hulewsky (38:08.421)\r\nYeah, I really like that. All right, Amanda, people go find her at Galleon. You can find her on Twitter, anywhere else you want to point people.\r\n\r\n\r\nNikolas Hulewsky (38:21.219)\r\nNo. And we'll have links in the show notes to all the documents that you shared.\r\n\r\n\r\nAmanda Orson (38:24.056)\r\nThere.\r\n\r\n\r\nAmanda Orson (38:29.346)\r\nYou're gonna have to cut this because I got cut out and you're frozen now, but thank you for having me. And I'm happy to share all the prompts.\r\n\r\n\r\nNikolas Hulewsky (38:33.058)\r\nUgh.",
  "metadata": {
    "duration": "",
    "date": "2025-07-30",
    "platform_source": "Google Drive"
  }
}