{
  "episode_number": "76",
  "episode_title": "TOP PICK! The Reality of Buying Your First Business with Chandler Reed",
  "guest_name": "Chandler Reed",
  "business_name": "Get Green NOI",
  "transcript": "﻿Nik (00:00.824)\r\nChannel Reed, welcome to Niconomics, my friend.\r\n\r\n\r\nChandler Reed (00:04.254)\r\nNick, pleasure. Thanks for having me. I'm so excited and I've heard nothing but great things. And from what I've listened to, fantastic pod you got here. So I'm honored to be a part of\r\n\r\n\r\nNik (00:13.966)\r\nCool, I'm glad you got that 20. I slipped you to say nice things, so appreciate that. Tell me briefly, what is your business and how do you make\r\n\r\n\r\nChandler Reed (00:16.688)\r\nYeah, thank you for that\r\n\r\n\r\nChandler Reed (00:23.172)\r\nYes, so my business is Get Green NOI. can look us up, getgreennoi .com to help just paint a better picture of what we do. At our core, we are a project management and engineering and design firm. We come in across the country and install green energy projects for commercial real estate owners, primarily multifamily apartment communities. So that's our little niche. And yeah, how we make money.\r\n\r\n\r\nWe go in, complete a project, get paid, wash our hands, and go on to the next\r\n\r\n\r\nNik (00:56.12)\r\nSo you have a really cool story. think a lot of people know you because of the SMB boot camps that you put on that you're a part of. But this was your baby, right? This was the first business that you purchased. I think we talked about this before, like three and a half years ago when you first got into entrepreneurship. How did it happen? How did you find this business?\r\n\r\n\r\nChandler Reed (01:05.744)\r\nIt's a catalyst.\r\n\r\n\r\nChandler Reed (01:15.182)\r\nYeah. So back then I had no idea what SMB stood for, what ETA was. Certainly didn't read Buy Then Build or the HVR Guide, nor listen to acquiring mines. I'm just scrolling on Twitter one day and I see a tweet from my now business partner, Sam Rosati, who's not only an investor with me, but we've also gone out to do some other stuff after that. the tweet was effectively looking for someone with a little bit more hustle than capital.\r\n\r\n\r\nneeds to know multifamily real estate and needs to be in Tampa immediately or is already here. And I kind of read that and I'm like, I guess I paint some more color. Like I'm a 25 year old single dude, like knew I wanted to get into entrepreneurship one day, have no idea how it would materialize. But I saw a tweet that was basically, hey, I have a lot more hustle in capital right now. Two, needs to be in Tampa, Florida. Like I'm born and raised in Tampa. I'm already here. That's where I was living at the time.\r\n\r\n\r\nAnd then three, no, it multifamily real estate. That is what I had done up to that point before we bought the business. So I was the client of the business that I eventually bought who we serve as.\r\n\r\n\r\nNik (02:21.986)\r\nHmm. Did you know you wanted to be an entrepreneur? Like, were you looking at the time and Sam's tweet was just serendipitous or did you not know you wanted to be an entrepreneur? You were just kind of on Twitter trolling or scrolling and\r\n\r\n\r\nChandler Reed (02:34.958)\r\nNo, yeah, a little bit of trolling too. But no, so I knew I wanted to be an entrepreneur. I guess this is probably a pretty common thing with most entrepreneurs. Whenever medium they decide to go, like big problem with authority. I hated having like a boss or someone telling me what to do or needed to be somewhere at some time or else, you know, I wasn't getting paid. I didn't know what the medium would have been. Like at one point it was, hey, I'm going to do a startup. I'm going to create some\r\n\r\n\r\nNik (02:39.16)\r\nYeah.\r\n\r\n\r\nChandler Reed (03:04.624)\r\nor something like that. At some point it was like, hey, I'm going to be my own real estate, like do my own real estate development investment. At no point in my mind did I ever think buying a business was even number one a possibility for me or for folks that weren't, you know, called private equity firms or fortune 500 companies. I didn't know what searchers or searching was. Never crossed my mind once. Much less buying a business that installed light bulbs at apartment complexes for lack of a super term,\r\n\r\n\r\nNik (03:16.713)\r\nChandler Reed (03:32.88)\r\nThe opportunity fell in my lap and I kind of put it through like a regret or like some mental frameworks of like, am I going to be kicking myself in five years if I don't do this? And the answer was yes. Hence why I ended up doing\r\n\r\n\r\nNik (03:47.02)\r\nInteresting. me an idea. You say changing light bulbs. like that, that infers it's not anything crazy. How big is the business? How many employees do you have with offline revenue?\r\n\r\n\r\nChandler Reed (03:57.39)\r\nNo, by and for that, yes, I'll get into that, but we literally go out and change light bulbs at apartment complexes. No fun intended. Yeah. So yeah, so when we bought the business, so this is the more household and capital part. So the business, was a massive turnaround. When we talk about key employee risk, key man risk, there's literally one employee with some shared services from the seller's other business. So at the time, like basically in year one,\r\n\r\n\r\nThe year before was peak COVID and they weren't doing any projects. So was basically a shot in the dark. I think the income or the tax return statement on the last year. we bought it in 2021. I think the 2020 income or tax return was like maybe 6K or something like that. So not unfinanceable from a bank for no SBA bank in that. But so basically year one when we bought it,\r\n\r\n\r\nIf you annualize it, because we bought it in May of 2021 when you annualize it, basically we did like 1 .1 million bucks top line and about a hundred K or so call it and even. So when\r\n\r\n\r\nNik (05:06.744)\r\nOkay. And this year? What are you trending on this\r\n\r\n\r\nChandler Reed (05:10.736)\r\nYeah, this year we are going to do just north of 2 million bucks and about 200, 250 in EVTA. Yeah, but in that month, so those are two points and I guess if you look at it just as two points like this, it looks like a nice steady like, okay, they're doing all right. What we skipped over was in year two, which I thought it was because I was the next coming of Elon Musk, Bezos, the next business titan.\r\n\r\n\r\nNik (05:18.712)\r\nThat's awesome.\r\n\r\n\r\nChandler Reed (05:40.432)\r\nI thought I'm a rocket genius out here. Lo and behold, it was how intimately tied that we were to the multifamily value -add transaction market. We just had a sale up and we had a gust, force, hurricane, wind push us upwards. It wasn't me doing anything. It was just being in right place, right time. So anyways, in year one, did like, we'll just focus on top on because we do about 10 % even to margins. But year one, it was like 1 .1 million bucks.\r\n\r\n\r\nNik (05:40.619)\r\nmy\r\n\r\n\r\nNik (05:49.779)\r\nChandler Reed (06:09.584)\r\nYear two, which is 2022, we did just north of three million bucks. like basically a triple. I'm like, okay, this is sad. Click. We're to do this again next year. This is easy. Exactly. Exactly. Exactly. Then year three, we get a gut punch, I guess when the interest rates spiked in, September of 2022, that literally brought one of the hottest commercial real estate markets of all time to a freaking screeching hole.\r\n\r\n\r\nNik (06:19.34)\r\nI'm the man, start calling me Elon. Yeah.\r\n\r\n\r\nChandler Reed (06:39.036)\r\nAnd obviously we're downstream of that. No one's buying apartments, no one's fixing up the apartments.\r\n\r\n\r\nNik (06:45.014)\r\nYeah, so they just weren't spending CapEx at that point, which you're obviously reliant on them having to make that investment in order for your business to thrive.\r\n\r\n\r\nChandler Reed (06:52.528)\r\nExactly. Yep. 100 % project based business. We live and die by CapEx projects. So in 2023, we did about 1 .7 million bucks. not a 50 % cut, but a cut. all the overhead that I drummed up to get ready to go double again, basically had to let go that and restart from one square zero. with a lot of lessons learned. And I guess I would say the only silver lining\r\n\r\n\r\nThat down year, 2023, that big drop from three to 1 .7 was, going back to how we structured this deal, was basically a big old earn out. that we were basically the buyer of last resort. long story short, the silver lining of 2023 was we were actually able to pay off our seller financing. So we're officially, we're debt free on the business, which is great. So it helps you sleep a little bit better at night, but damn, was a tough road to get there.\r\n\r\n\r\nNik (07:41.902)\r\nSweet man.\r\n\r\n\r\nYeah.\r\n\r\n\r\nknow, it's interesting. What's interesting is like, if you look at a graph of the stock market, it's not just up into the right. It's jagged, right? It's like peaks, valleys, peaks, valleys, but the overall trend is that, you know, it's up into the right. I think people forget about the valleys. They want the peaks, but they forget about the valleys. And so like for you to go from, all right, 1 million year one, 3 million year two, I'm the frickin man.\r\n\r\n\r\nChandler Reed (07:56.506)\r\nYeah.\r\n\r\n\r\nNik (08:16.974)\r\n1 .8 million year three. my gosh, I've screwed up 2 .1 million. You know, this year, I think you learned probably learned a ton of lessons. It was like your own MBA course over that period of\r\n\r\n\r\nChandler Reed (08:26.756)\r\nYeah, I'm so happy. Yeah, exactly. So I mean, I'm upset it happened because I had to let a lot of good people go that I thought we had really something special building there. Also was losing sleep. It was an incredibly stressful time for me. But in hindsight, the fact that I was able to see a big upswing and like, wow, this is what this feels like. And then also getting punched in the face and getting some blow of lows.\r\n\r\n\r\nall in like a two, three year stretch. I'm like, okay, like it just made me so much better of an operator. You know, I still have a lot to learn, a lot to improve upon, but getting humbled and having some early success all in that short span of kind of getting started in entrepreneurship. you know, I think it's helped me get a good head on my shoulders.\r\n\r\n\r\nNik (09:17.784)\r\nI love that. I'll ask you questions later what you learned over the last few years. But I'm curious, you talked about purchasing this business. What's interesting to me is like, this is the quintessential searcher business. If you look at kind of like the profile, it's not sexy. It's a sweaty business. It's not tech reliant. Like you have to actually go out, you're providing physical services and goods.\r\n\r\n\r\nChandler Reed (09:34.992)\r\nYeah. Mm -hmm.\r\n\r\n\r\nNik (09:46.988)\r\nI don't know about the competitive moat. Like, I don't know like what the switching costs are like or anything like that. But it's got that like long term type of a thesis. Did you just fall into that or was that already your thesis?\r\n\r\n\r\nChandler Reed (10:00.686)\r\nNo, I swear. just fell in it. So my favorite thing is like the bell curve meme where it's like the guy with the Jedi hood on and then there's like a dummy on the other side and then all the middle people and they have like the longest explanation for it and the smart people are like buy good businesses and the dumb people are like buy good businesses. You can consider me like the dumb person on that bell curve or on that chart. I just thought like, hey, I know there's lights at apartment buildings.\r\n\r\n\r\nNik (10:02.828)\r\nOkay, all right, fair.\r\n\r\n\r\nNik (10:17.387)\r\nYeah.\r\n\r\n\r\nChandler Reed (10:30.254)\r\nthey aren't going anywhere. They are going to need to get replaced every five years. I knew that from being in the industry. And then also kind of having the foresight and I don't know if we talked much about this, we can get into it later. But so the business that we bought was, you know, this classic like a need lighting business, like a big physical real world need business. But I also saw where the puck was headed as far as like the green energy and all that stuff. So as of today, we're also doing\r\n\r\n\r\nEV charging stations in saws, low flow plumbing, water fixture in saws, pretty much anything in like this green energy bucket you can think of.\r\n\r\n\r\nNik (11:06.702)\r\nYou mentioned it earlier, but it sounds like the way you were able to structure the allowed you flexibility during that year where you had sales kind of crash. Talk to me about the purchase process and what did the structure of that deal look\r\n\r\n\r\nChandler Reed (11:13.262)\r\nYes.\r\n\r\n\r\nChandler Reed (11:21.584)\r\nYeah, so the structure looked like a 25 % cash down, 75 % earn out. The earn out basically had a minimum per quarter or it was basically the greater of this minimum, this floor, or 33 % of gross profit basically. So we knew at the end of the day, like, hey, here's our minimum, not that we have to hit, like as long as we can do this, we can ask for, we can get work to do this.\r\n\r\n\r\nNik (11:49.806)\r\nHow did you come to the price of the business? sounds like it was a distressed business so you couldn't necessarily value it off of a multiple of eboda. Did you guys just go back and forth and say, think that the customer asset value is this? And he said, no, I think it's this. And you just met in middle? how did you actually value\r\n\r\n\r\nChandler Reed (12:05.84)\r\nSo it was brokered. A lot of strategic had passed on it. Listing it during COVID certainly didn't help. So to be completely honest with you, we had a whisper price or we had an asking price. And luckily it was from an in -town broker of who one of the associates is one of my really good friends. And I basically caught wind of like, hey, y 'all are literally the last buyer. It's either you or anyone. So I'm like, hey guys, he wants a million. I know we're the last person. He's about.\r\n\r\n\r\nready to throw in the towel and just shut it down. Let's offer him 400K. Just shot in the dark. Let's slow ball his ass and let's see if it works. Long story short, we ended up coming in at right around 625K. Yeah, I think it was 625K. So at a pretty significant discount to what at least what we thought the business would\r\n\r\n\r\nNik (12:55.064)\r\nDude, that's rad.\r\n\r\n\r\nChandler Reed (12:59.588)\r\nAnd there's a way that those brokers came to that million dollar based on, you know, a bunch of SIM and adjustments and add backs and normalizations and stuff. So who knows,\r\n\r\n\r\nNik (13:07.744)\r\nIt's all just it's all just like, lick your finger, hold it up to the wind. I think it's worth x y many times. It's that. So walk me through the business economics, you are going out, you're doing you're changing light bulbs. Yes, but sounds like you're doing EV projects. Now I thought I heard you say something about water efficient. Okay, so you're providing those. Are you just in Tampa? Are you like\r\n\r\n\r\nChandler Reed (13:27.15)\r\nYeah, water efficiency. like low flow toilets, shower heads, the\r\n\r\n\r\nChandler Reed (13:36.109)\r\nMmm,\r\n\r\n\r\nNik (13:36.456)\r\nHave you expanded on the tap? What does it look\r\n\r\n\r\nChandler Reed (13:39.226)\r\nSo we're had coincidentally the business was just headquartered here in Tampa. actually the most of the work we do is outside of Tampa. So we truly work coast to coast. We sub out all of our labor. Yep. that, yeah.\r\n\r\n\r\nNik (13:50.638)\r\nThat's what I was going to ask. So are you just building relationships with like national multifamily owners?\r\n\r\n\r\nChandler Reed (13:57.462)\r\nExactly. So I know I'm in with the big institutional property management groups. You get in with their kind of like construction management folks. I oversee different regions. They send you work. And then we're also in on the ownership side or on the acquisition side of the groups that are buying these apartments. They will come bring us in like right either when they're during due diligence or right after they close to come in and do the work that we do right after.\r\n\r\n\r\nNik (14:23.5)\r\nOkay, you're, and the work that you do is project based. You're not doing any recurring services where, I can't imagine, okay.\r\n\r\n\r\nChandler Reed (14:29.782)\r\nNo, no. So I guess I'll help paint you a picture. like, hey, we're working on a project right now in Dallas, Texas, where a group that buys value at apartment building says, Hey Chandler, we got a new acquisition here. We want to do the lighting upgrades. We want to do water efficiency upgrades. We want to get EV charging stations and salt. Can you come out here and give us a bit? So we send someone, whether that is us in house, flying from Tampa, or you know, we have some guys that work in Dallas or work in Texas.\r\n\r\n\r\nhaving them drive up. Conversely, we can also get some of our trusted subcontractors to go out on site to do our initial assessment. If you will, that's basically the data gathering to put together so we can make a bid. Exactly. So whether it's our own team or one of the subs that can do it, we'll basically get on site. God.\r\n\r\n\r\nNik (15:11.394)\r\nYeah, to bed.\r\n\r\n\r\nNik (15:18.648)\r\nThat's... No, I cut you off. Keep going.\r\n\r\n\r\nChandler Reed (15:23.344)\r\nWe will go get on site, collect all the data that we need, get it in our kind of big design software, put all the sexy ROIs, energy saving projections, revenue increases from it, throw a nice really low cap rate on it because yeah, maybe that value add is maybe a four these days. I don't know, most likely not. But anyways, we try to paint like a compelling financial story to completing these projects because\r\n\r\n\r\nThat's a cool thing about ours, like their necessities and they also is pretty significant utility and energy savings and the like to do in our projects.\r\n\r\n\r\nNik (15:56.502)\r\nYeah, I was gonna ask. So like, there's probably incentives to do it because there's savings on the utility side, but there's, I'm guessing there's also either state and federal incentives to install those things like tax incentives or credits rebates. Yeah.\r\n\r\n\r\nChandler Reed (16:06.7)\r\nyeah, rebates. Yep, so it's primarily through the utility providers. And it's simple as looking up on their website. You can also use softwares to figure out who, know, so to figure out who the utility providers are, but go on any utility provider. I'll use Duke Energy, because that's a big one. We do a lot of work in the Carolinas. Duke Energy, go right on, whether it's apartments, multifamily, industrial, retail, whatever, they have a program for it.\r\n\r\n\r\nand it'll spell out what the rebate is. So that's cool too and what we include in our services. Hey, by the way, the project's gonna be 100K. You're gonna get 200 or you're gonna get 20K of energy savings. Duke Energy is gonna pay you 15K for doing this project. And all the while, hey, you can also apply for this like tax rebate. Here's how your accountants can do it. So we'll come in and team\r\n\r\n\r\nNik (16:55.01)\r\nYeah, it's similar. It's not like we we have a true trimming business in Dallas. And we have one guy who goes out and does the bids essentially like we get leads that come in, he goes out meets with the customer does the bid, the estimate and then we sub it out to people. So it's like a very kind of similar thing. I'm curious though, like, is that is that the best funnel to sort of find people is to find those energy company utility companies or states that have the best rebates?\r\n\r\n\r\nunderstand what they are and then cold contact into these multifamily properties or are you are you doing any of that or are just relying on that?\r\n\r\n\r\nChandler Reed (17:30.192)\r\nYes, so that's a great, yeah. So what I'm doing right now with this new product that we actually just became a preferred distributor and installer of, it's called Occamizer. So without boring too much of your listeners or you yourself, basically, it's literally like all this thing is, so instead of like, think of like, you know, there's like the old toilets that were like five gallons per flush, like incredibly inefficient. The new ones today are call it like one to 1 .6 or\r\n\r\n\r\nNik (17:45.058)\r\nThe aqua -izer.\r\n\r\n\r\nChandler Reed (17:59.652)\r\nthe low flow flushing toilets. What this thing, Occamizer does is it goes right into any toilet tank, converts any toilet to one gallon per flush without reducing the flush velocity. It stops all toilet leaks and running toilets. It's like literally as close to a silver bullet as I can think of in my time in this space. So we basically know that this not only are the ROIs like a no brainer itself, but in Tampa, the Tampa Bay waterwise\r\n\r\n\r\nwill give owners 75 bucks to install one of these things, which is basically like half the cost of it. So now I'm going, I'm on a cold call campaign right now. I'm ripping cold emails. I just got this new software where I can look up hotel and whatever commercial real estate owner directly, hammering these folks saying, hey, I can reduce your hotel's water and sewer expenses by 50 % before the year ends. the city of Tampa is gonna pay for half the project.\r\n\r\n\r\nNik (18:35.95)\r\nCheers.\r\n\r\n\r\nChandler Reed (18:57.434)\r\nGive me your water bills, I'll run you a free evaluation. We'll get this thing kicked off now based to the effect of that. So we're about to go ramp with\r\n\r\n\r\nNik (19:03.096)\r\nDude, that's awesome. Do you have any idea what your customer acquisition cost is right\r\n\r\n\r\nChandler Reed (19:08.696)\r\nNo, I'm in the early phases of that right now. Like literally as far as like, just got an SDR set\r\n\r\n\r\nNik (19:13.398)\r\nIt just seems\r\n\r\n\r\nIt just feels like there's so much opportunity if you're like, okay, they're gonna pay me $75. Cool, I at least know I can spend $75 per customer, right? Maybe that's physical letters, texting, flyers, like whatever it is. I don't know that you're necessarily going to Facebook and Google and those types of places, but is there an average project size that you're getting? Is it like $10 ,000 per project or is it too variable to even?\r\n\r\n\r\nChandler Reed (19:25.308)\r\nExactly.\r\n\r\n\r\nChandler Reed (19:41.167)\r\nYes, no. So we do have an average. I would say like it kind of differs across our different project lines, if you will. I would say across all of our project lines, Our average project size is around 55 grand, 55K. Yeah, so we're doing work on 200, 300 unit apartment complexes. We're doing work on similar size hotels.\r\n\r\n\r\nNik (20:11.63)\r\nAnd so that's probably part of the reason why your margins, your net margins are 10 % because even though you're charging 55 grand, you've got to sub it out. And so if that was all in -house, you'd probably have a lot higher margins, but it's not. You're almost a lead gen business for local contractors to go and fulfill.\r\n\r\n\r\nChandler Reed (20:11.908)\r\nBut I guess like, okay.\r\n\r\n\r\nChandler Reed (20:21.188)\r\nYo,\r\n\r\n\r\nChandler Reed (20:26.359)\r\nExactly. Yeah.\r\n\r\n\r\nChandler Reed (20:33.05)\r\nYep, exactly. Yeah, but we got also what you know, we'll get in the scope and everything. But I don't know. I your mind's racing right now. So if you if you have any other if you have any other ways to help me make more money, I'm game. Let me know.\r\n\r\n\r\nNik (20:47.214)\r\ndude, I just think that there's so much opportunity in this space for a couple of reasons. There's like some big macro tail ends that I think are helping you, between 2008 and even today, because of the great financial crisis, they just stopped building houses stopped, right? So we're historically underbuilt. We've done a little bit better through COVID, but we're still underbuilt relative to where we should be. The age of houses are aging.\r\n\r\n\r\nAnd this isn't just homes, this is apartments, condos, any dwelling setting. And so you've got a lot of people who are going and remodeling, they're upgrading, like there's this capex expenses that are happening at a faster clip. on the wall, so that's like a macro trend that I think is just totally pushing your industry. And then, and then on top of that, you get to also take advantage of the home services market,\r\n\r\n\r\nmy mind races because if you've got all these relationships with multifamily owners, and you're just doing the upgrading the light bulbs, whatever you want to call it, right? Well, what else could you be doing for them? There's so many other things that are done from like a home services perspective for these multifamily units. tree trimming, plumbing, electrician, like all these other things. And again, because you're already built like a lead gen organization,\r\n\r\n\r\nChandler Reed (22:13.338)\r\nPainting,\r\n\r\n\r\nNik (22:16.206)\r\nYou don't have to do the fulfillment. You could just be generating these leads and selling them to the local contractors that you build a network with. Like you could start in Dallas and some of these other areas where you have some concentration and build out a good network or for out to them. And then it's just a numbers game and you're getting five to 10 % net margins for not doing and fulfilling any of the work. I just think it's, yeah, I think it's really, really cool what you got going\r\n\r\n\r\nChandler Reed (22:38.16)\r\nYeah, thank you. you know, we're always trying to get better and grow. So that's my big objective this year is like, you know, I would say the running joke was, the running joke in ETA is always kind of like, yeah, you never really want to buy yourself a job. But I bought myself like 10 jobs, but that's what I wanted to do. I wanted to get my hands dirty. I was literally a financial analyst before buying this. And I'm like, yeah, I'm going to do invoicing. Yeah, I'm going to do insurance. Yeah, I'm going to sell. Yeah, I'm going to organize. Yeah.\r\n\r\n\r\nNik (23:03.086)\r\nYou were 25, right? Dude.\r\n\r\n\r\nChandler Reed (23:07.12)\r\nI was literally running like Excel Argus models before I hopped into the driver's seat\r\n\r\n\r\nNik (23:09.966)\r\nYeah. I mean, was, I was 30. How old was I? 32. 32 when I bought my first business. but I had to get a lot of experience on somebody else's dime, right? Like I just, needed that. You, I mean, this was a situation and I tell people to do this a lot. You minimize your down, downside risk by having the seller note and, and, basically only putting 25 % down, which was incredible, but you, you, you mitigated the downside risk. So even if things went terribly wrong,\r\n\r\n\r\nyou weren't losing your house because you signed an SBA note that you couldn't meet. To finish up on the business though, here's my last question. What did you learn? Like what were the biggest lessons that you learned over the last few years from from the buy process to the peak Valley process to now looking to grow and scale\r\n\r\n\r\nChandler Reed (23:46.917)\r\nYeah.\r\n\r\n\r\nChandler Reed (24:00.516)\r\nYeah, I think that by, if you know, think learning how to sell is probably the most important skill that you can have as a business owner, or maybe not even selling. I'm not like getting on the phone with someone, but learning how to market, learning how to generate leads, I guess that is probably the better term. If you can generate leads, that is a business or that is a skillset that you can apply to literally any single business. Obviously there's going to be nuances between the different businesses, right? But if you can go, whether that\r\n\r\n\r\nHey, you've just identified this new area or this new problem that needs to be solved. Let me sell, let me set, or let me go build a business that can go services gap that I recognize and then drive leads through it. What, or that, Hey, I'm going to buy this existing mouse strap, right? Or this existing business that has a great fulfillment that has product market fit already. Let me go drive leads through that. Like you will never go broke. you will never be broke ever if you can learn that skill. And that's something candidly I had.\r\n\r\n\r\nzero idea how to do and it's something I'm trying to get better at every single day.\r\n\r\n\r\nNik (25:02.158)\r\nDo you think that was a hindrance for you when you saw the decline in 2023 was the year or?\r\n\r\n\r\nChandler Reed (25:10.862)\r\nI think it certainly could have been, but when I tell you like no one at all was spending any money and there's no transactions getting done, I was banging my head. was getting discounts. was going like anything and everything that you can think of. was the answer was, hey, we're putting this project the next year or hey, you know, we got to wait and see where the market shakes out. It almost felt\r\n\r\n\r\nNik (25:38.558)\r\nSo like that, want to like drill down on that, right? Because there's almost no way you could have predicted that was going to\r\n\r\n\r\nBut I'm sure, like what lesson did you learn from that experience that you'll take with you into the future, into every other deal that you'll do? Is there anything that came out of that that you feel like, x, y, is so important?\r\n\r\n\r\nChandler Reed (26:04.496)\r\nThat is, yeah, recurring revenue. I'm done with project -based businesses, I'll tell you that. Fuck that shit, sorry, it's part of my friends. It could be project -based if your margins are like 50 plus percent. And it's like, okay, it's super lucrative, but hey, if the margins are skinny to begin with, it's in a tough industry. It's not like, you know, I'm sending a PDF to someone or doing an Excel model. Like I'm sending,\r\n\r\n\r\nNik (26:09.398)\r\nOkay.\r\n\r\n\r\nChandler Reed (26:34.018)\r\na crew of blue collar dudes either in trucks, flying somewhere, whatever have you to go do physical work on an apartment building with residents who are always kind of up your butt, hey, what are you doing? All this stuff, complaining. And then I hear the end of it and every single bit of it. Or your guys are out there smoking cigarettes on site and the client's like, hey, you guys can't be smoking cigarettes on site, not in my apartment.\r\n\r\n\r\nNik (26:58.008)\r\nThat I think that's a really, really interesting observation because you could have said, well, you could have gone into it and said, well, we're to buy the business rates are historically low. The feds printed a lot of money. They'll probably have to raise rates in order to tamp down inflation. Therefore, if and when that happens, I need to have a diversified revenue stream, right? You could have done that analysis. Honestly, nobody was doing that analysis, but the better analysis moving forward is\r\n\r\n\r\nI just know, if a business is all project based, I need to diversify my revenue type. And so I need like, me get into some recurring revenue, because I know that that's a risk.\r\n\r\n\r\nChandler Reed (27:32.88)\r\nExactly.\r\n\r\n\r\nChandler Reed (27:39.104)\r\nExactly. Yes. Or on the flip side too is like, you know, with the lighting projects and the EV charging projects, which was like the bulk of the projects we were doing that year, that's like truly like, I would say it's cyclical, right? Like that comes and goes with like the flow of money coming through the system. But this, that product, the Occamizer I was just telling you about, which is again, product based or project based.\r\n\r\n\r\nbusiness model coming in and sawing it, boom. That thing, given where the ROIs are and how compelling the financial incentive is there, I think that will sell come hell or high water. So that is a point though, to your point of like, if this is gonna be up and down, whether it's revenue, whether it's project -based or recurring, and we have this that's just project -based, but it's gonna be steady through all times, like to your point.\r\n\r\n\r\nNik (28:22.774)\r\nYeah.\r\n\r\n\r\nChandler Reed (28:36.472)\r\nThat was a long -winded way of saying, like, yes, I agree. But it doesn't have to be recurring, even though that's the dream.\r\n\r\n\r\nNik (28:42.05)\r\nHave you added any recurring type of revenue streams to the business? Or thought about it might be?\r\n\r\n\r\nChandler Reed (28:47.882)\r\nNo, and I've tried to think about it. would be typically in our world, what that looks like is like master service agreements of like, hey, we're going to make sure your lighting is in place. But number one, like I don't have any in -house people to go keep those, you know, and it would have to be me doing a second agreement with a subcontractor, which could be done. I don't know. That sounds to me like, I don't know if that juice is worth that squeeze. But other things that we have.\r\n\r\n\r\nthought about primarily number one would be the EV charging stations like doing some like shared services agreement where like, we'll split the cost of this EV charging station with you and then we'll split the revenue that the machine spits off for the next whatever 10 years until we get paid back something like that. That's something that we're, God.\r\n\r\n\r\nNik (29:35.054)\r\nWell, that's what I was going to ask with the EV charging stations is like the light bulbs, those are fairly easy to change, right? But the, but the maintenance of the EV charging stations, what happens when one breaks or what happens when they want to add another one or what, like there could be something there with managing the, the EV charging stations and then working with local vendors to provide support or something like\r\n\r\n\r\nChandler Reed (29:42.936)\r\nIt's a commodity. Yeah, it's a commodity business.\r\n\r\n\r\nChandler Reed (29:59.343)\r\nYeah.\r\n\r\n\r\nExactly, you could think of that as like an EV charging as a service almost like, hey, we'll come in, we'll do all of it. You we'll either, and you basically leave some machines from us. I guess that's another way of thinking of it. And we'll do like a rev share that's more tilted towards my favorite. Again, it just depends on the client. A lot of the clients like, hey, I know I'm losing money on this in the long run. I just want to pay you to install it for me upfront. I'll take care of it in the long run. Like, okay, great. We can do that too.\r\n\r\n\r\nSo there's a billion different ways to slice a cat, right? It just depends on what they own.\r\n\r\n\r\nNik (30:34.496)\r\nMy favorite thing is the fact that you've paid the business off. You don't have any debt on the business already. It's amazing.\r\n\r\n\r\nChandler Reed (30:38.512)\r\nYeah, I mean, we have a line of credit, obviously that is for a construction business. We do try to get as big of a deposit as we can upfront for our projects, but we're a small fish in a big pond. We're doing work for multi -billion dollar businesses. So oftentimes you're like, hey guys, can I get that 50 % deposit? They're like, you're lucky we're giving you 20%. I'm like, all right, thanks. Cool, we'll do\r\n\r\n\r\nNik (31:05.304)\r\nI just, I love this business as a wedge into the relationship with those large billion dollar multifamily, you know, real estate companies where once you're in any of relationship, maybe you start expanding your product offerings. But I have some multi, I have some rapid fire questions for you. Are ready? All right. What do you love about this\r\n\r\n\r\nChandler Reed (31:12.666)\r\nYeah.\r\n\r\n\r\nChandler Reed (31:17.873)\r\nExactly. Yeah, please, let's let it rip.\r\n\r\n\r\nChandler Reed (31:26.928)\r\nHow little overhead there is, how small my team can be.\r\n\r\n\r\nNik (31:31.438)\r\nCool. All right, what do you hate about\r\n\r\n\r\nChandler Reed (31:37.134)\r\nthe how hard it is for how little the margin is. It's a really high, if at scale like this has to be a super high volume business. I'm trying to get it. I'm trying to get it\r\n\r\n\r\nNik (31:49.484)\r\nWhat industry or business model are you the most jealous of right\r\n\r\n\r\nChandler Reed (31:53.864)\r\nprobably sass, anything, anything that is like, you know, sass is beautiful. You're pretty much like selling air almost. some gel stuff.\r\n\r\n\r\nNik (32:01.495)\r\nYeah, it's Very true.\r\n\r\n\r\nIf you have two hours in your day, you don't have any personal or family responsibilities and you don't have any work responsibilities, what are you obsessed with right now? What are you spending your time\r\n\r\n\r\nChandler Reed (32:17.488)\r\nGolf. Big answer for me is golf. Maybe not the full full hours, at least maybe like an hour on the range session. Golf and then paid ads, media buying. That's what I'm kind of like infatuated or getting head over heels in right now for the bootcamp stuff.\r\n\r\n\r\nNik (32:31.992)\r\nYeah, yeah, Yeah, love it. All right, last question. What advice would you give to your pre -entrepreneurial self?\r\n\r\n\r\nChandler Reed (32:42.512)\r\nI don't think nothing is going to pan out how you expect it to be. So no need to get worried about stuff and nothing will be as nothing will be as bad as you think it's going to be. So don't sweat the small stuff. Just I guess just keep level headed. Have a good attitude. We prepared the role of the punches when they come because I will come and other than that you'll be fine and happy.\r\n\r\n\r\nNik (33:04.494)\r\nThat's a great perspective. Chandler, this has been awesome. Where can people come find you? Where's the best place?\r\n\r\n\r\nChandler Reed (33:11.043)\r\nYeah, Nick, this has been awesome for me too. You're a great podcast host and a pleasure again to be on here. But where they can find me is Twitter is or X, excuse me, is the best place. It's going to be at Chandler Reed SMB. I'm also on LinkedIn. You can find me there. You're not going to see my profile on it and I'll be full get green NOI because that's what my clients come to expect of me. But X is where I have some fun and drop some knowledge on the SMB world.\r\n\r\n\r\nNik (33:33.624)\r\nLove\r\n\r\n\r\nNik (33:39.63)\r\nWell, hope to see you around. was awesome. We'll talk\r\n\r\n\r\nChandler Reed (33:43.258)\r\nYes, sir. I appreciate you, Nick. Thank you so much.\r\n\r\n\r\nNik (33:44.792)\r\nAll right.",
  "metadata": {
    "duration": "",
    "date": "2024-10-28",
    "platform_source": "Google Drive"
  }
}