{
  "episode_number": "151",
  "episode_title": "AI SERIES: 5 - How Non-Technical Entrepreneurs Can Get Started with AI with Matthew Mellinger",
  "guest_name": "Matthew Mellinger",
  "business_name": "Local SEO Partners, SEO Gits, Cookville Buzz",
  "transcript": "﻿Nikolas Hulewsky (00:01.325)\r\nMatt, I'm excited to learn about AI today. Tell the people really quickly. What do do?\r\n\r\n\r\nMatt (00:08.322)\r\nYeah, so I have three main brands right now. So I'm trying not to be as wide, but I have a local SEO agency called Local SEO Partners. I have a software company that is built for SEO Analytics called SEO Gits. And then we kind of have a small side project called the Cookville Buzz, which is a local newsletter. So those are the three kind of main brands we're running right now.\r\n\r\n\r\nNikolas Hulewsky (00:32.463)\r\nSo you're a digital entrepreneur who has a marketing and sales orientation. You've got SEO tools and then you've got a local newsletter. Awesome. Where's the local newsletter?\r\n\r\n\r\nMatt (00:43.33)\r\nYup. Cookville, middle Tennessee. So it's hometown. Well, not original hometown, but where I'm living now, so.\r\n\r\n\r\nNikolas Hulewsky (00:47.011)\r\nMiddleton City. Okay.\r\n\r\n\r\nI love it. This is the question I always ask people when we get started. Tell me, what models do you use currently and what do you use them for?\r\n\r\n\r\nMatt (01:01.27)\r\nYeah, so I like Claude. Claude just came out with the 3.7.\r\n\r\n\r\nMost of my goals is to use it for copywriting or messaging, marketing, more text heavy stuff. And that's been really helpful. I prefer that over the other models. I've tried Grok. I've tried ChatGBT. I think ChatGBT is a better model for analytics. If I'm throwing in a sheet with a bunch of stuff and saying, can you go find this for me, I've enjoyed ChatGBT more for that. I'm using Mid Journey for image genera-\r\n\r\n\r\nNikolas Hulewsky (01:35.631)\r\nAnd when you say throw a sheet in, you talking about like an Excel doc or Google sheet? Or are you talking about a PDF? Let's see how this would file, okay.\r\n\r\n\r\nMatt (01:40.618)\r\nYeah, yeah, CSV file. Yeah, CSV file. I've actually, for PDFs, I still use Claude, as long as it's like.\r\n\r\n\r\nAgain, I want you to pull something from this. If it's numbers related, I go to ChatGBT. I've seen a lot of it. Now, I had issues with Claude on 3.5 with analytical stuff. It just was wrong a lot of times on numbers. Like, what percent is this of this many people? It just was wrong. So I was using ChatGBT more. I haven't tried it on 3.7. I might go back and try that. But again, they're both $20 a month. keep both of them. They have specific use cases. And yeah.\r\n\r\n\r\nNikolas Hulewsky (02:01.23)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (02:19.054)\r\nOkay, so Claude and ChachiBT are the two models you use. You don't use any of the other models?\r\n\r\n\r\nMatt (02:24.334)\r\nNope, I've played with Grok, not a fan of it personally. It's coming out better but I'm not a fan of it and then I haven't really played with any others.\r\n\r\n\r\nNikolas Hulewsky (02:32.91)\r\nOkay, so real quick, why are you not a fan of Croc?\r\n\r\n\r\nMatt (02:36.75)\r\nSo I've tried the Deep Thinking and I've tried some of the other stuff and specifically on the use cases that I've needed, which has been for copywriting messaging marketing and it may just be what I'm used to, Claude has seemed to outperform it. Just even using the Deep Think and the higher advanced models, it just doesn't output, it doesn't understand the concepts of like story brand marketing, messaging, things like that better than Claude has for me, in my experience.\r\n\r\n\r\nNikolas Hulewsky (03:06.262)\r\nInteresting. So you have an SEO agency and you're working on copywriting? Like you guys are doing copywriting for clients?\r\n\r\n\r\nMatt (03:12.876)\r\nYes. No. the, well, so the copywriting, like I'm in charge of marketing growth for the SaaS company. For my own company.\r\n\r\n\r\nNikolas Hulewsky (03:20.974)\r\nfor your own company.\r\n\r\n\r\nMatt (03:24.332)\r\nWe also have copywriting needed for our local SEO agency where like we need a landing page, right? So how do we write this so that it sells these services? We specialize in like home construction services. So like, how are we making sure that you are not focused on what we do, but set like, I'm a big proponent of the story brand messaging where like you want to be talking to the customer about the customer, about their pain points, their transformation, all that stuff. And so a lot of times when you ask, hey, we're a home remodeling company, right? A landing page.\r\n\r\n\r\nNikolas Hulewsky (03:29.966)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (03:36.536)\r\nOkay.\r\n\r\n\r\nMatt (03:54.228)\r\nlike we do this, this, this, this instead of saying here's the benefits, this is why you want to choose us, this is like the journey, things like that. So that's the copyrighting portion.\r\n\r\n\r\nNikolas Hulewsky (04:02.67)\r\nOkay, and the Claude has been great and Sonnet 3.7 has been just a great update as well for it.\r\n\r\n\r\nMatt (04:10.188)\r\nYeah, it's really been nice. It understands it very well.\r\n\r\n\r\nNikolas Hulewsky (04:14.03)\r\nCool. All right. So show me what you're using it for currently. I'm curious to see some of your workflows. What do you got for us today?\r\n\r\n\r\nMatt (04:22.604)\r\nYeah, so let me pull up the screen here. yeah. So yeah, this is one of our sites, Sioux Falls Home Remodeling. As we're going through this, this is, a very simple site. But one of the things that hopefully won't stand out to you is that all of these images are AI. Not a single image here is real.\r\n\r\n\r\nNikolas Hulewsky (04:27.31)\r\nthe infinity mirror.\r\n\r\n\r\nNikolas Hulewsky (04:51.405)\r\nReally?\r\n\r\n\r\nMatt (04:53.068)\r\nYeah, so.\r\n\r\n\r\nWe are using Mid Journey a lot for all of our AIs. A lot of times with new brand, they don't have the images yet. Now, if we have an established brand, they'll have a media folder, and we can do that. But say we want to throw up a site for a new brand, a new company, and they don't have any quality media, we will start with AI and then slowly over time start replacing it with actual content, actual media.\r\n\r\n\r\nNikolas Hulewsky (05:22.222)\r\nSo these pictures that I'm looking at, none of them were taken by you. They're all AI generated in mid-journey.\r\n\r\n\r\nMatt (05:29.386)\r\nAll, yep, all A-generated, yep.\r\n\r\n\r\nNikolas Hulewsky (05:31.832)\r\nCan you would you be able to go into mid journey right now and find any of the prompts that and there's one of a homeowner talking to a contractor. It's amazing. Okay.\r\n\r\n\r\nMatt (05:40.396)\r\nYep, and I mean if we zoom in you might be this thumb here is a little like the nail like but again from from from scanning and and There's some prompting I'm I'd be curious again. I this is kind of on the fly. I'd be Siri. Yeah. Yeah. Here we go so We play with it all kinds of different stuff. So like right here clean pressure washing wash\r\n\r\n\r\nNikolas Hulewsky (05:44.686)\r\nYeah, yeah, yeah, yeah. Little wonky.\r\n\r\n\r\nNikolas Hulewsky (05:57.87)\r\nBut I was just curious if you had an old one that you could, ooh, wow.\r\n\r\n\r\nNikolas Hulewsky (06:07.096)\r\nclick on the one right above the pressure washer.\r\n\r\n\r\nMatt (06:10.274)\r\nThis one? Yeah. All right.\r\n\r\n\r\nNikolas Hulewsky (06:13.336)\r\nBut is this one you created?\r\n\r\n\r\nMatt (06:15.938)\r\nYep, so this is our prompt over here.\r\n\r\n\r\nNikolas Hulewsky (06:16.814)\r\nOkay. So this is a beautiful looks like one story, maybe two story brick home. It's got a nice yard in front of it. It's a sunny day. I would never have said that this was Yeah, it's got the wash up.\r\n\r\n\r\nMatt (06:27.158)\r\nIt's even kind of got the wash. Yeah, it's got like the washed out clouds. So.\r\n\r\n\r\nNikolas Hulewsky (06:33.614)\r\nI would have never said, this is AI generated. And your prop for this was professional pressure washing of a beautiful home exterior in Cookville, Tennessee, clean driveway and siding, dramatic transformation visible, bright sunlight highlighting the clean surfaces, high resolution photography style. Dang.\r\n\r\n\r\nWere you happy with that output?\r\n\r\n\r\nMatt (06:56.514)\r\nYeah, mean, again, it's not a permanent solution. I like using AI as a tool to enhance manual work. I have not gotten to the full autonomous AI agent. Everything is being done. I'm using AI as a boost or a tool to do things better. So we can get websites up faster.\r\n\r\n\r\nNikolas Hulewsky (07:16.92)\r\nWell, yeah, generally speaking, if you go back to your website, all the pictures that are on the website, how would you have gotten those pictures in the past?\r\n\r\n\r\nMatt (07:27.79)\r\nProbably stock, like you go and find cheap stock photos and you have to pay for them. But the thing with Google is that if it's a stock image, Google can see those stock images where these are all unique photos because they are AI generated.\r\n\r\n\r\nNikolas Hulewsky (07:41.048)\r\nWell, that's what I was going to say. Like it's one of two ways you either send a photographer out there. take the pictures, which is the cost, or you buy some stock photos and frankly, other people could be using your stock photos. So when Google's indexing those, doesn't necessarily index to your site. It may index to across a couple of different sites. anyway, these are unique.\r\n\r\n\r\nMatt (07:53.272)\r\nYes.\r\n\r\n\r\nMatt (08:00.302)\r\nYeah, and so it's Google knows, yeah. Yep.\r\n\r\n\r\nSo Google knows when a picture has been used in other places. And the other thing that we did is we ran these AI images through Google actually has a service. Again, this is AI. This photo right here is AI. AI, like all these are AI images for this site. so we actually, Google has a scanner that you can put an image in and it will tell you what the entities are in that image. So it'll identify that, hey, there is a window here.\r\n\r\n\r\nAnd there is a sink here. And so that's how Google, from an SEO perspective, can look at this image and say, this is a bathroom. I put the pieces together. I'm 80 % confident it's a bathroom. And so from an SEO perspective, the AI images actually do well in being unique. But then they're also good enough that Google recognizes that this is a bathroom. Which, again, you kind of just do the naked eye test. It's like, if I showed you this, you know it's a bathroom. There's not really a question.\r\n\r\n\r\nNikolas Hulewsky (08:36.59)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (09:05.518)\r\nHow did you build these websites?\r\n\r\n\r\nMatt (09:05.584)\r\non that quality.\r\n\r\n\r\nSo we build them we build in WordPress and Yeah, a lot of these are like more templated sites for new new businesses that we just need to start getting them indexed starting page rankings then over time we eventually will like Like eventually they become something more like this a lot more high quality custom branded No, these again. This is no\r\n\r\n\r\nNikolas Hulewsky (09:32.43)\r\nHow are those AI generated?\r\n\r\n\r\nNikolas Hulewsky (09:39.214)\r\nThis is just like, hey, I'm trying to get a website up. Let's just get it up. OK.\r\n\r\n\r\nMatt (09:39.232)\r\nAnd so that's, over to, yes. And the thing is, this still brings in leads. this still looks better. If I look at the home remodeling sites in a place, normally the competition is sites built in the 2000s. And they look terrible. And so even this.\r\n\r\n\r\nas picky as I am is so much better than what a lot of their competition is. And so it's enough to get started, get them generating leads, they start making more money, then we can invest, like you said, in the media. We can invest in a better website. We can invest in all those things. It's just stepping stones.\r\n\r\n\r\nNikolas Hulewsky (10:14.286)\r\nAnd so for the SEO, you're building the websites for them as well? Or are you just, okay.\r\n\r\n\r\nMatt (10:19.446)\r\nYeah, yeah, so we handle everything. Yeah, so our SEO services are all encompassing. We handle the Google Business Profile, the backlinks, the websites, ranking tracking, everything that is needed.\r\n\r\n\r\nNikolas Hulewsky (10:32.462)\r\nHave you messed with any website building on Cursor or Replet?\r\n\r\n\r\nMatt (10:37.838)\r\nSo we've played a little bit with lovable Which is yeah idea to happen seconds\r\n\r\n\r\nNikolas Hulewsky (10:41.838)\r\nOK, levelable is the other one.\r\n\r\n\r\nMatt (10:47.422)\r\nI've played with it, but again, there's a lot of things that we know. We've built enough of these sites that we know exactly what's needed. It's a template. It's easy to just throw it up. And then we have the functionality. WordPress is open source. we have the ability to integrate with a bunch of different CRMs that people want, the form builders, things like that. It's just easier for us.\r\n\r\n\r\nThat kind of leads into this whole lovable thing. If we're building a new site, what I love doing is instead of paying a designer $1,000 for a couple pages of a prototype for a Figma file or something, I can just come in here and say, hey, I want this kind of a page.\r\n\r\n\r\nAnd then what I'll do is I will chat with it till it gets good enough for me to say, OK, this is a good enough style guide for my developer to then go build. And so we were like, hey, we wanted a page that\r\n\r\n\r\nfor like custom homes and but we wanted more e-commerce style and so I was able to create this page in level bull and then go and Send this live link to my developer and say hey take this style guide and go build it for the the actual plans that we have and so That's done in about Yeah, so in this\r\n\r\n\r\nNikolas Hulewsky (12:09.816)\r\nCan you show me in loveable how you did it?\r\n\r\n\r\nSo let me end while you're before you do that, I want to set the context. There's three that I know of. There's probably a lot more, but there's three that I know of. There's cursor, replet, and lovable. Cursor is like, from what I understand, you kind of need to have some coding background. You can get up to speed pretty quickly. It's still coding with natural language, but you do need to understand how it works. Replet.\r\n\r\n\r\nMatt (12:27.138)\r\nYes.\r\n\r\n\r\nMatt (12:33.315)\r\nYep.\r\n\r\n\r\nMatt (12:38.147)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (12:40.546)\r\nYou don't need as much coding experience. However, you do have to host on replicates platform, whatever you build lovable is similar to Replet in the sense that you can build websites or build, you know, write code through natural language, but it doesn't have the same hosting restrictions as maybe a Replet might have.\r\n\r\n\r\nMatt (13:00.492)\r\nRight, you can just publish it to a GitHub repository and then they also have the integration with SuperBase. Again, I'm not technical. I am a marketer. I'm an SEO. And so a lot of stuff that I'm building, like...\r\n\r\n\r\nNikolas Hulewsky (13:14.478)\r\nBut where you used to have these moments where you're like, you talk to the developer and you're like, this is kind of what I'm looking for. Here are the five websites I'm interested in. And then they give you the first draft and you're like, no, that's not what I wanted. And so you give them feedback. This gives you like three iterations in because you can do it yourself as opposed to having to rely on conveying it to somebody else.\r\n\r\n\r\nMatt (13:26.359)\r\nYes.\r\n\r\n\r\nYes.\r\n\r\n\r\nMatt (13:33.743)\r\nExactly. That's kind of the point is you're just short-cutting those iterations time to actual development.\r\n\r\n\r\nNikolas Hulewsky (13:39.448)\r\nAlright, go ahead, show me this.\r\n\r\n\r\nMatt (13:43.63)\r\nYeah, so I said, like, I want to build an e-commerce product page for a barn dominion build. Should include these things, floor plans, blah, blah, blah, and anything else you want. Make it modern and rugged design. And the first thing it built was actually a home page. It built this.\r\n\r\n\r\nNikolas Hulewsky (13:55.438)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (14:00.856)\r\nWait, so from that prompt, it built this?\r\n\r\n\r\nMatt (14:04.65)\r\nIt built, from that prompt, I don't think it'll let me even go back. Yeah. From that prompt, it built this. Just that little prompt, it built all of this. All of that.\r\n\r\n\r\nNikolas Hulewsky (14:14.103)\r\nWow.\r\n\r\n\r\nAll of that. like, if you scroll up to the top, and if you're listening to this, you need to go to YouTube and actually watch this. There's just like the general overview, rugged luxury for modern living at the barn dominion. That's amazing. You scroll down, it has floor plans with square foot, the key features mapped out, one's the homestead, one's the front of the year, one's the ranch, and then gives pricing options from that one prompt.\r\n\r\n\r\nMatt (14:46.018)\r\nYep, yeah. And this was actually really cool, too. It had this pricing calculator built in.\r\n\r\n\r\nNikolas Hulewsky (14:47.054)\r\nThat's insane.\r\n\r\n\r\nNikolas Hulewsky (14:51.79)\r\nprice. What it put a pricing calculator in there with without you telling it to\r\n\r\n\r\nMatt (14:56.558)\r\nYeah. And so obviously, there's a lot of white space here. And so my developer would understand, don't obviously leave this white space here. There's some things that a designer would just know. yeah, and we're like, OK, this is kind of cool. Now how would we actually then go and build this ourselves? Because that wasn't even something I had on my mind. And I'll put this. was like, you know, actually, let's go do that for some of our other clients. That's a really cool.\r\n\r\n\r\nNikolas Hulewsky (15:15.435)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (15:22.594)\r\nHow much is lovable a month?\r\n\r\n\r\nMatt (15:25.87)\r\nI'm paying 20 bucks a month for the lowest plan. And I think it's free, so you can try it for free. You get a certain amount of prompts per day. And so you can play with it for like 10, 15 minutes, get so far, and then it says that's enough for today. And then you can come back the next day and play with it. On the $20 per month plan, sorry, go ahead.\r\n\r\n\r\nNikolas Hulewsky (15:30.253)\r\nit is.\r\n\r\n\r\nNikolas Hulewsky (15:47.662)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (15:51.48)\r\nNo, I'll shut up, going.\r\n\r\n\r\nMatt (15:53.676)\r\nOkay, so for the $20 a month plan, like I think it's a certain amount of like projects per month. And so like I have all these different projects down here. And then we haven't run into a restriction on how many like prompts that you can do, but I'm pretty sure if we were to play with it all day. So like with this prompt, it did this. And then I said, hey,\r\n\r\n\r\nI actually want a page, a specific dedicated product page for the plan. We'll need to add a new route and create a product page. So that's when it created this second page where I can click View Plan Details. And then it took me to like a product page for this barn dominion plan.\r\n\r\n\r\nNikolas Hulewsky (16:38.302)\r\nOK, this brings up just a bunch of questions for me. The first question is more of a technical question. Someone who's showing this to me yesterday, they were like, here's the code, then here's summary. I didn't know this, but apparently people write summaries to explain what they're looking at in the code for other developers. Do you know what I'm talking about or no?\r\n\r\n\r\nMatt (17:00.624)\r\nno.\r\n\r\n\r\nNikolas Hulewsky (17:01.454)\r\nOkay, then we're gonna forget that. Moving on. The second thing is...\r\n\r\n\r\nMatt (17:04.192)\r\nOkay, all I know is that there's a little toggle here for the code viewer and you can see all the code right here.\r\n\r\n\r\nNikolas Hulewsky (17:11.022)\r\nOkay, so when you send this to your developer, your designer, they can look at the code and mess around with it. The second thing that I wanna ask is, how are you utilizing this with clients? This seems like you could do it one of two ways. You could literally send them a link to Lovable and be like, hey, describe what kind of a webpage you want and they could create the first draft for you that you create. Or you could say, I'm gonna create really good Lovable prompts. These are the things that I want answered and give the...\r\n\r\n\r\nthe customer, a questionnaire, right? You know, what are five websites that you want it to look like? What are the pages that you want? What's the functionality? Are you paying? Like, you know better than I do what the websites need to look like. And then you get that and you just feed it into the prompt and you get a first draft. Are you using it like that yet?\r\n\r\n\r\nMatt (17:57.388)\r\nNo, because they're hiring us for our expertise. If we went with their opinions, they would probably be choosing sites that look terrible. And that's kind why they're hiring us, is they trust, like, it's that whole, like, joke that, like, if you're hiring me to watch what I do, I'm gonna charge you, like, 10 times the price because you're gonna be micromanaging. So, a lot of our clients just trust us. The nice thing with this is that I can, instead of having my developer develop a bunch of stuff, what I can do is have this page, and then there's a, it's a,\r\n\r\n\r\na totally publishable live link right here, I send this to them and say, hey, are there any tweaks on this? And they're like, well, maybe this or maybe this or this. And then it's easy for me to make those tweaks pre-development. And that way, my developer isn't having to spend time building a section to then have to rebuild it later.\r\n\r\n\r\nBut most of our stuff, this is more internal. We are a very boutique agency. We don't have a lot. And we have a good relationship with our clients. And so this is more for internal operations than external. Now, you say those things, and I kind of like the idea of that questionnaire and stuff. But ours is very white glove service. And so we already know what they want because of our pre-boarding call. And we already know that this is kind of the style they like. This is what they're wanting. Here's the vision.\r\n\r\n\r\nand build this and then we'll go and say hey here's a first draft what are your thoughts on it and they'll make tweaks from there.\r\n\r\n\r\nNikolas Hulewsky (19:24.898)\r\nYeah, I'm just thinking more use cases in your business. You could have a pre-boarding call, it's recorded, you have a summary that feeds into AI, and then you have a custom GPT created, which is like, based on this pre-boarding call, give me an idea of what they're looking for. It's just like helping you get faster with these prompts, utilizing AI to essentially create the AI.\r\n\r\n\r\nMatt (19:47.032)\r\nYeah.\r\n\r\n\r\nYeah, and it would be really cool. A big wow factor is if it was doing this, dreaming big, right? You're on the call with a prospect. You're talking about this. It's feeding it in. It's building the page live. And at the end of the call, you say, hey, just curious. What do you think of this page? And it's their brand. It's all the stuff they've talked about. It's live. they're like, how did you do it? The wow factor of something like that.\r\n\r\n\r\nNikolas Hulewsky (20:15.907)\r\nYeah.\r\n\r\n\r\nMatt (20:18.222)\r\nLike I don't that's not even possible right now like in terms of like no one's does that but imagine if you're on a like a prospect call and you're like man it'd be cool if it did this it had this and had a calculator and then you're like at end of the call you're like here's a live link what do think of this and they're like Like you would literally be blowing people off their feet like mind blown Which\r\n\r\n\r\nNikolas Hulewsky (20:27.502)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (20:37.688)\r\nYeah.\r\n\r\n\r\nThat would be an amazing use case for it. think you could do it. I think you could do it now. I mean, really manual. Like you'd have to be. You probably need two people on. I don't know if you can, if there's live transcription, but either way you could be entering in the prompt and like creating the website or you could do pre work, right? You're like, I know I'm talking to Gary's hardware. So I'll go grab their logo. I'll go grab some blurbs about them to have it ready.\r\n\r\n\r\nMatt (20:43.502)\r\nYeah. I think you could.\r\n\r\n\r\nMatt (20:53.837)\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nYep. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:06.35)\r\nAnd then as you're talking to them about what they want it to look like, then you're also feeding in the content. You know what mean? It's like, hey, what do think of this first draft? That would be really cool.\r\n\r\n\r\nMatt (21:11.618)\r\nYeah. Yeah, that would be really cool. I definitely see. Now, again, we're small agency, I'm not being into like, we're not scaling. This agency isn't scaling. We have a very small set of happy, high-end clients. onboarding new, obviously, over time, we'll onboard a couple. But for an agency that's really looking to grow that side,\r\n\r\n\r\nThat's a way to differentiate yourself for sure. Yeah, it's really interesting. For the agency.\r\n\r\n\r\nNikolas Hulewsky (21:41.806)\r\nHow big is your business right now?\r\n\r\n\r\nNikolas Hulewsky (21:46.388)\r\nYeah, just your business is top line.\r\n\r\n\r\nMatt (21:48.13)\r\nYeah, about a dozen clients. And yeah, we have a couple employees, and we're keeping it small. We're very big about profit lifestyle businesses. And so we love it. Everyone gets paid well. Our clients are like our retention rate. We have only had to separate with one client in the past two years, and it was a mutual good.\r\n\r\n\r\nNikolas Hulewsky (22:01.966)\r\nDude. Yeah.\r\n\r\n\r\nMatt (22:15.424)\r\nseparation just because there was a change in direction.\r\n\r\n\r\nNikolas Hulewsky (22:18.51)\r\nHave you seen this add to your bottom line using AI?\r\n\r\n\r\nMatt (22:26.968)\r\nYou know, that's a good question.\r\n\r\n\r\nIt cuts expenses and time for sure. obviously, I'm not tracking it in that perspective. I still like.\r\n\r\n\r\nI'm still using it very much, like I said, just as a tool to assist me in what I'm skilled at. It's just trying to make me a better. And then my employees, like the mid-journey, like my developer goes and gets the images. So it cuts down on expenses. It speeds up time. It's better quality. so obviously, yeah, it's going to increase. I'm a big, like it's going to improve the quality of the work, better retention, all of those things.\r\n\r\n\r\nNikolas Hulewsky (23:05.422)\r\nWell, because they're like the primary benefits, right? It can either drive revenue or it can cut expenses. Cool. But then there's the secondary benefits like, it improves the quality of the product. And so now our customers are stickier. So churn is lower, retention is higher. That drives revenue as well. But those are like secondary and tertiary benefits of it. There's still benefits. It's just not as one-to-one for these things.\r\n\r\n\r\nMatt (23:12.045)\r\nYes.\r\n\r\n\r\nMatt (23:18.893)\r\nYes.\r\n\r\n\r\nMatt (23:29.422)\r\nYeah, and I think the biggest, like, off the top of my head, designer cost. Like, whenever we would have a new design, it cost me probably 800 to 1,000 bucks for just one or two pages of a prototype, whereas it's 20 bucks and five minutes. So time turnaround is shorter, cost is a lot less. A lot of my copywriting and marketing would take me hours. My time is valuable. So it's like,\r\n\r\n\r\ncutting down three, four hours of time that I would have to, I can go do other things. Again, productivity, that's top line revenue. Like there's more, there's more work being done. Yeah.\r\n\r\n\r\nNikolas Hulewsky (24:05.166)\r\nLast question, what do you think is the best way for an entrepreneur who maybe is not technical, they familiarize themselves with these tools?\r\n\r\n\r\nMatt (24:16.866)\r\nGo and play. There's nothing better than getting a sandbox. A lot of them are free. You can go and play with things. Claude has the projects that you can save preset prompts. We use that a lot. Start learning how to prompt. I think there's so much value in learning how to prompt. It's a lot of how you get the quality of the output to be better. And so go and play. Have fun with it.\r\n\r\n\r\nNikolas Hulewsky (24:21.848)\r\nMm.\r\n\r\n\r\nMatt (24:46.85)\r\nsaid you're taking this week and you're just learning. Go and talk to people. Go and try it. Go and get dirty. Like lovable. I'm not a technical person. Up until having the SaaS company, I didn't even know what GitHub repository was. And so a lot of it is clicking and very simple, like connect to SuperBase. OK, you just connect a credit card. Like I can now publish an app without any technical coding ability. go and have an idea. So like I had an idea. My buddy's a.\r\n\r\n\r\nstructural engineer and I was like what if you were able to put an input in a PDF and it outputs all the structural thing and then you just go and make sure everything's correct how much money and time with that safety is like dude if that was possible you're talking tens if not hundreds of thousands of dollars a year and I'm like really so we kind of built a little prototype for him in like a day and it's not perfect but it's like it's an MVP and it's like okay I could quickly see how SAS\r\n\r\n\r\nNikolas Hulewsky (25:39.054)\r\nAmazing.\r\n\r\n\r\nMatt (25:45.9)\r\nLike, SaaS is going to come down to distribution at the end of the day, because when non-technical people like me can start to get prototypes in, we still need to go. Like, there's ways to go. There was a guy who just posted like, I built this whole thing on Cursor alone, and blah, blah. now, like two days later, there was like a how it ended up is like, I'm getting spam. People are attacking me. I'm not going to build in public anymore. And it's like, yeah, if you don't underst-\r\n\r\n\r\nIt's really good for people that have the understanding that they can get 95 % of the way there and the last 5 % finishing is their knowledge. That's really where it's super powerful. Right now it's fun. It's like a fun little tool and use cases. then obviously you the AI agents and people building these stacks. And it's like, that's next level, which that's really solid. I'm waiting for it to become easier and frictionless for those things to happen.\r\n\r\n\r\nNikolas Hulewsky (26:20.43)\r\nYeah, totally.\r\n\r\n\r\nNikolas Hulewsky (26:41.774)\r\nI Matt, this was awesome. Thank you, Stay on for a second. We're going to let it upload.\r\n\r\n\r\nMatt (26:45.986)\r\nDude, yeah, pleasure.",
  "metadata": {
    "duration": "",
    "date": "2025-04-15",
    "platform_source": "Google Drive"
  }
}