{
  "episode_number": "179",
  "episode_title": "$6.5B for a Designer? OpenAI‚Äôs Wildest Move Yet, with Liz Knopf",
  "guest_name": "Liz Knopf",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:01.136)\r\nSo Liz, what did you think when you saw that Sam Altman and Johnny Ive are getting married?\r\n\r\n\r\nElizabeth Knopf (00:05.996)\r\nI mean, I was like, that is one of the best talent acquisitions, whether it's real or not, but to be bought for a couple of bill, like, hey, just to have the name, that was getting so...\r\n\r\n\r\nNikolas Hulewsky (00:16.934)\r\nWell, the picture announcement in whatever newspaper they released it in looked like an engagement photo. It was like on his shoulder with his hands. It so funny.\r\n\r\n\r\nElizabeth Knopf (00:24.568)\r\nYeah. Yeah.\r\n\r\n\r\nI heard that there was like a whole little ad they did that was like very, you know, played into that lovey-doveyness. I don't know, whatever. Yeah, I don't know. I haven't seen it. So, I'm gonna say.\r\n\r\n\r\nNikolas Hulewsky (00:36.902)\r\nDid it.\r\n\r\n\r\nAll right. So to catch everybody else up, OpenAI has paid $6.5 billion to acquire Johnny Ive's hardware company. I don't even know what to call it. I thought it was just an agency, but $6.5 billion seems like a really expensive agency. and will you walk us through who the frick is Johnny Ive?\r\n\r\n\r\nElizabeth Knopf (00:55.756)\r\nYeah, yeah.\r\n\r\n\r\nElizabeth Knopf (01:01.75)\r\nOkay, so he's basically famous for the iPod wheel, if I remember correctly, and hopefully someone will grock me on that or chat-chipity me on that and it's incorrect. But basically he's a famous Apple designer. He sort of brought Steve Jobs ideas to life across the board. And so he's obviously done very well from himself. He's like known as the number one designer for hardware specifically. And so obviously he has a following.\r\n\r\n\r\nNikolas Hulewsky (01:27.832)\r\nYeah. Yeah. He's British and he's well spoken and the way he talks about products. If you've ever watched any of the Apple releases, he was the one that would say aluminum. We've got a 4.7 touchscreen surrounded by aluminum, created from unicorn brows. He could say anything and it was mesmerizing when he would talk about stuff. So he was that designer at Apple for a long time. Left Apple, started an agency where he was essentially freelancing.\r\n\r\n\r\nTo be honest, I haven't been super impressed with anything that he's post-Apple unless I'm crazy, like has he done anything post-Apple that's been noteworthy?\r\n\r\n\r\nElizabeth Knopf (02:04.59)\r\nI haven't been too involved in looking at his career. I'm not into the design world too much. But I mean, I haven't heard anything and I would assume if there was anything of note, would.\r\n\r\n\r\nNikolas Hulewsky (02:16.632)\r\nOkay, so Johnny Ive, probably like you just said, the best acquirer of all time, $6.5 billion essentially to bring Johnny Ive onto OpenAI. It's about, what was the number? At least a point, if not 2 % of OpenAI's total value. So they gave him a lot. It was 100 % stock deal. They didn't pay him any cash. It's all just converting to equity within OpenAI. But it begs the question, Johnny Ive is a product guy.\r\n\r\n\r\nphysical product guy, OpenAI does not have a physical product, what are they cooking up?\r\n\r\n\r\nElizabeth Knopf (02:47.79)\r\nYep. Great.\r\n\r\n\r\nSo, you know, there's been rumors, people have been throwing out random designs of like a disc and other little objects, you know, whether or not it's going to compete with a pendant or glasses or, you know, whatever device. I mean, we've been seeing now Google glasses, meta glasses, and like the evolution of devices, wearables. And so we're now at the forefront where AI is really making AR, VR, all of that a reality. So obviously it's going to\r\n\r\n\r\nbe something that's, or I shouldn't say obviously, I think it's probably gonna be some kind of wearable. What kind of wearable or some people think it's gonna be a desk object or maybe like an Alexa type device you have in your home. I don't know, I really don't know. I mean, it's all speculation. But I think what's interesting is like last week was very clear on everybody has sort of a lane. Like each of these big guys, they were all competing neck and neck and they're all starting to take.\r\n\r\n\r\nlarge investments and picking their lane. And we'll get into the rest of the crowd here in a few minutes, but I think that was my biggest takeaway versus like what the form factor ends up being.\r\n\r\n\r\nNikolas Hulewsky (03:59.386)\r\nYeah, they dropped, there's like, people are like, it's in the picture. There's a picture of him with glasses on. It's gotta be the glasses. And then other people have kind of taken the text. I can't remember exactly what they said, but they said something about like, it would have context of everything around you and it would be portable. And so people were like, it's gonna be this. It looks like a little pendant potentially that you wear around your neck. The gist is nobody knows, they haven't announced it, but it's going to be something.\r\n\r\n\r\nthat bridges the gap between the physical space and the digital space. And I mean, you're seeing it now with Mark Zuckerberg wearing the Ray-Ban glasses. I don't know how well they're selling, but it seems like those are actually kind of becoming a thing. Are those augmented reality or are they?\r\n\r\n\r\nElizabeth Knopf (04:45.646)\r\nYeah, they are augmented reality. So like you will see things and I think they have like some, if I remember correctly, some maps, some other integrations that enable you to have some kind of like metadata.\r\n\r\n\r\nNikolas Hulewsky (04:47.334)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (04:56.132)\r\nOkay. Yeah. So anyway, so Facebook's got the glasses. There are other hardware devices. Like I wear that limitless pendant. There's a plot pendant. But it's obvious that there's going to be a wearable component to AI. And I think they're trying to figure out what that's going to be. So this is obviously a big splash from OpenAI to go and bring on Johnny Ive because he's the product guy in the physical space. He's the one that's going to take them to the promised land.\r\n\r\n\r\nWhat did you think about their timing of the announcement?\r\n\r\n\r\nElizabeth Knopf (05:28.11)\r\nYou mean that it was like during Google's IO? Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (05:31.456)\r\nYeah. Dude, Google released some freaking crazy stuff this week, which we'll talk about. And then nobody was talking about it. They were talking about Johnny Ive joining OpenAI. was like masterful.\r\n\r\n\r\nElizabeth Knopf (05:46.286)\r\nYep. I mean, it's kind of, mean, they've really won the marketing game. mean, again, we saw the chart a couple of weeks ago when I pulled up the Google trends and it's just, know, chat GPT, that's what people search for. That's what people are using. They're not searching for Gemini. I mean, that's a close second. yeah, but I mean, the rest of the guys don't know marketing as well as I want one.\r\n\r\n\r\nNikolas Hulewsky (06:07.226)\r\nYeah. No, it's apparently, apparently in Sam Alton. So anyways, we'll see. The iPhone became the portal through which everybody was able to access mobile. And we'll see what the device is that allows everybody to access AI. And I think they're hoping it's Johnny Ive who brings me there.\r\n\r\n\r\nElizabeth Knopf (06:24.674)\r\nLet me ask you a question because you've been wearing the pendant and I think this is a counterculture alternative investment approach because there's every new AI, I would say there's probably an anti-AI investment opportunity as well. And so I think the big thing that's going to come up in the next couple of years is just privacy. And obviously I would say we don't really care about privacy, even though we say we do. But I I bought a bunch of Alexas and we had to turn them off at our home because it was like listening at inappropriate times and other concerns.\r\n\r\n\r\nNikolas Hulewsky (06:27.249)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (06:35.676)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:52.625)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (06:53.954)\r\nBut I mean, think this is gonna become a big theme when you're talking to someone, maybe they're wearing glasses, you have no idea you're being recorded or you're in a meeting and it's like someone thinks they're confiding in you and it's being recorded. And so there are laws when you're doing a phone call and you're recording, but I'm just curious too, have you had any pushback when people find out you're wearing a pendant? Do you communicate that? Like what has been that experience? Because I think this is big thing.\r\n\r\n\r\nNikolas Hulewsky (07:15.131)\r\nYes.\r\n\r\n\r\nYeah, I live in a single party state, so I don't have to get anybody's permission to record them. However, after wearing it, it's like I make sure to tell people that I'm wearing it and what it does, because it's awkward. Like people are like, what the freak is that? And if I don't tell them, they're like, it's just recording our conversation. It just gets weird. So I like to get ahead of it. But I've had a conversation with multiple health care companies. There's a particular idea that I love, which is residents or patients would wear\r\n\r\n\r\nElizabeth Knopf (07:30.358)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (07:47.388)\r\na device that's capturing all the conversations. Why? Well, because family members want to know what's going on with mom or dad or grandma or grandpa. Did they eat today? Did they get changed today? What time was that? Did they get physical therapy? Did they get their meds taken, et cetera? So if you have a wearable device, it can summarize all of those things. Spits to the family. Now the family's more informed. Mom doesn't, or grandma doesn't have to worry about taking notes when they meet with a physician. Like there's a whole host of things that are good about it. But then I'm telling this idea to multiple healthcare providers with large companies. And the question is always like,\r\n\r\n\r\nI don't want all that stuff recorded because that's going to be massive liability. If that all of a sudden becomes discoverable and we're, we are a very litigious society, especially with healthcare, healthcare. mean, from my perspective, right or wrong, you may not agree with this, but almost any interaction could lead to a lawsuit and a settlement of some type. don't agree with that, but it just is what it is. That's the current environment. And so if you start recording everything now,\r\n\r\n\r\nAnd it's like, well, why did you say this? well, you were supposed to do this. that, like, we're humans, we're fallible. Like there are problems that, that there are mistakes that we make all the time. There, people are very worried about the potential downside risks of recording these things. So I think to your point, we've got to figure that piece out. We've got to figure out the piece of how do we keep privacy, but also allow these tools as much access as they need in order to make our lives better. I don't, and I don't currently have an answer for it.\r\n\r\n\r\nElizabeth Knopf (09:18.286)\r\nSo I'll give you a quick counterfactual on that. So I worked with law enforcement wearing body cameras, introduced them with a bunch of agencies. And one of the biggest issues was that concern. And actually it ended up being the inverse where liability and complaints got massively reduced because a lot of the times people would create litigious events and then it would be he said, she said, and then it depends on whoever. So it actually became where\r\n\r\n\r\nNikolas Hulewsky (09:26.3)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (09:41.374)\r\nElizabeth Knopf (09:45.238)\r\nit got a ton of agencies out of lawsuits because people were acting in align with the protocol. So the data might end up being reversed, but it's obviously a huge risk to test. yeah.\r\n\r\n\r\nNikolas Hulewsky (09:55.728)\r\nThat's fascinating. Was that just in the company you were looking at or is that broadly speaking what happened?\r\n\r\n\r\nElizabeth Knopf (10:01.422)\r\nNo, that was broadly across the board of our, had a bunch of case studies around that. And that was basically our pitch was here, wear body cameras, and now it's basically pervasive across every state of the country. I have them, I'll send them one over.\r\n\r\n\r\nNikolas Hulewsky (10:12.432)\r\nI got to find those studies because that's, well, no, I'm serious. Cause that's like the number one concern right now. And if I can say like, actually it's reduced the amount of liability on these companies, that would be, I'm sure, yeah. I'd have to think through that. That's fascinating. That's a really, really good data point.\r\n\r\n\r\nElizabeth Knopf (10:29.294)\r\nYeah, yeah. But yeah, there's a whole bunch of other use cases we could talk about another time that are fun around that. But I think people should start thinking about both sides of that equation because it does apply in every job. again, we're talking to SMBs who might be in trades and stuff. And again, thinking about both of those concerns.\r\n\r\n\r\nNikolas Hulewsky (10:33.681)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (10:47.28)\r\nWhat's interesting, I'm just thinking about this for the first time, is I wonder if there will become specialty insurance products specifically around liability associated with AI. They'll probably just be added to current policies, like it could be a D &O policy, it could just be a typical GLP, I always get those wrong, whatever it is, general liability policy, or there may be add-ons to it. That would be fascinating. That's potentially a fascinating business model. anyways.\r\n\r\n\r\nElizabeth Knopf (10:56.526)\r\nIt's actually really interesting.\r\n\r\n\r\nElizabeth Knopf (11:15.308)\r\nWell, actually, there is a couple companies doing that. on, I forget the name. I want to say it was quick. I don't remember the name of it, but it was for auto insurance and you would put it on your car. I don't think the company ended up doing well or if they're still around, but I know that that was one of their pitches was they did insurance and then they had another sort of pricing model. So I'll have to figure out the name of that. okay. So there you go. So there you go.\r\n\r\n\r\nNikolas Hulewsky (11:25.02)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (11:36.708)\r\nInteresting. Well, Tesla does that in auto insurance. Yeah, Tesla offers auto insurance and it's at a significantly discounted rate because they have all the information on you and your driving record and the probability of you getting into an accident. So that is happening. What was the second one?\r\n\r\n\r\nElizabeth Knopf (11:52.13)\r\nYeah, so super interesting. I want to say it's called Lemonade. And I think they're doing, I might be totally wrong on this, but they're, think doing this based on automated billing or, okay, I might've spoke on this. I know they're doing insurance with something cool, but anyways, yeah, to come back to that.\r\n\r\n\r\nNikolas Hulewsky (12:07.696)\r\nHmm. That's fun.\r\n\r\n\r\nNikolas Hulewsky (12:13.199)\r\nOkay, so that was the first piece of big news, but really the big news that it upstaged was Google IOs event. Is it Google IOs? Is that what it's called? Okay, so they do this every year. Google, I'll set the stage and then you are going to tell everybody why it's important. Everybody's been looking at Google and saying, what the freak are you doing? Open AI is eating your lunch. You're sitting on your hands.\r\n\r\n\r\nYou've got 2 billion users that use your product every single day. You're not integrating AI into your products. Everybody's chat GPTing things. They're not, they're no longer going to Google. You're fumbling the bag. We talked about the innovators dilemma last week or the week before. So they're like trying to figure out what should they do? People are complaining about their models. I'm sure that for Sundar, their CEO, it has not been a happy time over the last six months trying to figure this stuff out. But this week.\r\n\r\n\r\nThey unveiled a, like, if I was them, I would have staged it, but it was just like, here it is, like everything that we've been working on. So what did they unveil this week?\r\n\r\n\r\nElizabeth Knopf (13:21.624)\r\nThey unveiled quite a few things. So, you I think the biggest deal is that they for sure understand the writing on the wall. They have a ton of AI investments and products they're coming out with. But for me, the biggest thing was that they're shifting search to AI driven. And so what does that mean? That means that those little bubbles you start seeing up top or not bubbles, but little summaries up top with AI results.\r\n\r\n\r\nthat's going to be pushed more. They've done some tests and that's, they're showing good strides and they're going to be incorporating Google ads there. And so that is the big deal. At least in my mind of all the things they shared, it's like they had, they shared, have a premium service for unlimited. They have a number of products, which I think the most viral one was a VO3, which is in their labs, real estate. And that's, I mean, we can talk about that for a few minutes.\r\n\r\n\r\nNikolas Hulewsky (13:58.972)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (14:17.734)\r\nWe're gonna talk about VO3 for freaking sure. It's insane. But the piece really quickly with the AI search, they're not rolling it out all at once, right? They're kind of staging it.\r\n\r\n\r\nElizabeth Knopf (14:19.36)\r\nYeah. Yeah.\r\n\r\n\r\nElizabeth Knopf (14:28.578)\r\nYeah, so I don't even know, like I've been trying to look for it throughout just like my experience with Google and going back over there. And it's not super obvious of those updates and changes as of yet, but I'm sure they'll be popping up in the interface more.\r\n\r\n\r\nNikolas Hulewsky (14:44.102)\r\nSo here's why this is a big deal. right. You've heard of SEO, but you've also heard of pay per click. People pay money to be featured on the search results that Google has. And I want to say last year, $62 billion in like Q3 of last year was spent, was generated by Google just on those ads. $63 billion with a B. That's freaking insanity.\r\n\r\n\r\nAnd still to this day, the majority of their profit comes from search because they're so dominant search. So the question has been, what are CPMs going to be? Right. How are you going to price? Is it the same? What does it look like? And it looks like Google is finally confident enough to say we're doing this. It's going to be in our AI search as well. And we're coming for everybody. Like, pretty, it's a pretty baller move.\r\n\r\n\r\nElizabeth Knopf (15:36.258)\r\nYeah, no, absolutely. I mean, yeah. So I was happy to see that happen because it's, don't know. mean, if you feel emotional about companies, feel like they've been so set up to succeed. And I mean, people don't even know they have, you know, I joke about it because I feel like they have 30 different interfaces with AI. And it's almost true because there's a lot of products people don't even know exist. I just wanted to sort of pop up a couple here on screen so people can see like.\r\n\r\n\r\nplaces you can go to even check out some of the different tools that they have because there's so much AI real estate. So here's their Firebase Studio, which is where you can basically do little apps and create apps. You've got Google AI Studio, where you can also create apps, share your screen, do interactive stuff. They have a bunch of good visual search.\r\n\r\n\r\nvisual interaction. And so if you need help on something, you can share your screen and it can walk you through it step step. This is a really cool tool that most people don't know about. There's of course Gemini. Okay, sorry. So right now this is ai studio dot google dot com. The previous one was studio dot firebase dot google dot com. Then we have Gemini, which is Gemini dot google dot com. And this is of course sort of their main standalone LLM. Then\r\n\r\n\r\nNikolas Hulewsky (16:38.78)\r\nHoly crap. So, Tonya, tell me where you are again. Tell me where you are.\r\n\r\n\r\nElizabeth Knopf (17:00.77)\r\nYou've got labs.google.fx.dools.flow. And this is where you're going to see, we'll do some demos in here for VO3. Then you've got DeepMind, which we've like barely touched on, but they've done some really cool stuff with like deep tech, because this is really sort of the origination of a lot of their AI infrastructure and tools was from this company called DeepMind. So they are like for research. And if you want to go into, you know, science and\r\n\r\n\r\ndiscovering new proteins and stuff. There's Alpha Fold. There's Alpha Fold. Then you've got Vertex AI, which is more developer tool set, but they've got some cool features like managing prompts, a prompt gallery, a way to do fine tuning on models. But again, this is much more for, I would say, some technical folks, but there's some cool stuff in there just worth popping over.\r\n\r\n\r\nNikolas Hulewsky (17:53.692)\r\nOkay, so what do you currently use the very first one, Studio?\r\n\r\n\r\nElizabeth Knopf (17:59.348)\r\nYeah, so the studio, this one is I've only done a couple little apps in here. To be quite frank, like I like lovable still the best. Yeah, there's the equivalent. This one, I don't really know the comparison well for it, but this is like sharing, I would say media and also just when you're learning a new skill.\r\n\r\n\r\nNikolas Hulewsky (18:08.348)\r\nOkay, so this is like a lovable cursor, Replet equivalent. Okay, the next one that you had.\r\n\r\n\r\nElizabeth Knopf (18:25.506)\r\nThis is a great place to go. Cause again, you can share screen and say, or troubleshoot. can share your screen and say like, Hey, I'm doing this. What do I do? How do I do it? no, it's another interface. No, no, no. This is like, this is Google's problem is like, apparently from a culture standpoint, they do this. They have these different little teams building these tools and competing, but like from a user standpoint, it's not like, it's like, where do I go? forget.\r\n\r\n\r\nNikolas Hulewsky (18:30.396)\r\nNikolas Hulewsky (18:35.14)\r\nIs this where I access VO?\r\n\r\n\r\nSorry, I'm such a-\r\n\r\n\r\nNikolas Hulewsky (18:51.418)\r\nNo. Yeah, I know.\r\n\r\n\r\nElizabeth Knopf (18:53.728)\r\nSo, and then this is the main one. I mean, this is their main AI model. This is again, like a chat GPT or Anthrocyc. This is Gemini. And this is cool too. Like you can do coding apps here. They have this thing called a Gems Manager. I don't really use it that much, but it's like to save stuff or sort of like custom GPTs, I guess, kind of. They all sort of a unique flavor. And then.\r\n\r\n\r\nNikolas Hulewsky (19:00.092)\r\nThis is Gemini.\r\n\r\n\r\nNikolas Hulewsky (19:17.916)\r\nand then.\r\n\r\n\r\nElizabeth Knopf (19:18.626)\r\nTheir labs, apparently this is where they're going to be, labs.google.com, this is where they're relaunching a lot of their new AI experiments. So I guess this is going to be the new main hub for their releases. And I'm just super excited about this. then, go ahead.\r\n\r\n\r\nNikolas Hulewsky (19:33.148)\r\nAll right, so I want, were you gonna show where VO is? Or what was the next one?\r\n\r\n\r\nElizabeth Knopf (19:39.184)\r\nVO. So actually if you go to like, if you just search for VO3, it'll take you to DeepMind. Exactly. Cause then it's like, if you want to try it in Gemini, you can go try it in Gemini or try it in Flow, which is where I just was. But then it tastes, so it's just like, it's a little bit of a mess in terms of like remembering.\r\n\r\n\r\nNikolas Hulewsky (19:45.596)\r\nBro, Google's gotta get it together,\r\n\r\n\r\nNikolas Hulewsky (19:57.798)\r\nI we've talked about MCPs and like the thing I think that is so game changing about MCPs is like, it's just one portal. You can do everything there. That's where Google's got to get to. Like I know they have a bunch of cool stuff, but they've got to get to a place where, Hey, this is the portal you go to for Gemini and for coding and for VO and for like whatever else you need to use AI for this. There's just one portal and it kind of whatever the user interface doesn't change. ChatTPT does that pretty well.\r\n\r\n\r\nElizabeth Knopf (20:08.216)\r\nExactly.\r\n\r\n\r\nElizabeth Knopf (20:21.56)\r\nAbsolutely.\r\n\r\n\r\nElizabeth Knopf (20:25.986)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (20:26.684)\r\nIt's annoying. It can be annoying as well. But anyways, I want to go back just a little bit because I actually think a Google's founding motto was What was it? Don't be evil right and Honestly, and a lot of people look at Google and it's a mass a lot of power and blah blah blah They've done a lot of good in the world though. And if you take a look back over time like beyond just the search We've gmail\r\n\r\n\r\nElizabeth Knopf (20:39.278)\r\nGreat, yeah.\r\n\r\n\r\nNikolas Hulewsky (20:54.012)\r\nRight, emails is really where email has taken off. Android, which is obviously in the United States, been a competitor to Apple, but across the world, by and large, the most used operating system in the world is Android, which is what Google built. Chrome, everybody uses the Chrome browser. I use the Chrome browser. Obviously the advertising infrastructure, like Google figured out how to digitally advertise, how to market to people. It's gotten it.\r\n\r\n\r\nso refined. I Facebook has taken the baton and just taken it to a whole nother level. But Apple is really the pioneer in that space. And then the things that I'm like, in awe of, check this out. DeepMind that you talked about. DeepMind was sort of the impetus for, it wasn't sort of the impetus, excuse me. It was the impetus for Sam Altman going to Elon and starting OpenAI. Because one of the founders of Google had said,\r\n\r\n\r\nwell, it's just going to be the evolution of the species and humans aren't going to be around anymore. AI is here. And Elon was like, we can't have that. We must build something better. And so he goes to Sam Altman and they start this company. but they've been developing this stuff within deep mind for a really long time. And they've developed a lot of cool things within deep, deep mind. one of the offshoots of Google is this company called Verily. And what they're really focused on, which I think is really cool are the like healthcare and life sciences. So they're looking at,\r\n\r\n\r\nElizabeth Knopf (21:56.942)\r\nyou\r\n\r\n\r\nElizabeth Knopf (22:14.957)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (22:17.434)\r\nBiosciences in particular, which there's so much potential in those sciences to use artificial intelligence to help us find drugs that cure cancer, that cure autoimmune diseases, other diseases that obviously are currently incurable. And then the biggest one, which is like really popular right now is Waymo. People wrote Waymo, like they invested in Waymo for a really long time and everybody thought it was stupid. And now it looks like Waymo is going to win because they decided to go with LIDAR instead of\r\n\r\n\r\nSo like the reason I bring all that stuff up is because Google's been in a position of power and they've made so much money that they've been able to invest in all these other things and incubate all these other ideas. I think they've been a net good around the world and they will continue to be a check against open AI. I'm not saying open AI is bad. I just think competition is good and there needs to be somebody else who is not owning the AI space moving forward. So that's my diatribe. What do you think?\r\n\r\n\r\nElizabeth Knopf (23:07.406)\r\nAbsolutely.\r\n\r\n\r\nElizabeth Knopf (23:15.212)\r\nNo, I mean, I think you're spot on. I mean, it's funny because like each of those company, even those products, sweets, you just mentioned each individually are massive companies and even in of themselves. But, as we've talked about and touched on, it's just that their search and their their ads, it's such a big business. And so, you know, it's like sad because like you're not yet seeing the fruits even in their stock prices stock price, even though it popped last week to where I think it's going to end up.\r\n\r\n\r\nBut I mean, Waymo, I'm in a test market for Waymo in the Phoenix metro area. And I play with a game with my kids rather than sort of punch buggy. We play, you know, spot the self-driving car. And it went from like being a rare thing to now it's like we see multiple of them a day, both directions, you know, drop off and pick up. And so people, don't think realize how big it's going to be and how much it is. It's really going to be. Yeah. And I mean, obviously, yeah.\r\n\r\n\r\nNikolas Hulewsky (24:09.06)\r\nbe transformational. Yeah, it'll be transformational.\r\n\r\n\r\nElizabeth Knopf (24:12.974)\r\nYeah, and I mean, the other interesting thing with Google is like they've just been in such a good position because it's like they have all the data. They have all of our data. They have our personalization data, what we search, YouTube. That's basically what people say, you know, people have trained on. And I think their new product, VO, I think that's what they trained on from what I hear. yeah. All right. So let me pop over because let me not just tell you about it. Let's show you.\r\n\r\n\r\nNikolas Hulewsky (24:20.56)\r\nMm-hmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (24:30.972)\r\nOkay. Tell us about VO.\r\n\r\n\r\nNikolas Hulewsky (24:38.79)\r\nOkay, while she's pulling that up, I cannot believe that if you haven't seen this yet, which if you're not on Twitter, you probably haven't seen it yet. These videos are insane. You cannot tell the difference between. No, go ahead, you go.\r\n\r\n\r\nElizabeth Knopf (24:50.712)\r\nSo we'll, we'll, go ahead.\r\n\r\n\r\nYeah, so I thought I'd pull up some demos of what other people have done. And of course, the memes are always what starts it, you know, because we love memes here. So these were, you know, just some examples that were.\r\n\r\n\r\nOkay, so that's a.\r\n\r\n\r\nNikolas Hulewsky (25:08.126)\r\nmy gosh. So this is the meme of the guy who's walking with his girlfriend, they're holding hands. And then he turns around to look at another girl who walks by and he's like making a face, I think is a really famous meme. This is now VO making it into a video. And so that's what we just watched was, this one's crazy. All right. So what we're looking at are people at a car show talking about the cars. I don't know exactly what they're saying, but this is a woman being interviewed or husbands holding a child behind her.\r\n\r\n\r\nElizabeth Knopf (25:25.07)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:37.03)\r\nThis is all fake. It's all AI generated and it looks exceptional. It looks exceptional as they've solved the like, the mouth is moving and they're saying the words that their lips are saying. It's not, it's, it's, the lips are not totally off. It doesn't look overdone.\r\n\r\n\r\nElizabeth Knopf (25:56.494)\r\nThere's a lot of fun ways. So those are a couple examples. I don't know you can hear those or not, but they're all speaking and as we said, the lips are in sync. So now let's go over and see what we can do. Okay. So anything on your mind in particular? Otherwise I'll prompt something in.\r\n\r\n\r\nNikolas Hulewsky (26:17.532)\r\nNo, say two podcasters discussing remotely how AI is going to change the world.\r\n\r\n\r\nElizabeth Knopf (26:38.062)\r\nSo it was very simple, just one line, so nothing specific. And obviously you can get more creative with your prompts, but it is now generating and it's generating two different options. So hopefully we won't take too long. Sometimes this can take a minute.\r\n\r\n\r\nNikolas Hulewsky (26:53.2)\r\nYeah. And so you're in VO or are you in Flow? So which one do you go to?\r\n\r\n\r\nElizabeth Knopf (26:56.174)\r\nYeah, so you have to just go if you just search it basically it takes you over to labs and then you create with flow so I think they're trying to push you over to the labs.google and then flow I would just Google it and pop over Let me Google that for you you can do it from Gemini too. So we'll do a different prompt. Let's do\r\n\r\n\r\nNikolas Hulewsky (27:10.14)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (27:14.268)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (27:31.758)\r\nOkay, so I'm doing photo realistic balloon animals discussing top AI news from today. So we'll see from video that's in Gemini. So we'll just compare so we can see. Okay, so Jenner, I mean, these dudes look real. So I don't know if you'll be able to hear this or not. Well, let me play it. Okay, it's not making any sound. So that's a good, but.\r\n\r\n\r\nNikolas Hulewsky (27:43.856)\r\nGosh.\r\n\r\n\r\nNikolas Hulewsky (27:51.612)\r\nStill, so it's a picture, it's two men, they're having a conversation, they've got their podcast mics next to them, there's a split screen. AI World is the name of the podcast, there's even a QR code on it. Holy crap, how long is the clip?\r\n\r\n\r\nElizabeth Knopf (28:03.566)\r\nThe clips are only about eight seconds, believe. Like, yeah.\r\n\r\n\r\nNikolas Hulewsky (28:09.221)\r\nSo is Google giving away like a free amount of clips and then you've got to like upgrade in order to get more?\r\n\r\n\r\nElizabeth Knopf (28:12.494)\r\nYeah. Yes, yes. So it's like six of them. And then, I mean, it is a little bit expensive to upgrade. Let's just double check the pricing so I don't get it off. Hello, pricing. I think it was like, but again, if you know, compared to.\r\n\r\n\r\nElizabeth Knopf (28:30.87)\r\nAlright.\r\n\r\n\r\nNikolas Hulewsky (28:32.304)\r\nI mean, if you haven't seen this yet, it literally looks better than any CGI you will ever see in any Hollywood film. It looks real. I don't know how Hollywood will incorporate this. There has to be a way that they'll incorporate it. But since I've been a kid, you've always known from Toy Story on, this is CGI. It's gotten really good over the last few years. And so there are some things that you can't quite tell. This is indistinguishable.\r\n\r\n\r\nIt's it's or at least until you double click into it and take a look and you're like, oh, the lighting is a little off. He's got six fingers. Maybe that stuff shows off, but it. It's pretty incredible. Alright, so $125 a year.\r\n\r\n\r\nElizabeth Knopf (29:15.894)\r\nYeah, then this is their starting price. It's going to go up to 250. Sorry, it's per month. It's not per year. So it is expensive. It's expensive. But again, compared to your budget, if you would ever have to hire anyone for production, for video editing, I mean, it's a steal when you compare it to that. I mean, again, like all these prices for these things, you have to compare it to hiring real people to do this stuff. least that's the way I think about it to justify it. But yeah, it's not cheap. But again, like\r\n\r\n\r\nNikolas Hulewsky (29:41.958)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (29:45.014)\r\nRight now, if you want to go be, you know, create ads for your business, whether you want to do this for other people, I mean, we're just going to see an explosion.\r\n\r\n\r\nNikolas Hulewsky (29:54.938)\r\nMy question, is it good enough yet? Like, could I upload a video of myself and say, hey, put me in a video talking about X, Y, and Z, or is it like chat GPT where it spits out something, it's not great, and then it's like, well, edit this part of it, and then it edits a bunch of other things. You know I mean? Like, is it production grade yet?\r\n\r\n\r\nElizabeth Knopf (30:15.086)\r\nYes-ish. Like again, yes. Start getting to know it well and start knowing like prompting. Cause like, yeah, you still have to figure out sort of styles and what you want to communicate and you have to do frame by frame. So from what I've sort of gathered, the persistence from one frame to the next is not perfect yet, but again, is like orders of magnitude beyond like\r\n\r\n\r\nagain, anything that's been in existence. And I think you can create real ads. I we saw some of those examples that were stitched together, images and frames. So if you can think through a story that that's not as much of an issue, absolutely. And so like it's, can also build from a frame. if you do have an image, frames to video. again, like if you have, yeah.\r\n\r\n\r\nNikolas Hulewsky (31:04.217)\r\nYeah, that's insane. And what she means by frame is like you take a picture and you take it from there and say, hey, built this out.\r\n\r\n\r\nElizabeth Knopf (31:09.675)\r\nExactly.\r\n\r\n\r\nElizabeth Knopf (31:13.582)\r\nSo I don't have a good picture of you on hand yet, but maybe we can do some of those.\r\n\r\n\r\nNikolas Hulewsky (31:15.42)\r\nThat's okay. No, no, no, no, that's fine. They also introduced some AI powered smart glasses, correct?\r\n\r\n\r\nElizabeth Knopf (31:23.21)\r\nYeah, I'm not as familiar on the details of that, you know, everybody's coming out with devices.\r\n\r\n\r\nNikolas Hulewsky (31:26.982)\r\nOkay, here's my question, all right? How much was the pricing a month for this?\r\n\r\n\r\nElizabeth Knopf (31:34.03)\r\nIt was 125, I think, per month for three months, and then it came up to 250.\r\n\r\n\r\nNikolas Hulewsky (31:37.404)\r\nOkay, so it's $125 a month, could be up to 250. I just had last week, chat GPT tell me I had to delete some things, and I had paid like 200 bucks a month. So it's like, at some point you hit a limit of all the things that you're uploading and having it sift through for context. It's got me thinking about this question of where is the bottleneck? I think it's easy to take a look at this and say,\r\n\r\n\r\nHoly crap, it's changing so quickly. Everybody's jobs are done. We're done. But in order for that to happen, there needs to be enough power to run the models and to do the compute. And I'm not sure that we're even close to being able to do that. Especially, mean, Google's charging 150 bucks a month. I'm sure OpenAI is at some point is gonna release an agent and it's gonna be probably $60,000 a year, which is still cheaper than a full-time employee.\r\n\r\n\r\nBut at some point there's gonna be where we hit, I guess, compute cap. Am I thinking about it wrong or is that a thing?\r\n\r\n\r\nElizabeth Knopf (32:44.33)\r\nYeah, so it's actually I would say less. So yes and no. So right now there's a massive infrastructure built out. Everybody's investing like these big, you know, the big country investments are going into infrastructure. Data centers need to be built out. Already you're seeing improvements from Nvidia and there was a whole like it's stock dropped a whole bunch a couple like about a month ago or two months ago.\r\n\r\n\r\nBecause people thought that it was actually you needed less data. Deep-seq, this was the big deal of like you needed less compute. So there's a truth to both sides of that. Yes, there's going to be a capacity issue, but no, there's also improvements and technological advancement. So I think both things are true. It's going to get much more efficient. And as we saw with, was it Moore's law that, you know, every, you know, there's a doubling of capacity or whatever.\r\n\r\n\r\nevery couple of years that it's gonna be I think a similar thing maybe with compute like I don't know if that's the truth or not but I think the bigger bottleneck for the United States is a bigger issue and the real bottleneck is on the energy side and this is where I actually think small businesses have an opportunity so let me just show you a terrifying\r\n\r\n\r\nNikolas Hulewsky (33:50.448)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (33:53.776)\r\nguess that's what I meant is like, you've got to have the compute power and you can build out all the infrastructure that you want. Holy crap. I'm gonna just shut up. What are we looking at here?\r\n\r\n\r\nElizabeth Knopf (34:06.542)\r\nOkay, so this is the total electricity generation in the United States versus China. So the US, let me just pull off China here for a second, has barely been improving like since the 90s. Over 35 years, we've only improved.\r\n\r\n\r\nNikolas Hulewsky (34:23.984)\r\nThe X axis are years and the Y axis is what total power capacity? Terawatt hours, okay.\r\n\r\n\r\nElizabeth Knopf (34:27.95)\r\nYes, in terawatt hours. Yeah, so we've only gone from like slightly under 3,000 terawatt hours to now just above 4,000 terawatt hours over, yeah, over 30 years. And so we have not been adding to any of our energy needs and demands. And the energy required for AI is so much bigger. And right now our lunch is just getting eaten by China.\r\n\r\n\r\nNikolas Hulewsky (34:56.144)\r\nHoly crap. Yeah, if you can't see this graph, where do they intersect? What year is that?\r\n\r\n\r\nElizabeth Knopf (34:58.701)\r\nSo.\r\n\r\n\r\nElizabeth Knopf (35:02.19)\r\nThat was 2010.\r\n\r\n\r\nNikolas Hulewsky (35:05.244)\r\nOkay, 2010, China is equaling the amount of electricity generated as the United States. And just ever since then, I can't see the scale on the graph, but is it double? Are they double what we produce right now?\r\n\r\n\r\nElizabeth Knopf (35:18.03)\r\nmore than double. So it's at, they're up at 10,000 terawatt hours. And we're again, just above 4,000. So this\r\n\r\n\r\nNikolas Hulewsky (35:22.627)\r\nmy gosh.\r\n\r\n\r\nYeah, once you scale out, looks like we're a flat line and they're just going parabolic almost.\r\n\r\n\r\nElizabeth Knopf (35:29.006)\r\nExactly. So it's pretty terrifying and something where we really need to unlock our energy. And it's not like we don't have access to energy. So one big deal was on Friday, Trump just announced an executive order not to get into politics, but to unleash nuclear energy. So I think that's a big deal. But again, that's not enough. And you hear Elon Musk discuss that we have enough\r\n\r\n\r\nsolar power or that the sun has enough power that to basically power us all. But the problem of course is batteries. But again, maybe he'll go down that path and solve that. And I know a bunch of people sort of working on that problem. So hopefully that'll get solved. But the\r\n\r\n\r\nNikolas Hulewsky (36:03.568)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (36:14.172)\r\nSo what I was saying, what I was saying before you pulled this graph up is like, that's the point is we can build all the data centers. We can build all the infrastructure that we want. If we don't have the power capacity to generate what the demand is going to be, then none of that really matters. Unless we decide we want to have rolling blackouts and, and it like, Oh, it's compute time. Everyone shut off your computer. Everyone at home, retail, shut that off. We, we, let Microsoft get their power for the day. But it's.\r\n\r\n\r\nElizabeth Knopf (36:30.03)\r\nexactly.\r\n\r\n\r\nNikolas Hulewsky (36:44.604)\r\nSo I thought I was thinking about this over the weekend. And do you know Hector Resendez?\r\n\r\n\r\nElizabeth Knopf (36:50.178)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (36:51.42)\r\nOkay, so he has a trade school online and I was thinking people like him, I think are gonna just crush it over the next 10 years because what do you need in order to build out power stations, to build out infrastructure, to build out data centers and also to implement the data generation, not the data, but the power generation necessary to power everything. You need tradesmen, you need electricians, you need people who understand how to actually do this stuff. So I think the trades actually are probably going to see an even bigger explosion. I wouldn't be surprised if they start passing legislation.\r\n\r\n\r\nto fund trade schools, trade unions, trade, like, I think there's gonna be a renaissance of trade.\r\n\r\n\r\nElizabeth Knopf (37:27.544)\r\nSo this morning Trump also just announced that he's going to pull $3 billion from Harvard to send to the trades. So yes, yes. So that happens. So absolutely. And I mean, you already see that there's already investment happening with like, even with the Chips Act, which, you know, I don't know if you want to talk about that, but they did allocate to semiconductor training and a bunch of other sort of sectors. But I absolutely agree that the trades are, you know, we have labor shortages. We need people. I know a ton of people.\r\n\r\n\r\nNikolas Hulewsky (37:33.702)\r\nDid he really? my gosh.\r\n\r\n\r\nElizabeth Knopf (37:57.122)\r\nIn this case, I know you do too, that they need to find people. right now, upper, I mean, college degrees, the things people have been trained for, mean, half of it's not useful and the other half is getting automated with AI. So it's like the only place until the robots come is gonna be the trades. And to build all that stuff, need it.\r\n\r\n\r\nNikolas Hulewsky (38:15.356)\r\nYeah, I think it'll be interesting to see in the same way that many towns were created around oil, where it's like, this town has a big mining operation and they were just built like Elko, Nevada. Nobody freaking lives in Elko, Nevada, but the reason they live there is probably because they had some mining operation 100 years ago. I would bet there's probably going to be whole industries that come up with just servicing the transition or the creation of the power generation. Right. It's like, so you're like, well, I'm just an entrepreneur. own a restaurant.\r\n\r\n\r\nLike, okay, well, maybe you live in a place or you could move to a place that's going to be the data center of the future or the power generator. Maybe they're building a nuclear facility because now they have these really, anyways, there's a bunch of technology around that. So I think you're right. I think there are some interesting things you can just start thinking about as an entrepreneur of how do I take advantage of that even if I just stay in my same lane?\r\n\r\n\r\nElizabeth Knopf (39:06.456)\r\nAbsolutely.\r\n\r\n\r\nElizabeth Knopf (39:10.398)\r\nAbsolutely. Like data centers, they need cleaning. They need people to clean specialized cleaning that's premium. HVAC services are specialized. Cooling issues are a big deal. know, security systems, a lot of these places are going to be targets for, you know, whatever. So, I mean, there's a bunch of secondary effects that all these investments are going to be made. And so, yeah, you got to start thinking about.\r\n\r\n\r\nNikolas Hulewsky (39:16.102)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (39:32.124)\r\nYou said it when we first started, is that like, it could be a counterculture investment thesis. like, the technology is going this way. I'm going to invest the total opposite way. Everything you just said is a services business that's done by a human.\r\n\r\n\r\nElizabeth Knopf (39:46.744)\r\nAbsolutely, yeah. Until the robot.\r\n\r\n\r\nNikolas Hulewsky (39:48.7)\r\nLike that's a very interesting. Yeah, I don't know. mean, I think it's going to be a long time before the robots take over is my personal opinion. Not because the robots won't be able to do it. I think that mentally it's gonna be really hard for people to like grasp that and accept it. But that's my own personal opinion. So dude, Liz, was a, what a great week. Action packed. This was awesome. Thank you.\r\n\r\n\r\nElizabeth Knopf (39:58.722)\r\nYeah. Yeah.\r\n\r\n\r\nElizabeth Knopf (40:12.206)\r\nBut we didn't even get to Anthropic, which is like much more, so maybe next week we'll do it. Yeah, so.\r\n\r\n\r\nNikolas Hulewsky (40:16.374)\r\nI know.\r\n\r\n\r\nNikolas Hulewsky (40:22.908)\r\nGive us a teaser. What's going on with Anthropic?\r\n\r\n\r\nElizabeth Knopf (40:24.406)\r\nOkay, so real quick, Anthropic dropped a bunch of exciting stuff, very clear sort of their path. But again, they're just making tools like accessible to the average user. And so again, we sort of mentioned and teased model context protocol, which at some point we will talk about. But I'll be doing it in our school community, some deep dives on that because I've been obsessing over it. And I think just from a workflow that's not AI automation, and it's not AI agents, it's just really easy to set up and use.\r\n\r\n\r\nit unlocks a lot. It's like the potential of what custom GPT actions have. It's actually like very real and easy and accessible.\r\n\r\n\r\nNikolas Hulewsky (41:02.448)\r\nAll right, so this is the part in the show where you need to like and subscribe so that you don't miss next week episode where Liz actually shows us what this is and walks us through how to use it. Cool, Liz, this was awesome. Have a good weekend. We'll talk soon. All right.\r\n\r\n\r\nElizabeth Knopf (41:09.294)\r\nThank\r\n\r\n\r\nElizabeth Knopf (41:14.542)\r\nYou too.",
  "metadata": {
    "duration": "",
    "date": "2025-05-28",
    "platform_source": "Google Drive"
  }
}