{
  "episode_number": "49",
  "episode_title": "Making 240K/Yr from ONE Newsletter with Ryan Sneddon",
  "guest_name": "Ryan Sneddon",
  "business_name": "Annapolis Scoop",
  "transcript": "﻿Ryan Sneddon (00:00.869)\r\npodcast better.\r\n\r\n\r\nNik (00:02.126)\r\nRyan, welcome to Niconomics. I'm stoked that you're here. You're comfortable. You have a beer. We are going to get rolling right now. Tell me in a short sentence, what is your business and how do you make money?\r\n\r\n\r\nRyan Sneddon (00:14.821)\r\nSo my business is a localized email newsletter. We send email every weekday to the people of Annapolis, Maryland, about 19 ,000 readers, about 41 ,000 people in town. And we just tell them what's going on. Like where's the live music? What restaurant just opened? What's the city council up to? No crime, no politics. It's always positive. And we make money through selling advertising in that newsletter, just like a newspaper used to.\r\n\r\n\r\nNik (00:40.334)\r\nAnd you just have that one location in Annapolis or do you have other locations around the country?\r\n\r\n\r\nRyan Sneddon (00:44.805)\r\nJust the one for now, but the idea from day one, we're four years in now, the idea from day one was always to have more. And I think by the end of the year here, we'll either start another one that I'm the sole owner of or a partner in, or actually working on a cool licensing program. And I have some people interested in that. So it's one way or another teaser for later, maybe one way or another, there's going to be another scoop out there by the end of 2024 come hell or high water.\r\n\r\n\r\nNik (01:02.606)\r\nteaser for later teaser for later\r\n\r\n\r\nNik (01:13.294)\r\nHow did you get into it? What's your background?\r\n\r\n\r\nRyan Sneddon (01:16.837)\r\nnothing like this by I'm a mechanical engineer from school. I'm a software consultant by discipline, or like trade. I quit doing that. I never wanted to be an engineer. I just wanted the degree and one of the think like one. but while I was a software consultant, someone exposed me to the email newsletter, just as a content medium, not as a business model, but then I quickly got into it as a business model and decided that this was the one for me or the business model for me.\r\n\r\n\r\nNik (01:21.806)\r\nWhat?\r\n\r\n\r\nRyan Sneddon (01:45.701)\r\nLet's see, probably, so I quit my job in January of 2020. And then by July of 2020, I figured this was for me and started in August.\r\n\r\n\r\nNik (01:55.214)\r\nHmm. So a lot of people, especially on social media, are big into newsletters. And the reason for that is Instagram, Twitter, Facebook, Google, they can change their algorithm at any time. And if they change the algorithm, it changes how much your reach actually impacts the people that are following you. But with a newsletter, you own the email addresses, you have direct access to individuals. So especially recently, I've seen a lot of people trying to grow their newsletters over the last few years.\r\n\r\n\r\nWhat was your thinking as you were looking at this business that convinced you that you wanted to go in on newsletters in 2020?\r\n\r\n\r\nRyan Sneddon (02:33.573)\r\nIt was definitely that. And I've had little micro episodes of seeing that. Like every once in a while we'll hit a spam filter and our email usually has like a 65 % open rate. And sometimes it'll go down to like 30. And that's only ever happened twice or three times, three times in the last four years. But they've all been in the last two months. And so it's like, it's horrible when that happens. I mean, you're literally going from, I'm reaching 12 ,000 people every day to now I'm reaching six and\r\n\r\n\r\nNik (03:01.454)\r\nThank you guys.\r\n\r\n\r\nRyan Sneddon (03:02.053)\r\nThat's like a tiny micro heart attack that I have when that happens. But I can only imagine if you had a business built on Facebook or Google or anything like that, and you were getting 200 ,000 site visits a day. And then the next day you're getting 10 and there's no sign of it changing because Google changed the algorithm. They're not changing it back. For me, the open rate always bounces back up the next day. But if it wasn't going to, that would be so demoralizing. So that was part of it.\r\n\r\n\r\nNik (03:09.358)\r\nYeah.\r\n\r\n\r\nRyan Sneddon (03:28.229)\r\nIt was also just the, you know, I think I can do this. I think this is the best delivery format short of a text message. Everybody opens text messages, right? Pretty much everybody. There are some psychopaths out there with thousands of unread texts. Most people open their texts, but probably like the second best would be email. And so that was what really appealed to me was if you get someone's email address, that inbox is a trusted place. You can really start to build trust. You'll be there regularly and they'll know your name. They'll eventually.\r\n\r\n\r\nThey'll stop opening your email just because the subject line is good, but because they see the from line is you and you've built up that trust.\r\n\r\n\r\nNik (04:02.382)\r\nAnd you said you have 19 ,000 subscribers in Annapolis?\r\n\r\n\r\nRyan Sneddon (04:07.461)\r\nYeah, 19, 446, I just gotta look at the whiteboard behind me.\r\n\r\n\r\nNik (04:11.598)\r\nHow does the business model work? Like, how do you make money? I know you sell ads, that makes sense to me, right? But like, what is the economic model of selling ads actually look like? How's it generated?\r\n\r\n\r\nRyan Sneddon (04:24.293)\r\nYeah, so I basically looked at it in the beginning, picked a number out of thin air to charge for ads. and then said, what is my average customer worth customer being reader, not advertiser. And I said, if my advertiser or my readers will stay on for a year.\r\n\r\n\r\nNik (04:35.694)\r\nMm -hmm.\r\n\r\n\r\nRyan Sneddon (04:42.117)\r\nthen they're worth $7 at a 50 % open rate. So based on staying for a year, 50 % open rate, excuse me, and the price I was selling for ads, they're worth $7. So if I could run a Facebook ad and get an email subscriber for less than $7, I could be profitable. And both of those numbers were very conservative on purpose. The 50 % open rate was conservative. We've since gone higher than that, much higher than that, even though open rates are a little bit less accurate now, but we're still.\r\n\r\n\r\nwell above that and people stay on for much, much longer than a year. People don't unsubscribe very often to this. So that was my thought.\r\n\r\n\r\nNik (05:16.91)\r\nSo if I'm an advertiser, if I'm an advertiser and I'm like, and just broadly speaking for newsletters, I'm not talking about the hyper local that you have, but you have 19 ,000 subscribers. Is there like a dollar per subscriber that I pay you per month for ads or is it a per week per per letter sent? Like how, how do I, as the advertiser assign an economic value for the ad space in your newsletter?\r\n\r\n\r\nRyan Sneddon (05:45.381)\r\nSo there's a cost to it, which is the, it's loosely based on a cost per thousand impressions. It used to be a very common way of selling ads, digital space, but is a little bit less now with, like I said, especially open rates getting less accurate. Yeah, CPM cost per thousand, cost per mil, mil being like the Latin for thousand, I think. So that's how I loosely based it. But now it is, sorry, I'm gonna put on two dot disturb there.\r\n\r\n\r\nNik (05:56.558)\r\nCPM.\r\n\r\n\r\nRyan Sneddon (06:12.741)\r\nbecause I'm getting messages that I don't, they're distracting. Okay, we'll just restart again. So now it's still based on that, but basically being four years, we're pretty established now. Our subscribers grow a little bit every month, every week, every day actually. Basically now we've just set a price and like, here's the price is what you pay.\r\n\r\n\r\nBut I encourage my customers, my clients to look at it a little bit differently where I really push into them. What is your average customer value worth? And if you're going to pay me $800 a month or $1 ,500 a month based on what kind of ads you're buying, how many of customers do we need to get for you for this to become a profitable investment? And I don't think a lot of other people in town are selling that way, or I think they should be because that's the easiest way. If I can convince a dentist.\r\n\r\n\r\nthat, hey, you're a veterinarian, here's a real example. We have a dentist too, and they're killing it. But a veterinarian, the last time I talked to them, they've been advertising with us for about a year, and they've gotten 41 clients. Or that was two months ago, they've gotten 40 new clients. I haven't talked to them recently. But just for me, they've gotten more clients than that, but that's directly attributable to us. And I'm sure there's a little bit of slop there. We've probably sent them a little bit more.\r\n\r\n\r\nNik (07:17.902)\r\nWow, just from advertising with you.\r\n\r\n\r\nNik (07:26.382)\r\nyou\r\n\r\n\r\nRyan Sneddon (07:29.541)\r\nbut they know that they've got 41 from us. They know their average lifetime customer value. They actually didn't share it with us, but they're very happy with the results. And so they're renewing and they're very happy to pay their monthly bills. That's how I encourage my clients to look at it is what do you need to get? Don't think that this is an $800 a month marketing cost. That's the wrong way to think about this. Think about what do we need to do for you to get a positive return on investment? Because that's the thing, right?\r\n\r\n\r\nNik (07:57.87)\r\nYeah, so you're convincing them on return on.\r\n\r\n\r\nRyan Sneddon (07:59.333)\r\nIf I tell you that you can give me $800 and I'll give you 2000, wouldn't you do that all the time? Like that's the easiest sale in the world.\r\n\r\n\r\nNik (08:05.454)\r\nYeah. Yeah, so you're having them evaluated based on like a return on ad spend as opposed to just thinking about it as a cost.\r\n\r\n\r\nRyan Sneddon (08:12.741)\r\nI hate the term marketing budget. Whenever I hear that in the sales meeting, I try to switch it to return on ad spend. I don't want you to tell me that you have $2 ,000 a month to spend on all the places. I want you to find a place where you can give $2 ,000 a month and get 10 back. That's how you should be thinking about it. A lot of these local businesses, they don't think like that.\r\n\r\n\r\nNik (08:30.062)\r\nBecause marketing.\r\n\r\n\r\nMarketing theoretically should be a game of I know that if I put X dollars in I get Y dollars in return. It shouldn't be a\r\n\r\n\r\nRyan Sneddon (08:41.317)\r\nOr even better formula, like if I put X dollars in, I get three X back. That's a, I think it easier to understand one. Yeah.\r\n\r\n\r\nNik (08:47.022)\r\nYes, much better said, much better said than than what I said. But so many times it's like, well, I put x dollars in and I get, you know, I don't even know back. I did a question. Right.\r\n\r\n\r\nRyan Sneddon (08:57.349)\r\nThey don't even know what they get back. Yeah, that's a real problem. Or they don't even know what their customer value is worth. Like I said, mine is very, very conservatively valued at $7 a subscriber. It's way more than that because they stay on for more than a year and our open rate's higher. But I know if I run a Facebook ad and I'm getting an email address for less than $7, I know I'm making money. We kind of hinted at the portable toilets. On that one, I know I have like $1 ,800 to spend on a customer.\r\n\r\n\r\nNik (09:05.166)\r\nYeah.\r\n\r\n\r\nNik (09:17.742)\r\nOkay, I'm gonna.\r\n\r\n\r\nRyan Sneddon (09:26.181)\r\nI can spend that to acquire them. If I have to buy a customer a Yeti cooler to get their deal, I can still do it because I know I'm making money.\r\n\r\n\r\nNik (09:34.094)\r\nI want to drill into this lifetime value customer acquisition costs because I can tell that you are not only smart and knowledgeable about it, but you, you like it. So.\r\n\r\n\r\nRyan Sneddon (09:41.893)\r\nI do like it because more people need to know this. You ask them how much their customers are worth and they're like, I don't know. And you're like, how are you have been in business for 20 years?\r\n\r\n\r\nNik (09:44.942)\r\nBut I know it.\r\n\r\n\r\nSo.\r\n\r\n\r\nBefore I do that though, I just wanna tie a bow around this newsletter subscriber thing. So my understanding is there's kind of three metrics that are really important when you're talking about your newsletter. Obviously the number of subscribers and then the open rate and then the click through rate are the three things, right? Those are the three kind of numbers that people play with.\r\n\r\n\r\nRyan Sneddon (10:17.381)\r\nThose are the three things that I have on my board behind me. Yeah. Those are the three things I care about. And I write an up arrow if they're up week over week and a down arrow if they're down. Cause we have, now we have people in the office. So it's, I like them to see that.\r\n\r\n\r\nNik (10:19.854)\r\nDo you?\r\n\r\n\r\nSo.\r\n\r\n\r\nNik (10:27.534)\r\nWill you just give me like a.\r\n\r\n\r\nNik (10:32.462)\r\nyou like them coming into your office and you just point to the board, they ask you a question and you're like, I'm not.\r\n\r\n\r\nRyan Sneddon (10:36.293)\r\nNo, no, no. I mean, not the team. I like the team, like the social media team. I like them to see in the editors. I like them to see, the click rates up this week. We've done good. the click rates down. Why is it down? I love them to see that.\r\n\r\n\r\nNik (10:48.654)\r\nDo you have it on a whiteboard?\r\n\r\n\r\nRyan Sneddon (10:50.469)\r\nYeah, we have an eight foot by four foot whiteboard over here behind me. It's my favorite thing I've ever bought for the office.\r\n\r\n\r\nNik (10:52.622)\r\nI love it. At one of my offices, we had a big whiteboard like that, and I had a girl who worked for me. She was fantastic, and she got out the electrical tape, and so she made the grids on the board so you could easily erase everything, but it was so clean. She had all the categories, all the dates, and she would go once a month and update the headers for the rows and the columns, but.\r\n\r\n\r\nI love that thing because I was walking and be like, all right, where are we at today? Cool. And we tried to do it.\r\n\r\n\r\nRyan Sneddon (11:23.621)\r\nYeah, I update mine every single day. We've got accounts receivable for advertising, our overdue accounts receivable, newsletter subscribers, Instagram followers, a seven day open rate and a seven day average click rate. And those are right now, those are the numbers we've decided to track every single day.\r\n\r\n\r\nNik (11:40.046)\r\nAll right, so tell me those numbers again. What was the first one?\r\n\r\n\r\nRyan Sneddon (11:44.101)\r\nAccounts receivable. So services delivered and we need to be paid. And then.\r\n\r\n\r\nNik (11:45.806)\r\nOkay.\r\n\r\n\r\nNik (11:49.326)\r\nSo for accounts receivable, they don't pay you right away. You have like what, net 30 days?\r\n\r\n\r\nRyan Sneddon (11:53.189)\r\nWe have net 30. Well, it's net 30, but it's like pretty flexible net 30. So I bill on the first day of every month for the last day. It is a, it is a flex. It is anywhere from net 30 to net 60 basically. So I bill on the first day of the month for the last month's advertising. So on June, July 1st, I'm billing for every piece of advertising we ran in June. And then that's due on August 1st. So if your ad ran on June 1st, I bill you on.\r\n\r\n\r\nNik (11:59.502)\r\nIt's a flexible net 30.\r\n\r\n\r\nNik (12:07.118)\r\nOkay?\r\n\r\n\r\nRyan Sneddon (12:21.253)\r\nJuly 1st, it's due August 1st. That's actually really net 60. But if you're ad run on the 29th of June and I bill you on the 1st and then it's due, that's like more like net 30. So it's anywhere from net 30 to net 60. And it's kind of annoying. I kind of hate it.\r\n\r\n\r\nNik (12:30.414)\r\nInteresting. I would have assumed your, I would assume your business was like you're paying upfront. So you have almost like negative working capital.\r\n\r\n\r\nRyan Sneddon (12:40.357)\r\nSome people do, I do encourage that and I offer a discount for that, but our average customer is paying about $5 ,800 a year and a lot of these businesses can't just write a check for that. And some of them are paying upwards of 20 and they can't just write a check for that. So we do break it out month over month, but about 10 % of them do pay upfront and those are my favorite, obviously.\r\n\r\n\r\nNik (13:00.398)\r\nOkay, makes sense. All right, so you got.\r\n\r\n\r\nSo you got AR, what were the other metrics?\r\n\r\n\r\nRyan Sneddon (13:06.693)\r\noverdue AR because I like to see who I need to bother or how, how badly do I need to bother people? Like right now it's pretty bad. Like our AR is 35 ,000 and our overdue is 16 ,000. And I'm like, okay, who do I need to call to be like, how do I get the overdue AR done? Cause like anything more than 30 months or 30 days or more, more than one day late, anyone who hasn't paid within their 30 day pay period. And so I think.\r\n\r\n\r\nNik (13:11.31)\r\nOkay? Okay?\r\n\r\n\r\nNik (13:20.238)\r\nWow.\r\n\r\n\r\nNik (13:23.95)\r\nWhat qualifies as overdue?\r\n\r\n\r\nNik (13:34.126)\r\nWow, okay.\r\n\r\n\r\nRyan Sneddon (13:36.005)\r\nI think that's one client or pretty much one client right now who wanted to pay upfront and it's, it's late, but it's kind of not late. It's weird how it's set up. but it's still like, okay, there's money out there that we need to get. How do we get it? And then underneath of that is our newsletter subscribers, our Instagram followers, our seven day average open rate and our seven day average click through rate.\r\n\r\n\r\nNik (13:59.758)\r\nSo you send daily newsletters.\r\n\r\n\r\nRyan Sneddon (14:02.181)\r\nWe send five days a week, every weekday.\r\n\r\n\r\nNik (14:06.03)\r\nI'm writing all this down. How long did it take you to come up with those metrics as like, those are the metrics for the business?\r\n\r\n\r\nRyan Sneddon (14:16.06)\r\nthose were like two months old. I've, we've never had an office and I've never actually had the metric. Well, that's not true. Maybe six months old. because I had a tiny whiteboard in my home office where I had those numbers, but I was messing around with them and figuring out which ones were the right ones. So I think about six months is when I started really looking at that and looking at them and updating them every day.\r\n\r\n\r\nNik (14:40.942)\r\nBecause I've always said, and I believe that when you're trying to evaluate the health of your business, many people focus on the P &L. And they're like, I made X number of dollars last month. But the P &L is important, but the P &L really is a lagging indicator of where your business is. And for a business like yours, when you're not collecting upfront, like health care is the same way, there's this lag in between when you provide the service and when you get paid. We're not McDonald's, where when I go to McDonald's, I pay for the burger right away.\r\n\r\n\r\nwe have this period of time where we're floating costs in order to continue to operate. And so sure, you could have a month where, hey, I made $15 ,000 of profit, but if you've got overdue AR of 20 ,000, your cash flows, you're out $5 ,000. And so what does it matter if you're profitable if you're not actually collecting that stuff? So it takes a while for people to really understand like, the cash game is actually different than just optimizing for the P &L. And you, I mean, two months in, you were like, we're gonna figure this out.\r\n\r\n\r\nRyan Sneddon (15:35.685)\r\nYeah, I, no, no, no. I mean like it took me probably three and a half years to figure that out. and, and yeah, no, I mean, I figured this out six months ago. we ran out of money twice before I figured this out and you would think it would only have taken once, but we definitely ran out of money twice. And now I finally figured it out. Cause I'm like, all right, I'm not doing it a third time. We're not running out of money again.\r\n\r\n\r\nNik (15:42.51)\r\nNik (15:50.318)\r\nmy gosh.\r\n\r\n\r\nRyan Sneddon (15:52.905)\r\nIt\r\n\r\n\r\nRyan Sneddon (16:01.381)\r\nWell, the second time, no, the second time kind of just sucked. But the first time running out of money was actually pretty useful because I stopped spending money on basically everything I could. And I stopped spending money on ads to acquire new subscribers. And then we had to get creative and kind of focus on organic growth, which is we still haven't spent money on ads since. So the first time was kind of a blessing. The second time just kind of sucked, but it's never happening again. Yeah, not doing that again. It took me a long time. And I like the portable toilet business because\r\n\r\n\r\nNik (16:20.046)\r\nJust freaking suck.\r\n\r\n\r\nNik (16:26.318)\r\nNo, it's -\r\n\r\n\r\nRyan Sneddon (16:31.237)\r\nAs soon as people want to book, they give us a deposit, that money goes in the bank, and then they ought to pay for their rental a month before the rental happens. So by the time I'm actually delivering the toilet, I'm already paid, it's all good. And if they don't pay, I just don't deliver it.\r\n\r\n\r\nNik (16:45.838)\r\nWell, like in healthcare, I'd always tell people our average days to collection was 45 days. So think about it like this. If I take 45 days to get paid for a service rendered, then I've got a float cost for 45 days. That's already hard enough. But what if you're growing and things are going great and you double your census or you double the number of patients that you have?\r\n\r\n\r\non paper, it's like, we got all this revenue. And that's amazing. Let's hire these nurses. Let's bring on more people. Let's expand to a new office. But I don't get paid for a month and a half. So how do I do that? How do I onboard these people? How do I make sure that I have the money necessary to actually grow in the right way? And like, so cash flow management is incredibly important. And until you get burned a couple of times, like you have, you don't prioritize it the way you should. And then once you do get burned, you're like, never again.\r\n\r\n\r\nRyan Sneddon (17:36.165)\r\nNo, and I, I can't well, after the second time for me, I can't believe it took that long. I'm like, usually I learn things after one mistake, but it did take me two on that. but I am never making that mistake again, like for the new business, the toilet rental, that's like clean, hygienic good from day one that\r\n\r\n\r\nI'm never making that mistake again. And if we do any, anyone that we do do like a license for this for, and they're operating this business outside of me, I'm not going to be a partner in it. That is going to be something we help them with where it's like, these are the numbers that matter. It's great that you sold 200, even let's pick a crazy number. You sold $200 ,000 of ads last month. That's awesome. But some of that you're not going to get paid for for two years. So you need to really be smart.\r\n\r\n\r\nNik (17:58.158)\r\nI love\r\n\r\n\r\nRyan Sneddon (18:23.909)\r\nWe have people who want to sign three -year contracts and it's great. Yeah, we just signed a $50 ,000 deal, but it's going to take three years to get all that. So we can't just go celebrate right now.\r\n\r\n\r\nNik (18:37.39)\r\nI love how you describe the toilet business. You're like, yeah, I mean, we started that up. That one's that's that one's clean. It's hygienic. I'm not dealing with this crap. You know what I mean?\r\n\r\n\r\nRyan Sneddon (18:45.064)\r\nThere's so many jokes to be made in that. When we do it, if we do another episode talking about that, I'll dive into that more. You just can't be, you can't take yourself seriously if you're making a living renting toilets. It's, it's, you just have to lean into that.\r\n\r\n\r\nNik (18:54.926)\r\nSo good.\r\n\r\n\r\nNik (19:00.366)\r\nSo tell me how big is the local newsletter business? Like how much revenue are you generating a year and what does bottom line performance look like?\r\n\r\n\r\nRyan Sneddon (19:11.461)\r\nSo this year, or probably best to go on last year, last year was 240 top line and about 60 bottom line. The 240 there sounds kind of misleading because about 40 of it is an event that we do where we donate all the profits to a charity. So that's just 40 in, 40 out. It just, that's a vanity top line number, if you will.\r\n\r\n\r\nwhat actually got paid to me and helped me pay the bills was the 60 on the bottom line and the goal this year, it is 400. Probably not going to hit that. it was 350 and then my sales guy was like, let's make it 400. So made it 400. We're probably not going to hit that. we probably, you know what? I'm hoping he's listening. We're probably not going to hit 350 either. So get after it, Mike. but yeah, if we make 350, it should be 120 bottom line.\r\n\r\n\r\nNik (20:01.806)\r\nAnd so how many subscribers did you have over the course of last year? Was 19 ,000 pretty steady or did you start really low and work up to 19?\r\n\r\n\r\nRyan Sneddon (20:09.829)\r\nNo, it grows every month. I actually, I'll pull it up right now because I have.\r\n\r\n\r\nNik (20:15.438)\r\nbecause I'm just doing the math. Let's just say that it was 19 ,000 for the whole year. Your revenue per subscriber last year was like $11 almost.\r\n\r\n\r\nRyan Sneddon (20:26.245)\r\nNo. So why doesn't this actually tell you how many? So in the last 12 months, we've gained 3 ,500. So, here we go. So 12 months ago we had 16 ,000. Today we have 19 ,000. Actually, 19 ,446 isn't right.\r\n\r\n\r\nNik (20:41.518)\r\nSo let's just say for argument's sake, 17 ,000 was your average subscribers in 2023. 200 ,000 was your top line revenue because you donated the 40 ,000.\r\n\r\n\r\nRyan Sneddon (20:55.077)\r\nWell, we didn't donate the $40 ,000. We donated about $5 ,000. Parties are expensive, so we spent about $35 ,000 on the party and donated $5 ,000.\r\n\r\n\r\nNik (21:02.478)\r\nOkay, but like you said, it's an event. No, that's awesome. I'm just saying that's an event that you do that's kind of outside of your business. So that is $11 .80 essentially is 200 ,000 divided by $17 ,000.\r\n\r\n\r\nRyan Sneddon (21:04.165)\r\nIt's a really fun, good party.\r\n\r\n\r\nRyan Sneddon (21:10.501)\r\nYeah, it's a wash. It's 40 in, 40 out.\r\n\r\n\r\nRyan Sneddon (21:20.677)\r\nYeah, so that goes back to that seven I told you about. The seven is super conservative.\r\n\r\n\r\nNik (21:25.262)\r\nSo as you're looking at that, like how long do you keep subscribers? What's your churn like?\r\n\r\n\r\nRyan Sneddon (21:33.797)\r\nWe lose about three to eight a day. And so in that same time period, we, let's see, 12 months audience, we gained 5 ,368, but 1 ,838 unsubscribed. So the net positive was 3 ,530.\r\n\r\n\r\nNik (21:41.934)\r\nSo let's just.\r\n\r\n\r\nNik (21:54.062)\r\nAll right. So you're churning a year close to 10%. That's actually a good churn. That's really good churn.\r\n\r\n\r\nRyan Sneddon (22:02.053)\r\nYeah, it is. When you think about it, it's fine, but like also the population of Annapolis isn't growing that fast. And so at some point we're going to have to start winning them back or getting them in another way. Maybe daily was too much for them. Maybe we just give them a weekly update. you know, I think we can get to you. That's the only problem with a local newsletter is you have a smaller tam.\r\n\r\n\r\nNik (22:11.95)\r\nHmm.\r\n\r\n\r\nNik (22:22.958)\r\nwith\r\n\r\n\r\nNik (22:27.31)\r\nWith all of that data, so what is your LTV for a subscriber?\r\n\r\n\r\nRyan Sneddon (22:33.573)\r\nI don't actually know, because I don't know how many years they stay, because we're only four years in.\r\n\r\n\r\nNik (22:36.654)\r\nWell, just do this thought exercise with me, right? Let's just say that 10 % churn every year.\r\n\r\n\r\nThat means it will take you seven years to turn over your entire customer list. So if that's the case, your LTV is going to be seven years. All right, so seven years.\r\n\r\n\r\nRyan Sneddon (23:03.909)\r\nYeah. So 77 around about there.\r\n\r\n\r\nNik (23:06.894)\r\n77, okay. So for kicks and giggles, let's say it's $77. How do you think about your customer acquisition costs? How much does it cost you to acquire a customer?\r\n\r\n\r\nRyan Sneddon (23:18.437)\r\nAt the current point, we don't do any kind of paid marketing. So it's a little bit more complicated than you'd have to be like, well, what percentage of my writer's time is dedicated SEO content and that sort of thing. In the beginning, it was just very simple. It was how much do they cost to get an email address from a Facebook ad? That was the only number I cared about.\r\n\r\n\r\nNik (23:22.094)\r\nThat's right.\r\n\r\n\r\nNik (23:39.584)\r\nAnd so at this point, everything, when you say organic, what does that mean?\r\n\r\n\r\nRyan Sneddon (23:44.101)\r\nIt means people are sharing it with their friends either through our referral program, or they're just sending it to them. People are looking at our SEO content. Like we best pizza in Annapolis. We better than Yelp for that. And people there's obviously there's big whatever pop -ups. wait, you know, if you'd like this, get more that kind of thing. Best electricians, best coffee shops, all those kinds of local focus, any kind of search like that. Try to be number one for that.\r\n\r\n\r\nNik (24:07.662)\r\nAre you, are you writing all of that? Or like, who's doing that for you?\r\n\r\n\r\nRyan Sneddon (24:12.293)\r\nI wrote in the beginning, now we have writers to do it.\r\n\r\n\r\nNik (24:14.798)\r\nOkay, so there is some cost to the customer acquisition if you factored in the fact that they're right, they're doing that type of marketing. It's not pay per click. Yeah, yeah, totally.\r\n\r\n\r\nRyan Sneddon (24:20.261)\r\nYeah, it's just more complicated than just looking at the Facebook. Yeah. So there, there is some cost to it, but the referral program, there's not much cost to, because our first level, our first milestone is free for us to fulfill. So that is just basically just free subscribers. I guess we have a B we have, we pay beehive a monthly fee, but that is just the cost of sending the emails.\r\n\r\n\r\nNik (24:39.31)\r\nSo.\r\n\r\n\r\nNik (24:45.358)\r\nWhat exactly is your newsletter? What does it look like? What are you offering in it? How long does it take for the consumer to get through it all?\r\n\r\n\r\nRyan Sneddon (24:55.589)\r\nSo nobody reads the whole thing. So if you read the whole thing front to back, it would be probably three to four minutes, but nobody reads the whole thing. It's broken down. There's a top story. Sometimes there's not always a top story, but that's usually reserved for a really big thing in town or something that we're promoting.\r\n\r\n\r\nIt's maybe it's our party or a massive thing. Like if the president were coming to town, that's going to be the number one story. That's our headline thing. Be like the front page of the newspaper basically. And then there's an ad. Yeah, it's basically it's a newspaper. Then there's an ad and then there's a section called diet, the digest, which is like the miscellaneous stuff underneath that there's local business news. Like we got a new restaurant. This restaurant's closing. We got a new boutique or this one expanded or something like that.\r\n\r\n\r\nNik (25:20.814)\r\nYeah, it's a newspaper.\r\n\r\n\r\nRyan Sneddon (25:39.365)\r\nThen there's a featured Instagram post. That's just pretty. It makes people happy. Then the real, real kind of value is the next one is what's happening. And that's what parties can I go to? Like what big fundraisers are fun? What, what am I, what can I bring my kids to this week? What's going on this weekend?\r\n\r\n\r\nNik (25:55.662)\r\nHmm.\r\n\r\n\r\nRyan Sneddon (25:57.349)\r\nAll those sorts of things. Then below that there is a civil news section, which is like what the city council is up to if we're changing laws or boring government stuff. And then a little bit down further, there's the weather. I don't know why people like the weather in there, especially since we have all these apps and they got to know that.\r\n\r\n\r\nThis weather is getting put in at 6 PM the night before and you're reading it at 6 AM or maybe noon or whenever you're reading it. It's not the most up -to -date forecast and you could literally just Google an appless weather and get something or get your favorite app out. But I asked people if we could get rid of it and they were like, no, don't get rid of it. So we've made it, we've added a couple of things there that make it a little bit more useful, like wind speed. We're a big sailing boating town, so that's important.\r\n\r\n\r\nWater temperature is important in the summer or the winter, kind of in the summer too. So you can what about jellyfish, but definitely in the winter, if your boat's still in the water or something like that. And then our most popular thing by far by a mile is almost at the very bottom. It's right near my lowest tier of ads for a reason, because it's the most popular thing. And I got to get people down there to the ads. It's the live music calendar. So it's got probably 80 % of the music that's happening in town. it's very comprehensive. It's.\r\n\r\n\r\nNik (27:04.174)\r\nHmm.\r\n\r\n\r\nRyan Sneddon (27:11.653)\r\nBroken out by day, by venue, you can see exactly who's playing, what time and.\r\n\r\n\r\nNik (27:17.166)\r\nWho aggregates all of this stuff for you? That's a lot of stuff in that newsletter. How are you systematizing it?\r\n\r\n\r\nRyan Sneddon (27:23.121)\r\nSo the live, anything that's like programmatic, like that live music calendar in the sports seasons for the college sports here, it would, that, that would be a programmatic thing. All of that is done completely 100 % by an administrative assistant.\r\n\r\n\r\noverseas works in the Philippines. She's amazing. Definitely more morphed into an operations assistant than an administrative assistant now. And then she also compiles all of the other stories. So we're checking a bunch of places. People are sending us stuff. She just puts it all in a pile. And my editor used to be me. Now it's an actual person, different person. She looks at it every day and says, we're going to cover this, that, this, and nothing else.\r\n\r\n\r\nNik (28:02.958)\r\nwhere does your editor get all the stories from? People just send it in or you're on Twitter all day or like what are you doing?\r\n\r\n\r\nRyan Sneddon (28:07.365)\r\nPeople send it in, we're on Twitter, we're on Instagram, we're on Facebook, we're in Facebook groups, we're looking at websites, we're on press release lists. It's almost all, we're going, yeah, we're going to look for it. We get a lot sent in now, which is really helpful, but we're going to look for a lot of it.\r\n\r\n\r\nNik (28:13.006)\r\nSo it's out, you're outbound, you're like being proactive.\r\n\r\n\r\nNik (28:24.59)\r\nDo you think this model is replicable in other cities? And if you do, what do those cities look like?\r\n\r\n\r\nRyan Sneddon (28:32.581)\r\nI absolutely think it's replicable. I always say.\r\n\r\n\r\npeople are the same everywhere. They want to know what they can do on the weekends. They want to know what restaurant they can try. If the new restaurant opened, they want to know if it's worth the money because not everybody has the flexibility like me. I get to go to these new restaurants or send someone to these new restaurants and it's a cost of our doing business. Our job is to tell people if they're good or not. A lot of times, sometimes the meals get comped anyway. Even if they don't, the meals are right off because it's just a cost of our doing business. It's not like a typical business meal where it's just\r\n\r\n\r\nNik (29:02.158)\r\nYeah.\r\n\r\n\r\nRyan Sneddon (29:02.981)\r\nthe normal write -off, like we're reviewing it for people, so it's actually a cost of doing business. But not everybody has the flexibility. Not everybody can go to the new restaurant and drop $400 on a meal because they gotta try everything and take pictures, because they gotta tell 20 ,000 people about it in the morning. So the average person wants to know, is it worth me spending my money to go to this new restaurant? And so we do that for them. I can't remember exactly what you asked, actually.\r\n\r\n\r\nNik (29:28.558)\r\nWhy do you think it's the...\r\n\r\n\r\nRyan Sneddon (29:32.933)\r\nyeah, will it work in other cities? So absolutely. People always want to know stuff like that in any city.\r\n\r\n\r\nNik (29:37.902)\r\nMedia is just taking a hard hit, especially traditional media, print media, even cable media. Why do you think your business is able to stay viable when those are going out of style? Why haven't they adapted to becoming hyper -localized to stay profitable? Why are they continuing to shut down?\r\n\r\n\r\nRyan Sneddon (29:59.781)\r\nProbably the short answer is because they're too big. This is done. I'm full time, but I'm not even full time anymore because I'm working on the toilets and I'm having fun and I'm going golfing and going boating sometimes. And I'm working on other stuff. So I'm not even really full time anymore. But I was the only full time for a while. But then I have one full time operations assistant and everybody else is part time. They're they're contractors, they're freelancers. And I think.\r\n\r\n\r\nNik (30:11.79)\r\nworking on the toilets.\r\n\r\n\r\nRyan Sneddon (30:27.173)\r\nWe have these big media businesses that have to do a similar amount of content. They might have four full -time people and they're spending so much more money on it. And I think also just not everybody, I think this is a plague in the journalism world. They want to tell you what they want to tell you about. I'm a journalist. I know what you need to rereading about. I am smarter than you.\r\n\r\n\r\nThis is important. You need to pay attention. And I think that's such a wrong way to look at it. I think about it the other way. What does our audience care about? Let's just give them more of that. Like, I don't care if our audience cares about, this is an example of something we actually do and it's a lot of fun. It's not something I don't care about, but it's a, we, we review the crab cakes at all of our local seafood restaurants and it's super fun. I love doing it. But at the end of the day, if I didn't like crab cakes, but we made a video.\r\n\r\n\r\nreviewing the crab cakes and 25 ,000 people watched it in our town of 41 ,000 people, you better believe that I would keep reviewing crab cakes and people just in this industry, I think they think they know better than you and they don't give their audiences exactly what they want. Maybe they're not paying attention to what they're clicking on. Maybe they're not paying attention to what they're reading, but I think it's also a combination of they're just too big and their costs are too high. They're just not thinking about it right.\r\n\r\n\r\nNik (31:37.262)\r\nSo.\r\n\r\n\r\nNik (31:48.462)\r\nAnd they're focusing, kind of what you're saying is they're focusing on editorializing their content, whereas you're just reporting on what is.\r\n\r\n\r\nRyan Sneddon (31:59.845)\r\nYeah, at the end of the day, we're entertainers.\r\n\r\n\r\nNik (32:01.102)\r\nHey, give me one second. My kids are banging on something. Hold on one second.\r\n\r\n\r\nNik (32:36.078)\r\nSorry, one of my kids had like this drum tied around their waist and we're just like playing. I'm like, dude, I don't care if you play it, just don't be by my window. my gosh. All right, let me ask you that question one more time. So it sounds like traditional media has kind of leaned into editorializing things as opposed to just reporting.\r\n\r\n\r\nRyan Sneddon (32:44.837)\r\nNo, no worries.\r\n\r\n\r\nNik (33:04.526)\r\non what is, what's going on and what people are interested in.\r\n\r\n\r\nRyan Sneddon (33:08.869)\r\nYeah, I think it's a lot of arrogance to be completely honest. I don't think I know any better than anybody in this town, what they should think about or what they should care about. I just pay attention to what they do care about and I give them content around that. I don't, I don't sometimes care about it, but I know that other people are like, we wrote a story.\r\n\r\n\r\nabout sharks in the Chesapeake Bay. We're right on the Chesapeake Bay here. I think it's the biggest estuary in the country, maybe the world. It's a great body of water. We boat on it all the time. And we do have some sharks in it. And I don't care at all what kind of sharks are in the bay, because I never swim in it. It's dirty. I'm not swimming in it.\r\n\r\n\r\nI know that I'm not going to get hurt by a shark in there. And I know that even if I do swim in it, very low likelihood that a shark is going to attack me. The only reason that I would care about what sharks are in there is just because I think it's cool. And I would want to tell as a fun fact when I'm out on the boat, maybe, but I'm not going to read it. We actually are my editor.\r\n\r\n\r\nShe wrote the story. She did all the research, hundreds of people clicked on it. Thousands of people actually, if you combine all the emails we promoted it in, that's great, but I don't care at all. I'm not going to read it. And I think there's so much of this.\r\n\r\n\r\nas an editor, as a publisher, there's so much this attitude that I know what's right and you, the readers need to listen to me because I'm smarter than you and I'm in the, I'm doing all the research and I'm, I'm in the know. And it should actually be the other way of, you know, turn, turn the year around and listen to what they want and just give them that. You know, why are you losing readers? Cause you're not giving them what they want.\r\n\r\n\r\nNik (34:50.734)\r\nI've been fascinated by this space. I told you this on the pre -call, but I heard Andrew Wilkinson talk about this a few years ago, and I've seen just a lot more of these hyper -localized newsletters becoming popular. So your model just makes sense to me because people wanna know locally what's going on. How do you scale this though? Like if you were to go and do another city, how are you thinking about growth? And you kind of talked about it earlier.\r\n\r\n\r\nBut what's the plan over the next year or two as you think about expansion?\r\n\r\n\r\nRyan Sneddon (35:27.685)\r\nSo when I started, it was, I'm going to do a, the number I've always picked the magic number is I'm going to, I'm going to a hundred of these things are all around the country, all around the U S a hundred of these local newsletters. And when I first started, I thought that I would start and own them all. The problem with that is you're basically operating a hundred businesses at that point. And I don't know how many businesses you own, but I own two actually in the process of buying a third, but the third one's very small.\r\n\r\n\r\nAnd that is hard. I can't run a hundred businesses. There's no way. And it doesn't make any sense also to hire, like, I know that you talk about Andrew Wilkinson, Andrew Wilkinson hires CEOs, sometimes hires CEOs to run multiple businesses. It doesn't make any sense to do that because they're all the same kind of business. And so the way that I think this works best is with a local operator.\r\n\r\n\r\nand some guidance. And so that's what I'm doing now is finding people in cities that match this under 250, 300 ,000 person, but also like a cool city. People are excited to live there's lots happening. Hopefully the population is growing. It's a lot of investment maybe is a good sign. I'm trying to find some people in those cities who want to do this, but don't really know exactly how to do it and either partner with them as an actual business partner or\r\n\r\n\r\nBasically license everything I've learned to them and then get this thing operating and they can get to the point that it's taken me four years to get to in one year because they don't have to make any of the same mistakes again. Like they don't need to run out of money because they're running Facebook ads too fast. They don't need to run out of money because they have no idea how to do accounting. Like all those things, they don't need to run out of money because they don't know how to sell ads. Like all those things I can do.\r\n\r\n\r\nJust help them get to the point that I'm at faster. That's where I've leaned into now is the path forward to get this to scale.\r\n\r\n\r\nNik (37:28.334)\r\nIt's interesting because you kind of have three potential channels that you could grow into. One of them is you just own everything. But in order to do that, you've got to figure out what can I centralize that is independent of local needs, right? Like payroll, accounts payable, maybe the sports calendar, maybe that's something like that.\r\n\r\n\r\nBut because it's hyper local, you need an editor who's local. So like the editing, you can't really centralize, right? Because you want somebody whose boots on the ground understands that market.\r\n\r\n\r\nRyan Sneddon (38:05.285)\r\nYou, you absolutely cannot centralize that. Cause that's part of the difference is I know what's going on in my town and my editor now knows what's going on in town. because she's grown up here. She knows the city. She lives here. She loves it here. You can't centralize that. I am not arrogant enough to think that just cause I did it here, I could do it again and be the editor in Frederick, Maryland, which is about an hour and a half away or Cedar park, Texas.\r\n\r\n\r\nI don't know anything about those communities. I've been to Frederick twice. I've never been to Cedar park. I can't do it there. And so there are things you can centralize and there's things you can't, but there's also benefits. Like I didn't realize this when I first started, kind of figured it out by accident. When you do this and you attach your face to it, and I think you should attach your face to it because I always say this, people connect with people, not brands. So you put your face on this, you become the publisher, the editor.\r\n\r\n\r\nand people know you around town, there are some nice benefits to that. I get to go to pretty much any fundraiser in Annapolis that I want without paying for it. I am sometimes I get invited to weddings because people are like, I wouldn't, you're, I wouldn't have you like, you become a little bit of a rock star celebrity kind of thing. And that's fun. If you like it. I'm, I used to be super extroverted, super public. And as I've actually experienced that a little bit, I've gone.\r\n\r\n\r\nNik (39:11.662)\r\nThat's awesome.\r\n\r\n\r\nRyan Sneddon (39:30.565)\r\nvery private, but you still get to enjoy all the benefits of it. You just go and have service level conversations and you don't often meet like deep, deep connections of these things, but you still get to go and enjoy them and meet cool people. And maybe you make some of those cool connections, but I don't need that benefit in Cedar Park, Texas or Frederick Marion, like I said.\r\n\r\n\r\nthose two examples I keep using. I don't need to be a rock star there because they're never going to go there. I'm never going to live there, but somebody else can live there and they can get that benefit. I can get a little bit of financial benefit by helping them, but they can get most of it. And I feel like that's the real way to scale.\r\n\r\n\r\nNik (40:01.518)\r\nYou know what?\r\n\r\n\r\nNik (40:07.886)\r\nI think it'd be really interesting. And you've probably thought about all this stuff, but if you found like a micro influencer in the markets that you've identified as potential markets for this, right? It sounds like you kind of have a clear thesis of like, okay, these are the types of markets that I'd be interested in because maybe there's somebody there who's like Instagram famous in their town, right? And that would be the person you would go after like, Hey, I'll partner with you on this.\r\n\r\n\r\nI'll do all the backend office work. I'll handle all the operations and then I'll give you a rev share of everything locally, but I need you to curate, be the editor, et cetera, because they're already tied into the community. It would just give you a leg up on not only getting users to come to the platform, but also having somebody who knows what those users are going to be interested, or subscribers are going to be interested in. I don't know if you thought about that. Maybe I'm telling you something you already know.\r\n\r\n\r\nRyan Sneddon (41:00.965)\r\nYeah, that's like the unicorn. That's like, that's, that's still, I call it the local operating partner. Like that's still the same model, right? They just have their own followers to start with. That's like the unicorn. Someone who knows the town and has an audience. If I could find them, that's amazing. But I think in most cases, it's just going to be the person that knows the town really well, and maybe they don't have their own followers.\r\n\r\n\r\nNik (41:23.054)\r\nOkay, last business question. How do you acquire, like where are you getting these customers from? How are you getting subscribers?\r\n\r\n\r\nRyan Sneddon (41:30.597)\r\nemail subscribers you're talking about about half of our list has come from Facebook ads. About 25 % has come from word of mouth, just people telling their friends or using our referral program. And about 20 % or 25 % comes from, SEO content. Like I was talking about like best pizza places in town.\r\n\r\n\r\nNik (41:49.102)\r\nWow, half of your list, but half of your list came from Facebook ads.\r\n\r\n\r\nRyan Sneddon (41:53.893)\r\nYeah. And I went all in on that. People are like, how do I grow this without Facebook ads? And I'm like, slowly. And that's fine. If you want to do that, that's totally fine. But at the end of the day, if you want to get this done fast, Facebook ads are the cheat code and\r\n\r\n\r\nNik (42:00.046)\r\nYeah.\r\n\r\n\r\nNik (42:09.294)\r\nHow much did it cost you to get the $9 ,000 that you bought through Facebook ads?\r\n\r\n\r\nRyan Sneddon (42:15.525)\r\n$21 ,000.\r\n\r\n\r\nNik (42:17.07)\r\nOkay. Yeah. So it's over a dollar per cut, $2 per customer over $2.\r\n\r\n\r\nRyan Sneddon (42:21.893)\r\nYeah. I mean, it's a little, little bit, but you can either do it in 10 years or you can do it in four years or even less. So I've got people in town here. I actually, I don't know if I have one, give me one second.\r\n\r\n\r\nNik (42:29.518)\r\nWell, I think it's crazy.\r\n\r\n\r\nYou have almost half. Yeah.\r\n\r\n\r\nRyan Sneddon (42:40.325)\r\nThis is our media kit. I have it printed out. Yeah, here we go. This is my favorite page in the media kit. It's the fastest growing publication in Annapolis. This y -axis, or this x -axis, goes out for 25 years, and the y -axis goes up to 20 ,000 subscribers. And I actually made this a while ago back when we only had 15 ,000. And so there's other publications, some of them that are even bigger, but it's taken them 25 years to get where we are.\r\n\r\n\r\nNik (43:02.574)\r\nThat's rad.\r\n\r\n\r\nRyan Sneddon (43:08.485)\r\nI mean, my line's almost vertical. So that's the question. None of these people spend any money on reader acquisition. So do you want to take 25 years or do you want to take one year? That's my question. And that's, I just love showing that to advertisers because they're like, how did you do that? I'm like Facebook ads. It's very simple.\r\n\r\n\r\nNik (43:26.254)\r\nWell, I think I think it's crazy that you have almost half of your town on your newsletter. Half. Subscribe to newsletter. Yeah.\r\n\r\n\r\nRyan Sneddon (43:35.141)\r\nYeah, that's Facebook ads. You're not going to get that kind of growth organically unless you go viral every week.\r\n\r\n\r\nNik (43:39.406)\r\nAnd Annapolis is a city that almost everybody in the country knows.\r\n\r\n\r\nRyan Sneddon (43:45.765)\r\nYeah, so it's a pretty unique city. It's bigger than it is. It's 41 ,000 people, but we've got the Naval Academy, we're the capital of Maryland, and we're very close to DC. And we have a lot of money here. So it's definitely bigger than it is. Like most people do know Annapolis. I'm actually not from Annapolis originally. I live here now, luckily. But I'm from about 45 minutes away. And I used to tell people, nobody has ever heard of my town. There's like 5 ,000 people in it. So I used to just tell people I was from Annapolis in college.\r\n\r\n\r\nalmost everybody was like, yeah, cool. I know where that is, or at least I've heard of it.\r\n\r\n\r\nNik (44:16.27)\r\nSo what's the profile of a town, like where would you go next to open a location? Let's say you weren't going the model where you're licensing it. Let's say you just wanted to go to open a location. How would you decide on a city to go to?\r\n\r\n\r\nRyan Sneddon (44:30.213)\r\nIf I was going to just do it a hundred percent me, no partnership, no licensing, anything like that. distance would be important because I would want to be able to be there a lot in the beginning because we have a, a Monday weekly content meeting and that has been absolutely incredible for the team. And I would want to be able to do that in person, not on zoom with whatever team I was doing. And also sales are always easier in person and also just more fun. so.\r\n\r\n\r\nNik (44:58.35)\r\nSo, okay, so tell me what like what's the size you would look for.\r\n\r\n\r\nRyan Sneddon (45:02.565)\r\nanywhere from that 50 to 250 ,000 people. But if I was, I already have the two picked out, cause I used to think I was going to do it this way. I would start with Frederick, Maryland, which is about an hour and a half away, about 90 ,000 people, really cool town. It's in the mountains of Maryland. Not that we have very big mountains, but people love living there. They got a baseball team, minor league team. They got cool bed and breakfast. They got cool restaurants. People go there. They seek it out. It's a cool town. And then easy other answer would be Charlottesville, Virginia about\r\n\r\n\r\ntwo and a half, three hours away. You've definitely heard of Charlottesville probably it's, it's a UVA. It's, it's awesome. It's got a ton of great wineries, Dave Matthews wineries there. Like it's a destination and you don't, it's funny cause you kind of want a destination, but you don't actually want any of the tourists to read your thing. Cause they'll unsubscribe. You, you want to, you want a place that's really cool to live and cool to be and destinations usually are. but you also don't want like a super seasonal place.\r\n\r\n\r\nNik (45:35.598)\r\nYeah, yeah.\r\n\r\n\r\nRyan Sneddon (46:01.445)\r\nBut then even if you do have a destination, you just want the residents to read. You don't care about the tourists. There are other people that are going to focus on that. Like there's a great town that I absolutely love and I'm going to buy a house someday. It's called Cashers, North Carolina. Have you heard of that? Absolutely amazing town. It's 95 degrees here in Annapolis today, July 9th. It's probably 75 in Cashers and they might even have a little rain to cool everything down. It's amazing. Towns at like 3 ,500 feet elevation. There's amazing golf, hiking. It's just...\r\n\r\n\r\nIt's beautiful. It's where I want to spend most of my summers eventually. And a lot of fall too, because it's just fantastic. But they have about, for this, anything under 40 ,000 would be really, really tough to make a full -time living, I think. You could definitely do it as a cool side hustle, but it would be very tough to make a full -time living. But you don't want to tell them, jumping back to like, you don't want to tell them like cashers, because they've got 35 ,000 people or 3 ,500 people.\r\n\r\n\r\nNik (46:34.798)\r\nWhat's too small?\r\n\r\n\r\nYeah, because you're at 40 ,000.\r\n\r\n\r\nNik (46:45.006)\r\nInteresting.\r\n\r\n\r\nRyan Sneddon (46:59.205)\r\nin the year round population in the summer, it goes up to like 40 ,000. And you'd have all of those readers in the summer, because you'd be curating all the cool events, but then you'd have nobody for the, like there's nothing happening in cashers in the winter. There's no reason for them to read your newsletter. You'd have to go down to like maybe once a month of a newsletter, maybe two times a month. And you'd still be scraping for content. Like, Hey guys, like next season, this coffee shop is not going to open. It's going to be this one. But like.\r\n\r\n\r\nNik (47:03.598)\r\nmy gosh.\r\n\r\n\r\nNik (47:23.566)\r\nSo.\r\n\r\n\r\nRyan Sneddon (47:28.389)\r\nYou can only write about that so many times. So you want a destination, but you don't want the tourists and you don't want seasonal.\r\n\r\n\r\nNik (47:28.558)\r\nI live in Eagle Island, Ohio.\r\n\r\n\r\nNik (47:36.59)\r\nSo I live in Eagle, Idaho, and I've thought a lot about doing a newsletter here. I'm always looking around, like I'll go to the city's website, because I want to know about the new construction that's going on, or there's lots of new restaurants or like whatever. And I have to like piece it together from Twitter or the city or Facebook or whatever it is. Eagle is the highest income city in the state. It has the highest.\r\n\r\n\r\nmedian home value in the state. It's where a lot of the politicians, business owners, entrepreneurs, et cetera, live. But there's only like 35 ,000 people who live here. So it fails your 50 ,000 person test. However, the demographic to me feels like if I was ever gonna do it in some place like Idaho, it might be a worthwhile demographic. What would I need to look for?\r\n\r\n\r\nRyan Sneddon (48:27.077)\r\nSo yeah, looking at Eagle, I'm just looking at proximity to Boise on Google Maps and population and stuff. You might be able to get away with it, something like there, based on your demographics, like you just talked about. You're probably a really cool place to live. I'm looking at beautiful, amazing pictures of this amazing landscape.\r\n\r\n\r\nNik (48:33.146)\r\nthat's really close.\r\n\r\n\r\nRyan Sneddon (48:49.157)\r\nBut then you also could fill in with some Boise content. Like people who live in Eagle are probably going out to hang out in Boise every once in a while. And so you could fill in with big Boise content. Like if a Michelin star chef is opening a restaurant in Boise, people in Eagle are going to care about that. If...\r\n\r\n\r\nNik (48:51.982)\r\nYeah.\r\n\r\n\r\nNik (48:56.302)\r\nyeah, yeah, yeah.\r\n\r\n\r\nRyan Sneddon (49:08.997)\r\na building is getting, a new development is going up in Boise and it's gonna change the skyline, people are gonna care about that who live in Eagle. And so you could definitely get away with it from a suburb perspective like that. But I wouldn't.\r\n\r\n\r\nNik (49:21.262)\r\nCould you get away with it if you decided to do weekly as opposed to daily?\r\n\r\n\r\nRyan Sneddon (49:26.757)\r\nYeah, definitely. I probably wouldn't do a daily in Eagle based on the population. And I would imagine that a lot of the news is going to be Boise news, but then you could also go a totally different way and you could add a little bit more state news into it. Like I don't cover anything that has anything to do with the laws that happen that get made here in Annapolis where the state Capitol. So you could add that in and it's, it could be very much more of a.\r\n\r\n\r\nbigger, a little bit of a bigger thing and a little tiny bit less local, especially given, you know, your number of people in Eagle 33 ,000 looks like it seems pretty affluent. That's great. And it looks like people probably like living there, but then you also have a big city around. And so I wouldn't do it. I mean, I'm looking at now all of the Boise things, like I wouldn't do it.\r\n\r\n\r\nNik (50:19.182)\r\nYou wouldn't do just eagle. You would probably wanna do like, I live in the Treasure Valley is what it's called, like sprawling suburbia, including Boise.\r\n\r\n\r\nRyan Sneddon (50:31.269)\r\nYeah, maybe something more like that.\r\n\r\n\r\nSo Eagle's probably a little bit of an exception to my rule, but it would probably work just as well there.\r\n\r\n\r\nNik (50:42.798)\r\nOkay, well I could ask you questions for another hour, but we're bumping up against some time. So let me ask you the rapid fire questions to end. Is that cool?\r\n\r\n\r\nRyan Sneddon (50:51.781)\r\nI love rapid fire questions.\r\n\r\n\r\nNik (50:53.39)\r\nOkay, what do you love about this business?\r\n\r\n\r\nRyan Sneddon (50:58.053)\r\nI love selling ads. I love making, I love getting businesses to give me $5 and then I give them 15 back. That's such a cool feeling. you know, some of these people that come to us when they're brand new in town and we have built their business with them and I've become friends with them and. You know, some of these people, it is really cool. That's probably the second thing is I love being.\r\n\r\n\r\nNik (51:20.494)\r\nIt must be pretty cool to be like in the know as well.\r\n\r\n\r\nRyan Sneddon (51:29.221)\r\nYou know, people call me a man about town or you might say a Bon Vivant. I love being at all the things. It's so fun to be included and to go and to see people and to know people. It's, it is so much fun. So that's, that's my, those are my favorite two things. I hate the daily grind. I, I hate.\r\n\r\n\r\nNik (51:44.686)\r\nYeah. What do you hate about it?\r\n\r\n\r\nRyan Sneddon (51:51.621)\r\nright now, unless I talk like it talks about, I think I talked about with you. No, it was a different podcast. I was doing earlier today. actually, so we've done hundreds of these newsletters now. The first one that went out completely without my, any attention for me was actually this week. It was the July 4th newsletter on July 3rd. We have another fireworks show and I.\r\n\r\n\r\nNik (52:12.782)\r\nNo way.\r\n\r\n\r\nRyan Sneddon (52:13.829)\r\nI had a, I had a few drinks and it was hanging out and I didn't really, I did, I completely forgot that we were sending one the next day. And then I hadn't actually looked at it yet, but my editor wrote it completely. or, you know, the writers wrote it, she added it completely. And I saw it the next morning and I was like, oops, I totally forgot to look at that. So it took four, almost four years to get to a point of where I didn't actually see a newsletter before it went out.\r\n\r\n\r\nBut for the most part, I do look at it every day. I used to write it every day and edit it. Then I used to just edit it. Now I just kind of look at it, but the daily grind is it's hard. And then a close second would be, and this is just my fault because I could set it up in a way that's better with autopay and stuff. But the other thing is collecting ad money. They're looking at the accounts receivable that $35 ,000 you talked about. That's already services that have been delivered. That's not contracted revenue.\r\n\r\n\r\nNik (52:46.638)\r\nDaily grind is real.\r\n\r\n\r\nRyan Sneddon (53:04.644)\r\nI've already completed everything that is required to earn that money except for cashing the check. And I, I hate that part of it too. That kind of sucks.\r\n\r\n\r\nNik (53:11.79)\r\nCheers.\r\n\r\n\r\nNik (53:15.15)\r\nfor you, let's say you have two hours in the day, you don't have any work responsibilities, no family responsibilities. You can do whatever you want. What are you obsessed with right now? What are you spending your time on?\r\n\r\n\r\nRyan Sneddon (53:27.717)\r\ndepends on the weather. I might go boating. I might go golfing. I might spend time with my girlfriend. if she's not working, she's an ER nurse. That's tough. But if I'm going to, it's also, I'm kind of just obsessed with thinking about where this goes. Like.\r\n\r\n\r\nI would probably be thinking about exactly how we structure the licensing deals, because that's not done yet. I'd also be thinking about the toilet business, because that's something I'm doing right now. It's the second business. And I just love it. It doesn't feel like work. Anytime I have to work on that, it's always fun. But yeah, probably one of those things.\r\n\r\n\r\nNik (54:09.582)\r\nOkay. And then last question. What advice would you give yourself five years ago? Before you started this entrepreneurial journey, what would you tell yourself?\r\n\r\n\r\nRyan Sneddon (54:16.901)\r\nfive years ago.\r\n\r\n\r\nRyan Sneddon (54:21.125)\r\nTwo pieces of advice. The first one would be hire faster than you think. You're going to be uncomfortable with it and you're going to feel like they can't do as good a job as you, but you can't do a great job at everything. It took me a long time, way too long to learn that, but I still am very lucky that I've learned it at an early age. I'm only 27. So I feel like by the time I'm 40, I'll be really good at that. And that's a huge advantage. And then the second one would be...\r\n\r\n\r\nNik (54:40.526)\r\nyou\r\n\r\n\r\nRyan Sneddon (54:45.445)\r\nLearn how to manage your cashflow faster so you don't run out of money ever because that is not fun. And then also a private caveat, the hiring thing, which is don't ever just hire the first person that applies. I did that one time and I didn't actually, I just told somebody that I was hiring.\r\n\r\n\r\nNik (54:51.758)\r\nthere.\r\n\r\n\r\nRyan Sneddon (55:04.869)\r\nAnd then they said, you should hire this person. And I just did. I didn't do any application process. And that, that cost me a lot of money. It wasn't the right person, obviously. And that set me back probably about six months financially. So that would be part of my advice for the hiring advice. So that's a little bit of a cheating answer because they gave you three, but that those would be my answers and it would save me a lot of heartache over the next five years or the last five years.\r\n\r\n\r\nNik (55:17.262)\r\nmy gosh.\r\n\r\n\r\nNik (55:24.654)\r\nNo, I love it. I love it.\r\n\r\n\r\nNik (55:31.022)\r\nRyan, this has been an awesome conversation. I need to come visit Annapolis so I can experience what the VIP treatment is like. That's what I've heard.\r\n\r\n\r\nRyan Sneddon (55:39.301)\r\nDude, you got to do it in the summer too. It's really fun here in the summer. It's a little hot, but anytime through October, we'll have an absolute blast if you come visit. Sounds like I got to come visit Boise too.\r\n\r\n\r\nNik (55:49.454)\r\nOkay, all right.\r\n\r\n\r\nYou can stay at my house. If you come visit, come to ConvertKit. You can come stay at my house, say what's up to Nathan Barry.\r\n\r\n\r\nRyan Sneddon (55:59.429)\r\nSounds great. Apparently you live in like the best suburb of Boise. So it's probably a great house. Unless you followed the advice of, by the worst house in the best neighborhood. Maybe you did that.\r\n\r\n\r\nNik (56:03.342)\r\nIt's yeah, you know, ever.\r\n\r\n\r\nNik (56:08.814)\r\nI can neither confirm nor deny. Is this off the record or on the record? I know you media people are always looking for gotcha questions. Where's the best place for people to find you?\r\n\r\n\r\nRyan Sneddon (56:20.069)\r\nSo probably just Twitter or X at Life of underscore scoop. I only talk about local newsletters and toilets. And then if you want to go a little deeper on local newsletters, it's so funny is that you can't, you can't not laugh talking about toilets. You got to take yourself, you can't take yourself too seriously. But if you want to go a little deeper on local newsletters, I do write a newsletter about local newsletters that I don't update as often as I should. That's at Life of scoop, no underscore dot beehive dot com.\r\n\r\n\r\nNik (56:32.558)\r\nYou can't.\r\n\r\n\r\nRyan Sneddon (56:47.813)\r\nThose are the two best places to find me. That's where I write about everything I'm doing.\r\n\r\n\r\nNik (56:52.11)\r\nOkay, man, I can't wait to check in with you in a year and hear about your poop business. But until then, I'll just follow along. All right, man, have a good one.\r\n\r\n\r\nRyan Sneddon (56:56.608)\r\nIt's gonna be great. Thanks, Nick.",
  "metadata": {
    "duration": "",
    "date": "2024-08-26",
    "platform_source": "Google Drive"
  }
}