{
  "episode_number": "90",
  "episode_title": "The Easiest Way to Start a Lead Gen Business Using Facebook Groups with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Not Applicable (discussion of business ideas)",
  "transcript": "﻿Chris Koerner (00:00.156)\r\nYou still call it Thanksgiving. call it grinds giving, OK.\r\n\r\n\r\nNikolas Hulewsky (00:04.968)\r\ngot grinds giving I caught thanks grinding. So I don't. Okay. Yes, it's born ready for this.\r\n\r\n\r\nChris Koerner (00:10.846)\r\nAll right, you ready for this? Okay, so last week I went to what is now my favorite city in the world, which is called Nashville, Tennessee. Okay, I, I love Nashville. I'm all in on Nashville. And I'm leading into this because it gave me some business ideas, some inspo, right? It me this shirt, right? I walk into this hipster shirt, or I walk into this hipster shop and I see this shirt and it had to be mine. So\r\n\r\n\r\nNikolas Hulewsky (00:22.294)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (00:26.978)\r\nAll\r\n\r\n\r\nNikolas Hulewsky (00:33.378)\r\nOf course it did.\r\n\r\n\r\nChris Koerner (00:42.078)\r\nHave you spent any time in Nashville?\r\n\r\n\r\nNikolas Hulewsky (00:44.246)\r\nI've never, I've never been in Nashville. I've heard cool things about it. Like it's one of the, think it's one of the top cities that people are moving to in the South.\r\n\r\n\r\nChris Koerner (00:50.886)\r\nIt's blowing up a good economy and I lived an hour and a half from it for years in Huntsville, but we'd never really spent much time there. We would drive up there to fly out of it, but I never spent much time. Yeah, it's close. And then I went.\r\n\r\n\r\nNikolas Hulewsky (00:57.195)\r\nFF-\r\n\r\n\r\nThat's really, that's really close. I've spent a lot of time. I spent a lot of time walking in Memphis. Yeah, walking in Memphis.\r\n\r\n\r\nChris Koerner (01:07.863)\r\ninteresting.\r\n\r\n\r\nI would say you're in the top 1 % of people that quote that song on regular basis.\r\n\r\n\r\nChris Koerner (01:20.072)\r\nSo I went to Nashville over the spring to meet with Aaron Harper, Aaron Harper of Rolling Suds. And he took me to Broadway, which is like what you do in Nashville. It's where all the music scene is. And I loved it. And we were only there for like an hour and I just got a little taste, but I'm like, I gotta come back. So Jesse and I went for three days and let me tell you about Nashville. Nashville's got Broadway from the river to 17th street, but Broadway Broadway is only like four blocks. Okay. And\r\n\r\n\r\nOn Broadway, you've got honky tonk bar restaurant, honky tonk bar restaurant. That's all you've got. You just got bars and restaurants, a little bit of shopping. Every single bar has a stage like it's state law. And many of the bars have multiple levels with multiple stages in different bands playing 24 seven all at the same time.\r\n\r\n\r\nNikolas Hulewsky (02:11.01)\r\nOkay, time out. We'll edit this out. I'm sorry. When you get loud, it sounds buzzy. Now I'm like, turn it down just a little bit.\r\n\r\n\r\nChris Koerner (02:17.106)\r\nNo, that's good. That's good to know. how about testing, testing, testing, bar? I mean that, okay.\r\n\r\n\r\nNikolas Hulewsky (02:22.828)\r\nsay like, say like bar.\r\n\r\n\r\nYeah, it's a little better.\r\n\r\n\r\nChris Koerner (02:30.43)\r\nAnd so like you're a music guy, I'm a music guy for a music lover. It's just incredible because you don't have to like, like people think Nashville country. It's just music period.\r\n\r\n\r\nNikolas Hulewsky (02:39.074)\r\nWhat is a honky tonk? I don't know what that is. Hey, I grew up in California.\r\n\r\n\r\nChris Koerner (02:42.908)\r\nI think it's just sure sure I think it's just a bar for rednecks. I don't know. It's a bar for white people. I don't know how else to describe it. Like it's a bar that plays country live country music maybe\r\n\r\n\r\nNikolas Hulewsky (02:48.674)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (02:55.906)\r\nOkay. Like if you asked me what a vato was, it's like, okay, I'm in dude. I'm in arms. It's like, I know what that guy is, but a freaking honky tonk. I couldn't tell you. What does that mean? Is it like a place where you just honk your horn on your car? It's weird. Keep going.\r\n\r\n\r\nChris Koerner (03:09.842)\r\nLike if you ask me what a Mexican pizza or a Crunchwrap Gordita is, you're like naming all these Taco Bell names.\r\n\r\n\r\nNikolas Hulewsky (03:13.987)\r\nHahaha!\r\n\r\n\r\nlike a double decker taco. It's like my favorite is like when they wrap the bean burrito on the outside of the crunchy hard taco. Anyways.\r\n\r\n\r\nChris Koerner (03:24.926)\r\nOkay. So you're just walking along the street and there's tons of people everywhere and you just hear music coming out of every door and window. The weather's pretty good in Nashville. It was great when we were there and it's just fun. It's just a vibe. It's just a vibe. Okay. And then the whole time Broadway, you've got these party buses driving up and down Broadway. You've got one that's that looks like it's camo one that looks like a duck boat, all these themed party buses, some have poles on them where you can dance on.\r\n\r\n\r\nNikolas Hulewsky (03:39.276)\r\nK K\r\n\r\n\r\nNikolas Hulewsky (03:51.319)\r\nReally?\r\n\r\n\r\nChris Koerner (03:53.374)\r\nYeah, and people are just dancing and they're singing and everyone's wearing cowboy hats and cowboy boots. And it's just, it's a vibe. I don't know how else to say it. Okay. So gave me some business ideas. Give me some business ideas. That's not that's I mean, that's already a thing. That's already what they call it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (03:59.786)\r\nOkay, all right, let's survive.\r\n\r\n\r\nNikolas Hulewsky (04:04.866)\r\nCan we start calling it Nash Vegas?\r\n\r\n\r\nNikolas Hulewsky (04:10.893)\r\nis it really? I'm such a moron. I'm sorry.\r\n\r\n\r\nChris Koerner (04:15.131)\r\nThat's a thing.\r\n\r\n\r\nNikolas Hulewsky (04:15.297)\r\nI hate myself.\r\n\r\n\r\nChris Koerner (04:18.434)\r\nyou've probably heard it before. Okay. All right. Let me tell you how it works when you go into a bar or restaurant for, let me back up best two bars and restaurants on Broadway. I'm probably the biggest sellout for saying this. It's kid rocks and it's Justin Timberlake's. Okay. The two greatest musicians of our time. I mean, can we be real?\r\n\r\n\r\nNikolas Hulewsky (04:37.826)\r\nBall with the ball to bang to bang diggity. I mean, come on, Chris. Is there anything better than that song?\r\n\r\n\r\nChris Koerner (04:43.293)\r\nYeah. And their bars are amazing. Yeah. I FaceTimed you at Kid Rocks Bar and it was a vibe, wasn't it? It was a vibe. Then you go to... Go ahead.\r\n\r\n\r\nNikolas Hulewsky (04:50.124)\r\nknow. It was a vibe. It was amazing. Okay, here's what's on. Here's what's funny. You got two Mormons talking about the best bars in Nashville.\r\n\r\n\r\nChris Koerner (04:58.918)\r\nI know never tasted alcohol in my life, which just goes to show that if you do, it would be even better. Right?\r\n\r\n\r\nNikolas Hulewsky (05:06.548)\r\nNick, I tell you what the best bar in Nashville. Kid Rocks Bar.\r\n\r\n\r\nChris Koerner (05:13.394)\r\nI mean, he's the greatest musician of our time.\r\n\r\n\r\nChris Koerner (05:18.558)\r\nOkay, so this is how it works. You walk into a bar, any bar, and the musician is going to have a five gallon bucket on the stage with a QR code. And it says like, Hey, Venmo me 20 bucks. That's the price market price. don't care where you go. 20 bucks and I'll play whatever you want. Okay, whatever you want. And so you've got the sweet Caroline's you got the don't stop believing you've got the thunderstruck you hear a lot of the same stuff. But then you hear a lot of like really beautiful medleys like\r\n\r\n\r\nThe second greatest musician of our time. There it is.\r\n\r\n\r\nNikolas Hulewsky (05:54.166)\r\nSex from the urge and I'm thinking\r\n\r\n\r\nChris Koerner (05:58.46)\r\nI don't know what to do while you sing. I don't know what to do. I don't know what to do with my hands while you sing. I know, I know, I know.\r\n\r\n\r\nNikolas Hulewsky (06:02.572)\r\nDude, we're talking about music. We both love music. I can't help but sing. I'm sorry. I think in lyrics, we start talking about Creed. I gotta sing it. I don't know what you want me to say. All right. If that's a crime, I'm sorry. Book me, officer.\r\n\r\n\r\nChris Koerner (06:09.222)\r\nLock me up. If that's a crime, just lock me up.\r\n\r\n\r\nChris Koerner (06:15.944)\r\nSo, okay, I'm a cheapskate, right? $20. That's like two Chipotle meals, 1.8 now. think about it this way, Everyone that comes to Nashville is a musician. It's like LA, right? You go to LA, you wanna act, you wanna do music, you also go to LA, but you can go to Nashville too, okay? And so there's some real talent. I did not hear one bad band, one bad singer, one bad musician, not even mediocre. Everyone's amazing, because there's...\r\n\r\n\r\nNikolas Hulewsky (06:35.818)\r\nRight. Right.\r\n\r\n\r\nChris Koerner (06:45.474)\r\nsuch a high concentration of musicians there. And so to think that you can merely pull out your phone, scan the QR code, send 20 bucks, and you can have a private concert. You can have them play whatever you want on demand. And there's usually not much of a queue or waiting list for whatever reason. So you just pay 20 bucks to play whatever you want. And so I had him play, I was at this first bar and I said, play Carry On My Wayward Son by Kansas. And he looks at it.\r\n\r\n\r\nNikolas Hulewsky (07:12.711)\r\nmy gosh. Carry on my way with some. It's going to happen every song you name. I'm just going have to do it.\r\n\r\n\r\nChris Koerner (07:20.638)\r\nThat's fine. That's fine. And so usually with these songs, he gets a request. He's like, all right, John wants me to play Don't Stop Believing. And then he plays it. But this one, he, he, they have like a secret microphone where he talks to his other band members and he's like, Hey guys, this guy wants to don't stop believing. I don't know. I don't know. It's like a freaking tough song. You've got a big range in there. You've got guitar solos and he's like, all right guys, this is like my nightmare. We got Chris, Chris, raise your hand. I raised my hand. He's like, man, this guy wants to play, carry on my wayward son. Everyone's like, yeah, I love that song.\r\n\r\n\r\nNikolas Hulewsky (07:38.533)\r\nyeah. yeah.\r\n\r\n\r\nNikolas Hulewsky (07:50.178)\r\nYeah.\r\n\r\n\r\nChris Koerner (07:50.226)\r\nLike guys, that's like a really hard song. I attempted it once completely failed. So we're going to try it. Yeah. Long story short, he did it. He crushed it. We're Instagram friends now and it was a vibe. Okay. It's amazing. So then we went to Justin Timberlake's bar and I'm not going to lie. I spent more on songs than I spent on food. Okay. I was just, it was like 20 bucks here, 20 bucks there. Like what the general public does at strip clubs with dollar bills. I do with songs in.\r\n\r\n\r\nNikolas Hulewsky (07:56.002)\r\nYay!\r\n\r\n\r\nNikolas Hulewsky (08:04.61)\r\nThat's amazing.\r\n\r\n\r\nChris Koerner (08:20.006)\r\nNash Vegas. Everything I requested they played everything.\r\n\r\n\r\nNikolas Hulewsky (08:25.218)\r\nYou know what I was surprised you sent me a video of Gosh, what's the name of what's name of the song the Alabama song?\r\n\r\n\r\nChris Koerner (08:32.814)\r\nI hadn't played that. Dixieland Delight.\r\n\r\n\r\nNikolas Hulewsky (08:33.974)\r\nDixieland Dixieland delight. Like, I couldn't believe that and they played it well. Like they knew Dixieland delight.\r\n\r\n\r\nChris Koerner (08:40.104)\r\nThey did. And everyone in the crowd was singing the Alabama parts. Not everyone.\r\n\r\n\r\nNikolas Hulewsky (08:44.096)\r\nI know it's amazing. You're like everyone in the crowd was singing the Alabama parts. It was just you and Jesse. Where my last dollar?\r\n\r\n\r\nChris Koerner (08:47.902)\r\nIt was me. It was me.\r\n\r\n\r\nChris Koerner (08:52.713)\r\nNever tried it.\r\n\r\n\r\nNikolas Hulewsky (08:54.498)\r\nYou\r\n\r\n\r\nChris Koerner (08:56.55)\r\nso how do you, could this be a thing? I'm calling it custom concerts, any city in the world, you get a band in there that's talented. They've got a whole repertoire of songs. They can just play. There's, there's no shortage of them. And you go to a concert and there could be like an auction or a bidding system where maybe it's 20 bucks, maybe it's five. It depends on what the supply and the demand is. And it's like a silent auction. You, the Venmo settings return to private.\r\n\r\n\r\nAnd you're like, I really wanted to play this song and it looks like there's a line. Maybe you can see how deep the line is and the highest bid goes to the top of the line and the musicians can make money. The organizer who puts all this together can make money. Maybe he just makes a percentage of the song request. Maybe there's like a five, $10 door fee. What do you think?\r\n\r\n\r\nNikolas Hulewsky (09:46.658)\r\nSo first of all, I'm in, I love the idea. But second, it sounds like you're just describing a bar in Nashville. Like that's just what a bar is. It's like, you're like, maybe there's a Dorothy, maybe there's a drink minimum. isn't that what I already, isn't that I wanna do?\r\n\r\n\r\nChris Koerner (09:53.778)\r\nI am absolutely. It sounds like it sounds like I'm describing like a really unique concept that's hyper localized to one area that you could bring to another area.\r\n\r\n\r\nNikolas Hulewsky (10:07.254)\r\nI know what I'm saying is I think that these exist in every major city.\r\n\r\n\r\nChris Koerner (10:11.73)\r\nYeah, there's not enough of them. When was the last time you went to one?\r\n\r\n\r\nNikolas Hulewsky (10:16.054)\r\nTo be fair, this is two Mormons talking about bars. This is where the...\r\n\r\n\r\nChris Koerner (10:18.78)\r\nYeah, there's I've done the research. There's nothing like this in like the DFW suburbs. I can go to Dallas proper and go to a bar. But if I had the opportunity to go to a restaurant that also had a live band where I could request money and the food was decent, I would absolutely do it. It's the same concept of studio movie grill, like ordering good food while watching a movie. DFW is like a Mecca for that. And it's just starting to kind of go outside of DFW. But it's just combining\r\n\r\n\r\ntypes of entertainment and systemizing it. So it doesn't even have to be a restaurant. Like you could just rent a venue and it's kind of like they have touring cover bands like Dave Matthews band, Beatles, they have touring cover bands. It's kind of like that but for any type of music you would want.\r\n\r\n\r\nNikolas Hulewsky (11:02.754)\r\nSo this is a, it's almost the same thing. It's a little bit of a riff on it. The most you and I love karaoke, which we just love karaoke. It's so much fun. can sing belt out your favorite songs. The most fun I've ever had at karaoke is karaoke with a live band. Do you, and do you know what I'm I believe in a thing called love by the darkness.\r\n\r\n\r\nChris Koerner (11:18.412)\r\nMmm. Mmm. That could be an aspect of it.\r\n\r\n\r\nJourney. OK. You hit those high notes.\r\n\r\n\r\nNikolas Hulewsky (11:28.674)\r\nIt was so fun. Yeah, I think if you combine like, made it even more experiential, like, okay, yeah, you can pay to have them play the song, but you kick in an extra 50. Hey, Rhonda, from the back, you can come and sing with us. Right? Like it makes it even more experiential. I still kind of go back to like, so essentially, this would be a feature of\r\n\r\n\r\nEither a bar or just just a venue. No. You wouldn't tie it to a bar.\r\n\r\n\r\nChris Koerner (11:59.838)\r\nNo, I just, no, I wouldn't. Like to me, this is like a candlelight concerts or a bingo loco. It's something for millennials to do on the weekend and you don't need to own a venue. You don't need a lease of venue. You just find a venue and rent it for that one night. Right? Like our friend Alex, the wedding guy, he, he hosts candlelight concerts. It's a,\r\n\r\n\r\nNikolas Hulewsky (12:09.537)\r\nMmm.\r\n\r\n\r\nChris Koerner (12:25.726)\r\n20, 30, $50 million company. And all they do is they bring in a pianist and some fake candles. They light the candles or they turn the candles on. People sit there and they listen to piano. So it's kind of like candlelight concerts, but custom concerts.\r\n\r\n\r\nNikolas Hulewsky (12:40.076)\r\nSo to your point, you'd have to find a band in each market that is not only talented, but has a big repertoire, like they know a bunch of songs. You probably have to whittle down the catalog. And then what would you do the marketing or would you go to the venue and say, Hey, I'm putting this together. You do the marketing.\r\n\r\n\r\nChris Koerner (12:47.154)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (12:57.286)\r\nyou do the marketing. you have to find a band in a market to prove the concept. But once you find it, just an amazing band, then you go on tour. Then it's like a bingo loco. You just set up all these events, Facebook ads, that's how bingo loco candlelight concerts, all these millennial stuff grow is just with Facebook ads.\r\n\r\n\r\nNikolas Hulewsky (13:15.794)\r\nOkay, you keep saying bingo loco, I don't know what that means.\r\n\r\n\r\nChris Koerner (13:18.942)\r\nYou must not consume my content. It's bingo loco is just like it's like a dance party combined with bingo neon lights, music, food, drinks, super expensive. And these these guys make like, it's like 50 to $200,000 a night. It's just bingo.\r\n\r\n\r\nNikolas Hulewsky (13:21.783)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (13:38.082)\r\nAll right, I'm caught up. I love the idea. Here's my question. Is there a way you could piggyback this idea? You know how we've talked in the past of finding a distribution and one of the ways is by piggybacking. Would this be something you piggyback off of?\r\n\r\n\r\nChris Koerner (13:46.194)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (13:50.01)\r\nAbsolutely. Yeah, you piggyback off bingo loco. It's like, hey, for an extra 20 bucks, stay around for another hour or two once we're done for custom concerts. Well partnership and we'll we'll we'll help cover your door fee.\r\n\r\n\r\nNikolas Hulewsky (13:56.002)\r\nHmm?\r\n\r\n\r\nNikolas Hulewsky (14:02.402)\r\nYeah, that'd be super.\r\n\r\n\r\nNikolas Hulewsky (14:07.52)\r\nI love it. Yeah, it's live music.\r\n\r\n\r\nChris Koerner (14:09.18)\r\nIt's music. It's timeless. And it's what you want to hear. And then you got all these people singing what you just requested. It's just a vibe. You wouldn't get it.\r\n\r\n\r\nNikolas Hulewsky (14:19.136)\r\nYeah, and I wouldn't I wouldn't do it at a bar either because I'd want to bring my kids, you know, fun that would be to like bring Royce or an auto and like, just listen, how funny would it be if like the band's like, all of sudden they look down at their phones, they're like, what the what the heck? I don't I don't think you're allowed to do that. Okay. Okay. He just he just looks back at the drummer and he's like, All right, let's do this thing 123.\r\n\r\n\r\nChris Koerner (14:37.054)\r\nParagrip, the Poopoo-Poopoo-Pee-Pee song.\r\n\r\n\r\nNikolas Hulewsky (14:44.928)\r\nBaby shark did it it did it baby shark did it did it did it. That would be amazing. That would be so funny. Yes, yeah, I love it. Okay. All right, here's four ideas for you to choose from. It's a newsletter idea. I know we've talked about those but I have a new one. Something to do with the silver tsunami. reminders.\r\n\r\n\r\nChris Koerner (14:52.647)\r\namazing.\r\n\r\n\r\nNikolas Hulewsky (15:12.672)\r\nRecommendations.\r\n\r\n\r\nChris Koerner (15:14.856)\r\nLet's go newsletter idea. Cause I've got a newsletter idea that I could add to.\r\n\r\n\r\nNikolas Hulewsky (15:19.17)\r\nOkay. So I know we've talked a lot about newsletters, dude, I'm just, I'm obsessed with newsletters. I think that they're so freaking cool. I had Jazz on my podcast and he talked about his local newsletter. It's in a small town in Canada and he's just freaking exploded. And the reason I'm so interested in them is because the economics blow my mind. It's like spend one to $2 to acquire a customer. And then the LTV of that customer is like 50. So you've got this 50 to one or 25 to one\r\n\r\n\r\nLTV to CAC ratio when typically a three to one LTV to CAC ratio would be incredible, right? So I love that part of the business model. And to what we were just talking about, I love that things are getting local and experiential. And I think that having a local newsletter.\r\n\r\n\r\nChris Koerner (16:05.031)\r\nLoco?\r\n\r\n\r\nNikolas Hulewsky (16:06.25)\r\nLocal newsletter accomplishes both of those things. So there are kind of three broad categories in my mind, and you can tell me if I'm wrong, of newsletters. There's a newsletter around a brand. So that could be a business, it could be a person, it could be whatever. There's a newsletter around a niche topic like AI. And then there can be newsletters around geography. And sometimes you can like mix and match those, but.\r\n\r\n\r\nChris Koerner (16:09.352)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (16:35.904)\r\nTake it to three broad categories.\r\n\r\n\r\nChris Koerner (16:37.82)\r\nI would add the one that I was thinking of first is like a personal, like a blog newsletter, which is kind of a thing like, Hey, here's what I'm buying. Here's what I'm doing. Here's what I'm building.\r\n\r\n\r\nNikolas Hulewsky (16:47.018)\r\nThat's my mind. Yeah, that's in my mind. That's the brand, right? Like Chris Kerner is a brand like hey, this is it. You're more like interested in that in that person or that brand or that company as opposed to the specific idea or this. But anyways, yeah, OK, we can have that a personal one. So I've been thinking about this a lot and we've talked a couple of times about launching an AI automation agency, but local businesses don't know the first thing about AI. not using it right now. I mean, it's still pretty much a novelty thing.\r\n\r\n\r\nI was talking to a group of people the other week and I was asking them, do you use chat GBT? And they're like, yeah, I use it. I'll ask it a question or two here that are like my brother and I mess around with it to like quiz it. And like, they're not actually using it to accomplish tasks. It's a novelty thing. They're just, they're seeing how good it can answer a question, right? So many of these local businesses are still not using it. And so the idea that I would have is to start a local\r\n\r\n\r\nChris Koerner (17:35.912)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:46.228)\r\nnewsletter focused on AI automation. So it's like you're the AI guy, but it's mixed with the local piece of the newsletter. And I would go and just start knocking doors with local businesses. This is my pitch. This is who I am. But you're building a brand or awareness around your business in the local area.\r\n\r\n\r\nAnd then you're also adding ad revenue on top of it. So I think I'm doing a freaking terrible job explaining it. Let me, we might have to cut this and start back over. know, but I feel like I F'd it.\r\n\r\n\r\nChris Koerner (18:21.042)\r\nI get it.\r\n\r\n\r\nNikolas Hulewsky (18:27.538)\r\nLet me just try a two-minute speech one more time. We'll mark this. Okay, so two things are happening. Local businesses do not know the first thing about AI.\r\n\r\n\r\nChris Koerner (18:39.112)\r\nWe're, we're in a Twitter bubble because everyone knows about it on Twitter, but that is not representative.\r\n\r\n\r\nNikolas Hulewsky (18:43.166)\r\nExactly. That is not representative of local businesses. And I would say most local businesses are not on newsletters. They're not like your prime newsletter subscribers. So I still think you launched the AI automation agency, but the way that I would do it is I would launch it off of the back of a newsletter and I would literally go boots on the ground, knock doors, meet with local businesses, right? And acquire customers that way. This is where I need your help.\r\n\r\n\r\nChris Koerner (18:51.72)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (19:06.265)\r\nOkay, yeah, yeah.\r\n\r\n\r\nChris Koerner (19:10.534)\r\nMm-hmm. This is a good idea. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (19:12.15)\r\nI would have a lead magnet. I would knock on the door and be like, hey, so and so. I have this new AI automation agency and I'm doing this for free for everybody. And it could be like helping to show you how to write your first contract or like just anything to show your value for free. And then you get them onto your newsletter, right? So it does, and it does two things. Number one, it creates a newsletter and you have an audience. And so maybe at some point you're adding ad revenue to that by selling ads to local.\r\n\r\n\r\npeople who want to advertise. But then the second piece is then you're capturing also the project based revenue when they're like, I'm ready to automate something in my business. They call you and they bring you in and it's local and you don't have to worry about like outsourcing and being remote. You're just there in your local town. Does that make sense?\r\n\r\n\r\nChris Koerner (19:59.518)\r\nDude, Nick, I just can't. I can't right now. I just can't right now. Okay, that's an amazing idea. Okay. That's an amazing. Your idea stands on its own. It's very good. No, but\r\n\r\n\r\nNikolas Hulewsky (20:14.796)\r\nWell, okay, all right. I haven't. Okay.\r\n\r\n\r\nChris Koerner (20:16.508)\r\nBut no, but I'm going to level it up. Okay. I'm going to make it more relevant to us to me and you and Brandon and what we're doing right now. Okay. And I will say there was a YouTube commenter recently that was like, I just love this because it's like you guys are just, it's unscripted. You're just saying this on the fly. You're actually doing things on the fly in real time. And I'm like, yeah, what's what we're doing. We're freaking awesome.\r\n\r\n\r\nNikolas Hulewsky (20:45.058)\r\nYeah, yeah.\r\n\r\n\r\nChris Koerner (20:46.502)\r\nSomeone tell our wives please. Jeez. Our wives have the same name. Can someone please tell them that we're tight?\r\n\r\n\r\nNikolas Hulewsky (20:49.602)\r\nHer name is...\r\n\r\n\r\nNikolas Hulewsky (20:56.406)\r\nI don't, all right, keep going.\r\n\r\n\r\nChris Koerner (20:58.206)\r\nYou're like, I'm not going there. Okay, so absolutely. It's an AI newsletter. Everyone's doing that big deal. But who doesn't know about AI that much? Local business owners, home service business owners. Okay. And so it's an AI newsletter that is not going to monetize by ads. It's vertically integrated. It's going to monetize by charging one to $3,000 a month for\r\n\r\n\r\nAPI integration, AI integration, open AI API integration, all of that stuff that's very transformative. Totally with you agreed stands on its own. But\r\n\r\n\r\nWhy do we need, let's say we have a hundred different markets over the world, a hundred different people starting this local AI newsletter. The content is all the same. It's the same. It's about new AI happenings and you can plug in things here and there about X, Y, or Z city to make it seem more personalized, but it's really all the same content. Okay. So why not like a white labeled or a syndication of some sort of one parent entity writing and creating all this content.\r\n\r\n\r\nNikolas Hulewsky (21:42.754)\r\nYou\r\n\r\n\r\nChris Koerner (22:04.508)\r\nand then sending it out to these hundred local newsletter owners and they're just sending it out. don't do anything. They're finding subscribers that are local to them. They're using our content or someone's parent content, sending it out. No one knows that it's duplicate because it's in an inbox. There's no SEO. It's not publicly published. And then they do the same thing. They have to be there. They need to interface with the customer. And so for what we're doing with repeat leads, this could absolutely be a lead gen source.\r\n\r\n\r\nfor the people that are white labeling repeat leads for us.\r\n\r\n\r\nNikolas Hulewsky (22:37.728)\r\nYeah, to catch people up to speed. We were launching something in January where we do all of the backend fulfillment. So lead generation in particular, but we're working with individuals who are, know, hustlers, side hustlers trying to launch their business to go out and find customers. And then they white label the services to us. So what Chris is saying is essentially, yeah, this would be an amazing funnel for what we're doing with repeat leads. They could go out, they could find the customers and we provide the content we provide.\r\n\r\n\r\nthe information and the training and then we also provide the fulfillment on the backend is what you're describing.\r\n\r\n\r\nChris Koerner (23:11.026)\r\nOr yeah, yeah. And instead of them going out and finding customers, they go out and find newsletter subscribers that they convert to customers with the content that we give them for free.\r\n\r\n\r\nNikolas Hulewsky (23:23.17)\r\nDude, I honestly hadn't thought of that. That is very, and here, and then talking about this right now, I'm like, this is actually pretty genius that we brought this up. wish I would have said that I actually thought of doing it like that. The way, I'm gonna add one thing to this. The way that I would get into it is I would pick a niche or a very, very small geography. So I would either pick like CPAs,\r\n\r\n\r\nChris Koerner (23:31.986)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (23:51.818)\r\nand I would really learn their business so that I could make custom automations for them. Because that's where the rubber meets the road, right? It's like, sure, I could tell you that there's this AP automation or that there's a make automation, but how does that help the CPA? Which part of their workflow does that actually automate? So I would either pick a niche or I would pick a very small geography like, downtown Plano. I'm just going to go and hit up as many businesses as possible.\r\n\r\n\r\nChris Koerner (23:57.266)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:19.618)\r\nbecause that way you're limiting your surface area. You're not spreading yourself too thin. And I would go really deep, build relationships with those people, get them to join the newsletter. And like, again, to your point, partner with somebody who's already creating the content. You don't have to reinvent the wheel. You could outsource all of the fulfillment. You're essentially a lead gen agency, except you're getting back into analog, right? Like it's, you're not just a digital lead gen agency who's sending all these emails. Like you're going and knocking doors, which has kind of become a lost art.\r\n\r\n\r\nChris Koerner (24:32.318)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:47.244)\r\nBut like people aren't knocking doors anymore. They're all trying to get it through SEO, pay-per-click and Google ads and all these other things.\r\n\r\n\r\nChris Koerner (24:53.222)\r\nYeah. And it's funny because we're in a we're in a Twitter bubble when with regards to AI, but we're also in a bubble with regards to newsletters. I've started getting a bunch of newsletter subscribers from Facebook specifically. And I've had a few people tell me, this is the only newsletter I'm on. I don't even know what a newsletter was. wow. This is cool. This is this is a newsletter. I'm like, grandma. But that I mean, who subscribes it? Jesse, my wife doesn't subscribe to any newsletters. You know, she's on like Beth.\r\n\r\n\r\nBed Bath and Beyond's mailing list, but like an actual newsletter as we describe it is not really a common thing.\r\n\r\n\r\nNikolas Hulewsky (25:28.716)\r\nWell, you think about it, if I'm a business owner, I own an iPhone repair shop and somebody comes into my store and is like, hey man, I started this business, we do AI automation, can I just show you one thing that we do for free? And then at the end of that, even if I don't have something right then and they're like, do you wanna be on my email list? I just send weekly updates that kind of show you the new things that are coming out. Of course I would sign up, like legitimately, I would sign up, because I'm like, I might not use this today, but.\r\n\r\n\r\nChris Koerner (25:51.869)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (25:55.51)\r\nI'd like to kind of just keep in the loop of what's going on because I just don't know what's going to happen. I think you would capture emails at a much higher rate and you would have a much higher intent customer. you and I have talked about this. You have how many total subscribers do you have to your newsletter?\r\n\r\n\r\nChris Koerner (26:00.126)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (26:06.942)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (26:12.918)\r\nlike 41,000.\r\n\r\n\r\nNikolas Hulewsky (26:15.01)\r\nIs that including the people that you... Okay. Chris has probably close to 60,000 newsletter subscribers, but a big segment of those newsletter subscribers were like co-registration. That's this thing called co-reg, where essentially if you sign up for one thing, you also get signed up for a newsletter. Those are really low quality newsletter subscribers, those co-reg subscribers. They churn at a really high rate, but the people who are not low quality, those are the ones who went out of their way.\r\n\r\n\r\nto opt in. So you're not just like building a newsletter list to say that you have 20,000 subscribers, you're building high quality subscribers that are actually going to be valuable to either your business or to advertisers that want to advertise to these individuals.\r\n\r\n\r\nChris Koerner (26:47.368)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (26:57.138)\r\nYeah, you're going to find a direct correlation between how hyper niche a newsletter is and the open rates and click rates. I'm thinking of the neighborhood I lived in in Houston, Cross Creek Ranch, 6,000 homes, therefore 6,000 homeowners, 19, 20,000 people in this one neighborhood, like a proper neighborhood. Why isn't there a newsletter there? Now I was getting emails from the HOA, but like the pool is closed and whatever, but that's not a newsletter, right? Like happenings like\r\n\r\n\r\nI live in this small city. There's 6,000 people. I get a physical magazine every month where they profile a family that lives here. And then there's a whole article about them and they, they monetize via ads, like print ads in a fricking magazine. Like it's a digital version.\r\n\r\n\r\nNikolas Hulewsky (27:39.852)\r\nWell, before a year ago, I would have been sitting at home and somebody who's listening to this, I'd be thinking the same thing sitting at home being like, well, I'm a part of the Facebook group. Right. Like, I get updates. I'm on Nextdoor. I get updates from them on that. There is something dramatically different about getting updates on a social media platform and getting an email to your inbox. It's much more intimate to get an email to your inbox than it is to see an update on Facebook. Number one. And then number two, Facebook\r\n\r\n\r\nChris Koerner (27:47.806)\r\nMm hmm. Or next door.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (28:00.305)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (28:09.25)\r\nGoogle, Instagram, Twitter, they can change the algorithm at any time. And so you may not even see the notification. You may not even see the update. You don't necessarily own the relationship with that person if you went and created a Twitter account or a Facebook account to communicate to these people. The only way you can, you have that direct communication is either through a phone number, a text or an email. And so capturing their emails is incredibly valuable. That's why email newsletters right now, it may seem old school. They're growing like crazy.\r\n\r\n\r\nChris Koerner (28:14.43)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (28:37.974)\r\nbecause the value of having a direct one-to-one relationship with your customer far exceeds the value of building 500,000 subscribers on your Facebook page.\r\n\r\n\r\nChris Koerner (28:47.198)\r\nMm hmm. Yeah, I mean, back to that neighborhood I lived in 6000 homeowners, 10 % of Americans are business owners. There's six 600 business owners in that one neighborhood.\r\n\r\n\r\nThis is a one to $3,000 a month service. Like that could be a big business just localized to that one neighborhood doing lead gen.\r\n\r\n\r\nNikolas Hulewsky (29:06.338)\r\nYeah, that's what saying. Like if you either niche down to a geography or to like a business type, right? Like home services, CPA, whatever. And I'm not saying niche down to a geography like, niche down to Boise. That's dude. That's that's too big. You can't cover all of Boise. It's got to be like you're saying 6000 homes is still probably 25000 people ish. Like that's probably the max of where you should niche down to if you're going to be if you're going to be the everything to everybody type of guy.\r\n\r\n\r\nChris Koerner (29:22.707)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (29:29.48)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:36.67)\r\nI would niche down there specifically if you're trying to launch a business off of it. If you're just trying to be a newsletter and then you're going to sell ads down the road, yeah, you got to go broader. But if you're like, got this business idea, I'm going to niche down in this geography, I would start that small. So that's my local AI guy newsletter idea.\r\n\r\n\r\nChris Koerner (29:44.851)\r\nYeah.\r\n\r\n\r\nChris Koerner (29:55.666)\r\nI love it. Well, let me take that and give you another customer acquisition channel for a newsletter for a current newsletter or a future newsletter. I tweeted about this, but I didn't share much detail. So there's this one app called group boss and group boss will sync with your Facebook group and enable you to collect emails from new group entrance in your Facebook group. So\r\n\r\n\r\nIf you are the owner or the moderator of a Facebook group, you can set what questions people have to answer when they join. Facebook does not want you to collect emails. They don't want to be any part of that, but you can ask question. This is what is your email address? And then a third party app will take that email address, put it in a Google sheet, which you can use with Zapier to put in Beehive or Substack or anywhere you want. So idea number one, do what I did. I started an RV park off market Facebook group.\r\n\r\n\r\nsix months ago, I didn't push it. It had zero members and Facebook just started pushing people into it. Today it has 2000 people and I have the email addresses for about 1100 of them because they gave it to me. They didn't have to. It wasn't a required field. Okay. So 1100 like arguably real estate investor email addresses for $0 and I didn't push it. I didn't push ads. I didn't push it to my community. I just started it and the algorithm's like, okay, yeah, people are searching for this. Here you go, Chris. All right.\r\n\r\n\r\nSo you can start one, but that's, you know, we're impatient here. So we just don't want to wait for people to come. You can buy one. You can buy a Facebook group. They're very cheap because most are not monetized and it's worth, you know, if you say, give me, I'll give you a thousand bucks for your Facebook group. I would say most Facebook group owners or moderators would say yes to that. Now I know, cause it's in any niche you could ever imagine. It's hyper local. It's to any niche, any country, whatever you want.\r\n\r\n\r\nNikolas Hulewsky (31:40.739)\r\nmy gosh, I'm getting so excited.\r\n\r\n\r\nChris Koerner (31:50.186)\r\nAnd then those like, those are getting people every day. So you buy the group. You can do a few things to try to get emails from people that are already in the group, but it won't be very successful. You just change the questions on day one and start collecting emails for new entrants.\r\n\r\n\r\nNikolas Hulewsky (32:07.618)\r\nDude, I absolutely love this idea. I absolutely love, like, this isn't an idea that someone would need to sit on their hands for six months to implement. Like, kind of my AI automation idea in my mind, if I were to launch it, it'd take some time. It's like, okay, I gotta pick the niche. I gotta make sure I understand what some of these tools are. I gotta go knock doors, whatever. I could buy a Facebook group in the next week, right? And the, the,\r\n\r\n\r\nChris Koerner (32:32.403)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (32:35.626)\r\nThe other thing is to level up your idea. You're saying to just collect emails. You could have a campaign to go back and collect emails as well. I'm doing that with my Twitter followers right now. Well, I'm going back to anybody who followed me and just like, hey, I have this newsletter. I'd love for you to subscribe. And it's definitely not going to be as high of an opt-in rate as upfront, but it still works. I think you could turn this into a service and not even buy Facebook groups. Just reach out to big Facebook groups and say, hey, right now,\r\n\r\n\r\nChris Koerner (33:03.699)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (33:04.898)\r\nEmail addresses in order to acquire an email address costs on average $2. You have 100,000 subscribers that if you had all their emails that would be worth $200,000 to somebody. I can help you implement a process to not to not only collect the emails of people who you currently have in your group, but any new members who join from here on out. Can I implement it for you for 500 bucks?\r\n\r\n\r\nChris Koerner (33:16.84)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (33:26.056)\r\nMm-hmm.\r\n\r\n\r\nor\r\n\r\n\r\nNikolas Hulewsky (33:30.464)\r\nOr...\r\n\r\n\r\nChris Koerner (33:31.71)\r\nCan I implement it for you for $0 and I'll pay you 10 cents for every email that you push to me?\r\n\r\n\r\nNikolas Hulewsky (33:38.134)\r\nYeah, if you that's if you have an idea of what to do with the emails. Yeah, but I'm just saying like if you didn't have an idea of what to do with emails, you could just here's a service for me helping you create an automation that collects the emails because the emails are so freaking valuable. They're so valuable.\r\n\r\n\r\nChris Koerner (33:40.902)\r\nRight, right, right.\r\n\r\n\r\nChris Koerner (33:50.674)\r\nThat's a great idea. But they, the caveat there is they need to have a valuable way of using the emails as well. That might not be the case depending on what type of group it is. You know what saying?\r\n\r\n\r\nNikolas Hulewsky (34:01.858)\r\nYeah, fair point. Yeah, so maybe instead you just sit and you're like, all right, what are the five most valuable niches that I could go after? So there would be some research maybe involved and you're like, I'll pay you 10 cents for every email that signs up. And that would be brilliant because then the owner of the group is like, cool, and I'll make an extra hundred bucks a month. Great.\r\n\r\n\r\nChris Koerner (34:22.567)\r\nYeah.\r\n\r\n\r\nChris Koerner (34:25.928)\r\nDude, like if, go ahead. If I were like a mortgage broker, right? Mortgage leads are super expensive, hundreds of dollars, okay? There are thousands of real estate investing Facebook groups, thousands, right? In one market, Plano, Texas, you're gonna find 20, okay? And then if you go one niche, say, you know, self storage, Class B industrial, you're gonna find hundreds. So then when you multiply all those together,\r\n\r\n\r\nNikolas Hulewsky (34:28.865)\r\nNo, you.\r\n\r\n\r\nChris Koerner (34:54.408)\r\nprobably tens of thousands of Facebook groups for real estate investors. Some of those group owners are probably monetizing in some way. Many are not. If I'm a mortgage broker, I'm going to go to the owners, like you said, and say, hey, I'll give you 10 cents for every one, every email. And we'll both track it in the same Google sheet. You don't have to keep me honest. And then when I get an email, I'll just have a welcome email that says, hey, my name's John. I do loans. I see you're a real estate investor. We'd love to help you any which way. People like John, people like that mortgage broker are paying\r\n\r\n\r\nLike $50 to $300 for those leads. He could get them for 10, 20, 30 cents.\r\n\r\n\r\nNikolas Hulewsky (35:31.298)\r\nI would look at anybody, any business that currently joins Facebook groups and then just comments asking for business and turn that into something that goes even farther upstream. Like you're just saying, local business group of Plano, Texas, right? There's going to be a guy in there who's like, hey, I'm the local CPA. Anybody need CPA work? Hey, I'm the local insurance broker. Do you need insurance? Hey, I'm the local payroll automation person. Whatever. Do you need X, Y, and Z? Cool. That's great. They join the group for free.\r\n\r\n\r\nChris Koerner (35:42.931)\r\nGo on.\r\n\r\n\r\nChris Koerner (35:54.163)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (35:59.636)\r\nand they're just commenting and everybody rolls their eyes at them. Or if you're the local insurance guy, you go to the Facebook group owner and you're like, I'll pay you 10, let me implement this automation. I'll pay you 10 cents for every email that comes in. And now you don't have to rely on the mercy of somebody looking at your post and seeing you say you offer those services. You can just reach out to them. There probably are some implications. You know this better than me. Like you probably just can't email someone unless they've opted in.\r\n\r\n\r\nI don't know exactly how that would work in capturing the emails, but that's where my mind would go. Like go upstream. If you have a business that already provides value by going in Facebook groups, mean freaking Dan Magazzu, that's his whole business. He goes into Facebook groups, comments. What if instead he went to the Facebook group owner and was like, hey, I was gonna join and comment so could drive business, but instead I'll just pay you 10 cents per email.\r\n\r\n\r\nChris Koerner (36:56.424)\r\nMm-hmm. Mm-hmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (36:58.272)\r\nRight. And it's like, OK, cool. I'll make money. And I don't have the annoying spam in my comments. Great.\r\n\r\n\r\nChris Koerner (37:04.998)\r\nYeah. And what's great about this idea is there's a, there's a huge spectrum on how high quality or low quality these groups are. Some groups have no moderation and it's just spam and there's no engagement, but you could see that before you buy it or before you reach out to the moderator to cut a deal. And some of them are very tightly moderated and tightly curated. Therefore every post in that group gets a lot of comments, a lot of engagement. So you like, you can do all that filtering yourself. So you don't just have to scatter shot, reach out to everyone. So, okay.\r\n\r\n\r\nIf you're not a mortgage broker and listening to this, which I would imagine is 99.4 % of you, here's exactly how you could make money with this. There's the hook. That's a, that's a hook, right? That's a hook. It's a good hook. Here's what you do. You go to lendingtree.com. You type in info. I want mortgage info. You are going to find exactly the lending officers and mortgage brokers that are paying way too much money for leads. Okay. Now you know who your buyers are.\r\n\r\n\r\nYou already know you don't have to just randomly reach out to mortgage brokers. Then you circumvent lendingtree.com because it's going to show the name of the broker. You go find the guy in LinkedIn and say, Hey, you're on lending tree. You're probably giving them thousands of dollars a month with mixed results. Here's what I do. I'm a middleman. I partner with people like you and Facebook group moderators that are not currently collecting email addresses. You tell them exactly what you're doing. And I use software. I use proprietary processes.\r\n\r\n\r\nto acquire email addresses of real estate investors. Okay. And then.\r\n\r\n\r\nNikolas Hulewsky (38:34.038)\r\nJust say AI. Just say AI.\r\n\r\n\r\nChris Koerner (38:36.754)\r\nThat's it. That's it. I use a machine learning and augmented reality and crypto and NFTs.\r\n\r\n\r\nNikolas Hulewsky (38:44.044)\r\nWeb3, have you heard of Web3?\r\n\r\n\r\nChris Koerner (38:45.79)\r\nNo, but look at it this way. You go to the moderator of the good group, you say, I'm to give you 50 cents per email. You don't have to do anything. Okay, cool. Then you go to this guy and you say, $5 per email. You buy them? Yeah, I'm $30 per email. Absolutely. And you're just middleman. And you only start buying them once you've already sold them to someone. You just swipe the card every time there's a new row created in your Google Sheet.\r\n\r\n\r\nNikolas Hulewsky (39:09.644)\r\nOkay, you know the answer to this question. I don't know the answer. If I'm capturing all those emails from the Facebook group, like if I go to lendingtree.com, I am clicking yes, you can contact me and then those brokers contact me. If I'm signing up for the Facebook group and then there's an automation that asks me for my email and then I give it yes or no, am I allowed to then just cold contact them?\r\n\r\n\r\nChris Koerner (39:22.173)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (39:33.054)\r\nListen, Nick, there are some podcasts that don't do public math. This podcast doesn't do public talking about regulations and can spam acts. That's not for us to figure out. Okay, you can do it the right way. You would just have to put in the question when you ask it like, Hey, I'm gonna, I will email you once a week with you'll just have to put that in there. And also if someone does want to use this app that enables this\r\n\r\n\r\nNikolas Hulewsky (39:42.882)\r\nYou\r\n\r\n\r\nChris Koerner (40:00.958)\r\nplease use my affiliate link in the show notes, cause you'll get a discount. Thank you. Group boss.\r\n\r\n\r\nNikolas Hulewsky (40:04.354)\r\nWhat's the app?\r\n\r\n\r\nNikolas Hulewsky (40:08.594)\r\nOkay, here's my next question. Do Facebook groups, so like a newsletter, if I have 10,000 subscribers and I'm sending out a weekly newsletter, I can get advertisers that pay me for access to those subscribers. Do Facebook groups have advertisers pay them for access to their Facebook groups?\r\n\r\n\r\nChris Koerner (40:24.979)\r\nIt happens, but it's not like a common thing.\r\n\r\n\r\nNikolas Hulewsky (40:28.15)\r\nWhat does it usually look like? Is it just a post?\r\n\r\n\r\nChris Koerner (40:31.37)\r\nLike I've seen guys on Twitter that have like travel Facebook groups, like I think I met a guy once that had like a Hawaii tourist Facebook group with 150,000 people in it. And he would charge like 500 to a thousand dollars for like a local tour guide to post in there. And then they would pin it for like a few days. So there's kind of like a black market for that stuff, but it's not really regulated by Facebook.\r\n\r\n\r\nNikolas Hulewsky (40:55.938)\r\nactually might be a really cool way to do it is you go to them and you're like, hey, look, you've got 50,000 members in your Facebook group, right? Yeah, yeah. What's engagement like on any given post? I don't know. A thousand people see it, right? right. Let's just say it's thousand people, right? One fiftieth of your whole audience sees any given post. So it's like, here's what you should do to make sure that your Facebook group stays in the know. You need to have a weekly newsletter.\r\n\r\n\r\nChris Koerner (41:10.674)\r\nThey could show screenshots of like the analytics.\r\n\r\n\r\nAhem.\r\n\r\n\r\nNikolas Hulewsky (41:25.772)\r\nthat just updates them on like the top three posts of the week. Hey, just so you're in the loop in case you missed it, that's all it's called. In case you missed it, business owners, and it just shows you the top three posts, you collect their emails upfront, that's what you tell them it's for, and then you sell advertising through the newsletter. Now, again, if I'm the mortgage broker, that's a really, really easy way to get in there and be like, hey, look, I'll make you the newsletter. It's easy, I'll set you up on Beehive, I'll create the automations.\r\n\r\n\r\nChris Koerner (41:32.882)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (41:43.538)\r\nMmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (41:54.882)\r\nAll I want is for your first six months to have a free advertisement. That's it. Right? And then it's done. And then you don't have to worry about the opt in, opt out, piece because they're opting into the Facebook group and their updates as opposed to you as the mortgage broker just contacting them and buying the lead. Because I would get kind of pissed if I was in that Facebook group and I just got cold contacted by a freaking mortgage broker. like, I didn't give – No.\r\n\r\n\r\nChris Koerner (42:01.114)\r\nMm-hmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (42:24.704)\r\nI gave the group my email. didn't give this mortgage broker my email.\r\n\r\n\r\nChris Koerner (42:27.678)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (42:30.358)\r\nYou have so much you want to say right now. I love it. You're just like,\r\n\r\n\r\nChris Koerner (42:30.568)\r\nThat's good. No, I don't. I don't. It's good. There's that's a lot of dopamine.\r\n\r\n\r\nNikolas Hulewsky (42:39.874)\r\nOkay. Still, you want to take a break real quick?\r\n\r\n\r\nBathroom break.\r\n\r\n\r\nChris Koerner (42:48.882)\r\nYeah, get a drink. Let me get a drink.",
  "metadata": {
    "duration": "",
    "date": "2024-11-29",
    "platform_source": "Google Drive"
  }
}