{
  "episode_number": "106",
  "episode_title": "TOP PICK! How to Use AI Agents to Do the Work For You with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Not Applicable (Discussing business ideas)",
  "transcript": "﻿Chris Koerner (00:00.838)\r\nWell, Nick, do you want to kick us off or should I? You call it.\r\n\r\n\r\nNikolas Hulewsky (00:04.763)\r\nChris, it's 2025, okay? I want you to kick us off.\r\n\r\n\r\nChris Koerner (00:10.11)\r\nAll right, I got an idea. I got a business idea. No, there's no time for pleasantries.\r\n\r\n\r\nNikolas Hulewsky (00:11.791)\r\nWow, you just took it. You didn't even fight it, okay? Heartful.\r\n\r\n\r\nYou\r\n\r\n\r\nChris Koerner (00:19.656)\r\nSo did you see that tweet by Andrew Wilkinson about how he created an AI agent to set a restaurant reservation for him? Okay. So I saw, yes. Yes.\r\n\r\n\r\nNikolas Hulewsky (00:30.928)\r\nYes.\r\n\r\n\r\nDid you watch the video of him on the tweet? OK, did you have the same thought I did?\r\n\r\n\r\nChris Koerner (00:42.45)\r\nDo we need to edit this out? I don't know.\r\n\r\n\r\nNikolas Hulewsky (00:44.411)\r\nwe might. I was like, you're a billionaire. He's like he was in like this like cardboard cut out the plywood. Anyways.\r\n\r\n\r\nChris Koerner (00:48.695)\r\nJust.\r\n\r\n\r\nYeah, there was like plywood behind him. I'm like, you good bro? Blink, blink twice if you good bro. Is that, that, is that like a Chipotle plywood vibe? Like are you, are you purposely intending for that to be a vibe or are you, did notice that anyway. So it's just, of all, zooming out. You, you and I both know about AI agents. We both know that this tech is possible, right?\r\n\r\n\r\nNikolas Hulewsky (01:04.215)\r\nYeah.\r\n\r\n\r\nWas this designed on purpose?\r\n\r\n\r\nNikolas Hulewsky (01:13.989)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:19.752)\r\nThere's a company called air.ai that has been enabling like voice caller agents for over a year now. And I played with it right when it came out. And like, this is a very simple use case for AI agents.\r\n\r\n\r\nNikolas Hulewsky (01:31.899)\r\nJuly 2022, we were playing with it.\r\n\r\n\r\nChris Koerner (01:34.428)\r\nYeah, very simple use case, but just seeing it and just the context and the framing. don't know. It just set off this flurry of ideas for me. Isn't that interesting? Like I knew it was possible, but I just saw it it's like, okay, that's not the end idea. Like a restaurant reservation center, but how could you apply this?\r\n\r\n\r\nNikolas Hulewsky (01:54.171)\r\nIt's because when we played with it, it wasn't good. You could see that it was going to be something good at some point, but the technology just wasn't there. And I just don't think we've adapted to how fast this technology is changing because in my mind, AI would still be what it was two years ago. And I haven't played with it for two years. So of course, you're not up to speed with how good it potentially is right now.\r\n\r\n\r\nChris Koerner (02:20.328)\r\nSo from what I saw, honestly, it was about as good as when I was playing with it. And the because because what was the same for me was the pause. There's still an awkward pause in his video. And when I played with it a year ago, and so I didn't see enough in the video to know how much like logic the AI had. But I know that the pause is like the worst part because it's very unnatural. Okay, but you can get around that. So I watched the video.\r\n\r\n\r\nAnd then I go over to that room and I start doing the dishes. And I'm just thinking, I'm just thinking, I'm just scrubbing and thinking and scrub. I'm just scrubbing the balls. I'm scrubbing the glasses.\r\n\r\n\r\nNikolas Hulewsky (02:55.483)\r\nI'm just thanking. I got the bubbly, it's bubbling up.\r\n\r\n\r\nNikolas Hulewsky (03:02.703)\r\ngot the silverware soaking in the water. But can we just talk about how much we both love washing dishes? Because it's like that mindless activity that allows your brain in the background to like run and like you just\r\n\r\n\r\nChris Koerner (03:05.406)\r\nAnyway.\r\n\r\n\r\nChris Koerner (03:11.346)\r\nYes. And it makes us pretend like we're halfway decent husbands for like an hour.\r\n\r\n\r\nNikolas Hulewsky (03:18.083)\r\nWhen it solves the ADHD of us where it's like, I did a task and there's the outcome like really quick. You can see the result of what you did like I I do enjoy washing dishes.\r\n\r\n\r\nChris Koerner (03:27.41)\r\nThe bar the barbell strategy is employed when I do the dishes, because I only do the dishes when I'm in a good mood, or a really bad mood. If I'm, if I'm in a steady state, I ain't doing those dishes. Okay? If I'm angry at something, I'm gonna be scrubbing those dishes so hard. Yeah, that's just me. But I do I do enjoy it, honestly. So I'm doing the dishes. And I'm thinking and my kids are like, Dad, what do think about this? And I'm just like, huh. I'm like, Dad, Dad.\r\n\r\n\r\nNikolas Hulewsky (03:35.343)\r\nHahaha\r\n\r\n\r\nYou\r\n\r\n\r\nNikolas Hulewsky (03:46.456)\r\nmy gosh.\r\n\r\n\r\nChris Koerner (03:56.828)\r\nAnd like, I'm just thinking of ideas. I'm in the zone, right?\r\n\r\n\r\nNikolas Hulewsky (03:59.535)\r\nDad, I love you. I just want to tell you one thing really important. Yeah, well, okay, whatever.\r\n\r\n\r\nChris Koerner (04:02.398)\r\nDad, mom left for milk and she hasn't been back in seven hours. Anyway.\r\n\r\n\r\nNikolas Hulewsky (04:08.155)\r\nDad, do you still love me? Because last night, anyway, sorry, keep going.\r\n\r\n\r\nChris Koerner (04:12.605)\r\nSo.\r\n\r\n\r\nWho likes calling people on the phone? to, no one, that's universal. You're not special if you don't like making phone calls, right?\r\n\r\n\r\nNikolas Hulewsky (04:23.003)\r\nI mean, talking to your friends is one thing, like to get something done, no, nobody likes talking on the phone.\r\n\r\n\r\nChris Koerner (04:25.158)\r\nSure, sure, sure, sure, sure.\r\n\r\n\r\nYeah. And so I started thinking, how could we productize something like this? Okay. First of all, remember what we did with the stump stump grinding business. We had a virtual assistant call every stump grinding company in Houston and asked a few questions. He surveyed them. How much would it cost? Would you ever outsource it to us? Yada, yada, yada. It was really interesting. We did a couple of podcasts in it. It was like July. If you want to go back and listen, we could do something like that. We could do like a business idea validation, agent that\r\n\r\n\r\ncalls up businesses and asks, you know, does research, what is your pricing and all that. That was like my first level of ideation. What do you want to say?\r\n\r\n\r\nNikolas Hulewsky (05:04.911)\r\nYeah, no, well, I'm smiling because you and I never share notes beforehand and we didn't this time either. This perfectly integrates with like one of my ideas. So it's not the same, but it does perfectly integrate. I'm not going to mention it yet, but this is similar to the idea that we had a couple of months ago about the car. What is it? Car selling? Yeah, car negotiations where we'd have a VA call. It's a VA. It wasn't AI, but it was a VA calling around to like negotiate the best prices on people's behalf. So yeah, I.\r\n\r\n\r\nChris Koerner (05:24.19)\r\nnegotiations.\r\n\r\n\r\nChris Koerner (05:30.771)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:34.747)\r\nI think I like where you're going. Keep going.\r\n\r\n\r\nChris Koerner (05:36.542)\r\nYeah. So that was the first line of thinking. It's like, okay, well, our audience, their business owners, their aspiring business owners, you know, we, you know, if someone wanted to launch a home service business, let's say a plumbing business in Dallas, they could call around and you know, what percentage of people are answering their phone because it doesn't even matter if there's a pause of no one's answering. You can just mark that on a spreadsheet. How much is the cost for a toilet replacement from 20 different plumbing companies? Let's compare side by side. And then it's like, okay, but that's like,\r\n\r\n\r\nIt's not even that it's too niche because I'm, you know, I'm cool selling stuff to aspiring business owners, but people just don't do this. We'd have to convince aspiring business owners to do this type of market research. You know what I'm saying? We're like, this is valuable to do. We can help you do it. That's a lot of friction. So I quickly moved out on from that. Okay. And then I start thinking like a mass market. Okay. So what if you're a 24 year old woman that's engaged and you're planning a wedding, you're going to be making a lot of phone calls.\r\n\r\n\r\nVenues, catering, photography, flowers. I knew you were going to say that. Like the more people you call theoretically, the more money you save because you're getting more quotes, more data points, right? But most people aren't going to call that many. They're going to get a quote that seems okay. And then they're going to stop. Okay. So then I start thinking mass market and it could be like for, for wedding planners or for people planning a wedding, it could be a service for them.\r\n\r\n\r\nNikolas Hulewsky (06:38.875)\r\nThe menu, the venue, the seating.\r\n\r\n\r\nChris Koerner (07:04.178)\r\nto call and this is what the agent would do it would say like you get ahead of the pause and it's very important here it's like hey I'm working on behalf of Mallory Smith first name last name in city name very important right I'm not you know some random robot calling you trying to sell you something she has a wedding planned on March 31st I don't even think there is a March 31st March 30th I don't know my months\r\n\r\n\r\nNikolas Hulewsky (07:28.699)\r\nNo, there's a March 31st. Dude doesn't even know his month, the days.\r\n\r\n\r\nChris Koerner (07:33.8)\r\nHold on, me count my knuckles. Let me count my knuckles. yeah, it's a bit. It's a bit now. this out, but actually don't because it's funny. I want people to hear it. Don't edit that part out either, because I want them to hear me telling you to edit.\r\n\r\n\r\nNikolas Hulewsky (07:36.507)\r\nOh, Yeah. Oh, that's a 31. It's 31.\r\n\r\n\r\nNikolas Hulewsky (07:54.491)\r\nKelly was just telling me we need to have a safe word for what really needs to be edited out. All right.\r\n\r\n\r\nChris Koerner (07:57.83)\r\nI know, I know. Anyway, so it's like, okay, so the agent calls and it's like, hey, I'm calling on behalf of Mallory Smith. She lives here in Plano, Texas. She has a wedding plan for March 31. She's trying to get as many and it's just like the first the intro is just like a pre it's just a very long preamble because there's no pause.\r\n\r\n\r\nNikolas Hulewsky (08:16.931)\r\nYeah, you're telling them like basically don't hang up on me. I'm an AI agent.\r\n\r\n\r\nChris Koerner (08:21.502)\r\nWell, you're not even there yet, but we're getting there. Yes, because they probably don't know in that first preamble because there hasn't been an opportunity for a pause, right? So it's like, hey, I'm helping her with this wedding. She's trying to get as many quotes as possible. I like a quote for X, Y and Z, something very specific, something that's like their language, right? Like 50 heads, we're budgeting for 15 to $20 per head, we want two appetizers aside and a meat, right? And then it's like, also at the end of it, now like, you've got them, they're hooked.\r\n\r\n\r\nNikolas Hulewsky (08:23.491)\r\nRight, right, right, right.\r\n\r\n\r\nChris Koerner (08:51.44)\r\nAt the end of it, it's like, also, I know this is weird, but I am an AI agent. you're going to, you're going to see a pause in this conversation, but ask me anything you wish. I'm going to report all of it back to Mallory. And if your quote is competitive, she's going to give you a call herself.\r\n\r\n\r\nNikolas Hulewsky (09:07.355)\r\nthese AI agents were stupid. I'm gonna see a pause. Okay, I don't know who this is. I don't see pauses. hear pauses.\r\n\r\n\r\nChris Koerner (09:12.358)\r\nHoney! Arnold Schwarzenegger's calling! It's here!\r\n\r\n\r\nNikolas Hulewsky (09:20.421)\r\ncalling on some wedding questions. Do I get to the chopper first or second? Sorry.\r\n\r\n\r\nChris Koerner (09:27.292)\r\nAnyway, so you finish it, you finish it with like, am an AI agent. I know this is weird, but like, please ask me any questions you wish. I am intelligent. And I'm going to report all this back to Mallory and she's going to call you back herself if your quote is competitive. And then you're like, okay, wow, this is weird. Okay. Well, our pricing is okay. Well, does that pricing include silverware? And it's going to ask all these relevant followup questions and it's literally checking boxes in the spreadsheet and then they hang up. And then Mallory just gets an email summary at the end of the day.\r\n\r\n\r\nwow, this is competitive. Yeah, I'm gonna give them a call. And it's like the offer is the no brainer offer, like, we will save you $5,000 on your wedding, or like money full money back guarantee if you don't feel that we saved you any money. So anyway, go ahead.\r\n\r\n\r\nNikolas Hulewsky (10:13.155)\r\nNo, I like it being hyper niche because you can have an AI model that you can train. even is her name Mallory? Right, right, right. But her name is Mallory in this instance. OK, so it's like Mallory finds this and from the beginning, it's not just making calls. It's like, all right, Mallory, have you thought about this? It's an inner iterative and interactive process with the AI agent to figure out what exactly she's looking for. And then based on that set of parameters.\r\n\r\n\r\nChris Koerner (10:18.394)\r\nMm-hmm. Mm-hmm. It won't like go off the rails, right?\r\n\r\n\r\nSure, sure.\r\n\r\n\r\nNikolas Hulewsky (10:42.059)\r\ncan go out and search for the venues in their area because they're all now able to go out and crawl the open web, tell Mallory, here are the top five that I recommend you call. What do you think? Mallory says yes or no, and then it goes out and executes on that. because it's, let's say it's just trained on weddings, it knows what questions to ask. can train it to ask specific data. You can enter in your own proprietary information if you're a wedding venue or whatever it is. I'm out of my depth with the wedding stuff.\r\n\r\n\r\nChris Koerner (10:51.73)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (11:06.312)\r\nMm-hmm.\r\n\r\n\r\nAnd it's going to ask questions that Mallory wouldn't even think to ask because guess what? She's probably never been married before.\r\n\r\n\r\nNikolas Hulewsky (11:13.395)\r\nRight. Yeah, because you're either going to pay $10,000 for a wedding planner or for most people, you're going to do it on the cheap and you're just going to plan the wedding yourself. This is the AI wedding planner, the Claude wedding planner, right? Like, and they help you plan everything related to the wedding and they know what questions to ask. They don't a general price that it should be right. Like how many times are you pricing something out and you're like, I don't know. Is that good? Is that a good price and it can go crawl the web?\r\n\r\n\r\nChris Koerner (11:38.706)\r\nYeah, you don't know. There's no baseline.\r\n\r\n\r\nNikolas Hulewsky (11:41.145)\r\nYeah, I go call the web and say, generally speaking, this is how much this should cost. And then the more people that you have using that product, it becomes a network effect because then you're actually getting the data that people spent so it can get proprietary information to level set and say, this is what market is for these services. anyways, I like it. I like it a lot for niching down.\r\n\r\n\r\nChris Koerner (12:01.544)\r\nHonestly, it's like, could be as simple as a chat bot and you can integrate it with iMessage with just a text chat bot. It's literally someone you have saved in your phone and you treat it like, Hey, how much should catering costs? Like in, in Plano, Texas, like one guy quoted 30 bucks a person. One guy quoted seven, like what is average? And it will have all this expertise to answer you. And then you can say, okay, go call 30 caterers and I'm targeting 13 bucks ahead. Okay. I'll be back in two hours.\r\n\r\n\r\nNikolas Hulewsky (12:05.307)\r\nHmm?\r\n\r\n\r\nNikolas Hulewsky (12:17.362)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (12:29.371)\r\nOkay, you glossed over this. You can integrate it into your iMessages.\r\n\r\n\r\nChris Koerner (12:32.914)\r\nYeah, with text message.\r\n\r\n\r\nNikolas Hulewsky (12:34.491)\r\nto Because I go right now and I just open the app every single time with chat GPT and I'm like, hey, blah, blah, blah. But if it was just integrated into my text messages, is it an iMessage or is it blue or green?\r\n\r\n\r\nChris Koerner (12:48.136)\r\nthink it's gonna be green next.\r\n\r\n\r\nNikolas Hulewsky (12:50.104)\r\nI will remember you\r\n\r\n\r\nChris Koerner (12:53.022)\r\nThe 38 % of Android users are logging off right now. They just put their phone down and unsubscribed.\r\n\r\n\r\nNikolas Hulewsky (12:59.183)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (13:03.841)\r\nthat I didn't know that didn't know you could. How do you integrate it with your, with your texts? I know.\r\n\r\n\r\nChris Koerner (13:07.952)\r\nIt you got to find workarounds like for the average consumer. I mean you could use Lindy or you could use Zapier or through Twilio through Twilio. Yeah.\r\n\r\n\r\nNikolas Hulewsky (13:15.909)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (13:19.707)\r\nThat's a tweet. Anyways, sorry, I like that idea. Put it as a text message and then you're just literally questioning it. it's not like Google in the sense that it's, ask a question and it gives a specific answer. Many times when you're using these models, ChatGPT, Claude, Gemini, they'll give you an answer and then they'll ask you another question, right? Like, did that answer or have you thought of these things or would you like me to plan X, Y, and Z, right? it does, it's an interactive.\r\n\r\n\r\nChris Koerner (13:20.99)\r\nThere you go.\r\n\r\n\r\nNikolas Hulewsky (13:48.677)\r\nconversation as opposed to just a one-way asking, answer, ask, answer. It's like ask, answer, ask back.\r\n\r\n\r\nChris Koerner (13:56.914)\r\nYeah, it's like it's it's chat GPT that can go out and do things for you, which to us is like, it's called an agent, but to 99.9 % of humans that is mind blowing to them. Cause it's like the person, the Mallory that we're selling this to, and I'm picturing two pricing pans plans, one to the woman who's planning her own wedding and then one to the wedding planner. That's going to be a much more high volume user. They would need to pay more. Right? So all of these people like\r\n\r\n\r\nNikolas Hulewsky (14:20.507)\r\nYeah, that's a good one.\r\n\r\n\r\nChris Koerner (14:24.574)\r\nA 20 to 40 year old woman is used to using chat GPT most likely, right? But if you were to say, Hey, I want you to ask it like what an average catering order costs. Okay, I could do that in chat GPT. And then I want you to ask it to go call 30 caterers in your area and report back on prices. Oh, wait, what? How can it call? And then it's like, Well, do want me to call you right now? We'll do a sample call. Yeah, sure. They'll pick up her phone and she can play the role of a caterer.\r\n\r\n\r\nand she can just ask questions and just see how good it is.\r\n\r\n\r\nNikolas Hulewsky (14:55.195)\r\nLet ask you a question. What percentage of the time do you use Google and what percentage of the time do you use an AI model, chat GPT, Claude?\r\n\r\n\r\nChris Koerner (15:02.842)\r\nI almost never use Google anymore, unless I'm in Google maps or there are some exceptions.\r\n\r\n\r\nNikolas Hulewsky (15:08.185)\r\nSure. Sure. That's what I think. Searching for physical businesses, I think, and products like that, I still use Google for. And I think I would bet even though our audience is probably tech forward, 50 % of them still don't use ChatGPT or an LLM in the way that they should be using it. I want to get like, this is a perfect example I'm going to give right now. We bought our son's Apple watches for Christmas. They had these, they had the little gizmos that were set where they could only call like,\r\n\r\n\r\nChris Koerner (15:12.326)\r\nhuh. Yup.\r\n\r\n\r\nNikolas Hulewsky (15:37.871)\r\ncouple of people and they were fine for a period of time, but the GPS on them didn't work really well and it was gated so we couldn't add that many contacts to it. There was a certain number of contacts that it could add. And so we were like, you know what, let's get the Apple watches for them. Cool. So we get them Apple watches for Christmas, but we still don't want them calling everybody. We don't want them getting out to the open web. And also we don't want them to have access to the game center. We don't want them to\r\n\r\n\r\nChris Koerner (15:43.208)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (16:04.254)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (16:05.691)\r\nbe able to receive calls, we want them to be able to make. Anyways, there's like a whole set of things that we wanted to set in order to gate their experience. Well, if I went to Google and I said, how do I set permission parameters on the Apple Watch for new watches? I'm going get a list of articles that were pre-written with somebody else's idea in mind of what they thought I might be asking. So it's not going to be exact. There may be one article that's like, hey, how to limit phone numbers.\r\n\r\n\r\nChris Koerner (16:30.974)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (16:34.239)\r\nThere may be another article that's like how to make sure the game center is not active. And there may be another article that says how to make sure the web isn't available, but Siri still is, right? Whatever. I entered in all the parameters. It's a lot of clicks and I've got to read and I've got to then interpret, internalize, and then I got to do it myself. I went to Jachi BT and I wrote a long prompt. I said, here are the things that exactly that I want. Please give me a step by step process to do this. And guess what? It was perfect.\r\n\r\n\r\nChris Koerner (16:41.854)\r\nIt's a lot of clicks, right?\r\n\r\n\r\nNikolas Hulewsky (17:03.395)\r\nI didn't even have to ask it a second time. Jess was sitting there with me and we went through it and it was like, okay, go to your phone, open this setting. Click on this. This should be, this should be here. Go to the watch. Very, very easy. And I think what most people don't realize is, is that change is so enormous from, Hey, here's an article that might help you solve this to this is the answer. And then what we're talking about on top of that is this is the agent that will go out.\r\n\r\n\r\nChris Koerner (17:09.854)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:33.271)\r\nexecute this function and bring it back to you with an answer. It's two-step functions away from even Google at this point. Even the people who are listening to this, think, probably aren't using ChatGPT enough.\r\n\r\n\r\nChris Koerner (17:37.128)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (17:48.606)\r\nYeah, you can take it even a step further. Like I was making sourdough bread for the first time and it's a little complicated and I pulled out my starter and it had like deflated and I made the sourdough and I'm like, okay, the consistency is kind of weird and we're just having this conversation and then I took a picture of the sourdough and I'm like, what does this mean? What does this mean? And it's like, oh, and what it told me is exactly what it was. It was like, oh, that's because you didn't leave it out long enough. You need to do this. You need to feed it with 50 % flour, 50 % water.\r\n\r\n\r\nNikolas Hulewsky (18:12.261)\r\nThat's insane.\r\n\r\n\r\nChris Koerner (18:18.622)\r\nAnd it's like, how many, how many chefs or how many people cooking in their home kitchens are even thinking to do this? And there's probably 20, 30 apps in the app store right now, like AI enabled cooking apps like this that offer this. bet you there's room for like 200 more because it's so early and people, if you're listening to this and you have an idea like this, like, Oh, I like a cooking assistant app that's $5 a month that you can talk to and take pictures of.\r\n\r\n\r\nNikolas Hulewsky (18:39.131)\r\nIt's so early.\r\n\r\n\r\nChris Koerner (18:47.238)\r\nAnd then you go, you're going to go to the Apple apps or I've never done this. I just know you're going to open it you're going to see dozens of these and you're going to be disheartened and you're going to move on. Don't be like press forward cursor.ai is like the website for specifically building iPhone apps using AI and it's like plug and play. So there's just room for so much more.\r\n\r\n\r\nNikolas Hulewsky (19:06.683)\r\nHave you played with the chat GPT? I'm sure Gemini does this as well where you just talk to it, ask it questions.\r\n\r\n\r\nChris Koerner (19:16.008)\r\nverbally. When I'm driving sometimes I will but not really.\r\n\r\n\r\nNikolas Hulewsky (19:20.655)\r\nI'm not trying to over exaggerate. I feel like I'm living in the future because, and I have to do this. I know this is going to sound so stupid. I have to tell myself, I have access to whatever I'm curious about. Let's say that I want to learn about Bitcoin. It's like, have access to Satoshi. I'm going to ask him questions. And so I'll ask a first question and Chat CPT will give me the response, but then I can ask follow up questions. So if I'm on a walk,\r\n\r\n\r\nChris Koerner (19:48.925)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (19:50.435)\r\nor if I'm driving, I can have a conversation. And it's like teaching me as we're talking, as if I have, you know, Satoshi or whoever the PhD of the topic that I'm most interested in. And it's giving me real information. It's like a, it's like a course in my car, which is, it's just nuts to me that I have access to that right now. There's so much ability to learn.\r\n\r\n\r\nChris Koerner (20:11.218)\r\ncrazy. lot of opportunity. No. So, so I bought a domain name for it. I bought a domain name for it. So I think you could do this with the generalized name I'm about to tell you and just focus on weddings and then go broad from there. Or I think this could be a standalone wedding product like we talked about. But the domain name I bought, are you ready? So have you heard of do not pay.com?\r\n\r\n\r\nNikolas Hulewsky (20:12.793)\r\nSorry. So I love that idea. I love the idea.\r\n\r\n\r\nChris Koerner (20:37.884)\r\nSo, I mean, do not pay is like, it's a nine figure company and they started by just like, it was an automated service where you could dispute your parking ticket in San Francisco. That's how niche they started. And yeah, now it's, and they've been funded by like, like Sequoia and all the big names, do not pay.com. I'm trying to see like what they're purporting themselves to be. Your AI consumer champion. Do not pay uses AI to help you fight big corporations, protect your privacy, find hidden money and beat bureaucracy.\r\n\r\n\r\nNikolas Hulewsky (20:47.589)\r\nHmm. That's amazing.\r\n\r\n\r\nChris Koerner (21:08.102)\r\nThis is a big company. It started out very niche. So I was thinking along those lines. What could I name this? That's like, it just stands out. It says exactly what it does. A few syllables. you could start at niche with weddings and then go as broad as you want. Like they did with parking tickets. Never call again.com. That's it. I own it. It's mine now.\r\n\r\n\r\nNikolas Hulewsky (21:26.491)\r\nOh my gosh! I'm, dude, I'm done. I'm done.\r\n\r\n\r\nChris Koerner (21:36.103)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (21:37.379)\r\nAre you freaking kidding me, dude?\r\n\r\n\r\nChris Koerner (21:39.485)\r\nHe's gone.\r\n\r\n\r\nNikolas Hulewsky (21:40.857)\r\nAre you freaking kidding me, Do not call again.\r\n\r\n\r\nChris Koerner (21:42.526)\r\nIt's a good one. It's a good one. Never call again. Never call again.\r\n\r\n\r\nNikolas Hulewsky (21:47.339)\r\nnever call gosh dang it Chris it's so good it is so good\r\n\r\n\r\nChris Koerner (21:51.144)\r\nGood, right? So it could also be like a monthly membership, like just to keep in your back pocket, 20 bucks a month. And it's like, our AC just broke. I want 10 quotes. Click. got 10 quotes.\r\n\r\n\r\nNikolas Hulewsky (22:04.943)\r\nthat name though. But that name though. Gosh dang it. That's a good name. Never call again.com. Holy crap.\r\n\r\n\r\nChris Koerner (22:06.568)\r\nGood night.\r\n\r\n\r\nChris Koerner (22:14.088)\r\nSo anyone listening to this, you're welcome to go copy me, but you can't take the name. So it's mine now.\r\n\r\n\r\nNikolas Hulewsky (22:20.335)\r\nWell, I think this is going to be an all AI episode.\r\n\r\n\r\nChris Koerner (22:24.505)\r\nshoot. Okay, we're doing this. I mean, how could it not be? It's so transformative.\r\n\r\n\r\nNikolas Hulewsky (22:28.667)\r\nIt is. It's very trans. So is it my turn? I tell an idea? All right. So I was talking to my son about Royce. was talking to Royce about AI and why it's important. we've been playing around with it. I was like, Royce, you know what's interesting is that knowing the right question to ask is as important as whatever answer you think you want to get. He's like, really?\r\n\r\n\r\nChris Koerner (22:33.052)\r\nYes, please.\r\n\r\n\r\nChris Koerner (22:54.056)\r\nI Nick real quick. I have this exact conversation in the last week with my kids. The exact conversation. You got to know what questions to ask. It could open up the whole world to you.\r\n\r\n\r\nNikolas Hulewsky (22:59.856)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (23:06.011)\r\nYeah, yeah. It's pretty funny. So we're sitting there and we're talking and I'm telling him, Royce, you're curious, I'm curious. I can't tell you how many times I've asked a question and everybody else who's sitting around me has been like, on, that's stupid. But when we start drilling into it, it's like, oh, nobody really knew the answer to that question, right? And nobody had thought to ask it because, oh, well, everybody knows the answer or it just seems so obvious.\r\n\r\n\r\nChris Koerner (23:10.878)\r\nAhem.\r\n\r\n\r\nNikolas Hulewsky (23:35.967)\r\nAnd as we were talking through, was like, did you know that there are jobs out there that people are paid a lot of money for? Where they're literally paid to figure out the right question to ask for these LLMs to return the right answer. He's like, really? I'm like, yeah, they're called a prompt engineer. So what do they do? It's like, well, these LLMs are very specific. And so you have to be very specific with the parameters that you give them. What does the outcome look like? What information can they use and digest?\r\n\r\n\r\nCan it be inferred? Does it have to be cited? Where are they pulling the information from? All of those things. And so in order to get the right answer, you have to ask the right question there, these prompt engineers. He's like, wow, that's really interesting. so he starts researching that. And I started thinking about this. Do you remember, I don't know if they still do it, but do you remember in the Apple stores where they'd have like Saturday morning classes and every grandma would go and they'd bring their iPad and it'd be like, they still do it? Okay.\r\n\r\n\r\nChris Koerner (24:28.434)\r\nThey still do.\r\n\r\n\r\nNikolas Hulewsky (24:31.003)\r\nThis is how you access photos. It's like, oh, are you my grandson? You know, and they've got people telling them what to do. I think there's a world where an entrepreneur is an enterprising entrepreneur could either do a physical in-person or virtual class for boomers on how to use chat tpt. Because right now, mean, even teenage kids that I've shown how to do it, they don't know how to use it. They use it for novelty. They're like, oh.\r\n\r\n\r\nChris Koerner (24:35.656)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (24:50.216)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:57.519)\r\nCan you spell penis? You know what mean? Like, this is just like, they think it's something funny. It is pretty funny. But they don't know like, okay, what else would I use this for? Like, what's, I can ask the first question, but what's the next question? How do I get the most out of it? And so if I was in this space, if I was in college in particular, and I wanted a side hustle, I would launch a business around educating adults. It doesn't even have to be boomers, just adults on how to ask\r\n\r\n\r\nChris Koerner (25:01.374)\r\nThat is pretty funny though.\r\n\r\n\r\nChris Koerner (25:14.366)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (25:27.269)\r\nand how to get the most out of chat GPT. What do you think?\r\n\r\n\r\nChris Koerner (25:32.158)\r\nAbsolutely. Like I'm thinking of other variations of this. Like this is just a thought I had while you were talking. Open AI is not about to spend millions of dollars pushing paid targeted ads towards boomers that don't know how to use chat. They've got too much on their plate or like or like a boomer that wants to cook better with chat. You BT. There's like no one at open AI that's not on their radar. Right. That's why you want to build a rapper.\r\n\r\n\r\nthat can help boomers cook better with chat GPT. And so I'm thinking like a twist on your idea is to just make a ton of rappers that make the prompting easier that basically prompt the old people to ask better questions. So like you download an app for 999 and that's pushed to the boomer through paid ads. The boomer downloads it and then the app starts talking to them and like basically pushes them along. What do you want to know?\r\n\r\n\r\nAnd it does the same thing as what you're saying, but through an app and not through a class.\r\n\r\n\r\nNikolas Hulewsky (26:36.059)\r\nSo I like the rapper. I really do like the rapper idea. But the reason I like doing this as a class is because of the reasons. You know how when you post stuff to Twitter and people are like, it's not that easy, bro. Actually, what about insurance? He doesn't think about the liability that's going to come, right? And you post about that stuff. Every time you post,\r\n\r\n\r\nChris Koerner (26:57.64)\r\nWhy don't you do it? If it's such a good idea, why don't you do it, bro?\r\n\r\n\r\nNikolas Hulewsky (27:03.323)\r\nIf I had to start over again and make $100,000 this year, this is exactly how I would do it step by step. And then I text you, I'm like, could, but could you do that? Please? Could, could you do that please? Anyways, like, I think that someone with would hear this, Oh, put a wrapper on it and be like, Oh yeah, I'm going to put a wrapper. And they start doing a little bit of research and there's friction. And they're like, Oh, it's too hard. I don't want to do it. Yes.\r\n\r\n\r\nChris Koerner (27:27.998)\r\nI see what you're saying. For the person listening that wants to start this, that might be kind of a bridge too far. Yeah.\r\n\r\n\r\nNikolas Hulewsky (27:34.265)\r\nYeah, yeah. But I think if they started this within three months, they're going to be so good at chat GPT, they're going to be like, I can build a wrapper. I could just have chat GPT even tell me how to build the wrapper. I have all these tools and resources to build the wrapper. think that's the iterative next step where I would start with this is, and this might be too controversial. I would go to my local church that I'm a member of and just say for free, I'm not asking for money. Hey,\r\n\r\n\r\nChris Koerner (27:44.317)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (27:57.886)\r\nCan you loan me money for this investment scheme with infinite? Is that what you're, nevermind.\r\n\r\n\r\nNikolas Hulewsky (28:02.371)\r\nNo, no, I'd say, God told me I'm supposed to start this business. That's I'd say. I'd go and I'd say, hey, look, we do activities. One of the activities at nights I'd like to do is just show any member of the ward or any member of the congregation, any member of whatever parish, how to use chat GPT. Can we put on the books? And I would just test it and I would just see what the response is like. Did it work? How was it received? Odds are somebody in the congregation is going to be like.\r\n\r\n\r\nChris Koerner (28:23.848)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (28:30.437)\r\ncould you come and help me do this a little bit more this week, right? And you'll get even more experience doing that. And then at some point that that might blossom out into other business, but I would, that's where I would test it first before I went full bore into it. And then from there, I would use the same distribution channels that we've been talking about since the beginning of time, email, Twitter, social media, et cetera. But if I didn't have those things again, potentially controversial, I would go to\r\n\r\n\r\nChris Koerner (28:33.47)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (28:58.253)\r\nAssisted and independent living facilities. Mainly independent living facilities because. Assisted living facilities you get people there who just like really aren't all there independent. They're still all there. They just need a little bit extra help. And I would just offer offer a free class and then I guarantee at the independent living facility after the class you'll get 10 people coming up to you saying I'll pay you 50 bucks for half of an hour if you teach me how to do X, Y and Z. That's where I would start. This business if I didn't have a social platform.\r\n\r\n\r\nChris Koerner (29:10.931)\r\nYeah.\r\n\r\n\r\nChris Koerner (29:27.294)\r\nDo you think that's the revenue model is charging for your time? Like per hour? Is it like a subscription?\r\n\r\n\r\nNikolas Hulewsky (29:30.98)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (29:34.863)\r\nBack to what we were talking about, I think to get into it for just the person listening is like, I want to try this out. Yeah, it'd be for hour per hour. I think eventually there's a million things you could do. You could create the wrapper. You could have a subscription. We talked about this when we were talking about recording stories in these facilities. You could create a video of yourself interacting with them and set these up around the city for people to have interactive.\r\n\r\n\r\nChris Koerner (29:59.966)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (30:02.971)\r\nconversation. So yes, it is you, but it's not really you. But I think the first step would be like, all right, prove that you can generate some income, learn the product and the education piece of it, and then scale.\r\n\r\n\r\nChris Koerner (30:16.914)\r\nI like it. I like a lot. think a lot of, think it would lead to like more higher ticket things just naturally, right? Based on the type of demographic that you're, that you're teaching to.\r\n\r\n\r\nNikolas Hulewsky (30:24.731)\r\nTotally.\r\n\r\n\r\nNikolas Hulewsky (30:31.363)\r\nThe reason I like it for somebody younger or somebody in college is because I think it's going to take six months to present itself on what the opportunity is. I don't think it's like heir apparent right now. this is exactly the business model that it's going to become. If it's somebody like you or I and we leave our jobs, it's like, I don't necessarily have six months. If somebody listening to this, don't necessarily have six months to just mess around and figure out what it's going to be and then another six months until it's monetizing to a point where they can\r\n\r\n\r\nhave income to pay their mortgage and pay bills and all that other stuff. So I think somebody young could do this.\r\n\r\n\r\nChris Koerner (31:06.066)\r\nYeah, I like it. It's a good one.\r\n\r\n\r\nNikolas Hulewsky (31:08.296)\r\nChris.\r\n\r\n\r\nChris Koerner (31:10.686)\r\nAll right, should we do the, go ahead.\r\n\r\n\r\nNikolas Hulewsky (31:14.971)\r\nI have one more idea on this. Should we switch? Okay. I just talked to Craig Fuller. He's the founder of Freight Waves. And if you don't know what Freight Waves is, it's a really cool business. There's a million podcasts out there you can go listen to. He's on My First Million and others. But essentially, do you know what a Bloomberg terminal is? Okay, so Michael Bloomberg, one of the richest men in the world, made his money.\r\n\r\n\r\nChris Koerner (31:17.81)\r\nWe got time.\r\n\r\n\r\nChris Koerner (31:35.24)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (31:42.469)\r\nby selling information faster than anybody else. He set up these terminals around the world. They were called Bloomberg terminals. They're this big hardware device. And they had proprietary information that people used to make investment decisions. And that's where he started. And now he has a media company that he had Bloomberg markets, had Bloomberg publication, all that other stuff. Think of Craig. Yeah, very, very expensive, very expensive. Think of Craig as like the Bloomberg.\r\n\r\n\r\nChris Koerner (32:03.358)\r\nSuper expensive to use, right? The terminals.\r\n\r\n\r\nNikolas Hulewsky (32:12.005)\r\nfor logistics and shipping. So he has a media brand, which is Freight Waves, where they put out information, industry publications, et cetera. And then they've got a Bloomberg-like terminal in Sonar, is the name of the company. But the idea was that they're going out and they're aggregating all of this information and they're giving it to people who wouldn't have the ability to go out and aggregate it otherwise. right. And it's a hundred million dollar plus company, totally bootstrapped.\r\n\r\n\r\nowns it 100%. Anyways, it's a really, really cool business. As I was talking to him, though, I started thinking, what could we or what could somebody build around this thesis, which is unique or proprietary, that's the better word, proprietary information? And what could some of those be? One might be search or sentiment. So people who want to buy a business.\r\n\r\n\r\nthat are out there searching actively right now. ETA is a big deal in the SMB world. They're looking to buy a business. Thank you. Entrepreneurs, ETA, entrepreneurship through acquisition. What's ETA searcher sentiment like right now? How would you get a survey of all the searchers? How would you get all that information? Small business pizza restaurants, I don't know. How would you get a sentiment of what those business owners are feeling right now?\r\n\r\n\r\nChris Koerner (33:15.1)\r\nentrepreneurship through acquisition.\r\n\r\n\r\nNikolas Hulewsky (33:39.213)\r\nThe reason I started bringing it up is because Craig predicted the last four recessions before anybody else was predicting them because he had the logistics information. He knew what was shipping from China. He knew what Walmart was ordering. He knew the inventory was going to be on the shelves because they had this proprietary order flow that they were tracking. So it got me thinking about what could you build around that in small businesses? Back to the AI agents, I think if you had\r\n\r\n\r\nAI agents going out and just calling, making the call and aggregating the information on your niche. This idea right here, bro. This is a billion. It's a billion dollar idea, bro. I can't even count as high as it's worth, bro. I'm you. But if you had the.\r\n\r\n\r\nChris Koerner (34:09.278)\r\nMmm, mm-hmm. Just a good idea.\r\n\r\n\r\nAll of our ideas suck, but this one's a good idea.\r\n\r\n\r\nThis is the one.\r\n\r\n\r\nChris Koerner (34:24.316)\r\nMultiple 11 figure idea.\r\n\r\n\r\nNikolas Hulewsky (34:36.271)\r\nThe hard part about that business is you're an information business. So have to aggregate and collect the information. Craig was able to get the information because he's plugged into all these systems and he's getting like real time electronic communications for what they're ordering, right? It's hard to do that with sentiment. So AI agents going out, collecting sentiment, aggregating that, and then either selling it as proprietary access or you as the business are making investment decisions based off of what you know ahead of time. I mean, there's kind of a hundred use cases, but that's the idea. What do you think?\r\n\r\n\r\nChris Koerner (35:07.582)\r\nI can't listen anymore because I love this idea so much and I'm just thinking of ways to apply it. So, all right, a couple schools of thought.\r\n\r\n\r\nOkay, let me back up. So I was thinking of when I started LCD cycle, right? And for those that don't know LCD cycle, I sold iPhone parts to iPhone repair stores. When I started that business, I started it by scraping every single iPhone repair store in the country. And it was very tedious. And I ended up with a spreadsheet of 20,000 repair stores. And I remember thinking very distinctly at the time, I know more about this industry than anyone on the planet right now.\r\n\r\n\r\nCause who's who else is doing this? Who else is scraping every iPhone repair store and then analyzing the results. And then I called them or when I say I, mean three virtual assistants called them and started a $10 million business all built on that one spreadsheet. Okay. You talk about one chart businesses. I'm talking about one spreadsheet businesses. Okay.\r\n\r\n\r\nNikolas Hulewsky (36:03.771)\r\nI'm gonna give you one more example that you're not gonna say. Chris, a couple of years ago, partnered with John McAfee. Yeah, the crazy John McAfee. They launched a token, it was called NoBS Crypto. The whole thesis was Chris was crawling Reddit, Instagram, Facebook, Twitter, whatever it was, right? And he was getting sentiment about coins from places that nobody had looked. And it was a very accurate predictor of which coins would pop.\r\n\r\n\r\nChris Koerner (36:25.114)\r\nMm-hmm. True, true.\r\n\r\n\r\nChris Koerner (36:31.998)\r\n.\r\n\r\n\r\nNikolas Hulewsky (36:32.171)\r\nand he got a meeting with John McPhee. can go watch this video. has recorded it a couple of times. He even got a meeting with John McPhee. John was like, nobody can predict this. Okay, show me your model. And within 20 minutes, John was like, Chris, I love you. Will you marry me? And they went into business together. But yeah, I mean, you did that with LCD cycle. You did that with NoBS Crypto. It's about finding sentiment. It's a one-spread-through business.\r\n\r\n\r\nChris Koerner (36:45.82)\r\nI meant show me your female model, like Cindy Crawford.\r\n\r\n\r\nChris Koerner (36:54.75)\r\nMm hmm. So one spreadsheet business.\r\n\r\n\r\nOkay, so, okay, so my mind went there, then I went a level deeper and it's like, okay, okay, how you want to find the sweet spot between a business owner that will answer the phone, right, with few gatekeepers and a high enough ticket size. So let's say, convenient, convenience stores, right? Let's say we want to analyze the sentiment of convenience stores, cause there's 250,000 convenience stores in the U S it's like the biggest retail industry there is.\r\n\r\n\r\nNikolas Hulewsky (37:18.395)\r\nMm.\r\n\r\n\r\nChris Koerner (37:29.466)\r\nsecond to restaurants. Okay, so yeah, like it's just a freaking gas station. Yeah, like independent convenience stores. A lot of the independent ones you're going to call and you're going to get the owner, right? Or like a nail salon, you're going to call and you're going to get the owner. There's no friction to get to the owner. Okay.\r\n\r\n\r\nNikolas Hulewsky (37:32.079)\r\nconvenience being like 7-11 a.m. p.m. maverick. Okay.\r\n\r\n\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (37:52.091)\r\nNamaste.\r\n\r\n\r\nChris Koerner (37:53.278)\r\nI just thought I lost you for a second. Okay. So that's great because you can get to the owner and you could, you could build a big business off this. You could say, Hey, I'm going to ask you five questions about the sentiment of the industry, whatever it is. Let's say convenience stores. What, what are your, like, what is your sales velocity recently? Like they gotta be broad enough questions to where they don't feel like protective of it, but they also have to be specific enough to where it's good data.\r\n\r\n\r\nNikolas Hulewsky (37:56.475)\r\nI knew you were staring at me the second there was like a 30 millisecond. No, I was here. I was here.\r\n\r\n\r\nNikolas Hulewsky (38:17.285)\r\nGo.\r\n\r\n\r\nChris Koerner (38:23.262)\r\nAnd then you're like, Hey, and in return, I'm going to send you an email with a report of what everyone else is saying about this. It's such a perfect offer because I need 30 seconds of your time, but I'm going to, I'm going to spill beans on what everyone else is answering me. Like, why wouldn't they want that? Of course they would. So that's great because there's 250,000 of them. You can get to them easily, but it's not very high ticket. Now, in a sense it is cause they're business owners, but what they're selling is not high ticket.\r\n\r\n\r\nNikolas Hulewsky (38:23.429)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (38:41.797)\r\nsoon.\r\n\r\n\r\nChris Koerner (38:51.432)\r\nSo then I go to the other end of the spectrum like dentists, okay? Tens of thousands of dentists out there, but you're gonna have to go through a receptionist. I am, we all are in a sense. You gotta go through the receptionist. It's really hard to get a dentist on the phone. But it's very high ticket. You can sell high ticket stuff to dentists. So then I thought lawyers. I've done this before. I've scraped a list of lawyers. You can get their cell phone numbers quite easily. There's not as much friction to reach them, but it's very high ticket.\r\n\r\n\r\nNikolas Hulewsky (38:57.243)\r\nbecause you are on the spectrum.\r\n\r\n\r\nChris Koerner (39:20.766)\r\nAnd you can there's a hundred thousand lawyers probably much much more and you can just call them and ask them a list of questions and then say hey where can I email your answers to not your answers but everyone else's answers aggregated and then you opt them into your list now you have a newsletter that like your CPMs cost per mil aka how much you can charge for advertising on this newsletter are insanely high because it's all lawyers reading it and In order to get the newsletter they have to answer the questions in order to answer the questions. They have to get\r\n\r\n\r\nNikolas Hulewsky (39:38.011)\r\nThank\r\n\r\n\r\nChris Koerner (39:50.478)\r\nnewsletter. And so you're aggregating the data and building a newsletter at the same time. And then you can still like it's not all you have as a newsletter. The data itself is incredibly valuable outside of the newsletter. So and now you can do this with agents. You can click a button and call a thousand lawyers over the next five minutes.\r\n\r\n\r\nNikolas Hulewsky (40:03.429)\r\nYes. Well, and that's, that's the, that's what I'm.\r\n\r\n\r\nEverything that's done right now when they're going out and polling people is done off of statistics modeling. The more people that you poll, the more answers that you get, the better your model is. However, there is a selection bias, right? So it's like, it may be that the people who are willing to answer skew the data, et cetera, whatever. But the more data that you can get, the more accurate of a picture it becomes. And when you're looking at these smaller industries,\r\n\r\n\r\nChris Koerner (40:26.578)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (40:38.373)\r\nthat are niche that don't have as many operators in them. There's not an economic incentive for you to hire even somebody in the Philippines to call these people and get answers. But if you have an agent and the cost is effectively 10 cents a call, all of a sudden there's an economic incentive there and you can arbitrage the knowledge gap. And that's where I think it's like super interesting to start thinking about some of the ideas there. And again, this was from Craig.\r\n\r\n\r\nChris Koerner (40:58.291)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (41:06.103)\r\nin his original business, the Michael Bloomberg-esque terminals of getting you information timely and applying this down. So I really like that idea.\r\n\r\n\r\nChris Koerner (41:14.514)\r\nThis is this is a really good idea. So the downside of this idea is the cost. So I've been pricing this out recently and you're probably going to spend about 15 cents a minute for these AI agents and they round up. Some do some don't round up. And so it doesn't seem like a lot on the surface, but that can add up over time.\r\n\r\n\r\nNikolas Hulewsky (41:38.245)\r\nHmm. What if it was like a 30 second call and you just you knew you knew that there was going to be friction and drop off and it was like, hey, I'm an AI. You do the pitch. I don't an AI agent. I'm gathering information on your industry. I anonymize it and then I send you the report of a thousand people who have also responded to this. Are you interested? Yeah, great. What's your email? I'll send you the survey. it's John Bigsby at all dot com. Perfect. I'll see you soon.\r\n\r\n\r\nBoop, hang up. So it's like, you're not even doing the survey on the phone. Again, that would bring the cost down. But also there is friction. However, you do get their email, boop, and it's a lot cheaper for you to send out that many emails as it is to like keep them on for a five minute survey as opposed to them filling out the survey online. So that could be a way around it.\r\n\r\n\r\nChris Koerner (42:13.222)\r\nMmm.\r\n\r\n\r\nChris Koerner (42:24.604)\r\nMm-hmm. That's a good idea.\r\n\r\n\r\nThat's a good idea. Yeah. The hard part would be like transcribing the email wrong. but yeah.\r\n\r\n\r\nNikolas Hulewsky (42:34.979)\r\nRight. There's going to be an error rate and there's going to be a big percentage that just doesn't click through. They're not going to answer the survey. You know what I mean? Yes, there's a number of things that it could be.\r\n\r\n\r\nChris Koerner (42:45.874)\r\nYou just have to you have to A B test it do both two different scripts. One just asked for their email and the other one asked the questions and compare the open rates and the costs and the outputs.\r\n\r\n\r\nNikolas Hulewsky (42:56.283)\r\nBut you could also tier your pricing, right? Like to the end consumer. Hey, we've got, this is the cheap option. We don't do a five minute phone conversation. We send out the email or we get really high quality data for people who are willing to stay on the phone. And that's, you know, 10 X the price. You know what I mean? So it's like, okay, $100 a month or do you want $500 a month?\r\n\r\n\r\nChris Koerner (43:05.831)\r\nMmm.\r\n\r\n\r\nChris Koerner (43:14.525)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (43:19.166)\r\nYeah, you could this with election polling too.\r\n\r\n\r\nNikolas Hulewsky (43:23.237)\r\nYou could do it locally. You could be like, hmm, there is a city ordinance that they're going to pass and there's a vote for it by the city council. What sentiment like, does that make sense? Could I get people rounded up and advocating on my behalf? Like there's a million kind of applications that it could be, I'm running for the school board or my son wants to raise money for his whatever student project.\r\n\r\n\r\nChris Koerner (43:32.765)\r\nMmm.\r\n\r\n\r\nChris Koerner (43:43.902)\r\nMm.\r\n\r\n\r\nI don't know. Are there even that many municipalities you could sell this to? Well, this is like 10 cities in America. 20. It's a small market. It's a small market. Yeah, let's bag it. Hey, let's just delete this part of the episode. Mohammed actually don't. I'm joking. Don't delete.\r\n\r\n\r\nNikolas Hulewsky (43:52.411)\r\nIt's a little higher. think it's in the 30 to 50 range. Yeah.\r\n\r\n\r\nNikolas Hulewsky (44:00.539)\r\nThe safe word is banana. Banana!\r\n\r\n\r\nChris Koerner (44:06.43)\r\nThis is, is, this is seriously a good idea. Cause you could sell this as a service to people. You could sell the data to people. You could build your own newsletter with it. Like, uh, it's just the whole dynamic of the AI color changes when you're, get ahead of it. It's like, Hey, I'm an agent. There's going to be a pause. There's going to be a pause. It's awkward. It's kind of like what we've talked about with building, like marketing agencies where it's like, Hey, I'm a lot cheaper. I'm not 3,500 a month because I use AI. Yeah. I use AI.\r\n\r\n\r\nNikolas Hulewsky (44:12.315)\r\nMm-hmm. Yep.\r\n\r\n\r\nNikolas Hulewsky (44:20.347)\r\nYeah, when you just own it, you own it. I'm an agent.\r\n\r\n\r\nNikolas Hulewsky (44:34.094)\r\nWell, and if if when we were using AI AI two years ago, if we would have gotten ahead of it, hey, just want to let you know this is an AI agent, the call is going to be a little weird, there's going to be some pauses, nobody would know what the freak you're talking about. What AI what are you talking about AI? Now, even if you use the word agent, they're still not going to know. But if you say AI, they're going to be like, oh, okay, this isn't a real I think 90 % of people are going to understand that there's a lack there. Whereas two years ago, there just wasn't an education.\r\n\r\n\r\nChris Koerner (44:46.844)\r\nYeah, it's true, it's too early.\r\n\r\n\r\nChris Koerner (44:58.12)\r\nYeah.\r\n\r\n\r\nI would probably say like, cause they're not even going to know what agent means. think I would say like, it's like, it's as if you're talking to chat GPT. Yeah.\r\n\r\n\r\nNikolas Hulewsky (45:07.813)\r\nYeah, that's what I mean. I would just say like, Hey, I'm AI. I'm not a real person. There's going to be a little bit of a lag. I agree.\r\n\r\n\r\nChris Koerner (45:12.774)\r\nI would yeah, like I'm an interactive AI. So like ask me anything you want, but I'm gonna you know what I'm saying?\r\n\r\n\r\nNikolas Hulewsky (45:16.729)\r\nRight. Agreed.\r\n\r\n\r\nChris Koerner (45:20.286)\r\nIt's a good one.\r\n\r\n\r\nShould we wrap this one?\r\n\r\n\r\nNikolas Hulewsky (45:26.267)\r\nYeah, I'm good with wrapping this one.\r\n\r\n\r\nChris Koerner (45:28.286)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (45:32.069)\r\nSo is that for, this one's for tomorrow.\r\n\r\n\r\nChris Koerner (45:35.13)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (45:37.115)\r\nDo you want to stop the recording right now and just tell them it's in Riverside so they can start working on it?\r\n\r\n\r\nChris Koerner (45:41.79)\r\nGood idea.",
  "metadata": {
    "duration": "",
    "date": "2025-01-10",
    "platform_source": "Google Drive"
  }
}