{
  "episode_number": "190",
  "episode_title": "Inside the Wild West of Influencer Deals and Agency Life with Tom Stefaniuk",
  "guest_name": "Tom Stefaniuk",
  "business_name": "Small Screen Marketing",
  "transcript": "﻿Nikolas Hulewsky (00:00.483)\r\nquotes for the intro anyways. It's not like we're just all live. Okay, Tom, you own a company that helps social media influencers manage their business, but also helps businesses market through those marketing channels with social media influencers. I'm going to throw a stat at you and I want you to tell me why it's happening. I just read that over 50 % of young people aspire to be social media influencers. Like that's what they want to be when they grow up. Why?\r\n\r\n\r\nTom (00:28.172)\r\nMm-hmm. That's higher than the last time I heard it. The last time I heard it, it was like 36 % of people. But that's good to hear that it keeps going up.\r\n\r\n\r\nNikolas Hulewsky (00:30.337)\r\nWhy, really?\r\n\r\n\r\nNikolas Hulewsky (00:36.675)\r\n50 seconds, oh good to hear. Okay, tell me, to quote the Backstreet Boys, tell me why, why does it keep growing? What's happening right now?\r\n\r\n\r\nTom (00:45.88)\r\nWell, I think it if done properly, it really is like the dream lifestyle. It takes a lot of work. There's a lot of things behind the scenes that people don't see. You know, what you see is the fun part most of the time, but I did it for eight years and it was great. Like you get burnt out and there's ups and downs, but you control of your own schedule. can travel wherever you want and often get a ton of opportunities to travel. You meet a bunch of other people that are highly skilled or\r\n\r\n\r\nhighly knowledgeable about a certain niche or highly talented in videography, filmmaking, and some knowledge base that they have. And you get to do really fun things while you're doing it. Like I have filmed videos of walking around the Philippines bartering at fake markets to see which stall would give me the cheapest Gucci purse. And, you know, I get paid to do silly things like that when I was making content. And I don't know how many things there are in life where you could just be a 12 year old and make a lot of money from it. And I think that's the core of it is\r\n\r\n\r\nIt's like this prolonged childhood that I think a lot of people are looking for. And then there's like the fame. I think that's a big motivator for some people. Personally, it would be my worst nightmare if I became famous, famous. But a lot of people want that attention and there's really cool doors that it unlocks.\r\n\r\n\r\nNikolas Hulewsky (01:49.176)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:52.843)\r\nOkay, so you you were a sneakerhead you had a you had a basketball sneaker channel, but you're also going to the Philippines to buy Gucci bags, which is freaking amazing.\r\n\r\n\r\nTom (01:56.758)\r\nI was. Yes.\r\n\r\n\r\nYeah, so I got so lucky. I got invited to speak at all these conferences, give panel talks. And so I've been to every major American city. I've been to all over Europe. I've been to Melbourne. I've been to the Philippines. I've been to Hong Kong to go to these events. Got a ton of opportunity to travel. Yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (02:15.991)\r\nand they would sponsor you. They were like, hey, you come out here. How much, okay, I have to know this. You did it for eight years. How much did you make? Like how much money were you making a year?\r\n\r\n\r\nTom (02:22.99)\r\nThat's a great question. So it was almost nothing than a gradual build and all of sudden a ton, at least like age-weighted at the time. So I started when I was 16. I remember my first check from Google AdSense. At the time it wasn't even Google AdSense because YouTube had not partnered with Google yet for that. So my first experience with getting a check from YouTube was like $113. And this was after four months of work of making videos.\r\n\r\n\r\nNikolas Hulewsky (02:32.715)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (02:42.275)\r\nMmm.\r\n\r\n\r\nTom (02:51.822)\r\nAnd I ran over to my mom and I was like, look, I told you I could make money doing this. She rolled her eyes at me because it took me four months to make 113 bucks. But two years into it, I was making maybe $30,000 a year. And then I made a pivotal shift in 2019. So that would have been six years into it where I started selling my own product. And that was a big, big shift for me. I went from making at the time maybe 15\r\n\r\n\r\nNikolas Hulewsky (02:55.925)\r\nSee, Mom?\r\n\r\n\r\nNikolas Hulewsky (03:03.223)\r\nYeah.\r\n\r\n\r\nTom (03:20.558)\r\nto $20,000 a month just off of sponsorships, YouTube AdSense to immediately $75,000, $80,000, $90,000 a month because I started selling my own product. And it was really like, was a, exactly, it was a holy crap moment. It was a big shift. So I did that for a couple years of having my own product, continuing to make videos and then felt it was time for a shift. And that's when I started Small Stream. And that was a weird decision to...\r\n\r\n\r\nNikolas Hulewsky (03:24.675)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (03:29.443)\r\nHoly crap.\r\n\r\n\r\nTom (03:48.438)\r\nstep away from something that was a great income and I'd started to upload a less. My income wasn't quite that high when I stopped making videos, but it was still a great living and to step away from it.\r\n\r\n\r\nNikolas Hulewsky (03:59.459)\r\nWell, dude, you said 70 to 80 grand a month?\r\n\r\n\r\nTom (04:02.702)\r\nYeah, when I was 20, 22, 23, I was.\r\n\r\n\r\nNikolas Hulewsky (04:06.733)\r\nI mean, 80 grand a month is almost a million dollars a year. Or is that 960?\r\n\r\n\r\nTom (04:09.838)\r\nYeah, to be fair, this is in Canadian dollars, to be fair. So let's call it 60 grand a month USD. Yeah. Yeah, exactly. Exactly. Let's call it like 58 to 62,000 USD, give or take.\r\n\r\n\r\nNikolas Hulewsky (04:13.411)\r\nokay. So like 15, 16 bucks. Still, still that's an incredible, that is a freaking incredible amount of money. And that's something that I've heard with many of these influencers is like, is nothing, nothing, nothing. And then it, you know, everything all at once. Honestly, it's very similar to entrepreneurship, entrepreneurialism, where it's like for entrepreneurism, what the freak, what am I trying to say? Being an entrepreneur.\r\n\r\n\r\nTom (04:34.828)\r\nAbsolutely.\r\n\r\n\r\nTom (04:39.138)\r\nEntrepreneurship.\r\n\r\n\r\nNikolas Hulewsky (04:40.835)\r\nThank you. Yeah, we're just making words up now. Where it's like nothing, nothing, nothing, nothing, and then boom, overnight. You're an overnight success, 10 years in the making. But what's interesting is there's kind of this gradual progression for many people, especially if you start on YouTube, where you first are sharing ad revenue through the AdSense program. So anytime anybody who's on YouTube, they see an ad and they just can't wait for it to say skip. Like my kids are like, whoa, when's it gonna say skip?\r\n\r\n\r\nTom (04:57.518)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:09.281)\r\nThose are ads that are running in those videos and YouTube will share that money that the ad company, whoever's paying for the ad pays, they will share some of that revenue with the creator. So that $100 check was that first split, supposedly, with YouTube. My first check was very similar, where I was like, honey, I made 100 bucks last month. And she's like, that's great. So that's only like one cent per hour worked? that what you?\r\n\r\n\r\nTom (05:22.562)\r\nYes, yeah.\r\n\r\n\r\nTom (05:36.974)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (05:38.563)\r\nShe's always just pulling me right back down. But many of these creators have sort of a progression that you named where it's like, okay, first they're making some videos, they're getting some views, and they're sharing revenue with Google. And it's like, that's interesting. And then when you get to the point where you're sharing revenue with Google, you kind of have enough views that you start getting on other people's radars. And so other companies start reaching out to you and they're like, hey, Tom, could I pay you to sponsor this shoe?\r\n\r\n\r\nTom (05:45.966)\r\nMm-hmm.\r\n\r\n\r\nTom (06:00.27)\r\nAbsolutely.\r\n\r\n\r\nNikolas Hulewsky (06:05.901)\r\nCould I pay you to talk about this product? And you're like, sure, I guess so. So you get some paid sponsorships and then it sort of morphs into the next level of the game, which is in my opinion, affiliate. So you're paid at a little bit of amount of money, but then you also get a piece of every item that's sold on the backend. And then you get to the final boss, in my opinion, which is you start selling your own product. You've like built your own business around your distribution channel to your very specific niche, because now your audience.\r\n\r\n\r\nTom (06:06.19)\r\nMm-hmm.\r\n\r\n\r\nTom (06:28.974)\r\nAbsolutely.\r\n\r\n\r\nNikolas Hulewsky (06:35.329)\r\nYou very clearly know what they want. And so you decide to bring it in house. Why am going to partner with somebody and let them pay me for my distribution? I'm just going to start my own product. That's typically what I've seen. Did I miss anything in there or is that pretty, was that a good summer?\r\n\r\n\r\nTom (06:46.392)\r\nI would flip around two and three. So I'd say usually the affiliate comes first before the paid partnerships. Largely because you think New Balance wants to work with someone with three million followers, right? New Balance isn't expecting, nor should the creator expect someone to watch this YouTube video and immediately go buy their next pair of running shoes, right? They're going to two months from now, next time they're in the mall, next time they're walking down the street and see a New Balance store, then they'll go in and buy it. So we wanna make sure the creator's seeing the value from the...\r\n\r\n\r\nNikolas Hulewsky (06:53.153)\r\nOkay, true.\r\n\r\n\r\nNikolas Hulewsky (07:06.497)\r\nYeah.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nTom (07:15.788)\r\nthe residual sales that they're making, not just the direct sales off of that one ad. So generally, the bigger you get, the more hesitant creators are to do affiliate ads, unless it's like a perfect one-to-one fit with the creator and the product.\r\n\r\n\r\nNikolas Hulewsky (07:17.921)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (07:25.494)\r\nOkay, okay.\r\n\r\n\r\nYeah, because the cash now is much better than the potential of participating in the upset. That makes sense. Yeah.\r\n\r\n\r\nTom (07:32.778)\r\nExactly. Yeah, because you can do a great ad and your audience could just not connect with the product.\r\n\r\n\r\nNikolas Hulewsky (07:39.611)\r\nRight, right, yeah, that makes total sense. For you, what do you think are the best platforms? It's like you did YouTube, obviously, but if you're making $80,000 a month on YouTube, could you have done an equivalent amount on Instagram or Twitter or Facebook or like, how do you think about the different platforms?\r\n\r\n\r\nTom (07:41.614)\r\nHmm.\r\n\r\n\r\nTom (08:01.993)\r\nYeah, I think there it's like a it's a toolbox. What job are you trying to accomplish? You know, do you need a wrench or a hammer or a screwdriver? And I'd say the platforms are very similar. If you're trying to get quick attention, quick by reality, as many eyeballs as possible, YouTube might be the worst platform for that. I would say go TikTok or Instagram way before you consider making a YouTube channel. But if you're looking for a really dedicated audience that knows who you are, feels like they have a pretty\r\n\r\n\r\nNikolas Hulewsky (08:11.927)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (08:20.845)\r\nBrilliant.\r\n\r\n\r\nTom (08:29.644)\r\nstrong rapport or connection with the creator. I'd say YouTube is the only place to do that. If you're not maybe looking to become an influencer and you're just looking to get eyeballs on a product or a business or something you can offer to people, I'd say probably X or Twitter would be the best to do that. And Facebook's just kind of, who knows what's going on on Facebook these days. So Facebook is the Wild West. You could do whatever you want over there.\r\n\r\n\r\nNikolas Hulewsky (08:52.867)\r\nSo you went from making 80 grand a month to basically starting an agency, because now you're working with content creators, correct? What are you doing with them now?\r\n\r\n\r\nTom (08:55.534)\r\nMm-hmm.\r\n\r\n\r\nTom (09:03.554)\r\nYeah, yeah, correct.\r\n\r\n\r\nYeah, that's a wonderful question. So I like to sum it up. If I was on a sales call with you and you were a potential client, I would say we want to let creators be creative and we'll handle everything else. So where their agent business manager, we handle all the behind the scenes stuff. So that could be brand partnerships, negotiating those, doing outreach to brands that they like to work with, redlining contracts, chasing down a brand if they're a couple of weeks late to pay, organizing speaking tours, book deals, hosting TV shows.\r\n\r\n\r\nNikolas Hulewsky (09:16.535)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (09:34.284)\r\ngeez.\r\n\r\n\r\nTom (09:35.596)\r\nreally anything that has to do with monetizing the social cache that you built for yourself.\r\n\r\n\r\nNikolas Hulewsky (09:39.971)\r\nWhen did you realize it was a business?\r\n\r\n\r\nTom (09:42.946)\r\nThat's a great question. think I realized it was a business three years before I started the business. And like, I didn't start anything groundbreaking. There are other influencer management companies that existed a decade before small screen existed. But I was out for dinner with a group of my friends who were all YouTubers. We were this is where all great businesses are started. We're in a Chili's in Cleveland in the parking lot of a movie theater. And we were all doing\r\n\r\n\r\nNikolas Hulewsky (10:05.645)\r\ncourse.\r\n\r\n\r\nSure, yeah, just like Steve Wozniak and Steve Jobs, you know, it makes sense.\r\n\r\n\r\nTom (10:12.244)\r\nExactly. Exactly. So we're in this Chili's in Cleveland and we're all we had all been approached by the same brand to do this big campaign for a new product they were pushing. And one of the guys who had probably the biggest following at the table, maybe eight to ten times the size of mine, he said it was the highest paying campaign he had ever done. And so at the time, this probably will views wise, he was clocking about half a million views a video I was getting maybe\r\n\r\n\r\nNikolas Hulewsky (10:33.059)\r\nSo tell me how big you were at this time.\r\n\r\n\r\nTom (10:41.102)\r\n50 to 70,000 views a video. So how many at the time probably about 300,000 subscribers.\r\n\r\n\r\nNikolas Hulewsky (10:43.051)\r\nOkay, and how many subscribers?\r\n\r\n\r\nNikolas Hulewsky (10:48.245)\r\nOkay, so this guy's got millions of subscribers.\r\n\r\n\r\nTom (10:50.316)\r\nThis guy had about a million subscribers, super engaged audience though. Really, really engaged audience. And that's what brings in the money, not the subscribers, it's how many people are watching.\r\n\r\n\r\nNikolas Hulewsky (10:53.643)\r\nInteresting. Okay.\r\n\r\n\r\nNikolas Hulewsky (10:58.965)\r\nOkay, and so naturally you guys are, you know, collectively making $150,000 a month and you decide let's go to Chili's. It makes sense. As one does.\r\n\r\n\r\nTom (11:07.214)\r\nExactly as as one does as one does But I don't know if you had Michael Gurdley on here, but I think you'd have something to say about that But yeah, so this the guy with the largest following he he says it's the highest paid partnership he's ever done and One of the guys said well if you don't mind sharing how much did you get paid? He got paid. I believe it was $20,000 Meanwhile, I had got paid 15 and his engagement was easily eight times probably ten times the size\r\n\r\n\r\nNikolas Hulewsky (11:15.571)\r\nI have, have, of course, of course.\r\n\r\n\r\nNikolas Hulewsky (11:24.899)\r\nHmm.\r\n\r\n\r\nTom (11:37.516)\r\nAnd that was kind of the initial light bulb, where it's like, this is a business. People don't know what they're doing. And there's no manual. There's no course that you can take to figure out how much to charge.\r\n\r\n\r\nNikolas Hulewsky (11:44.931)\r\nDid you say they don't know what they're doing? Because you were like, I got paid 15, he got paid 20. His is, he should have got paid way more.\r\n\r\n\r\nTom (11:51.99)\r\nyou should have got paid. exactly. And it's not it's not linear. It's not like if I have 100,000 views that I should get paid 10 times as much if I have a million views doesn't work exactly like that. But it certainly should be expanding a lot quicker than you know, from 15 to $20,000 if your audience is that much bigger. So that was the first light bulb that I had of, like, I think I could help people with this. I love negotiating and\r\n\r\n\r\nNikolas Hulewsky (11:57.623)\r\nYeah.\r\n\r\n\r\nTom (12:18.378)\r\narguing with brands, guess you could say my dad's a lawyer, so I probably got it from him. But that was one of my favorite things making videos is you could like kind of go to war with these companies and see how much you could get out of them.\r\n\r\n\r\nNikolas Hulewsky (12:20.651)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (12:28.909)\r\nDude, I need you to be my best friend, because I hate that. I'm just so, I am so terrible at the negotiate, like the hard line negotiating in something. I'm much better, like buying a business that I know, I'm much better at negotiating, because I'm like, okay, I can still get what I want, but I know how to get the terms that I want. Whereas with assets that don't know as intimately, it's hard to feel like I know exactly what I'm doing. do you know like how much,\r\n\r\n\r\nTom (12:32.044)\r\nHahaha.\r\n\r\n\r\nTom (12:38.52)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (12:58.005)\r\nMoney is on social media marketing.\r\n\r\n\r\nTom (13:01.358)\r\nYeah, so the last numbers, this isn't even social media marketing, like this doesn't count Facebook ads, Twitter ads, anything. This is purely influencer marketing. The last numbers I saw, which I guess would have probably been for 2023, was $38 billion spent on influencer marketing, which is nothing, like maybe a couple billion dollars. It is expanding. If I had the audience that I had,\r\n\r\n\r\nNikolas Hulewsky (13:05.569)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (13:17.133)\r\nCan you give me a comparative number? Like what was it five or 10 years ago, do you know?\r\n\r\n\r\nTom (13:27.148)\r\nBack then, if I had it now, the money I would be making off sponsorships would probably be tenfold. Yeah, there were, you would get lucky if twice a year you had a publicly traded company want to sponsor your stuff. It was very small e-comm companies that were sponsoring your stuff.\r\n\r\n\r\nNikolas Hulewsky (13:32.461)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (13:43.703)\r\nWhy has there been such a big shift? So why from like a billion, let's say to $38 billion over the course of five or 10 years?\r\n\r\n\r\nTom (13:48.814)\r\nMm-hmm.\r\n\r\n\r\nI think it's brands have realized it's such a low cost to get the same amount of impressions you'd be getting on a TV ad, right? Your typical TV show has maybe half a million to a million and a half viewers. For that, you need to pay a production studio hundreds of thousands of dollars to make the commercial, maybe have some celebrity actor in it. Then you need to pay for airtime every single time you air it to the tune of tens of thousands of dollars. And it's just a commercial, right? Everyone knows they're being sold to you. There's no personal connection.\r\n\r\n\r\nNikolas Hulewsky (14:03.875)\r\nMm-hmm.\r\n\r\n\r\nTom (14:19.672)\r\nBut for that same price of one commercial spot, I can book probably a multi-month engagement with an influencer that has the exact same reach. And I think the big kicker of why brands are so open to it is that there is a personal connection with their audience. And it's not a stranger on TV telling you to go buy the new hamburger. It's someone that you know, that you followed for years, that you trust their opinion. It's almost like that cool friend in the group who always has the new bar or the new band that they're listening to. That's kind of what influencers have become where\r\n\r\n\r\nNikolas Hulewsky (14:46.124)\r\nYeah.\r\n\r\n\r\nTom (14:48.386)\r\nthere's this implicit trust of, they're ahead of the curve, they know the new trends. And the value in that, not to mention that you can get the same impressions for cheaper, but the value that those impressions create is so much greater with the influencer.\r\n\r\n\r\nNikolas Hulewsky (15:01.123)\r\nI mean, here you say that, where it's like they can get the same amount of impressions, no production costs. They've got a ton of trust. It feels like influencers are also in a position, well, not just in No Brand, but aren't influencers in a position to command a premium then on those ad dollars?\r\n\r\n\r\nTom (15:10.102)\r\nIt's a no-brainer.\r\n\r\n\r\nTom (15:15.904)\r\nAbsolutely. some do. There's two types of influencers. There's influencers that have that it factor and influencers that are charging just on a CPM, just purely impression based. And the influencers that have that it factor, they can charge outrageous amounts of money. We will have creators that we get deals for that have no business charging what they're charging based on their views, but they're charging that because it's them. And there's only one of them. And I think that's a really unique angle that people have in the influencer space.\r\n\r\n\r\nNikolas Hulewsky (15:27.683)\r\nNikolas Hulewsky (15:40.589)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (15:44.675)\r\nHow do brands or entrepreneurs or whoever's paying for the sponsorships, how do they measure performance, ROI? Because it seems to me, if I'm going to go run a Facebook ad, I can very clearly go, this was my cost per click. This was the customers that I required from it. It feels more ambiguous with these types of engagements.\r\n\r\n\r\nTom (15:48.536)\r\nMm-hmm.\r\n\r\n\r\nTom (15:52.451)\r\nYeah.\r\n\r\n\r\nTom (16:04.046)\r\nIt can be. On YouTube, it's almost always direct conversion ads. So they're expecting there's a link in your description. You advertise whatever product you're advertising. There's a link in your description that people are going to click. They save their 10 % if they click your link. And the brand knows, okay, we paid him $10,000. We need to see 37 sales or 85 signups or whatever the case may be for their product to deem this a profitable ad. And if you hit that target,\r\n\r\n\r\nthey'll almost definitely rebook you. Now, on the flip side, this happens more on short form content with awareness campaigns, let's call them, where a brand, this is usually bigger brands that have money to just pump into a bunch of creators to get their product out there. Think like Facebook when they had their meta sunglasses. This is a giant push. The money they were throwing to creators, it was completely decoupled from the amount of views that they were getting. They just wanted their brand in every\r\n\r\n\r\nNikolas Hulewsky (16:41.965)\r\nYeah.\r\n\r\n\r\nTom (17:02.754)\r\nkey person's feed for the next month. And they were paying a lot of money. And I guarantee you, no one was checking, hey, this person lives in Toronto and they advertise the Facebook meta sunglasses. Did the sale spike in Toronto at all? I guarantee you that was not done at all because they just wanted everyone to know that Facebook sold a pair of sunglasses with the camera in it. And if they accomplished that, then that was a win. So those campaigns pay a lot.\r\n\r\n\r\nNikolas Hulewsky (17:04.876)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (17:24.307)\r\nIt seems like attribution would be difficult, right? Because it's like, watch an ad, I like Ray-Bans. That's interesting. I'll come back later. And maybe you're at the mall and there's an impulse buy, and so you buy Ray-Bans, but it's not necessarily like, can't attribute it to that ad. Have companies gotten more sophisticated with the way that they, I guess, ROI or gauge performance of an ad? Or is it still just how many people clicked on that link and how many sales came from that link?\r\n\r\n\r\nTom (17:28.877)\r\nYes.\r\n\r\n\r\nTom (17:38.187)\r\nExactly.\r\n\r\n\r\nTom (17:52.654)\r\nWell, mean, from that aspect, is very, very, you know, did you hit your target or not on some of those conversion campaigns? But one thing we're seeing brands request after doing campaigns is how many link clicks did you have? Even if it was just awareness campaigns, right? Even if there was no expectation of direct sales, how many views did you get on this story? How many comments did you get? think comments and shares are a big vector that people are looking at. Because if a million people see something and\r\n\r\n\r\nNikolas Hulewsky (18:18.497)\r\nMm-hmm.\r\n\r\n\r\nTom (18:20.896)\r\nNo one really cares enough about it to action on it, you know, to leave a comment of their thoughts or to share it to their friend. That probably indicates that it wasn't the most successful campaign. But if there's a post with a million views that has, you know, 12,000 comments and 5,000 shares, that's a really good chunk of the people that watched it that found some value and it wanted to share it to someone else. but it is still, and I think this is where people like us come in. It is still very much the wild west where there is no set formula. There is no set.\r\n\r\n\r\nbasis of this is successful, this was not successful. And people like us kind of figure out the gray area in between and make sure that it's a good partnership for both sides.\r\n\r\n\r\nNikolas Hulewsky (18:59.811)\r\nOkay, so for business, let's say we're a business owner, I'm gonna put the business owner hat on. I would think about it this way. The first step I need to decide is whether or not my product is sellable through social media. Is that fair? Or is it like, no, all products are, you just need to figure out where your niche or like who your person is that is marketing to your target demo.\r\n\r\n\r\nTom (19:02.327)\r\nMm-hmm.\r\n\r\n\r\nTom (19:10.722)\r\nYes.\r\n\r\n\r\nTom (19:18.658)\r\nI would say almost all products are probably sellable through social media. So we have one of our clients going to the only barramundi fish farm in North America. This is some breed of fish that is in the Indian Ocean. But someone has created a artificial fish farm here in America, in Florida, I believe. And they are paying one of our clients who makes fishing content to go fish this barramundi to raise awareness that you can buy barramundi direct in North America.\r\n\r\n\r\nNikolas Hulewsky (19:30.176)\r\nWhat the f- barramundi?\r\n\r\n\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (19:46.915)\r\nThat's rad. Okay.\r\n\r\n\r\nTom (19:48.51)\r\nLike no one would have ever thought, this is like, this is a natural fit for influencers, my commercial phishing operation. Absolutely not. But if it's the right creator with the right pitch on the right product, you can really make anything happen with YouTube or social media in general.\r\n\r\n\r\nNikolas Hulewsky (20:04.717)\r\nSo it's really more about thinking, where is my target demo? Where is my ICP congregating? And then how do I access them? And then maybe going and finding that influencer who has access to them.\r\n\r\n\r\nTom (20:09.194)\r\nExactly.\r\n\r\n\r\nTom (20:15.81)\r\nAnd there's a community for anything. Like you name a niche and there's a channel with a million subscribers in that niche.\r\n\r\n\r\nNikolas Hulewsky (20:22.275)\r\nWhat about for businesses? If I'm, if I'm a business owner and I'm just trying to think through, I have a limited set of dollars, $5,000 a month towards marketing and I can put that, put those dollars to a billboard. could, you know, radio, podcasting, uh, Google pay per click ads. Again, depending on the type of product that you have. If I have a pie and let's just say that represents a hundred percent of all my ad spend, how would you think about allocating to social media?\r\n\r\n\r\nTom (20:28.558)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (20:51.692)\r\nmarketing.\r\n\r\n\r\nTom (20:53.132)\r\nYeah, I mean, you don't want to put all your eggs in one basket. I'd say the same thing in the context of the influencer campaign. You never want to spend all your money with one superstar creator. You kind of want to allocate a little. We've heard some brands say they're spending as much as 50 % of their ad budget. Those are some of the more software heavy, like where you're not actually purchasing a physical product, you know, sign up for this online security or VPN or some other type of software spending as much as 50 % of their ad budget on influencers and\r\n\r\n\r\nsome of the more institutional brands that have been in existence for decades are spending maybe more like five to 10 % of their budget on influencers.\r\n\r\n\r\nNikolas Hulewsky (21:28.419)\r\nSo is there a framework that you have? Like how would I think about whether or not an influencer would be the way to go to spend my ad dollars? It sounds like what you just said, that one of the attributes would be a high ticket item. So if it's a high ticket sale, that might be, what are some other attributes if I'm a business owner to think about?\r\n\r\n\r\nTom (21:39.15)\r\nMm-hmm.\r\n\r\n\r\nTom (21:44.652)\r\nYeah. Does your product look good? Not even visually, but like if I watch a video with your product, does it make me excited to have this in my life? There are some products that probably don't do that. Like a really nice pen. It might be a really nice pen, but like you don't get the feel of gliding it across a piece of paper by watching a video of it, right? Whereas something that's a little bit more visually appealing or looks more exciting, or you can really get that wow factor from, I think those generally perform better on social media.\r\n\r\n\r\nNikolas Hulewsky (21:55.319)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (22:03.747)\r\nTrue.\r\n\r\n\r\nTom (22:14.426)\r\nand some things with a little bit more nuance are harder for most people to articulate over video. Now, there's an exception to everything. There's some very talented videographers that I'm sure could sell that pen, but it's a lot easier to sell a new pair of jeans or some bright pink Stanley water bottle.\r\n\r\n\r\nNikolas Hulewsky (22:14.637)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (22:30.515)\r\nSo you're not saying whether or not I've created a video or a marketing campaign that looks good. You're just saying like, does the product itself look good on camera? Okay. Okay. So is it sexy? Is it high ticket? Are there any other attributes that you're like, this is perfect for influencers?\r\n\r\n\r\nTom (22:37.228)\r\nYes. Is the product sexy? Let's say.\r\n\r\n\r\nTom (22:46.414)\r\nMm-hmm.\r\n\r\n\r\nYeah, mean, high-tech is a general rule, but there's brands that advertise phone cases. know, all they sell is phone cases and they spend millions of dollars on influencers. And those are, I mean, the margins are good, but it's a $30 purchase for each customer. But I'd say the other thing you want to think about is what type of people are you trying to get to buy your product? Right. Because, I mean, actually I say that Fidelity has started doing influencer marketing, which is crazy, but generally the people\r\n\r\n\r\nNikolas Hulewsky (22:57.773)\r\nReally.\r\n\r\n\r\nTom (23:14.53)\r\nthat they'd be marketing to would be a little bit older, maybe not going to influencers for advice. But even that is shifting. I think more and more and more even with things like TikTok shop or there's other companies that have multi billion dollar valuations that are totally based off of live stream auctions of selling products to people. It's a live video auction of influencers selling whatever product they're selling that day to their viewers. And I think\r\n\r\n\r\nNikolas Hulewsky (23:21.666)\r\nHmm.\r\n\r\n\r\nTom (23:39.596)\r\nwe keep moving in this direction of there being more and more trust with influencers and more and more and more things being sold through influencers. Even like real world products that you can't buy online, like we've seen grocery stores doing ad campaigns.\r\n\r\n\r\nNikolas Hulewsky (23:51.309)\r\nWell, something I bring up fairly frequently is when a venture capital company invests into a startup, half of those dollars are earmarked for Google and Facebook, Alphabet and Meta, because they're just acquiring customers. That's our biggest spend is to go out and acquire customers to grow the market for themselves. And so I look at social media in particular, and when I started kind of just messing around on social media,\r\n\r\n\r\npeople like Cody Sanchez or people like Alex Hermosy or anybody who Nick Huber with his niche following. You have a distribution channel and there is real value in that channel. I'm wondering though from your, so going from the business side to the creator side, what do you see as the most and maybe least valuable audiences, if you will, like if I'm, if I'm a girl on Instagram who's cute and have\r\n\r\n\r\nTom (24:26.606)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:46.819)\r\n20,000 followers, is that the same as somebody who does tech product reviews on YouTube with 20,000 subscribers? Does a follower count? Is it the same across all platforms?\r\n\r\n\r\nTom (24:54.446)\r\nGreat question.\r\n\r\n\r\nTom (24:58.464)\r\nIt's definitely not, not even across all platforms, but across all niches. You know, you, if you were able to amass a hundred thousand subscribers on YouTube, that would be multiples more valuable than someone doing lifestyle blogs on YouTube. Just cause who are you attracting? Who's watching the videos? What is the intent of this content? And you're attracting a generally someone with a lot more disposable income, a lot more, you know, time to look at these high ticket products versus if my audience is a bunch of teenagers, then.\r\n\r\n\r\nNikolas Hulewsky (25:02.53)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (25:26.104)\r\nYeah.\r\n\r\n\r\nTom (25:26.582)\r\nThere's only so much you can sell to them. But YouTube, one for one, definitely has the most valuable followers. If I could choose 100,000 followers on any platform, without a doubt, it would be YouTube. And I'd say TikTok is probably... Absolutely. Yeah. It's the ability to relate long-form ideas to people, I think, is invaluable. TikTok, you get a couple minutes and people are scrolling so quick. YouTube's a bit more of a commitment, right? If people click on your videos,\r\n\r\n\r\nNikolas Hulewsky (25:37.281)\r\nReally? Independent of what you're selling. If you were just like, doesn't... Wow. Why?\r\n\r\n\r\nNikolas Hulewsky (25:52.994)\r\nMm-hmm.\r\n\r\n\r\nTom (25:56.162)\r\nI don't know about you, but I watch the video full screen. It's the only thing on my monitor. can't scroll to go to a next video. need to remove the full screen, go back to the homepage or look at the recommended and make an active decision to watch something else. you capture so much more attention from people where, know, even let's say this podcast is a 40 % watch retention that is still people watching you for 15, 18 minutes versus if they watched you.\r\n\r\n\r\nNikolas Hulewsky (25:59.607)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (26:12.311)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (26:19.521)\r\nWhat about Spotify or Apple, right? Because that's in your earbuds. I'm listening to that. At the end of my podcast, I have this little ad that's like, hey, if you're still here, you either really love the show or you're gardening and can't take the earbuds out. You know what I mean? But I think of podcasts as also really sticky. Do you kind of lump that into the same bucket as you do?\r\n\r\n\r\nTom (26:23.64)\r\nMm-hmm.\r\n\r\n\r\nTom (26:31.95)\r\nYou\r\n\r\n\r\nTom (26:44.206)\r\nI would, mean, in some sense, yeah, there's a little bit less of the social aspect. There can still be, I mean, there's podcasts that I've listened to every day for years, and once you get the little inside jokes and stuff on the podcast, it accomplishes the same thing.\r\n\r\n\r\nNikolas Hulewsky (26:49.911)\r\nThat's true.\r\n\r\n\r\nNikolas Hulewsky (26:56.683)\r\nYeah, I guess that's true because of the discoverability on YouTube, it allows people to spend more money. Whereas on podcasting, the discoverability is not there. Spotify is trying to do some things with it, but it's just not there. There's just not as much ad dollars pouring into the podcast.\r\n\r\n\r\nTom (27:06.732)\r\nExactly.\r\n\r\n\r\nTom (27:11.702)\r\nYeah, I think the number and don't quote me on this, but I heard this recently, the number, like we talked about $38 billion spent on influencer marketing. And I think only 3 billion of that, maybe 4 billion of that was on podcasts. So it's a very tiny sliver. I know we look at it's it's so top heavy in podcasting where the Joe Rogan's, the Caller Daddy's, you know, the big sports podcasts are making hundreds of millions of dollars. And then the person with a few thousand listeners is making\r\n\r\n\r\nNikolas Hulewsky (27:27.788)\r\nWow.\r\n\r\n\r\nTom (27:40.694)\r\nnothing in most cases. Whereas if you have a few thousand dedicated audience members on YouTube, you could probably find a way to... it would be a humble living, but you could probably find a way to make a living off of\r\n\r\n\r\nNikolas Hulewsky (27:42.466)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (27:52.32)\r\nAt what point, so I'm curious about this because I'm like going through it right now. At what point do you as a creator like sit and assess and think, I could turn this into a business.\r\n\r\n\r\nTom (28:04.93)\r\nThat's a really great question. For me, it happened naturally. It's something I wanted to do for fun. I knew you could make money, but it was more of just a hobby. And I thought, I remember saying to myself, if I could make $1,000 a month off of this, it would be incredible when I was making videos. And I think that's a lot of people's initial entrance into it. Generally, people that are really successful didn't start because they wanted to achieve success from it. And I think that's a corollary in all.\r\n\r\n\r\nall things in life. started it because they enjoy doing it whether they ever saw success from it or not. The people that are starting to chase fame or monetary success, it's almost never going to come right away. Sometimes it does. Well, we have clients that have posted two videos and ended up with a quarter of a million subscribers after two videos, but that is an extreme outlier. Most people, is just like me, years of making videos before you see any real traction or economic reward for it. So I think loving what you're doing before you start would\r\n\r\n\r\nNikolas Hulewsky (28:31.362)\r\nMm-hmm.\r\n\r\n\r\nTom (29:01.016)\r\nprobably be the biggest correlation between starting and seeing success from it.\r\n\r\n\r\nNikolas Hulewsky (29:05.235)\r\nDo you have tiers of influencers? you think of like, at this subscriber count, this is where you are at this, you're at this level. do you think of it in tiers?\r\n\r\n\r\nTom (29:14.414)\r\nNot really. think for me, I mean, we're working with people at the end of the day. We're not working with numbers on our end. So whether someone has a hundred thousand subscribers or 10 million followers, we're looking at them for their unique needs, what they're trying to achieve, you know, what their expectations are. Obviously some clients are bigger than others. You know, you can never totally block that out. But once you get to know people for people, I think it becomes a little less about the numbers, at least on our\r\n\r\n\r\nNikolas Hulewsky (29:40.363)\r\nAlright, so, well, I'm gonna make it about the numbers. 10,000 subscribers. Can you make a living at 10,000 subscribers? And we'll just say YouTube.\r\n\r\n\r\nTom (29:44.045)\r\nYes.\r\n\r\n\r\nTom (29:47.562)\r\nWe have had... So we had a client a while back who actually stopped making videos because she went back to grad school, but she was clearing about 80 grand a year on 12,000 subscribers. And she had a very, very niche content. She was retrofitting an old bus and all of her audience was men in their 50s and 60s that had money, wanted to spend money on construction things, on Home Depot tools, on you name it. And she was able to monetize\r\n\r\n\r\nincredibly well off of really sponsorships. Every single one of our videos was sponsored for between $2,500 and $3,500 off such a tiny audience. Now that is almost unheard of. I think that's the only case where someone with around 10,000 followers has been doing it full time that we've worked with, but it can happen for sure.\r\n\r\n\r\nNikolas Hulewsky (30:18.253)\r\nHow? did she monetize?\r\n\r\n\r\nNikolas Hulewsky (30:25.219)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (30:38.403)\r\nOkay, so in your mind, let's say I'm like, hey, I'm Nick, I have Nick in Alamance, I have almost 5,000 subscribers, cool. I wanna do this full time, this is all I wanna do. I don't wanna invest in companies, I don't wanna start any other businesses, now I just wanna do a podcast 100 % full time. What would the subscriber number be that I need to shoot for in order, go ahead.\r\n\r\n\r\nTom (30:43.48)\r\nMm-hmm.\r\n\r\n\r\nTom (30:54.178)\r\nMm-hmm.\r\n\r\n\r\nTom (30:57.6)\r\nIt's more about the downloads, less about the subscribers. Because brands are going to look at how many years are hearing this thing each episode. I'd say if you could safely get to a reliable base of 10,000 downloads an episode, that would probably be where most people.\r\n\r\n\r\nNikolas Hulewsky (31:01.868)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (31:11.245)\r\nHold on, okay, you can ask me, I'll tell you my numbers. When you say downloads per episode, is that just on YouTube or is that, okay, okay, so podcasting, YouTube would be the downloads. If maybe I'm on Twitter and I release my podcast on Twitter, that might be.\r\n\r\n\r\nTom (31:16.076)\r\nYeah.\r\n\r\n\r\nTom (31:19.67)\r\nNo, across all platforms, across all platforms. Yeah.\r\n\r\n\r\nTom (31:26.924)\r\nYeah. Exactly. Apple music, Spotify, YouTube, wherever you're putting it. I'd say reliably about 10,000 would be where most people now, I think you're in a different situation. Your number is probably a lot lower because of who you're talking to. And it's, I'm guessing a large chunk of your audience is business owners. You can sell niche softwares and financial products and things that most podcasts with just a general audience talking about true crime or sports wouldn't be able to sell. So you probably have an\r\n\r\n\r\nNikolas Hulewsky (31:40.311)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (31:46.114)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (31:51.34)\r\nyou\r\n\r\n\r\nTom (31:56.654)\r\nI would say maybe, I don't know, 2,500, 3,000 people an episode and you could make a good living off of it, would be my initial guess. Which is extremely uncommon, but you're in a great niche to make money off of a small audience.\r\n\r\n\r\nNikolas Hulewsky (32:01.783)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (32:06.989)\r\nDude, that, okay, hold on, you need to stay right here, because I'm gonna pull up my numbers right now. Because I'm insanely curious. Let's see. Doing the math. Boop, boop, boop, boop, boop, boop. Sorry, I'm a nerd. All right, so this is interesting.\r\n\r\n\r\nNikolas Hulewsky (32:32.195)\r\nThis year, this is how many downloads across platforms I've been getting per episode. January, 982, February, 1061, March, 1036, April, 1268, and this month, 2758. So I've gone, I'm like, I'm close to that like 2500 ballpark, but like you're saying it's...\r\n\r\n\r\nTom (32:51.96)\r\nYou're right on. Okay.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (32:58.773)\r\nIt's not necessarily because of the volume, it's because of the quality of the volume that I have. Interesting.\r\n\r\n\r\nTom (33:02.242)\r\nAbsolutely, absolutely. So we put a lot of emphasis on that of like real estate content, finance content, know, tech reviews. They carry so much more value per viewer than prank channel. Prank channels is probably the, that is the bottom of the bucket of value per viewer. Well, I'd say about maybe 200 prank channel viewers equate to one finance channel viewer.\r\n\r\n\r\nNikolas Hulewsky (33:17.822)\r\nHahaha!\r\n\r\n\r\nNikolas Hulewsky (33:26.115)\r\nmy gosh, dude. So for somebody like me, let's say I wanted to start, because I have started getting sponsors for the podcast. like, they're like, well, what's your pricing sheet? Like, I don't know, dude. You know, and I'll throw out some numbers and I've got some sponsorships. But it's just always has felt like, hmm, when I think about like subjective, how would I, how would somebody like me go about pricing what I should charge someone?\r\n\r\n\r\nTom (33:34.346)\r\nMm-hmm.\r\n\r\n\r\nTom (33:53.358)\r\nI think a good way to start is, like you said, looking at your average downloads. So if you're looking at 2800, then you want to determine your cost per mill, your cost per thousand views, CPM. So let's just round up and say you have, you know, 3000 views. So what's your cost per thousand views? Now, in most areas of influencer marketing, it's going to be between 20 and $70 per thousand views. Yours is going to be much, much, much higher than that. Yours is going to be in the hundreds of dollars.\r\n\r\n\r\nNikolas Hulewsky (34:05.036)\r\nOkay.\r\n\r\n\r\nTom (34:22.446)\r\nfor a thousand views and more niche.\r\n\r\n\r\nNikolas Hulewsky (34:24.513)\r\nAnd I can go and look at this on YouTube.\r\n\r\n\r\nTom (34:28.494)\r\nYeah, you could look at, well, it's just you doing the math yourself. You can't look at it on YouTube, but you look at the views you're getting per episode and do the math yourself. So let's say you were in a typical ballpark. Exactly. So if you had 3000 views and you were just making typical run of the mill content, you'd probably only do worth about $150 on a $50 CPM base. Now that typically trends to higher CPMs and it's a smaller audience. And yours also tend to trend to a much higher CPM just because of\r\n\r\n\r\nNikolas Hulewsky (34:30.659)\r\nCan I?\r\n\r\n\r\nokay, okay.\r\n\r\n\r\nNikolas Hulewsky (34:37.947)\r\nand just what my spend is. Just what my spend is per episode. Okay.\r\n\r\n\r\nTom (34:58.112)\r\nyour content. But you could safely be charging several hundred dollars per thousand views with the type of stuff you're making. Yes, and that sounds crazy, but it's very rare that you have as hyper focused of an audience as an entrepreneurship podcast would.\r\n\r\n\r\nNikolas Hulewsky (35:04.639)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (35:13.759)\r\nAnd would I apply that to podcasts? So it's like a couple dollars per thousand views. Would I apply that to the podcast downloads as well? Because one thing I have noticed, I don't know what you've noticed, like my average view duration on YouTube is significantly lower than my average retention on podcasts. Like on a podcast, 70 % of the episode is completed. On YouTube, it's between 30 and 40 % of the episode is like fully watched per person.\r\n\r\n\r\nTom (35:21.313)\r\nAbsolutely, yeah.\r\n\r\n\r\nTom (35:32.514)\r\nMm-hmm.\r\n\r\n\r\nTom (35:39.554)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (35:42.901)\r\nAnd maybe because I'm ugly or something. don't know what the difference is on YouTube. But I know that in podcasting, that's a really good retention rate. And in YouTube, it's kind of middle of the road. It's not great, and it's not horrible. Why the disparity? you know?\r\n\r\n\r\nTom (35:57.582)\r\nThat's a good question. mean, we don't work with a ton of podcasters. So it's a little bit outside of my wheelhouse. We're more with social primary. my guess would be same thing we said about the fleeting attention span on TikTok versus YouTube. We can just move that one step to the right for YouTube versus a podcast, right? You still need to have your screen on. You still need to be looking at something with YouTube unless you have YouTube Plus or YouTube Premium. But with a podcast, I don't know about most people, but\r\n\r\n\r\nNikolas Hulewsky (36:02.711)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (36:16.482)\r\nHmm.\r\n\r\n\r\nTom (36:25.068)\r\nI put my phone in my pocket, have my headphones on, I'm not looking at my screen. I'm committed to the next hour of listening to this thing. So I think it's just a different behavior on different platforms.\r\n\r\n\r\nNikolas Hulewsky (36:27.607)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (36:32.075)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (36:35.979)\r\nIf you're ever curious, had his name is Craig Fuller. He owns a company called Firebrand Media and he owns. I can't remember all the print magazines, but flying.com is one of the the magazines like cruise ships. Mag. don't know a lot of so these are high value. Subscribe customers that are subscribing to these magazines. They're buying these are big ticket purchases, boats, planes, cars, mansions, whatever.\r\n\r\n\r\nTom (36:51.244)\r\nOkay.\r\n\r\n\r\nTom (36:58.542)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (37:06.115)\r\nand one of the things that he said when I was talking to him is he's like, I really like magazines because you're indistractable. If you've got a magazine in your hand and you're flipping the page, you don't have your phone out at the same time and trying to swipe through it and go to another website. Like you're indistractable. that's podcasting is the closest thing that I can think of on the digital medium spectrum that that is like that you're, you're indistractable. Cause you're probably doing something else that makes it really difficult for you to reach in your pocket.\r\n\r\n\r\nTom (37:28.334)\r\n100%.\r\n\r\n\r\nNikolas Hulewsky (37:35.788)\r\nand switch.\r\n\r\n\r\nTom (37:37.228)\r\nYeah, I totally agree. I think that's a big part of it, if I had to guess the difference, is just people are not looking for the next thing to listen to.\r\n\r\n\r\nNikolas Hulewsky (37:39.542)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (37:45.283)\r\nAre you seeing more and more dollars pour into the space? Like are you seeing more and more established brands or private equity or just, I don't know. Who are you seeing now pop in that weren't here five years ago, spend money on social media?\r\n\r\n\r\nTom (37:56.654)\r\nMm hmm. Great question. mean, every time I think I've seen the strangest brands spend money, spend money on influencers, then all of sudden we see the Barry Moody fish farm, right? Like there's always someone you never expected spending money on influencers that is now doing it. But like I said, we're seeing brands that you don't think of when you think influencers, we're seeing fidelity, we're seeing life insurance, we're seeing, I mean, TurboTax spends a lot of money on influencers and like big brands with\r\n\r\n\r\nNikolas Hulewsky (38:12.035)\r\nCheers.\r\n\r\n\r\nTom (38:24.75)\r\nproducts that aren't really glitzy and glammy that are pumping money into the space. it keeps going up and up and up. A really cool stat that we broke our streak in May because of the tariff situation, unfortunately. But we had 37 months in a row of increasing our revenue month to month, every single month for 37 months in a row. Like brands are not slowing down.\r\n\r\n\r\nNikolas Hulewsky (38:44.897)\r\nHoly crap, man.\r\n\r\n\r\nOkay, well now I gotta ask, can you tell me top line revenue? Like how big is your agency?\r\n\r\n\r\nTom (38:50.838)\r\nHa\r\n\r\n\r\nYeah, we're doing about $2.5-3 million a month at the moment.\r\n\r\n\r\nNikolas Hulewsky (38:57.411)\r\nThat's ins- that's ins- how big is your- how big is your team?\r\n\r\n\r\nTom (39:00.17)\r\nIt's a good business. We have a team of about 30 people. So they do some fantastic work for our clients.\r\n\r\n\r\nNikolas Hulewsky (39:06.196)\r\nThat's that's a freaking real business\r\n\r\n\r\nAre you like the Scott Boris of, or, my gosh, I'm blanking on LeBron's best friend, Rich Paul, there we go. Yeah, are you the Rich Paul of social media representatives?\r\n\r\n\r\nTom (39:15.872)\r\nAre you Rich Paul. Mabrick Carter. Yeah.\r\n\r\n\r\nI I don't know if we're LeBron's agent, but we might be like Jeremy Grant's agent at this point in our career.\r\n\r\n\r\nNikolas Hulewsky (39:30.474)\r\nHahaha!\r\n\r\n\r\nNikolas Hulewsky (39:34.927)\r\nHey, Hey, he's a solid player. He's he's signing, you know, he's getting eight figures, man, mid eight figures. He's getting he's making some great money.\r\n\r\n\r\nTom (39:39.118)\r\nExactly, he's getting 35 a year. Yeah, exactly. No, we work with some fantastic clients, know, multi million follower channels, but we're not working with the the Mr. Beasts or the Kaisenauts of social media.\r\n\r\n\r\nNikolas Hulewsky (39:55.085)\r\nDo you like this better than being a channel?\r\n\r\n\r\nTom (39:58.318)\r\nI love it. sounds insane. My friends think I'm psychotic for saying this. Running a company, being responsible for 350 clients, 30 employees, is orders of magnitude less stressful than making YouTube videos every single day. I'm behind the scenes. I don't have 100,000 people giving me their feedback on if they did or didn't like the title of today's video. I love it.\r\n\r\n\r\nNikolas Hulewsky (40:13.635)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (40:17.058)\r\nYeah.\r\n\r\n\r\nTom (40:22.382)\r\nI think doing YouTube, I always recognized it probably wasn't a forever career. There's not too many people doing YouTube for 20 years. And so I was always mindful of what was the next thing and wanted to do something scalable, something that could exist outside of myself. And it's a really great niche to be in. You get to help a lot of people and you get to directly see the impact that you have on people when they buy their first house or they quit their full-time job or they put their kid through college or whatever the case may be because of the deals that we're bringing in their way.\r\n\r\n\r\nNikolas Hulewsky (40:45.624)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (40:50.945)\r\nWhat do you do for people? So like, know the, well, let's just do that. What are your services as an agency?\r\n\r\n\r\nTom (40:56.862)\r\nYeah, so like I said, we really handle all the non-creative stuff. We're not going to help you make the content. We'll happily brainstorm content with you if you want, but you're always going to know yourself and your audience better than we do. We really handle the business transactions. You want to do a brand deal with Sephora, we will get in touch with Sephora and make something happen. You want to do a speaking tour, we will get in touch with production companies and event venues and give you a speaking tour. You're interested in making a cookbook, we'll talk with publishers instead of a cookbook.\r\n\r\n\r\nNikolas Hulewsky (41:20.419)\r\nMm-hmm.\r\n\r\n\r\nTom (41:25.986)\r\nfor you. So we're really just the business agents in all of these transactions.\r\n\r\n\r\nNikolas Hulewsky (41:26.819)\r\nYeah, that's what I was gonna ask.\r\n\r\n\r\nWhat if I wanted to self publish? What if I was like, dude, I'm not going through roundhouse Porter. How? don't know what the freaking these.\r\n\r\n\r\nTom (41:36.214)\r\nHey, we have had clients that have self-published very, we have a client that did a crochet book of little crochet patterns. She's sold 10,000 copies in three months, which is a lot for books. Yeah. Self-publish.\r\n\r\n\r\nNikolas Hulewsky (41:43.746)\r\nReally?\r\n\r\n\r\nHoly crap, holy Mike. But you're doing the business side of it. Are you also then, let's say they do a book or they're doing a speaking tour, are you then doing the distribution for it as well? Like helping them place it other influencers? Then it gets like meta.\r\n\r\n\r\nTom (42:02.85)\r\nYeah. Yeah, so we'll help them with that. So the speaking tour, for instance, great example. We're making sure that there are other key creators showing up at these events that would bring in another audience to want to buy tickets and show up, making sure that everything's handled. There's going to be merch to sell at the events. We're making sure there's sponsorships, sponsoring the events, sponsoring the meet and greet, all of that stuff.\r\n\r\n\r\nNikolas Hulewsky (42:16.909)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (42:26.723)\r\nOkay, so you're doing brand representation, but are you also working with companies that are like, hey, I wanna run a campaign for this new product or I wanna grow my business and then placing them with influencers as well?\r\n\r\n\r\nTom (42:36.973)\r\nOkay.\r\n\r\n\r\nTom (42:40.812)\r\nYes. Yeah. So we do that quite a bit. We kind of have a separate wing of our business that operates kind of independently. We want to make sure there's no conflict of interest where we want to charge more for our creators just because they're our clients. And we'll handle a brand's budget. We'll have a brand come to us and say, hey, we're looking to spend half a million dollars over the next year on influencers. Here's our plan. Here's who we're trying to target. We go out. find the creators.\r\n\r\n\r\nNikolas Hulewsky (42:51.8)\r\nYeah.\r\n\r\n\r\nTom (43:08.558)\r\nWe know how much they should be charging. We know how much they've historically charged, which that's actually a huge advantage where a brand might talk to a creator and let's say they're talking to you and you tell them, I will not work for you for less than $5,000 a podcast. Whereas if we're booking you quite often, we know that you took $2,000 for your last podcast and that you're going to take $2,000 again if we tell you that's a hard line. So we can save the brand a lot of money just because we have that historical context.\r\n\r\n\r\nNikolas Hulewsky (43:16.951)\r\nHmm?\r\n\r\n\r\nNikolas Hulewsky (43:32.119)\r\nRight. Right.\r\n\r\n\r\nNikolas Hulewsky (43:36.899)\r\nIf you were to break down, I'm just gonna say two million is the number. $2 million a month, what percentage is brand representation and what, or I guess, how do you name them, the two kind of sides of the.\r\n\r\n\r\nTom (43:40.024)\r\nMm-hmm.\r\n\r\n\r\nTom (43:45.932)\r\nYeah, I mean, working for the brand versus for the creator, pretty heavy towards the creator. I'd venture to guess about 85 % of revenue coming in is us representing the creators.\r\n\r\n\r\nNikolas Hulewsky (43:53.762)\r\nWow.\r\n\r\n\r\nHow do you get paid for each one of those? On the creator side, I'm assuming you're just taking a percentage of what they bring in. On the brand side, probably just taking a percentage of what they're spending. It's the same? Okay.\r\n\r\n\r\nTom (43:59.53)\r\nMm-hmm. Yeah.\r\n\r\n\r\nTom (44:06.19)\r\nSpot on. Yeah. So with, there's some variance, but generally it's, just take our 20 % management fee and then, you know, if we're not making you money, we don't make money either on the creator side. So it's a pretty, equitable agreement.\r\n\r\n\r\nNikolas Hulewsky (44:18.379)\r\nIs that a point where, let's say Nike comes to you and they're like, hey, I want to place it with some whatever the influencers and you're like, I'm going to save you money actually, because now the influencers not going to have to pay their representation. And you're going to have to pay me as your representation. Like you both can pay me. So we're going to bring the price. That's a selling point.\r\n\r\n\r\nTom (44:33.006)\r\nMm-hmm.\r\n\r\n\r\nTom (44:38.114)\r\nExactly.\r\n\r\n\r\nThat is a selling point. mean, we've seen insane, there are so many, this industry is the Wild West and in the Wild West you attract a lot of sharks and vultures just looking to get their little bite of the pie. We have seen ridiculous instances where Samsung will want to do an influencer campaign. So they'll contact an agency, the agency contacts another sub agency who contacts us, who then we go to creators that we don't represent at a different agency because that's who they wanted to work with.\r\n\r\n\r\nNikolas Hulewsky (44:51.638)\r\nYeah.\r\n\r\n\r\nTom (45:07.886)\r\nWe've done the math, there's been circumstances where the creator has got like 31 % of the initial dollar allocated. They got 31 cents of it because there's been so many middlemen in the situation, which is insane. So the more that you can cut that out, better. yeah, working with an agency that one can represent the brand, but also represents creators immediately, like you said, saves you 20%.\r\n\r\n\r\nNikolas Hulewsky (45:17.133)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (45:21.111)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (45:31.383)\r\nOkay, so what, I'm a brand, not a brand, I'm a creator, I come to you, I'm getting $10,000 a month in ad sponsorships, what's your cut now?\r\n\r\n\r\nTom (45:35.82)\r\nMm-hmm. Yeah.\r\n\r\n\r\nTom (45:43.118)\r\nYeah, so we would take 20 % but if you're one of our average clients, you'd go from making 10,000 a month to 17,200 a month. On average, our clients make about 72 % more working with us even after our fee. We make sure that we're not just sitting around waiting for brands to come in and be interested. We're going out and sparking that interest with the companies.\r\n\r\n\r\nNikolas Hulewsky (46:04.387)\r\nHow do you do that? Are you just going to conferences or are you just scrolling Instagram all day? how do you do that?\r\n\r\n\r\nTom (46:08.096)\r\nNo, it's, I mean, thankfully it's a job that you can do from your phone and your laptop. mean, I've never met 95 % of the people that we do business with and it's really interesting because this stuff didn't exist a decade ago. we do a lot of it as relationships, right? We know the person who's advertising at Nike or at HelloFresh or at Panasonic. We can email them, we can give them a call, say, hey, we started working with this creator. And we have that rapport. They know that our clients get stuff done on time. We charge reasonable prices.\r\n\r\n\r\nNikolas Hulewsky (46:18.691)\r\nseries.\r\n\r\n\r\nTom (46:37.922)\r\nyou we have good success on the campaigns. And that's invaluable. You you as someone that this brand has never heard of emailing them and saying, hey, please notice me, please pay me. 500 other people did the exact same thing that day. So us being able to already have that rapport and that existing relationship is really valuable. But on top of that, we do do a lot of cold emails. Every single one of our clients, if there's a brand they want to work with, we'll try and get in touch with them and make a partnership happen. So that could be\r\n\r\n\r\nNikolas Hulewsky (46:51.448)\r\nHmm.\r\n\r\n\r\nTom (47:05.142)\r\na niche company that's doing $50,000 in sales a year and has never heard of us. We'll go send them a pitch and see what we can make happen.\r\n\r\n\r\nNikolas Hulewsky (47:12.461)\r\nWell, dude, what's crazy is you've got a 25, $30 million business, which is nuts. And tell me really quickly, generally speaking, these types of businesses have what kind of margins? 10 % margins, 30 % margins? Like, what's the range?\r\n\r\n\r\nTom (47:21.838)\r\nMm-hmm.\r\n\r\n\r\nPretty good margins, I'd say anywhere between 10 and 16 % margins. Really depends on the scale and exactly what's going on, but it's decent.\r\n\r\n\r\nNikolas Hulewsky (47:29.344)\r\nOkay, fence.\r\n\r\n\r\nSo you've got a great business, good margins. But the reason I really love it is because I love businesses with tailwinds. That's why I love healthcare is because we have an aging population and you can be an idiot like me and get into it. it's like, healthcare is growing at 10 % a year. Yeah, yeah. I like I told you before the call, like I'd never heard of CAC, customer acquisition costs. What are you talking about? We just tell them we're open for business and they start coming to us. But if that's growing at 10 % a year and the rest of the economy is growing at 3 % a year.\r\n\r\n\r\nTom (47:41.144)\r\nMm-hmm.\r\n\r\n\r\nTom (47:47.31)\r\nYou'll find clients somewhere.\r\n\r\n\r\nNikolas Hulewsky (48:02.645)\r\nyou are by it's just math, you're going to grow faster than everybody else. It's very hard to fail. And like this business to go from a couple billion to 38 billion in a couple of years, and I would bet that's projecting to grow at, you know, 10 % a year over the next 10 years, I'm assuming. It's phenomenal. I love businesses with with those tailwinds. What's your plan? What do you want to do? Like, are you just like, I'm kind of going with the flow. We'll see what happens. Or are you like, no, private equities?\r\n\r\n\r\nTom (48:05.678)\r\nIt's hard to fail. Yeah.\r\n\r\n\r\nNikolas Hulewsky (48:30.851)\r\nsnatching these things up and eight to 10 multiple, I want to get to $50 million a year and get my margin to 15%. You know what I mean? Like, you, where do you fall on the spectrum?\r\n\r\n\r\nTom (48:35.79)\r\nMm-hmm.\r\n\r\n\r\nTom (48:39.694)\r\nYeah, I mean, I think where I fall in the spectrum is every single day making sure we can do a little bit better for the clients we have, attract bigger clients, do a great job for them. You know, if someone came knocking on our door and said, hey, here's 10X, then I'd have the conversation certainly, but it's not something I'm actively going out and seeking. I mean, we're growing pretty quickly. We're growing at about 70 % a year at the moment and want to keep that up and keep doing a good job, keep hiring the right people and see where the future takes the company.\r\n\r\n\r\nNikolas Hulewsky (48:57.88)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (49:02.339)\r\nThanks\r\n\r\n\r\nNikolas Hulewsky (49:09.987)\r\nall right. Who are the, these are going to be the best. I'm so excited for these questions. Like who are the best and worst influencers to work with? But before I do that, before I do that, if you're listening, I know, if you're listening, before you get the cake, I need you to go like and subscribe please. Cause I'm trying to get better about not only getting a better following, but also make sure that my, my rating is good on Apple and Spotify podcasts as well as YouTube. so what kinds of influencers do you hate?\r\n\r\n\r\nTom (49:18.094)\r\nHow long do you have?\r\n\r\n\r\nNikolas Hulewsky (49:38.839)\r\nand which ones are the best to work with.\r\n\r\n\r\nTom (49:40.856)\r\nSo that's a great question. Some clients during the sales process ask us that as well. We love working with people that are doing things or sharing knowledge that they have or some skill that they have. We generally shy away from the people that are like, hey, look at me. So the LA Instagram model or the kid who vlogs about going shopping on Fifth Avenue and buying designer stuff. There's not a lot of substance there. Exactly. And I think that's exactly, it's exactly what it becomes is\r\n\r\n\r\nNikolas Hulewsky (49:58.037)\r\nOkay.\r\n\r\n\r\nSo narcissists.\r\n\r\n\r\nTom (50:09.152)\r\nEven if you didn't start out being a narcissist, if all of your content is just about you, you become a narcissist and sometimes a very miserable and erratic narcissist. There's lots of creators like that that are all over the place, not reliable, can't hit a deadline. You'd think posting a picture for $30,000 would be a nice motivator to get something done on time, but sometimes it's not. Almost all the clients we work with are great people that\r\n\r\n\r\nI mean, one of my favorite clients flew over to New Zealand to visit him and his partner in January. He reviews tiny homes and he builds tiny homes as well. So think architectural digest style videos, but on 300 square foot houses and has millions of followers, but it's just his passion. He thought it was really cool. He didn't have money to live in a full sized house in his twenties. So started living in a tiny home, found this community and 13 years later is one of the biggest names in the space. And he's a great guy because he built an audience around.\r\n\r\n\r\nNikolas Hulewsky (50:45.304)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (51:00.503)\r\nHoly crap.\r\n\r\n\r\nTom (51:03.222)\r\na passion and I think that's those are the people you want to work with. Someone that said, I love this so much. I think there's other people that love it too. I want to talk about it. Not, hey, look at me, look at me.\r\n\r\n\r\nNikolas Hulewsky (51:12.695)\r\nWho was the last client you cut and why?\r\n\r\n\r\nTom (51:17.246)\r\nthat's a great question. I mean, I can't name names. wow, this is actually really grim. I can't do that. This is a first and this is actually like this is pretty dark. We had a client that was messaging teenage girls on Instagram at scale and it got out all over Reddit. And obviously that was a swift decision on our end, not someone we want to be working with.\r\n\r\n\r\nNikolas Hulewsky (51:21.163)\r\nOf course, of course, of course, but what does it rhyme with? Just kidding, I'm just kidding.\r\n\r\n\r\nNikolas Hulewsky (51:43.597)\r\nYeah, man, it can be. jeez.\r\n\r\n\r\nTom (51:45.694)\r\nAnd it's, I mean, you work with 350 people. Some people are not going to be the best people, unfortunately, but outside of that, we don't have to cut a ton of clients, thankfully. Yeah.\r\n\r\n\r\nNikolas Hulewsky (51:55.139)\r\nGood. All right. So there's a there's a couple of really cool examples that I love to look at. Dr. Dre and 50 Cent are two of them. So 50 Cent. can't remember the exact deal, but somehow he got equity in vitamin water before it was purchased by Coke or Pepsi or whoever bought them. And then obviously Dr. Dre had equity in beats that they grew and then sold. And he's now a billionaire or at least close to being a billionaire. But I would say they were early in this.\r\n\r\n\r\nTom (52:01.986)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (52:24.011)\r\nability to monetize their status as social media, as social icons. And now you see everybody doing it. The Rock has a, has a brand of alcohol and Diddy had a brand and George Clooney has a brand, like they all have their brands. What's the coolest, and maybe you, cause you can't name names, this will be hard, but is there a coolest story that you've had where it's like you worked with an influencer who wasn't as worried about the cash upfront that maybe negotiated?\r\n\r\n\r\nTom (52:26.081)\r\nAbsolutely.\r\n\r\n\r\nTom (52:36.238)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (52:51.211)\r\nan equity like deal like that? Have you seen a lot of those?\r\n\r\n\r\nTom (52:54.572)\r\nThere are some for sure. Generally, like you need a lot of pull to be getting equity deals with established companies. So it generally is more with smaller companies looking to really, you know, really benefit from the influencers audience. But we have seen some really cool deals. One of my best friends who was our second client at the agency, he got a really cool deal with an app that is now, I think he got, I don't know,\r\n\r\n\r\npercent, one percent equity, but it's 20X in revenue from the time that he got on board. So that's probably looking pretty good for him. And there's a lot of opportunities like that with small companies. You need to really believe in the company though, because some companies are offering you equity because they don't have cash. It's like, well, do I want to take a flyer on this? And would I rather have the 15 grand I'd get right away or put my...\r\n\r\n\r\nNikolas Hulewsky (53:43.288)\r\nYeah.\r\n\r\n\r\nTom (53:47.736)\r\nput my chips in on this one in a hundred chance of me ever seeing something from this. And if it's a great company, I would always encourage creators to at least look at the opportunity for the equity.\r\n\r\n\r\nNikolas Hulewsky (53:56.129)\r\nYeah. All right. Well, before we hop off, are there any clients you can say you work with?\r\n\r\n\r\nTom (54:03.392)\r\nYeah, I mean, we work with a lot of fantastic clients. If you hop over to our website, we have about 100 of them showcased there. But some of my personal favorites that I'll give a shout out to would be Seth Vowell, my friend I just mentioned, Amir Odom, and Living Big in a Tiny House, who we talked about as well, would be three that have become good friends of mine through working with them for years.\r\n\r\n\r\nNikolas Hulewsky (54:08.908)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (54:19.331)\r\nOkay, man.\r\n\r\n\r\nNikolas Hulewsky (54:23.351)\r\nDude, what a great business. This is incredible. I'm excited to continue to follow you and your success. If people want to come find you, where do they find you?\r\n\r\n\r\nTom (54:30.126)\r\nThank you. Yeah, they could find me on Instagram, Twitter at Tom Stefanik, or you could shoot me an email at tom at smallscreenmarketing.com. Always happy to have a chat if you're a creator or your brand wanting to work with creators.\r\n\r\n\r\nNikolas Hulewsky (54:45.645)\r\nAwesome. Tom, great. Stay on for a second. We'll let this.",
  "metadata": {
    "duration": "",
    "date": "2025-06-20",
    "platform_source": "Google Drive"
  }
}