{
  "episode_number": "47",
  "episode_title": "From Freelance to $2.5M: Inside a PR Empire with Chris Norton",
  "guest_name": "Chris Norton",
  "business_name": "Prohibition",
  "transcript": "﻿Nik (00:00.642)\r\nAll right, Chris, welcome to Niconomics from across the pond. Super excited to have you, my friend.\r\n\r\n\r\nChris Norton (00:05.757)\r\nThank you very much, Nick. Thanks for having me on. Delighted to be here from sunny not the UK. 18 degrees in the UK.\r\n\r\n\r\nNik (00:14.446)\r\nOh my goodness, well from many of us in the United States, we're going through a heat wave right now. Las Vegas just hit like 121 degrees, which is nuts. So for those listening, would you just give us a quick hitter of what is your business and how do you make\r\n\r\n\r\nChris Norton (00:31.71)\r\nOkay, so we're a public relations agency. Well, public relations and social media agency and we're based in a place called Yorkshire in England, UK. And Yorkshire is the biggest region, public relations, I've got a team of 30 consultants. Like I say, we're the biggest PR agency, depending on which year you're looking at it, in the region in Yorkshire.\r\n\r\n\r\nAnd a PR agency, what they do is they predominantly manage reputation for a company. So they'll help launch. So for people that listening to this, they're entrepreneurs looking to launch a business. If you want to work with a PR agency, they can help you launch a product into a market. They can help you get coverage in the press, on broadcast, on radio. They can get you interviews on podcasts and they can manage your reputation. And to be honest with you, most people think of PR agencies as\r\n\r\n\r\nthe people that create press releases and get market brands, but also they can really look after you if the proverbial hits the fan, because that's when people really need a PR agency, because we advise on the best steps to avoid getting negative stories all about you. And that's why a lot of politicians have PR people next to them. I won't mention politics on here. yeah, so it's basically that. And then there's also a\r\n\r\n\r\nSo Prohibition, the agency that I run in Leeds, we've got social media because I did social media. I was one of the first people on Twitter in the UK. I was in the first 50 people on Twitter in the UK. Yeah, which is quite a thing. Just means I'm really old and none of us had a bloody clue what we were doing with it. I remember, yeah, a long, time ago and when it was called The Facebook and I helped a politician and his team.\r\n\r\n\r\nNik (02:06.252)\r\nWow, congratulations!\r\n\r\n\r\nChris Norton (02:18.862)\r\nuse social media when nobody knew how to do it before influencers before everything before you could Google stuff and knew how it all worked. So since then I created Prohibition, is public relations, social media, content marketing and video and design and all that. So we do quite a lot of stuff. We don't do predominantly creative ads and stuff like that. We have done some stuff that you might see on TV, but yeah, predominantly our core focus is press releases, social media content and great videos.\r\n\r\n\r\nNik (02:46.734)\r\nThat's interesting. You have 30 consultants under you. That's a big team, Chris.\r\n\r\n\r\nChris Norton (02:52.252)\r\nYeah, well, it's big for here. So in Leeds, like I say, we're either first or second, depending on who you look at, because there's a couple of similar agencies. But in London, mean, London is the epicenter, I don't know what it's like in the US, but in the UK, London is the epicenter of public relations in the UK. Well, it was pre -COVID, and now everything's gone a bit more regionalized, because we can do what we're doing now, which is talk face to face, and clients don't really care where you're based, especially if\r\n\r\n\r\nto a 3 ,000 pounds a month cheaper to work with somebody based in Leeds that can do just the job. yeah, that's kind of, but an agency in Leeds, yeah, 30 is big, but an agency in London, what, blimey, could have 400 consultants.\r\n\r\n\r\nNik (03:32.974)\r\nWell, I appreciate the humility, building an agency to the size where you have 30 team members that you're working with, that's a really large team. I think one of the things that's surprising to me though about PR is I always think of PR is, the crap hit the fan. I did something stupid, something leaked. But the way you described it is you're also handling just any of their public persona or public profile, like managing social media.\r\n\r\n\r\nChris Norton (03:42.216)\r\nYeah.\r\n\r\n\r\nNik (04:01.698)\r\nhelping them with campaigns, those types of things. How did you get into\r\n\r\n\r\nChris Norton (04:06.942)\r\nWell, weirdly, I was at college and I did business studies and I loved marketing and I said I'm going to apply for marketing courses to my head of the course that was on for university and she said, have you thought about public relations? To which I said, what's that? I was only 18. What's that? And she said, oh, it's all about media relations and getting in the press and broadcast and I was like,\r\n\r\n\r\nThat's very exciting. The newspapers and the broadcasts were much more powerful than they are today, like social media is the new depending on how see it. And so I went to went on to an open day, went along and so I did a degree in public relations. Initially, I did a degree in it and then I left the degree and had to get a job in London. And there was like 300 people applying for this agency in London. was a top 10 agency in London.\r\n\r\n\r\nAnd it was interesting because there was people sat around me. I'm from, it's Chris from Harrogate in Leeds, which is a small place in the UK. And there was some, I was sat in this queue of graduates. was a hundred people applied for each role. And the person next to me was from Cambridge University. The one that side of me was from Oxford University. And they were only taking 10 people. And I got the job. Because I walked in and they went, they went exactly that. What they said, the interview question was.\r\n\r\n\r\nWhat do you want to do in PR? I went, well, I've already been doing it over a year. Here you go. Here's all my examples of all the work. And they were like, wow, we've never seen, because my course was quite new and nobody was qualified in PR. So yeah, it was a lucky break. wasn't that I was the best candidate. There was some really clever people. you know, so that's how I got into\r\n\r\n\r\nNik (05:46.584)\r\nWell, I, that's awesome. I mean, I always feel like anybody who thinks that luck didn't play a major role in their success is probably somebody I don't want to be friends with because I just think serendipity plays such a huge role in how we got our starter, a big break or et cetera. I'm not saying that people don't work hard. I'm not saying you don't put yourself in a position to be lucky, but when you look back on your life and you think about, man, just, I had one of the first schools.\r\n\r\n\r\nsome major in public relations. And then I go and interview for this position and I'm not qualified when you look at the candidates, you know, to your left and your right. But because you had that experience, it sets you apart. Yes, lucky for sure, but you also worked hard and put yourself in that situation.\r\n\r\n\r\nChris Norton (06:30.034)\r\ntell you what was lucky, the interview when this guy loved me in the interview, which I was quite shocked by. And then he said, I'm just going to get my boss. And the boss walked in and he said, I don't care what you know, just tell me who your favorite football team is. In the UK, that's a big thing. Now if I'd have said any team, it could have got me in, and I went Liverpool. And he went, you're hired. Because he was a Liverpool fan. Now that is luck.\r\n\r\n\r\nNik (06:56.782)\r\nThat is\r\n\r\n\r\nChris Norton (06:57.278)\r\nBecause if I said Manchester United, he said I wouldn't have given you the job, so there you go.\r\n\r\n\r\nNik (07:01.538)\r\nmy, read the room. Chris figured it out first, first day, first day as a public relations seat. He knew the right answer to say it's awesome. so you started working for this agency and were you doing the things that you're currently doing now? Like were you looking at placing people in interviews? I mean, obviously they weren't the podcasts back then or YouTube or social media. Those were just starting out. but is that the role you were playing or were you like focused on one specific vertical of a PR?\r\n\r\n\r\nChris Norton (07:03.206)\r\nYeah, exactly.\r\n\r\n\r\nChris Norton (07:21.608)\r\nYeah. Yeah.\r\n\r\n\r\nChris Norton (07:31.387)\r\nYeah, so how it works is back in the day, you used to use the phone. This really crazy modern thing that you pick up and ring people and you have to say hi and you have to pitch a story.\r\n\r\n\r\nNik (07:39.586)\r\nThat's funny. When you do this, which is, you know, the phone symbol with your hand, I can have no idea what that is. Like, why are you what's going on here? Like you guys have no idea. That's a phone.\r\n\r\n\r\nChris Norton (07:43.41)\r\nYeah.\r\n\r\n\r\nDo you want a drink? Do you want a drink? Yeah, exactly.\r\n\r\n\r\nChris Norton (07:53.746)\r\nYeah, that's a phone. I know I saw on social media the other day it said, how we blocked people in the 80s and it was just a phone off the hook. It's true that, isn't it? I was like, that's brilliant. I forgot the question. yeah.\r\n\r\n\r\nNik (08:01.58)\r\nThat's\r\n\r\n\r\nNik (08:07.406)\r\nSorry, I was asking when you started out, you focusing on, what kind of verticals were you focusing on within that space?\r\n\r\n\r\nChris Norton (08:12.968)\r\nThe tasks, yeah, so when I started out, so agencies work, they're quite similar structures, so you usually have account execs, so they're graduates, and people usually do one to two to three years as an exec, then you can become a senior exec, then you can become a manager, and they manage the execs, and they manage the clients, and then you can do three to five years in a management role, then you can go to a director role, which is more about client handling, client services, and and you\r\n\r\n\r\nbusiness development winning clients. That's essentially how the structure in the UK, it might be slightly different in America because America you've got vice president, you love a vice president in America. I see a lot of that in marketing. And so, yeah, so I started out as an account exec and weirdly I was, this is quite entertaining. So I was doing press releases, writing press releases during the day, using Word and everything that existed. Google had just come out. So Google, there was a BBC website.\r\n\r\n\r\nNik (09:09.07)\r\nDid you just say using words and everything that existed? Okay, okay. was like, well, hope you're using words for your press release. But yeah, yeah, yeah.\r\n\r\n\r\nChris Norton (09:12.766)\r\nNo, using word, Microsoft Word. Yeah. Not a typewriter. This is like, I'm talking 2000. I actually, yeah, year 2000. yeah, so we do that in the morning. And then the afternoon, you'd get all your press releases, stories for all your clients. So we had Lucent technologies. had big, we even had PlayStation and all sorts of stuff. And what we would do is fold the, fold them up into threes. And you got scored on how good you could fold paper.\r\n\r\n\r\nand then put it into envelopes, carry them downstairs to the post room, and actually put them through the franking machine to put them, then put them in the post bag. mean, none of that happens anymore. So now you just send an email out. It's just crazy.\r\n\r\n\r\nNik (09:50.766)\r\nmy god.\r\n\r\n\r\nNik (09:55.96)\r\nI mean, it is interesting to think about just how far technology has come and that in and of itself, how much time has that saved across thousands of people in that industry? How many man hours or human hours has that put back into the workforce? It's crazy.\r\n\r\n\r\nChris Norton (10:02.664)\r\nWell, yeah, loads. Loads.\r\n\r\n\r\nLoads, because people that have worked in this industry, anybody that, if you've printed out 150 press releases and you're sending them out, the worst thing is when you get to 86 and then suddenly see there's a typo in paragraph two and go, I'll be right. Nowadays, you can delete and edit, but then you will, oh no, I've printed out 300 of these. So yeah, I'd it takes about a couple of hours, a couple of hours sending stuff to post. And then I was always amazed by the technology where you put something in one end and it came out the other.\r\n\r\n\r\nFax machines, they still amaze me even now.\r\n\r\n\r\nNik (10:39.79)\r\nHas the speed of technology changed public relations? like, do you know who Anthony Weiner is? Okay, he was, I'm gonna describe like every disgraced politician, but he was a politician in New York who was sending pictures of his Weiner. His name really was Anthony Weiner. Yeah, yeah, that was, you know, the cherry on top. To women, right? And he's married and I think some of them ended up being underage girls, whatever.\r\n\r\n\r\nChris Norton (10:48.551)\r\nNo. Come.\r\n\r\n\r\nChris Norton (11:00.54)\r\nAs well. Right. Topical.\r\n\r\n\r\nChris Norton (11:10.128)\r\nMmm. Awful.\r\n\r\n\r\nNik (11:10.286)\r\nBut 30 years ago, for a woman to come forward wasn't as easy, right? Maybe they have to contact Gloria Albright and she comes out or whatever her name is and she comes out and she represents them. But now they can do a social media post or they can make an allegation online and it catches fire. Has that changed the landscape for public relations at\r\n\r\n\r\nChris Norton (11:32.658)\r\nMassive, like social media, well that's why I've set up Prohibition. Social media, was involved in the first social media campaign in the UK, that was one of my things. But you've got social media that came out, nobody knew. I was advising Sony at one point and then we were gonna do an influencer campaign and they had no idea what we were talking about. We didn't call them influencers, we called them bloggers and we were sending out load of phones that had a keyboard and what you did was you got your phone.\r\n\r\n\r\nAnd you slid it and you had to keep on. And at the time that was cutting edge technology. Now you can just use your screen, can't you? And at the time we were advising them and they were like, so you're telling me that if we send this out, people can then have an opinion on it and write what they actually think. And we're like, yeah, that's how it works. The game has changed. Like you can't control, it used to be you own the social, you own the medium, the press release.\r\n\r\n\r\nNik (12:01.058)\r\nYep,\r\n\r\n\r\nChris Norton (12:26.002)\r\nYou send it out, you deal with the journalist, it's fairly controlled. Whereas now you send it out and anybody can write anything. Because journalists sit to a code of conduct, whereas bloggers and all sorts don't. And then you've got AI coming out and you've got the era of disinformation. You've seen that with your election right now. England have just very recently got to a final of a European football tournament.\r\n\r\n\r\nAnd there's so much disinformation and deep fake videos of the England coach swearing and making jokes. And they're all fake. All of it's fake, but you can't use, there's that much stuff on Tik Tok and it's like, it's brands and companies have got to deal with that. And some of them benefit from doing fun, you know, outtakes and videos and Tik Toks and stuff. But some people, if you get, if you get attacked by somebody that's, and it's not even true, that can be a big problem as well.\r\n\r\n\r\nDisinformation is a big issue for quite a lot of corporates. And we've had several people on our podcast talking about it, how it's the biggest threat to companies for reputation, disinformation, or hacking is another one. Terrible.\r\n\r\n\r\nNik (13:33.806)\r\nSo I have a question about the UK. In the United States, we have a very entrepreneurial, not ethos, I don't know what the right word is, but culture, I guess you could say. We have this thing called the Small Business Administration where you can get a loan to buy a business for as little as zero money down, many times 5 % down, and the government will guarantee that loan. And it just makes the underwriting process lot easier to buy and start a business. But for whatever reason, I always think\r\n\r\n\r\nChris Norton (14:00.574)\r\nThat's cool.\r\n\r\n\r\nNik (14:03.65)\r\nharder to do that in Europe, harder to do that in the UK. There's probably some propaganda I've consumed, but there's also probably some truth to it. How did you start this business, right? Because again, to me, I'm thinking you're in the UK, people don't usually start businesses unless they've inherited them maybe from their families, but you, I mean, you've built a good sized business. What was your thought process in spinning out and how did that\r\n\r\n\r\nChris Norton (14:29.714)\r\nQuite easy. basically, not easy, quite simple. easy. Yeah, easy. I could do it yesterday. No, yeah. So I basically wanted to, I was having a child. I just had a little baby, not me personally, my wife, but we'd had a little baby boy and I needed to be around a bit more. My employer was not as flexible as I'd wanted and I wanted a bit more flexibility. This is before flexible working and everything like we've got now.\r\n\r\n\r\nNik (14:32.935)\r\nI was like, wow, I'm an idiot.\r\n\r\n\r\nChris Norton (14:57.758)\r\nAnd so I went freelance, part -time freelance. Then I started doing full -time freelance and literally nearly had burnout. So freelance is great because you get to meet amazing people that go, Chris, I really want to work with you. Can you launch my business? So I'll go, yeah, can you help me with this? Yeah. You say yes to everything and I had us making much more money than I'm making now. But then I was working 70, 80 hour weeks, working for loads of different clients.\r\n\r\n\r\nNik (15:25.506)\r\nHmm.\r\n\r\n\r\nChris Norton (15:25.714)\r\nAnd it was just, you go on a holiday because you didn't have a team. You didn't have someone managing it. So it became a bit too much. So I ended up thinking, right, instead of I'm going to have to start hiring people and then slowly but surely I started to put the things together. I haven't always got it right. Like the key thing in what we do, you're dealing with people. So you want good, creative, clever, smart people that can advise you on, give you the best advice. That's what you want in PI. You want really good quality people.\r\n\r\n\r\nnot cheap people, cheapest, cheapest is not best. and so, yeah, it has been tough, I've built up, my team's brilliant now. Yeah. I've got a great team. I've got the best team I've ever\r\n\r\n\r\nNik (16:06.99)\r\nHow did you launch that first business? So you said you started doing freelance work. Were you getting people coming to you saying, can you work on this project? And so you thought, I can be flexible, right? Like how did that process\r\n\r\n\r\nChris Norton (16:15.488)\r\nRight, I have got an answer to that. okay, so that, yeah, so obviously back in the day, social media was just, it was just coming out, you've got to imagine the period, I think we're talking like 2007, 2008. I started this business about 13, 14 years ago, a few years before that, I was working freelance. So I had, while I was in social media in the early days, created a blog, right, and I created a blog and it was called Dead Dinosaur.\r\n\r\n\r\na dead dinosaur because don't be a dinosaur. Otherwise your business will die without this new technology that it was just a off on a women. It used to be a, I'd write every day, like you're doing with the podcasts, regular, regular, regular. I'd write every day. actually my blog became really, really, popular. And I started to get my articles started appearing in PR week, which is the UK's magazine for the PR industry quite regularly, like weekly, which was quite a bit of a thing. Cause I was like, I better stop having quite so much opinion in case I get\r\n\r\n\r\nTold off. And a couple of times I did. Yeah, so it became like the dinosaur blog and then people started messaging me to my blog, can I have a comment for this? Or can you help me with this campaign? And it was like strategic social media campaigns. So I started helping people and I thought, hang on minute, I'm making quite a bit of money here. And then, so I turned my blog into a bit more of a website and launched my business. And slowly but surely, we transformed.\r\n\r\n\r\nNik (17:43.148)\r\nWhy did you, so why did you start doing the blog? Was it because you saw that, hey, there's an opportunity here for me to start getting business or was it just, I liked writing about this stuff and I thought it was new and I wanted to test it\r\n\r\n\r\nChris Norton (17:55.29)\r\nso my, so I started blogging because my, well, basically we saw that word of mouth marketing in America was becoming massive. So it was like people recommending P it was like TripAdvisor, the birth of TripAdvisor and all that era. word of mouth marketing was the thing that everyone was talking about. It's the, it's the, it's the old AI. It's what, this is amazing. People can actually recommend products and buy things, you know, and it's now it's, that's like the given, isn't it? Now it's like.\r\n\r\n\r\nIt's no longer people anymore. It's going to be AI that's recommending your products. And so yeah, what we did, I saw that trend breaking in America. So I thought, right, I'll start something that updates all the technology that's coming out and out comes MySpace. MySpace was actually out, but there was like something called Friends Reunited before then. Then there was the Facebook that came out. And then there was so many like FriendFeed. Oh God, there was millions. Loads of social media, loads of, there must've been 150 social media.\r\n\r\n\r\nNik (18:49.614)\r\nThere are What was the Google one?\r\n\r\n\r\nChris Norton (18:55.299)\r\nand Buzz, Google Buzz? Do remember that? Then there was Google Wave as well.\r\n\r\n\r\nNik (18:57.518)\r\nIt wasn't it. Yeah, Google Buzz and wave. But then there's one more. I want to say like spaces. No, it wasn't spaces anyways. But yes, it circle. Yes, sir.\r\n\r\n\r\nChris Norton (19:04.968)\r\nCircles, circles? Yeah, yeah, yeah. Yeah, yeah. Yeah, Google tried to take it on. One of them was quite good, actually. Google Buzz died. It was a Twitter copycat. Basically like threads, but it wasn't ready. But there was some great, great products that came out. Vine came out with micro videos, and that's now become TikTok, obviously, because it died and it came back.\r\n\r\n\r\nNik (19:24.63)\r\nI remember Vine. Yeah, now they're like, that's crazy. That part is crazy. If I was the owner of Vine, I'd be like, my gosh, I was five years too early. You know what I mean? literally, were just, their timing was off, which is nuts.\r\n\r\n\r\nChris Norton (19:35.367)\r\nYeah.\r\n\r\n\r\nChris Norton (19:39.964)\r\nAnd then they got up to more modern times. And honestly, I've seen the whole life cycle of all social, because that's right back in the day. then right up to two, three years ago, Clubhouse came out and everybody was talking about Clubhouse was going to be the new. And the reason why I'm talking about this with you is because each channel has got a role to play. If there's an audience behind it, podcasts being one of them, there's entrepreneurs listening to this. If there's a role that one of these channels can play to an audience that you're serving, then it's the right channel for\r\n\r\n\r\nbut you've got to do that channel correctly. So TikTok is all about fun. If you're a really boring accountant, you're going to have to do some fun videos about some part of your business that's going to be of interest, but that maybe that's the wrong audience. But I've seen some real quirky people doing some wacky stuff on TikTok, but maybe that's not the channel for you. Maybe it is LinkedIn. It's a bit of a more of a serious platform. So we do tons of LinkedIn training for\r\n\r\n\r\nbig corporates or small businesses that have got like teams and they all want to make their staff into like influencers in their own right. So like you with your podcast, maybe you've got 10 people underneath you. We train all 10 of them how to make the most of their own personal brand and how to spread out reputation. So those 10 people for that company suddenly become 10 different mini brands, like micro brands.\r\n\r\n\r\nNik (21:01.048)\r\nSo Chris, you're fascinating. I love talking to you because you are one of the few, like not one of the few people, but few people have actually spanned the time when they remember dial -up, If you, anybody who grew up in that era and hears that sound, they know what that is. And you know, and now you're dealing with AI, but if you're busy, you are Yoda.\r\n\r\n\r\nChris Norton (21:16.956)\r\nYeah, I do remember dial -up.\r\n\r\n\r\nChris Norton (21:22.394)\r\nYeah.\r\n\r\n\r\nChris Norton (21:28.21)\r\nI'm like Yoda. Yeah. Old and decrepit. Anyway, I won't do an impression, so carry on. You've done it. There you go.\r\n\r\n\r\nNik (21:30.876)\r\nYeah.\r\n\r\n\r\nThat is three times a day. You must tweet. I did it. had somebody had to do it. Chris, I stepped into the breach and took it on. How do you manage all of that? And especially as a business owner, like let's talk to a business owner who's not in the PR space. You're looking, there's threads and there's tick tock and there's YouTube and there's not just YouTube, but there's YouTube shorts and there's Instagram. And how do you know?\r\n\r\n\r\nwhat the best channel is for you and how do you go about optimizing?\r\n\r\n\r\nChris Norton (22:06.844)\r\nOkay, so what I say to small businesses is the same as what I say to big businesses. If we're doing like a training session or a strategy for a client, we'll say like, why are you on this channel? And they'll go like, well, our industry is very competitive and our competitors are all, they're all, I'm going, no, no, no, no, no, no, no, you're not listening to me. Why are you on this channel? And they go, I don't know. And I go, yeah, okay, ditch that, ditch\r\n\r\n\r\nWhy are you on this? Okay, that's because these people read that. So I'll give you, instance, why is Prohibition, my agency, on Instagram? Have I ever had one customer call me and go, hi Chris, just seen your latest Instagram post, I'd love to hire your agency, they're brilliant? No, absolutely not. But have I had 25 CVs in the last year?\r\n\r\n\r\nfrom people that want to come and work for the agency because they've seen a campaign we've done locally. Yeah, loads. So different channel, different reason. LinkedIn, of people, tons of work through LinkedIn. I've seen your podcast, Chris, or I've been on your website, I've seen your blog, whatever it is, then they message you on LinkedIn. Nobody seems to email these days, do they? So LinkedIn, Twitter used to be our ex, as you guys call it now, or does anyone call it that yet?\r\n\r\n\r\nYeah, exactly. That used to be the platform for new business, but now not really. So I would say pick a channel or two, have an objective for that channel. It can be different for each one and think about the audiences. They're different audiences. They do different things. I'm doing it currently with my podcast now where I've got to think that the podcast videos that we do are different to a social media video.\r\n\r\n\r\non that channel. The social media video that you put out about your episode will be the story in entirety, rather than just a clip that you might put out on, I don't know, on YouTube, for instance, like a little short. It actually needs to be the full story of what happened to Chris when he got the job\r\n\r\n\r\nNik (24:11.116)\r\nMm\r\n\r\n\r\nNik (24:19.288)\r\nSo the thing I love you're hitting on is something I talk about a lot is everything starts with why, like what's your motivation? And then from why you can craft a plan. I think you're hitting on the head. If you're a business, you need to be thinking about, okay, what's my brand? What am I trying to attract? And then what are the channels of distribution for that? You talked about you're on Instagram, not because you're trying to get customers, but because you get a lot of people who apply.\r\n\r\n\r\nfor your company. And that's a very, your strategy on Instagram is probably different than your strategy on LinkedIn. And it's a thoughtful approach to it. I have an example. I started a year ago today, actually, it's my one year anniversary of trying to grow on Twitter. And thank you so much. Thank you. I appreciate it. been a, it's been a hard year. But I love joking around and making jokes. And so around Christmas, I put out this tweet that said,\r\n\r\n\r\nChris Norton (24:49.074)\r\nYeah.\r\n\r\n\r\nChris Norton (25:03.794)\r\nHappy birthday.\r\n\r\n\r\nNik (25:18.35)\r\nThis year I gave my wife a $50 ,000 bonus and she could spend it on whatever she wanted. And I told her I wouldn't check her bank account this month. And it was like tongue in cheek. These guys who are bragging about how much money they have and how they let their wives do things. And I started getting followers from it. People were like, oh, this is amazing. Wow, you're such, this is really cool. And I had to think like, okay, I know I like to make those jokes, but that's not the type of audience that I want to attract.\r\n\r\n\r\nBut, but you know, sometimes we just don't even do the thought exercise of, what am I putting out there and what types of people am I trying to attract? Is\r\n\r\n\r\nChris Norton (25:56.618)\r\nAnd also you're trying to attract the same... If everyone copies everybody, you're not going to get anything, are you? You've got to have an opinion, you've got to be interested. What you know is very different to what somebody... Your opinion... You're completely an individual. Whoever's listening to this now, wherever you're sat driving, whatever you're doing, you are a brilliant, clever person with expertise in your own right. You have a completely different view on the world. To\r\n\r\n\r\nNik (26:04.45)\r\nBye.\r\n\r\n\r\nChris Norton (26:24.562)\r\nto Nick, to whoever it is. Do you see what I mean? So why do we have to all be homogenous and do the same things on those social media channels? That said, don't get yourself cancelled. I do work in reputation. So just be careful, kids.\r\n\r\n\r\nNik (26:39.214)\r\nWell, and it's what a boring life, man. I would hate that. I would be trapped every single day trying to fit. Well, did I say that the right way or I don't want people to know my actual opinion on certain things. Now, again, if if your opinion is that women should be, I don't know, handmaidens, then yeah, you probably shouldn't spout that stuff off on on social media. But everybody has a point of view. As long as you're a reasonable, thoughtful person and you can articulate a point of view that somebody else can at least understand. I think it's good to voice kind of where you stand.\r\n\r\n\r\nMan, have some rapid fire questions for you. Are you ready? What do you love about this business?\r\n\r\n\r\nChris Norton (27:10.354)\r\nI mean, okay, yeah, go for it, go for it. Yeah, yeah,\r\n\r\n\r\nChris Norton (27:17.896)\r\nWhat do love about it? I love the people, the creativity, the highs and the lows. I mean, it's an absolute bloody roller coaster managing an agency. One day is just like the best day ever. The next day can be an absolute car crash of painful. But it gives me so much energy. The creative people that I work with and a lot of clients as well, even though, know, it can be difficult sometimes, but creative clients that allow you to do what you want to do.\r\n\r\n\r\nAnd you come up with an idea and you see an idea from like a discussion to appearing on TV or in a shopping center or like a, or whether it's an art gallery or something like that, it's actually, that is, that's amazing. And when you do something that actually has a behavior change, we've done a, did something for cancer research, Yorkshire cancer research. We've done campaigns for that. That has actually changed and saved lives. That sort of stuff is so much better than just selling widgets.\r\n\r\n\r\nWell, you know, for a company, we do that as well, but actually when you make a like actual change on someone's behavior and do something that's quite worthy is just brilliant.\r\n\r\n\r\nNik (28:26.734)\r\nTell me about that marketing campaign.\r\n\r\n\r\nChris Norton (28:28.958)\r\nOh my God, there's a picture outside in my corridor actually. did a campaign that it was for the Yorkshire Cancer Research, which is the biggest, as I said earlier, Yorkshire is the biggest region of the UK. And we had to do a campaign to celebrate the fact that they saved 25 ,000 lives in Yorkshire every year. And that's down to this research that they'd done. So what we did was we had\r\n\r\n\r\nNik (28:42.562)\r\nYeah.\r\n\r\n\r\nChris Norton (28:57.016)\r\na Yorkshire artist at a and we got her to come down to a key Yorkshire stately home think Downton Abbey beautiful place massive and she we had a build a art installation and it was something to do I can't remember the why we why we used Wellington boots but it was something to do with well well it's Wellington boots with the symbol of it and she had hundreds of them and each one symbolized a thousand people that had been saved and it was\r\n\r\n\r\nNik (29:25.756)\r\nmy\r\n\r\n\r\nChris Norton (29:26.474)\r\nstunning art installation that got on all the TV and local newspapers. And it was just, and it was because of the research they'd done and it raised awareness of certain types of cancer and how to treat them. And yeah, it's actually saving lives and telling people, and it created people to talk about something, which is what PR is. It's to get people talking about you, your campaign, to stop talking about Donald or Joe, you know what mean?\r\n\r\n\r\nNik (29:53.998)\r\nChris, that is so freaking cool. Now when you go to dinner parties, they're like, well, what do you do? I save lives. you're a doctor? No.\r\n\r\n\r\nChris Norton (30:02.682)\r\nI don't say... No. I wouldn't say I've saved lives, but yeah, I know what mean.\r\n\r\n\r\nNik (30:09.038)\r\nNo, no, no, but I think that is a very rewarding campaign.\r\n\r\n\r\nChris Norton (30:16.23)\r\nYeah, think anybody that works in that sort of medical area and areas, there's some brilliant PRs out there doing some great work, know, raising awareness of key things that do save lives. The medical side of things in the UK is very different to the US. The way that we're not allowed to do anything in the UK around medicines and pharmaceuticals, it's all got to be back. Can you? Okay, I was gonna say.\r\n\r\n\r\nNik (30:38.027)\r\nAnd we can do whatever we want. it's, I'm just kidding.\r\n\r\n\r\nChris Norton (30:44.806)\r\nA friend of mine lived in Hollywood and he moved to Hollywood for a couple of years. He was telling me it was just very, very different. Like there was adverts on TV in America all for health products. We don't really get that in the UK. It's very unusual.\r\n\r\n\r\nNik (30:56.506)\r\nyeah, the pharmaceutical industry in particular is as a massive industry, but I think I think the thing that I love about that example that you gave was sometimes marketing is just thought of as, you're going to go out and shake hands and kiss babies or yeah, you're you're a part of the team that just kind of raises awareness. But without distribution and without marketing, people don't hear your message. And yes, it can apply to businesses,\r\n\r\n\r\nbut it can apply to nonprofits, can apply to good causes, it can apply to when you have a pandemic or you can apply to cancer. The ability to tell a story in a compelling way is a superpower. And if you don't have that, especially in today's world, you're at a severe disadvantage. Whether it's marketing, whether you want to call it PR, whatever it is, that is a skill.\r\n\r\n\r\nChris Norton (31:45.938)\r\nYeah, and a bad story can ruin a business overnight. So many of them, there's so many businesses that have been ruined by one bad story, and it's just not been handled well. You think of product recalls, you can probably think of quite a few where people have said something and it just gets them canceled, gets their business canceled, and bang, the business is gone.\r\n\r\n\r\nNik (32:06.602)\r\nMm -hmm. Just gone. All right. Well, that was supposed to be a rapid fire question. Jeez Louise. that was a great answer. What do you hate about this business?\r\n\r\n\r\nChris Norton (32:15.518)\r\nSorry.\r\n\r\n\r\nChris Norton (32:19.154)\r\nWhat do I hate about it? hate it in business in general. I hate the fact that people pay can pay late. I think people should pay on time. I can't, I pay all our customers, all our suppliers on time. hate late payment. Like if you, if you want a good relationship with your suppliers and you with your customers pay, pay your suppliers on time. I think that's one of the things that and that's in business as a whole, whatever sector you're in, pay the people on time. It's annoying.\r\n\r\n\r\nNik (32:45.39)\r\nand\r\n\r\n\r\nChris Norton (32:46.674)\r\nDon't treat supplies like second citizens. Otherwise they'll start treating you like it. Treat people with respect and you'll get it back. That's what I found anyway.\r\n\r\n\r\nNik (32:56.118)\r\nLove that answer. I find that most humans are creatures of jealousy and not saying you don't like your business, but as you sit here, what are some other businesses that you're most jealous of right\r\n\r\n\r\nChris Norton (33:11.654)\r\nWow. Jealous of? Who am I jealous of? Crikey.\r\n\r\n\r\nNik (33:15.874)\r\nI'll give you an example. Here, I'll help you. Here's my example. I'm jealous of commercial real estate because I'm like, all they do is they buy a building, they sign a triple net lease, their tenant takes care of everything, and then they just collect a payment every single month. They don't have to do anything.\r\n\r\n\r\nChris Norton (33:29.942)\r\nWe've actually got a couple of clients that do that and they've got 95 % let at any time. So we're like, why are we doing PR and marketing for you? You're already let. But it's for the brand. It's to raise awareness of the brand with investors and it means that they're doing excellent work. Who am I jealous of? You're sort of talking about industries there. I think I am jealous of, god, blimey.\r\n\r\n\r\nNik (33:45.208)\r\nSure. Sure.\r\n\r\n\r\nChris Norton (33:57.33)\r\nThat's one of the hardest questions. I don't think I really am. I'm jealous of anybody that doesn't have to worry about new business. You always have to worry, where's your next client coming from? I keeping the hopper full with our marketing? I don't want to do the cobbler's shoes. So I'm jealous of brilliant marketing businesses that have got amazingly dynamic CEOs, because these guys are stuck with\r\n\r\n\r\nNik (34:11.502)\r\nSo for.\r\n\r\n\r\nChris Norton (34:26.438)\r\nHahaha!\r\n\r\n\r\nNik (34:31.118)\r\nGood one. Many people say SaaS businesses, right? Because you've got recurring revenue in there and that might fall into that category. That's amazing.\r\n\r\n\r\nChris Norton (34:40.018)\r\nBut all SaaS businesses tend to copy each other though, don't they? All the pricing pages look the same. And you still don't, they're all about the features and not the benefits. I always tend to think, and all they ever want to do is get a demo. Book a demo, book a demo. so, but yeah, I suppose they've got loads of money and it's reciprocal, which is good. That's very good point, where you can sell stuff and you keep getting paid overnight. That's a good example, Nick.\r\n\r\n\r\nNik (34:56.012)\r\nYeah, that's stressful as well.\r\n\r\n\r\nNik (35:07.662)\r\nYeah, because you've got to maybe you have a client who has a retainer. Maybe you have some monthly stuff, but for the most part, you got to keep chasing. You're always on the treadmill. That's why I like that's why I like the commercial real estate. You sign somebody for 10 years and you just like set it and forget\r\n\r\n\r\nChris Norton (35:20.774)\r\nYeah, but Nick, really, you and I would be bored shitless if we actually had that. You'd be great for the first three months and then you'd be like, is this it? Nothing's happening.\r\n\r\n\r\nNik (35:23.758)\r\nThat's\r\n\r\n\r\nNik (35:29.482)\r\nSee, intellectually, I know that, but it's just hard for me to apply that. But I agree with you. All right, second to last question. If you have two hours in your day and you don't have any work responsibilities, you don't have any family responsibilities, what are you obsessed with right now? What are you spending your mental time\r\n\r\n\r\nChris Norton (35:35.154)\r\nYeah.\r\n\r\n\r\nChris Norton (35:50.45)\r\nand I didn't have any work and no children.\r\n\r\n\r\nNik (35:52.534)\r\nNow, you don't have to do anything with work, right? Like, I'll leave it\r\n\r\n\r\nChris Norton (35:57.192)\r\nOkay. Okay, yeah, well, because of the way that I got into social media and I'm into innovation and tech, that's what I'm into. I'm obsessed with, I am actually obsessed with AI. So I know people are talking about it and there's all these bloody cobblers, not cobblers shoes, snake oils salesmen chasing us, selling AI is gonna be the game changer. Well, so what I, I've rolled out a whole AI program at work. So we've had an AI workshop day.\r\n\r\n\r\nWe've got the paid platforms. We're rolling them out in the teams. We've had a workshop where we identify what processes we need to automate. I'm trying to infiltrate AI and everything that we do now because we're a people business. And if we can automate that, that's going to save me and the business a lot of time, money, and effort. And quite frankly, not everybody's still talking about it, but they're just dabbling with it. But actually, I'm doing it because I love that sort of thing. I actually love\r\n\r\n\r\nNik (36:51.01)\r\nYeah.\r\n\r\n\r\nChris Norton (36:56.252)\r\nI was playing around with it on Saturday at home, setting up my own custom GPTs to do things for my podcast. That's the sort of geek I am. And that doesn't feel like work. That's just because I'm into it. I started out in PR and tech. That was my first job because I love technology. That's why I got into social because I love technology. That's why I had a blog because that's why I've got a podcast. I love technology. But I also hate technology in some respects because I think there's good sides and bad sides. I see the bad side of social media as well.\r\n\r\n\r\nNik (37:08.034)\r\nMm -hmm.\r\n\r\n\r\nChris Norton (37:26.019)\r\nhow it's gone,\r\n\r\n\r\nNik (37:27.586)\r\nYeah, one of my favorite favorite phrases is the downside of the upside. that, you know, technology has its downsides, right? But I mean, there are more upsides than downsides, but there's definitely things that unfortunately we have to deal with as negative side effects.\r\n\r\n\r\nChris Norton (37:42.92)\r\nPeople just aren't bored anymore, that's one of the downsides.\r\n\r\n\r\nNik (37:46.208)\r\ngosh, I could do a whole podcast on\r\n\r\n\r\nChris Norton (37:48.04)\r\nWhen was the last time anyone was bored? If they're bored, they just look at their phone.\r\n\r\n\r\nNik (37:54.126)\r\nYeah, the last time anyone was bored was when their phone didn't work.\r\n\r\n\r\nChris Norton (37:58.162)\r\nYeah, and actually being bored is part of your own creative brain's process to work. You need to be bored because then your ideas pop up. That's when your best ideas, that's why when you're in the shower, you go, you have an idea. You're like, because you're not obsessed with all your other things. You're just neutral.\r\n\r\n\r\nNik (38:15.372)\r\nI had a friend of mine, he's a COO of this publicly traded company, very successful. I love this guy, but his phone is always just, bing, bing, bing, always. It doesn't matter when we're hanging out, just always. And he's like, telling me the story. He's like, you know, the other day I had this thought in the shower. And he explains it to me and it was like this really good idea. And he's like, cause that's the only time that I don't have access to my phone.\r\n\r\n\r\nChris Norton (38:24.552)\r\nYeah, it's nightmare.\r\n\r\n\r\nNik (38:43.682)\r\nAnd I just thought that would be miserable to just constantly always be the slave to your phone and not have time to actually sit and think about things.\r\n\r\n\r\nChris Norton (38:52.986)\r\nAnd that's the issue. We've all got to learn to just be and not be entertained. But it's difficult because if you just get into that, like you said, if you're on the treadmill.\r\n\r\n\r\nNik (38:59.788)\r\nYeah, very.\r\n\r\n\r\nNik (39:06.19)\r\nIt's a tough one. All right, last question for you. What advice would you give yourself? I usually say 10 years ago, but I've started changing it to before you got into entrepreneurship.\r\n\r\n\r\nChris Norton (39:21.31)\r\nRight, well when I started out the business, I had maybe one, two, three, four, five in the first year and then 10 in the second. And I was trying to be everyone's friend because I'm quite laid back. And I'm not in it. I was never in it to make loads of money. To be honest with you, in public relations, we do over 2 .5 mil, but profit wise, probably 400k, something like that. The business is doing well, but you're never in it to be\r\n\r\n\r\nNik (39:49.196)\r\nYeah.\r\n\r\n\r\nChris Norton (39:50.146)\r\nI'm not going to be Donald Trump. I'm not going to be a billionaire. But I do think when I started out in this business, I was trying to be friends with everyone, create this cool, fun family environment. And as you get bigger, you just can't do that. And I think it's just to be a boss and to be, I would say, don't be as worried about being everyone's best mate and concentrate more on being fair, good and, you\r\n\r\n\r\nbecause yeah, I was just trying to be everyone's friend and create this and it worked for years and years and years but when you've got 30 people like now it's it's just you can't be\r\n\r\n\r\nNik (40:25.582)\r\nYou started out being, you started out being Michael Scott on The Office.\r\n\r\n\r\nChris Norton (40:29.694)\r\nYeah, yeah,\r\n\r\n\r\nNik (40:33.012)\r\nAnd yeah, I totally sympathize with that. Chris, this has been an awesome conversation. Where can people find\r\n\r\n\r\nChris Norton (40:43.182)\r\nGreat question. Well, you could there's two places you can find me can find me on LinkedIn look up for Chris Norton on LinkedIn Or you can find my podcast which is embracing marketing mistakes, which is all about marketing mistakes obviously And it's just basically people telling us where they fucked up in life and it is quite funny because I just thought it was a hilarious concept because most people want to big themselves up and tell you how great they\r\n\r\n\r\nbut ask them to tell when they've the biggest mistake. And actually it's a cathartic experience. and, but it's very entertaining as well. yeah, embracing marketing mistakes .com UK. You can find, you can subscribe and listen, or you can find us on YouTube as well. We're there as\r\n\r\n\r\nNik (41:21.942)\r\nAwesome, well, I'll make sure to put links in the show notes for this, but you have a great day, my friend. Appreciate you coming\r\n\r\n\r\nChris Norton (41:25.448)\r\nCool. Thanks, Nick. I appreciate it. Thanks for inviting me on. See\r\n\r\n\r\nNik (41:29.112)\r\nsee it.",
  "metadata": {
    "duration": "",
    "date": "2024-08-21",
    "platform_source": "Google Drive"
  }
}