{
  "episode_number": "59",
  "episode_title": "Meme King: How To Make $44k/Month On Social Media with Charlie Light",
  "guest_name": "Charlie Light",
  "business_name": "",
  "transcript": "﻿Nik (00:01)\r\nCharlie Light, I am so stoked to have you on economics. Welcome, my friend.\r\n\r\n\r\nCharlie (00:06)\r\nYeah, thanks for having me, Nick. Excited.\r\n\r\n\r\nNik (00:07)\r\nLet's just let's just jump into it for those who don't know you tell me really quickly. What's your background and how do you make\r\n\r\n\r\nCharlie (00:16)\r\nYeah, well, my claim to fame is starting the John W. Rich parody account back in April of 2020 when I was bored, had absolutely nothing to do because of the COVID lockdowns that was before I had kids, before I really had any real responsibility. I had, luckily at that time I had 10 or 12 spare hours a day to screw around on Twitter and build up a parody account to do.\r\n\r\n\r\nNik (00:42)\r\nSpare hours\r\n\r\n\r\nCharlie (00:46)\r\nBut I mean, yeah, think back during COVID, like, well, I guess you had kids at the time, so you might, you probably weren't just sitting around wondering what to do, but I kind of was, because nothing was open.\r\n\r\n\r\nNik (00:55)\r\nI mean, was, yeah, there was still a lot of sitting around. mean, yeah, we had to go like walk outside and get out and about, but you know, babysitter Netflix was actively used. Babysitter Disney Plus was also actively used. Yeah, we use those things a lot. How did you come up with that account? It was John C. Rich, right?\r\n\r\n\r\nCharlie (01:18)\r\nJohn W. Rich.\r\n\r\n\r\nNik (01:19)\r\nOkay, John W. Rich, why the W?\r\n\r\n\r\nCharlie (01:23)\r\nI have no idea. I I just thought of that and thought it sounded good. I mean, I feel like the W makes it sound kind of regal and sophisticated. Yeah, so no real reason. I guess then the joke became that the W stands for wealthy, but it's not like I even thought of that at the time I named the account.\r\n\r\n\r\nNik (01:30)\r\nIt does.\r\n\r\n\r\nWhy'd you make the account? Like, what spurred that?\r\n\r\n\r\nCharlie (01:46)\r\nSo I had been in the, or I had followed a lot of the parody accounts in the couple of years before that. So I feel like I already had a lot of ideas that I could tweet. I just thought it would be for fun really, because I already enjoyed reading a lot of the older parody accounts that had been around forever. So I just thought, you know, I'll try my hand at it. I didn't really think it would turn into an actual business. And it was three or four months before I really even attempted to turn it into a business.\r\n\r\n\r\nNik (02:15)\r\nThree or four months?\r\n\r\n\r\nCharlie (02:19)\r\nWell, I mean, that's when I started trying to turn it into a business. No, would say it kind\r\n\r\n\r\nNik (02:19)\r\nThat's it.\r\n\r\n\r\nThat seems so quick to me\r\n\r\n\r\nCharlie (02:28)\r\nYeah, no it is. Yeah, because I think I got within a month, I got to 5 ,000 followers or so. And then I think within three months, it was like at 25 ,000. And then that's when I was like, okay, how can I make some money? Tried a few experiments, made a few bucks here and there. And it was about nine months later that I really started making some actual money.\r\n\r\n\r\nNik (02:50)\r\nWhat was the vein of the parody? what, who was John W. Rich and what was his schtick?\r\n\r\n\r\nCharlie (02:57)\r\nYeah, the whole idea was kind of this older executive who failed his way to the top. So I think one joke I played on a lot is that he basically had one real success at the beginning of his career. And like in business or tech, can kind of, if you have one big win, you can almost use that for the rest of your career and say, Oh, you know, I was early investor in whatever early investor in AOL 35 years ago, and I'm still raising money for\r\n\r\n\r\nyou know, newest venture or my newest VC fund. Yeah, that was kind of the whole joke is that the kind of clueless executive who still makes way more than everyone else around him just because he has this status.\r\n\r\n\r\nNik (03:41)\r\nWas he one of the first parody accounts in business, Twitter or SMB Twitter? It wasn't even SMB, he was massive.\r\n\r\n\r\nCharlie (03:47)\r\nYeah, that actually, right, like the S &P stuff didn't even, I don't know if people even called it that back then. Yeah, I would say the first, so there's definitely some stock market related ones. So like liquidity was around before that and there was a couple other accounts. Like if people remember the Senator Eloise Williams, that was probably the first one that was of the same category that John Rich was.\r\n\r\n\r\nYeah, there really wasn't a lot of them. I actually think most of the ones we know today were created later in 2020 or in 2021 around the GameStop AMC stuff. It's kind of when most of these accounts were created. So yeah, not really like, and I don't even remember, I guess people called it SMB Twitter, but a lot of the biggest players we know of today hadn't even really started posting at that time. So yeah, it was kind of a whole different.\r\n\r\n\r\nI guess Ramp Capital was the one who's always been around as like the finance, because he had been doing it for five or six years, even before I started mine. But yeah, that was kind of the 2020 was kind of a new age for the Twitter business accounts because a bunch of really now well -known ones popped up around then.\r\n\r\n\r\nNik (05:02)\r\nWhat?\r\n\r\n\r\nWhat were you doing at the time? Like, obviously it was COVID, but were you working?\r\n\r\n\r\nCharlie (05:11)\r\nYeah, and I was actually working from home. So I worked for a private equity fund. It's just like an analyst and it was okay. I liked it. So I kind of had that to fall back on as I experimented with the parody account. And so yeah, before that I did accounting and finance in school and just worked, you know, a couple of random corporate or startup jobs.\r\n\r\n\r\nBut yeah, in 2020 I had my full -time job, but I had so much free time. I was kind of able to treat this like a full -time job until 2021 when I really made it my full -time business.\r\n\r\n\r\nNik (05:51)\r\nAll right, so you have an accounting background. You're working at a private equity fund. Do know who Clint Murphy\r\n\r\n\r\nCharlie (05:59)\r\nYeah, yeah,\r\n\r\n\r\nNik (06:01)\r\nHe's a CPA, CFO type and because he writes really good copy as well. But at like at what point did you realize, okay, yeah, I'm good at the financial stuff, but I also write really\r\n\r\n\r\nCharlie (06:15)\r\nYeah, actually. way before that, uh, in college, there was this app called Yik Yak. I don't know if you've heard of it, but yeah. So that became extremely popular when I was, I think a sophomore in college. like 2014 or so. And I, you know, I'd go on Yik Yak with my friends and it was all anonymous, but it was all like, I mean, for people who don't know it's like Twitter, but within a certain location. there's a university of whatever.\r\n\r\n\r\nNik (06:20)\r\nYeah.\r\n\r\n\r\nCharlie (06:44)\r\nYik Yak and anyone within 10 miles can post, but it's totally anonymous. You don't even have a username. You know, you don't know who wrote the post. But when I started posting on there, like I would get of the top 10 posts, I'd have like three or four of them at any given time. And so my friends would start joking that they'd read the posts on there and say, oh, is this one yours? Is this one yours? And like, you know, a lot of them.\r\n\r\n\r\nNik (07:08)\r\nguess it was anonymous,\r\n\r\n\r\nCharlie (07:11)\r\nRight. So yeah, you had no idea. So there was really no value to being a top poster on there other than, my friends knew, but no one else could even know that it was this certain username. But I think, yes. So I did that. It had no real economic value or any value whatsoever. And then I think it got shut down shortly after. But I kind of kept that in the back of my mind. Like, okay, I was good at writing this short form jokes. And I guess I just stored that in my brain for the next six years until I actually.\r\n\r\n\r\nNik (07:22)\r\nSo\r\n\r\n\r\nCharlie (07:41)\r\nhad the opportunity to put that to use.\r\n\r\n\r\nNik (07:43)\r\nDude, that's pretty funny. were like the guy in the meme with the solo cup in the corner who was like, they don't know I'm a big deal on Yik Yak.\r\n\r\n\r\nCharlie (07:51)\r\nYeah, right, exactly. And I think, yeah, so I really wish at the time you could at least have some marker to say, you know, these are my posts, but yeah, pretty much.\r\n\r\n\r\nNik (08:05)\r\nWhat was the post or what was the series of post or the day on the John W. Rich account that took it from a hobby to, maybe this could be a business.\r\n\r\n\r\nCharlie (08:20)\r\nYeah, so I think it's probably the day would have been, okay, at first that there seemed like all these big milestones that like huge accounts or famous people would interact with my tweets. So like the first time I think like Jim Cramer replied to something or, you know, someone fairly famous either followed or interacted, I'd be like, wow, this is, you know, the big break. I come to realize it doesn't really matter. It's more.\r\n\r\n\r\nNik (08:32)\r\nYeah, yeah,\r\n\r\n\r\nI did\r\n\r\n\r\nCharlie (08:49)\r\nIf that person follows you and engages in you routinely, then yeah, maybe it'll lead to something later. But no, the real actual break was in the fall of 2020. This guy named Matt, runs, he founded The Hard Times, the parody news site for, I think it's like around punk and music. But yeah, so, you know, that's a pretty good following. But he was starting.\r\n\r\n\r\nNik (09:13)\r\nokay.\r\n\r\n\r\nCharlie (09:19)\r\nsister site called Hard Money, so parody finance. So he had reached out and said, you know, we have investors for this. You'd be great at writing headlines. So that was the call that I was like, okay, that this is probably the model is to write content for other people. Cause I had tried making money for the John Rich account previously. So, but it was really hard to make money directly from\r\n\r\n\r\nNik (09:42)\r\nYeah, how would you have made money from the John Rich account?\r\n\r\n\r\nCharlie (09:45)\r\nYeah, so the two ideas were like merch and basically selling advertising slots on the account. you know, neither of really make money, even if you have a lot of followers, because so like at the time, what's that?\r\n\r\n\r\nNik (09:55)\r\nThat's that's funny. No, no, no, no, I'll add after you're\r\n\r\n\r\nCharlie (10:02)\r\nOkay. Um, so like at the time I started selling merch, this company call or that company, uh, Nicola, the, you know, electric vehicle company that everyone, not everyone, but a lot of people on my side of Twitter thought was fraudulent. Um, so I guess this is late 2020 or I don't know, but I started selling some merch that was just like short NKLA and like just their ticker symbol. And I think I made like 50 bucks doing that. And then I got, you know,\r\n\r\n\r\nthen Nikola Corporation had the stuff taken down from where I hosted it, it infringed on their copyright. Yeah, so that made a few bucks. Like 10 people ordered it, and you have 10 % margins on that stuff, because it's drop shipped.\r\n\r\n\r\nNik (10:48)\r\nIt's funny. It's funny. So Chris Kerner, my business partner, he always says, anytime I see an influencer or anybody like on social media who's selling merch, all I know is that they have no idea how to how to monetize. Like, because that's like the lowest hanging fruit is like, well, OK, well, maybe I'll just sell some merch because I don't I don't really know what else to do with this account. But the John W. Rich account would have been difficult at that time because how else how were you supposed to monetize? Maybe you sell ad slots,\r\n\r\n\r\nWho are you selling ad slop to? Right. Because people are coming to you for parody.\r\n\r\n\r\nCharlie (11:21)\r\nRight, so like there were a few companies, so I think Polymarket would have been one that was very, like they were a potential great advertiser because they liked my stuff and they were more informal.\r\n\r\n\r\nNik (11:32)\r\nIs that the crypto betting market?\r\n\r\n\r\nCharlie (11:35)\r\nYeah, I don't even know if it's crypto, but yeah, like the betting market. Yeah, exactly. So yeah, they like, you know, they like to put out outlandish questions. So it's kind of perfect. So like that was a better moneymaker, but it still wasn't great because, you know, maybe once a week I could do that and charge them like 200 bucks. And the audience usually didn't like it. And\r\n\r\n\r\nNik (11:38)\r\nIt's a betting market. Yeah, okay. Yeah, yeah,\r\n\r\n\r\nI'm gonna\r\n\r\n\r\nCharlie (12:01)\r\nYeah, it just like degraded the quality of the content if I was promoting anything. so it wasn't a great moneymaker. so then when I got on this call with Matt, that's when I realized, okay, the real money is in connecting with these people who want help with their own brands writing. And, you know, they would hire me to do it because yeah. So, and that was by far and away the most lucrative part of this whole parody account ecosystem that I found.\r\n\r\n\r\nNik (12:28)\r\nI get ghostwriting because you're just essentially writing for somebody else's account. But when these people were contacting you, they asking you to ghostwrite parody or humor? Or were they like, no, we want you to just ghostwrite regular stuff? Because I'm just saying, this is my own bias. I would have been like, no, that guy writes humor. That guy writes parody. Why would he write for my account?\r\n\r\n\r\nHow did those first conversations work out?\r\n\r\n\r\nCharlie (12:59)\r\nRight. Yeah, that's a good point. Cause the first few clients, so almost every client I've ever had wanted to write serious content. hard money is a kind of an exception because they were starting a parody website, but you're right. The vast majority of people are not willing to pay for someone to write satire. Cause there's just not much money in it. Even if you build up a massive audience and satire advertisers don't want to work with you. Your audience assumes everything is a joke. So they don't want to, you\r\n\r\n\r\nNik (13:27)\r\nTrue.\r\n\r\n\r\nCharlie (13:28)\r\nThey don't think you're serious when you actually offer something that they have to spend money on. So yeah, the vast majority of my clients were serious people looking to publish serious content or maybe a little bit humorous. Like, with your content, you have some jokes on there. It's not the most extreme serious content all the time. So that was more my, that was the paying clients that I ended up having were people who actually wanted to promote their service or their company or something that made them money.\r\n\r\n\r\nAnd maybe they wanted to have some fun. So they knew I could incorporate the humor, but yeah, it actually, was a little difficult at first because it's not like I was getting tons of clients just from the John Rich account. It was actually just by accident. Like someone might reach out and say, Hey, do you help with content? And then maybe I'd get the next client as a referral, but I didn't have droves of people reaching out to the parody account because they didn't know who I actually was. So yeah, that didn't.\r\n\r\n\r\nNik (14:25)\r\nWhat did you find was the transferable skill of writing parody, comedy, to copywriting or being a ghostwriter for serious accounts? Because on its face, those two don't necessarily seem like they mesh.\r\n\r\n\r\nCharlie (14:44)\r\nYeah, that's true. Yeah, I would say probably the simplicity of the message you're writing. So like when writing parody, knew that you had to, at least on Twitter, you have to make the joke immediate. Like if it's a little bit confusing, the tweet will not do well because, you know, people are going to spend about two seconds figuring out what you're saying before they move on. So with copywriting, I think a lot of people have good ideas or have a lot\r\n\r\n\r\nmeaningful things to say, but they don't know how to simplify it down for a Twitter audience. That's not going to dive into complexities. unless they know who you are. So I feel like that was the biggest thing I could help clients with is they had a thousand really detailed thoughts, but they didn't necessarily know how to share it in a way that would actually lead to audience growth because no one wants, no one wants to read something that is dense on Twitter. see that's, that's probably.\r\n\r\n\r\nNik (15:19)\r\nI can see\r\n\r\n\r\nCharlie (15:41)\r\nAnd I guess to put it a different way, the transformable scale is probably grabbing someone's attention. Because that's what you're trying to do on Twitter, grabbing them with the first line basically.\r\n\r\n\r\nNik (15:50)\r\nYeah, I.\r\n\r\n\r\nI love comedy and there's a number of comedians who have transitioned into more serious roles. You had Al Franken who was the Senator from I think Minnesota. You have Jon Stewart who went to The Daily Show. I that was still comedy but he's also infused it with some seriousness. But I think comedy at its core is about storytelling. Like compelling storytelling and yes there's a comedic component to it where it's funny but\r\n\r\n\r\nIf you're a good comedian, you can hold someone's attention and you can get them from the beginning, the setup, the middle, and then the end, wham, you you hit them with the joke, but that's an art and a skill to be able to tell the story. I think for you in particular, like you're just very talented at seeing what is gonna capture somebody's attention. How do you then frame the story? And then at the end, you know, where do you hit them with?\r\n\r\n\r\nSometimes it's too subtle because I've seen a lot of comments to posts that you've made where people take you seriously and it's like, dude, he's trolling. Come on, guys. But to me, that's the real world -class skill, I think, that you have and a lot of comedians have.\r\n\r\n\r\nCharlie (16:57)\r\nRight.\r\n\r\n\r\nYeah, no, I think that makes sense. Yeah, thank you. think it is hard for people, like I've seen that, especially with clients, it's harder for someone who's really deep into a topic to figure out how a new person can kind of quickly acclimate and come aboard, right? So like a client might not understand the one piece of info that'll get a new audience member hooked into their ecosystem.\r\n\r\n\r\nand read further. So yeah, guess, yeah, I think you're totally right.\r\n\r\n\r\nNik (17:41)\r\nWere you always like that? Were you just a funny kid? Were you a class clown or were you just kind of quiet?\r\n\r\n\r\nCharlie (17:48)\r\nNo, I mean, I was more quiet, but I do remember in fifth grade I was voted, what was it, most likely to be a comedian. So, I mean, I definitely always had that at least a little bit. Yeah, so I don't know what jokes I was telling in fifth grade to get that, but yeah.\r\n\r\n\r\nNik (17:57)\r\nThat's awesome.\r\n\r\n\r\nI got voted most likely to make you laugh my senior year. That was my superlative. I was the most likely to make it. But I mean, yeah, I really do think, especially when you're young and you see people laughing and I love making people laugh even to this day, is you just like start to get a sense of, OK, why are they laughing? What do they find funny about that? How did I get them to that place? And what I have found is like if you can lead someone down a road and then you get to the very end of the road and you switch\r\n\r\n\r\nCharlie (18:11)\r\nnice.\r\n\r\n\r\nNik (18:36)\r\ntotally different from what they were expecting. That dichotomy just makes people laugh. If it's funny, right? It makes people laugh. And like that ability to hold someone's attention and create the environment where they're fixated on what you're talking about,\r\n\r\n\r\nThat's not comedy necessarily right in that piece right here, right? It's like the beginning set up and the end when you hit him, but that middle section's got to make sure you hold their attention so that you can hit him at the end with that punch line. And for me, that's where I've gotten better at writing is like, actually, I do have this skill. I just happen to use it a lot to make people laugh because I'm like a penis. And then all of a sudden, you know, people are like, that's hilarious. But I'm massively inappropriate.\r\n\r\n\r\nCharlie (19:11)\r\nRight.\r\n\r\n\r\nYeah, no, think that's, so that's kind of the approach I took. So with the Hunter Cold Calls account, which I helped develop with Workweek and they're running it now, I, kind of the approach I would take is I'd look at those somewhat ridiculous, like sales alpha male guys, like Grant Cardone, or you know, there's a bunch of them and they're out there. So I basically just take one of their stories.\r\n\r\n\r\nuse it as my own, like reword it, and then at the very end add just a 10 times more absurd level to it. But yeah, that's basically like that always did extremely well just because you're, you know.\r\n\r\n\r\nNik (19:59)\r\nDo you have a favorite tweet or format that it was like the well you always went back to where you're like, I know this one's gonna crush if I frame it this\r\n\r\n\r\nCharlie (20:08)\r\nOkay. I have, but not, I don't think any of them have lasted the entirety of, of how long I've done this. Cause I mean, the one negative of that is if you come up with a really good format, then all the other people who ship post kind of, you know, take it. And it's the right to, know, I'm not, this isn't copyrighted stuff, but the more people who use it, kind of gets old quickly. like one of my, one of my\r\n\r\n\r\nA format in I think 2021 that I always knew would crush it for at least a few months was that joke about, what is it? Uber has no cars, Airbnb owns no hotels, and then whatever, like FTX owns no crypto or something. And I think I was the first to make that joke. It was borrowed from the writer who originally wrote that.\r\n\r\n\r\nwho wrote that. Yeah, I he didn't write it as a joke because it was a serious article. It was about, you know, Airbnb has no hotels, Uber has no cars, welcome to the new economy or whatever. So I, I was one of the first to like come up with that as a joke. And for a few months, I knew that would always crush, but now it's kind of three years later, you've heard it a million different ways. Like it can be very funny in certain situations, but it's not as good. yeah, usually the shelf life on those formats is like about six months.\r\n\r\n\r\nNik (21:06)\r\nthat thread.\r\n\r\n\r\nCharlie (21:36)\r\nbut I guess the one well I can always go back to is basically those absurd stories about, you know, just find some story somewhere that's a little silly, kind of make your own version and then just make it way more absurd at the very end. but yeah, like there's so many business gurus on, on LinkedIn and on YouTube that are great for kind of finding material. Cause I would\r\n\r\n\r\nNik (21:59)\r\nTotally.\r\n\r\n\r\nCharlie (22:00)\r\nLike, what's that guy's name? The guy who does, who's like always shirtless and does the sales seminars where he like, no, yeah, yeah, that guy. Yeah. Who like says, if you don't have a six pack, he fires you from his team or whatever. So like, you know, I just watched two of his Instagram reels and then I have a couple of good stories that I can come up with for a parody account.\r\n\r\n\r\nNik (22:07)\r\nAlex Ramosi? no, Andy\r\n\r\n\r\nIt's so good. thought when I first got on Twitter a year ago, Chris was like, dude, Nick, you should be an account that like is your guru's guru. Like you just go after the gurus. And I kind of played that vein for a minute. But ultimately, I was like, it's not like it be a fun outlet. But I'm trying to kind of build an audience and build a business around this stuff. But gosh, like the stuff they say is just so outlandish. You're like Chris Krohn. He's my favorite. Have seen Chris Krohn?\r\n\r\n\r\nCharlie (22:54)\r\nYeah, he doesn't get sick. He just chooses not to get sick. Yeah.\r\n\r\n\r\nNik (22:57)\r\nOh, no. Did you know? This is my favorite. is like 78 % of everything is psychosomatic. So when you start getting tired and you tell yourself that you're tired, you get tired. Let me ask you a question. Let me ask you a question, Charlie. What's the first thing you say when you start not feeling well? I think I'm getting sick. It's all in your mind. I think I'm getting sick. So I don't say that. I say to myself, I am well. I am healthy. Dude, like I watch these videos. I'm like, people watch this?\r\n\r\n\r\nCharlie (23:16)\r\nRight.\r\n\r\n\r\nNik (23:26)\r\nAnd people then give him money. Like, how do they watch it? They didn't give him money because they're like, you know how to invest. Good, sir. Anyways, I so I love I love the sorry I went off on a big tangent there. I love the guru accounts. How?\r\n\r\n\r\nCharlie (23:34)\r\nRight.\r\n\r\n\r\nYeah, no, I'm with you on that. I just want more note on those. I love those accounts. Like Coffeezilla, I've been a huge fan of and was like in 2021, I used to message it with him a lot, but sadly he got too famous. Cause that was back when he only had like a hundred thousand subscribers. So I could actually have a conversation with him. But you know, after he went on, I think on Joe Rogan and or no, Lex Friedman. I don't know if he was on Rogan, but yeah, he got a little too famous, but at the same time,\r\n\r\n\r\nNik (23:59)\r\nCheers.\r\n\r\n\r\nCharlie (24:11)\r\nHis stuff is awesome. I don't, he might make good money now, but I know even when he had like 500 ,000 subscribers, he wasn't breaking in the money by any means. So it's, it's a tough niche to make good money\r\n\r\n\r\nNik (24:24)\r\nNo, it is interesting because you get some guys, I won't say his name, but I talked to somebody he's got, we'll say, I want to make this as anonymous as possible. He has less than 50 ,000 followers. That's a wide enough range where you're not going to know who I'm talking about. He makes a half a million dollars a year through his Twitter account. Half a million dollars a year. And he's got really high value, really high intent followers, but.\r\n\r\n\r\nThen you've got guys who've got hundreds of thousands of followers and they don't make nearly any money, but it's all about the curated audience that you have. I'm curious, you ended up selling the John W. Rich account. What was the thought process there? Were you like, well, if they're dumb enough to...\r\n\r\n\r\nCharlie (25:09)\r\nYeah, what the?\r\n\r\n\r\nYeah, and it went along with selling my agency. And I think...\r\n\r\n\r\nI don't know, I kind of had felt like I had done everything I could with the John Rich account. I felt like, you know, I had run it for about four years, three or four years. And yeah, there wasn't a ton more to accomplish with it. think one other thing I've learned about content is that, okay, like when I was obsessed with the John Rich account, I could grow at 10 and 20 ,000 followers a month, but I had, you know, one or two clients.\r\n\r\n\r\nAnd then at a certain point, it kind of became this question of, should I take on another paying client and make good money with that client or keep doing the, the parody account? so my thought process, I cut, there was nothing really more to gain by running the John Rich account for several more years. I mean, it would be fun, but at the same time, I kind\r\n\r\n\r\nNik (26:10)\r\nWere you approached or were you thinking, were you already kind of at the end of the road and you're like, I wonder who I could sell this to? Like, how did those conversations start?\r\n\r\n\r\nCharlie (26:19)\r\nUm, yeah, I was actually, I, I'm trying to think who, so actually I sold it to an existing client. So I don't, think I initiated it because I kind of thought, okay, I've done all I can with this model. Okay. So take you back. That was like summer of 2022 when I sold it and I was doing, um, I think 44 ,000 a month was the last month where I fully owned it. Uh, but that was just me and a team of\r\n\r\n\r\nSo I just have like three part\r\n\r\n\r\nNik (26:50)\r\nusing 44 ,000 for revenue.\r\n\r\n\r\nCharlie (26:53)\r\nYeah, monthly revenue and the profit.\r\n\r\n\r\nIt was something, let's see, so I had three contractors. I don't know the exact figures, but it was something like I pay those contractors nine or $10 ,000 for that particular month. So it was a pretty, I mean, obviously very high margin business. I don't think it was sustainable though, at least the way I was doing it, because I was basically.\r\n\r\n\r\nI mean, all day, every day writing this stuff for whatever 12 different clients. Um, so it wasn't going to be sustainable in some way or another either. had to cut the margins back to not, you have 12 or 14 hours of client work a day, but yeah.\r\n\r\n\r\nNik (27:40)\r\nSo I, and I get that too. mean, you're, you're creative. So you probably wanted a new challenge. You wanted to try something else. How do you value those businesses? I know you can't tell me what you sold it for, but I get, would, I would never buy a business like that because it just seems so key man dependent. I'm like, well, why am I buying it from Charlie? Like Charlie is John W. Rich. Doesn't make any sense to me, but why would someone buy? I'm just curious. Like what, what, is the value they would see in that account?\r\n\r\n\r\nCharlie (28:07)\r\nYeah, no, you're right. So actually I did talk to several different companies, like fairly large media companies that you know of passed on it for that reason. Like, you know, it just doesn't really make sense. Like, yeah, it's a good business, but yeah, we can't really grow\r\n\r\n\r\nNik (28:24)\r\nDid they, they interested in an aqua hire? Like did they want you to stay on?\r\n\r\n\r\nCharlie (28:31)\r\nYeah, a couple of them were like that. So like morning brew, example, that's kind of, they wanted me to work there potentially not like that for me, Joe, but we had discussed it a little bit. so yeah, I think most of them either thought of, okay, this, this isn't really like as much of a scalable business. So I will say the margin or the multiple of those are pretty low. Cause you're right. Like it's totally dependent on me, at least at first. so if anyone,\r\n\r\n\r\nNik (28:36)\r\nOkay.\r\n\r\n\r\nCharlie (29:02)\r\nLike no one's really paying more than two times revenue for that, or maybe probably not even two times earnings for that type of business. because yeah, you're right. It's, it's, you high margin, but that margin could basically disappear if, know, I didn't try as hard or if I left or whatever.\r\n\r\n\r\nNik (29:21)\r\nWas Hunter Cold Calls a part of that sale?\r\n\r\n\r\nCharlie (29:25)\r\nI didn't know because I actually created it after the acquisition. So they were paying me to create another parity count for them. So, yeah.\r\n\r\n\r\nNik (29:35)\r\nOK. So Hunter Cold Calls is owned by that company, but it was created after. interesting.\r\n\r\n\r\nCharlie (29:39)\r\nYeah, exactly. Yeah, exactly. So that was part of my post -close contract for consulting and also creating another account in a different niche.\r\n\r\n\r\nNik (29:51)\r\nDid you find it easier to monetize Hunter Cold\r\n\r\n\r\nCharlie (29:57)\r\nit's so that account directly has, it wasn't monetized as far as I know. it's, it's kind of hard to say, cause it really fed into my personal account, right? So like if I shared on my personal account, here's how I made this Hunter post go viral. That was extremely valuable because then I'd get a bunch of new followers who wanted to grow their account, who saw me as some sort of expert in doing so. So it was really valuable in that sense.\r\n\r\n\r\nYeah, I think the Hunter account could be monetized probably a lot better just because it is, it has to do with a very specific high value niche,\r\n\r\n\r\nNik (30:37)\r\nFor some reason, for some reason I thought I saw, and maybe this was after you stopped writing for it, but I thought I saw a Hunter account post where he was like, and if anyone's looking for cold calling solutions, use so -and -so. I swear I saw that. Maybe I'm like totally off.\r\n\r\n\r\nCause it would seem, it would seem like that. Yeah.\r\n\r\n\r\nCharlie (30:58)\r\nYeah, I can't remember that. I mean, that would make sense. Yeah, maybe that was, I mean, that would make sense. I don't think, I can't remember that at all. So don't think I posted it at least. But\r\n\r\n\r\nNik (31:11)\r\nCause I would think with those niche parody accounts, you actually do want to market to the types of people you're making fun of because the types of people you're making fun of are the ones that are going to think it's funny. Like they're, they're in the know they, that makes that so funny because that is what happens in call center culture. Haha. You know, so of course you would want to sell to them. I mean, it made sense to me at in that\r\n\r\n\r\nCharlie (31:33)\r\nRight, I viewed it as, yeah, you probably have a lot of those people following and you also probably have, okay, so say if a lot of the content was making fun of Grant Cardone, you have an audience that doesn't necessarily like Cardone, but are probably in the market for similar products and services, but don't wanna be sold to by, you know, a totally, well, you know, whatever you call Cardone, but.\r\n\r\n\r\nNik (32:00)\r\nLove you, Paul. Yeah.\r\n\r\n\r\nCharlie (32:01)\r\nYeah, so there's probably a lot of people who, because to find it funny, they have to know who Grant Cardona is and what, you know, what he's talking about. So yeah, I think that kind of account is definitely more monetizable. At the same time, though, I just don't think it's, it still is a hard business model to make work, a parody account on its own. Because again, people don't, people assume everything you post is a joke. So when you actually try to monetize something, how are they going to view\r\n\r\n\r\nNik (32:32)\r\nAlright, humor me for these last few questions. Are you ready? What was the craziest interaction you had in any of your parody accounts?\r\n\r\n\r\nCharlie (32:35)\r\nYeah.\r\n\r\n\r\nman, there's like, like a real life interaction or what do mean? Just anything I want to take.\r\n\r\n\r\nNik (32:56)\r\nYeah, was there was there ever a time where you were maybe somebody saw you in public and they are like maybe you're out to dinner and somebody mentions John W. Rich and you're like, you know, they don't know it's you. You're like, Holy crap, I write for that account or like, you know, your wife. Here's an example. One night I'm laying in bed next to my wife. And I had done this thing called growth madness where in March, we had this bracket style competition to see who could grow their followers the most and people from Twitter joined and we it was fun. One of the people who joined\r\n\r\n\r\nwas Colin Murphy. And he, if you know who he is, a Nick Huber 2 .0 type troll. He posts stuff for engagement. And one of the posts he posted was, have you ever heard of Bottle Night? Probably not, because my wife and I invented it. You probably saw Bottle Night. You and literally 70 million impressions on Twitter.\r\n\r\n\r\nCharlie (33:42)\r\nYeah.\r\n\r\n\r\nYeah, yeah.\r\n\r\n\r\nNik (33:49)\r\nAnd then it was all over other social media accounts. So I'm laying in bed. And I just was like, hey, sweetie, you ever heard of bottle night? That was it. She's like, what are you? yeah, yeah, yeah. Is that that like idiot kid who thought he invented drinking and talking to your spouse? And like, for me, that was a crazy moment because I was like, he was in my thing. I know him. I'm not Colin Murphy. Colin Rutherford. Sorry, I screwed his name up. But yeah.\r\n\r\n\r\nCharlie (34:03)\r\nRight.\r\n\r\n\r\nOkay, yeah, yeah, yeah, yeah, okay. Got it.\r\n\r\n\r\nNik (34:18)\r\nAnyways, so like that was for me, that was kind of like just weird, cool moment, but I'm sure you've had many of those types of moments.\r\n\r\n\r\nCharlie (34:27)\r\nYeah, okay. Yeah, I've had several. So, like, for example, my brother, he was hanging out with some friends one day and, you he was a finance major in college, so he's hanging out with other kids in his finance class. And one of them pulls up his phone and says, man, have you seen this account? You'd probably love it. And shows him like the John W. Rich account. And my brother's like, wait, do you know my brother runs that? And yeah, it's funny too, cause like when I would...\r\n\r\n\r\nI never really had anyone, well, I guess one person recognized me in public once. but besides that, when, like, when I go to conferences, it's really funny because like, if I go to a conference, has to do with content. I'll introduce who I am. And it's so hit or miss. Like if someone, you know, I'll explain, I started the John W. Rich account and half the time people will be like, no way. And like, have a ton of questions. But if they've never heard of the account, it's so awkward to explain what it is.\r\n\r\n\r\nor, yeah, actually, I'll leave you with one story about, so I went to a wedding last fall in Italy. And so it's my good friend growing up and his aunt happens to be the CEO of UPS. And I was just hesitant if I should mention it, but whatever. So I decided, you I'd love to meet her.\r\n\r\n\r\nBecause I had never really met her because she just lived, you know, she didn't visit because she was very busy when we were kids. But, you know, I said, okay, I'll go introduce myself and talk to her. I chatted with her for a few minutes and she asked what I do. And then just trying to explain like the world of Twitter, which, you know, a lot of CEOs do know of it, but she basically had no idea what the hell I was talking about. I was trying to explain that, you know, 210 ,000 people follow this stupid account of...\r\n\r\n\r\nNik (36:23)\r\nAnd then you feel all self -conscious because you're like, she doesn't even know that that's a flex. And now I feel like an idiot because I was like,\r\n\r\n\r\nCharlie (36:30)\r\nRight, I'm like, no, it's a big deal. Right, and it's hilarious too when people, when I talk to people who are in the kind of Twitter space, because I'll rattle off all the people I know and they're like, you know, they sound like celebrities, like, yeah, I know Nick Huber and Cody Sanchez and all those. And if they're in Twitter, if they're in the Twitter world, they're like, no way. But if they're not on Twitter, they're\r\n\r\n\r\nNik (36:53)\r\nYep,\r\n\r\n\r\nCharlie (36:55)\r\nWhat? Who? So like what kind of companies they run? Are these like public companies? Yeah.\r\n\r\n\r\nNik (37:02)\r\nMy wife does it to me all the time. She's never even listened to a podcast that I've done. She's not on Twitter. And I've stopped asking her, but I used to be like, oh my gosh, Jess, guess how many views I got on this post? She'd be like, I don't know, 10 million? And I'm like, oh my god. What am I going to say to that? Like 50 ,000? You know what I mean? So I had to learn to stop even asking her, because she partly knew what she was doing, but she also was like, I don't know. What's good?\r\n\r\n\r\nCharlie (37:19)\r\nHahahaha!\r\n\r\n\r\nNik (37:31)\r\nBut yeah, it's it's hard to explain to you. That is so that is so funny, Well, let me let's end by some rapid fire questions I have for you. Here we go What industries are you the most jealous of?\r\n\r\n\r\nCharlie (37:31)\r\nRed.\r\n\r\n\r\nNik (37:54)\r\nDid I cut out? Are you thinking?\r\n\r\n\r\nCharlie (37:57)\r\nYeah, it froze and he said, what industry? And then it kind of froze.\r\n\r\n\r\nNik (37:59)\r\nOkay. What are, what industries are you the most jealous of?\r\n\r\n\r\nCharlie (38:12)\r\nyou know, probably the people who sell courses on Twitter and make hundreds of thousands or millions of dollars, that kind of seems like the ultimate model, but very hard to put off. and I would say, you know, outside content, I'm not super jealous of anyone. Cause I do think I do recognize that I have pretty good, I just get to write tweets all day instead of my keyboard. So, but yeah, the one, the one model that's a little bit above mine, I feel like is the people who create a course once and then make a million dollars selling\r\n\r\n\r\nNik (38:32)\r\nIt's true. It's true.\r\n\r\n\r\nCharlie (38:41)\r\nwith that much more work.\r\n\r\n\r\nNik (38:42)\r\nSure. If you have two hours in your day and you're not doing anything, you don't have any work responsibilities, you don't have any family responsibilities, what are you doing? What are you obsessed with right now?\r\n\r\n\r\nCharlie (38:57)\r\nWell, let me go back because I'm a six month old kid, so I'll have to go back in time to when that two hours actually existed. But well, you know, right now it's probably the new NCAA football game that just came out, which I haven't got much of a chance to play. But yeah, yeah, the new college football game that came out. But yeah, and I'll just get obsessed with random things like that. So I'll play that for like a couple of weeks and then forget about it for a year. But yeah.\r\n\r\n\r\nNik (39:11)\r\nfor like, like video games?\r\n\r\n\r\nOkay, all\r\n\r\n\r\nwhat, this is a spicy question. I hope you're ready for it. What do think of LP\r\n\r\n\r\nCharlie (39:36)\r\nman.\r\n\r\n\r\nNik (39:36)\r\nLike you have to like comment on like his moral integrity. I'm more curious on like he's an anonymous account. I finally saw it like I knew at one point he was going to try to monetize and he just recently was like, hey guys, this isn't free and I'd like to do more deep dives. I was like, there it is. He's monetizing. That type of an account. that is that is that he can have a hard time monetizing?\r\n\r\n\r\nCharlie (39:51)\r\nYeah.\r\n\r\n\r\nNik (40:05)\r\nTake the fact that he's Jake out of it. You know what mean? Like, let's say that that's like resolve. Just like that type of an account. Is that a hard one to monetize?\r\n\r\n\r\nCharlie (40:15)\r\nyeah, it definitely is. yeah, like we were talking about earlier, I, I find that interesting, analyzing business models and saying, is this person full of it? Like, but there's almost no money in that. And I, and you know, by the way, most of his info is just wrong. So even if he had great info, it's, it's very hard to, or at least exaggerated, like he just greatly exaggerates. but anyway, I\r\n\r\n\r\nIt's really hard to monetize that kind of thing because...\r\n\r\n\r\nI mean, yeah, no one, there's just no money behind that. is someone going to pay you to investigate someone? Like, probably not. There's just not a natural revenue stream behind that kind of thing.\r\n\r\n\r\nNik (40:55)\r\nThank you.\r\n\r\n\r\nHere's the thing I find the most interesting about his whole thing. While I feel like very much, hey, put up or shut up. You're making all these accusations. So show us the proof. Dude, Nick Huber's gone. Like, don't see him post. I don't see Nick post anymore. And when he does post, he changes profile picture where he looks like a, you he's like, got a corporate picture and his stuff's super tame. So it's like, okay, was there truth?\r\n\r\n\r\nCharlie (41:27)\r\nYeah.\r\n\r\n\r\nNik (41:30)\r\nto what he was saying, like getting called out, or maybe Nick's investors were like, hey man, we know it's not true, but you can't be drawing this type of scrutiny, tone it down a little bit.\r\n\r\n\r\nCharlie (41:43)\r\nRight, yeah, I could see that. That just, yeah, reduced the controversy. Because I do think if you're like Nick and once you hit a certain level, there's just no point in getting involved in that stuff or even trying to be super controversial because, you know, he has whatever, two or 300, yeah, there's two or 300 ,000 followers. He already has a great network. He's probably just, there's more of a benefit for him to just chill out on Twitter\r\n\r\n\r\nNik (42:00)\r\nThere's only downside.\r\n\r\n\r\nCharlie (42:11)\r\nyou know, reap the rewards of the incredible network he has now rather than, he doesn't need a million followers. Yeah.\r\n\r\n\r\nNik (42:18)\r\nOkay, here's my last question. What advice would you give yourself 10 years ago?\r\n\r\n\r\nCharlie (42:25)\r\nTen years ago. Yeah, I do regret not writing on Twitter or somewhere online sooner, because I think I would have, I mean, I probably would have fast -tracked this career a bit sooner, but I guess at the same time, I probably wouldn't have had anything meaningful to say back when I was 10 years ago. When I was... Right, guess, yeah, the advice would have been to get into\r\n\r\n\r\nNik (42:48)\r\nbut you would have had something funny to say.\r\n\r\n\r\nCharlie (42:54)\r\nkind of the Twitter world sooner, because I had always read that stuff, but I had never even tried creating. So I probably would have told myself, know, spend way more time creating content and seeing what works and what doesn't, rather than just spending those first six years only reading stuff. Yeah, and besides that, buy Bitcoin, I guess. Because I remember fully knowing what it was back in like 2012. I don't know why it never, I guess I didn't have much money,\r\n\r\n\r\nIt never occurred to me to even try to buy it.\r\n\r\n\r\nNik (43:27)\r\nWell, when you always think that it's a speculative asset, of course you're going to put money into it. And then all of sudden one day you blink and it's $10 ,000 and the next day it's 70 ,000. You're like, what the f where did this come from?\r\n\r\n\r\nCharlie (43:38)\r\nYeah, like I distinctly remember all those, like when it hit 19 ,000 and everyone thought, oh, this is a total mania, it's going to crash. And it did crash after that. But yeah, I kind of remember all those moments thinking, how these idiots buying into this?\r\n\r\n\r\nNik (43:51)\r\nIs it? This is it. Charlie, this has been a really cool conversation. You are exceptionally smart. You're thoughtful. You're humble. You're just very likable. And I can't wait to see what you do over the next 10 years. I think you're really talented. Where can people find you?\r\n\r\n\r\nCharlie (44:05)\r\nYeah, thank\r\n\r\n\r\nJust on Twitter at Charlie W. Rich.\r\n\r\n\r\nNik (44:14)\r\nAll right, Charlie W. Rich. OK. Cool. All right, man. Well, you have a good one. It's a great conversation.\r\n\r\n\r\nCharlie (44:16)\r\nYeah, yeah, that's my username. Yeah.\r\n\r\n\r\nYeah, thanks so much, Nick.\r\n\r\n\r\nNik (44:23)\r\nit.",
  "metadata": {
    "duration": "",
    "date": "2024-09-18",
    "platform_source": "Google Drive"
  }
}