{
  "episode_number": "219",
  "episode_title": "The Secret to Standing Out without Going Viral with Nick Gray",
  "guest_name": "Nick Gray",
  "business_name": "Museum Hack, Two Hour Cocktail Party",
  "transcript": "﻿Nikolas Hulewsky (00:00.686)\r\nAll right, Nick, one of my personal favorites. I'm freaking so excited to talk to you. For those who don't know you, serial entrepreneur built and sold multiple multimillion dollar businesses. Your first business was called FSD is the only thing I can FDS. It was a family business. You guys ended up selling to private equity. You then started this really cool company called Museum Hack that you built to like $2.8 million in revenue that you sold to your employees. You then you wrote a book. You're hosting these happy hours. You're friends with billionaires. You've got this amazing network.\r\n\r\n\r\nthat I'm envious of and I think people can really learn from. But I want to start. Tell me about your best worst date story.\r\n\r\n\r\nNick Gray @nickgraynews (00:40.435)\r\nMy best worst date story. Okay, so.\r\n\r\n\r\nNikolas Hulewsky (00:42.062)\r\nI probably framed that wrong, but yeah, you your bad date story.\r\n\r\n\r\nNick Gray @nickgraynews (00:47.775)\r\nBad date story. All right, so for listeners, what Nick is doing is he's asking an icebreaker question. And I think of icebreaker questions as categorized into green, yellow, and red questions. An example of a green, yellow icebreaker question would be like, you know, what's one of your favorite things that you have for breakfast? That's an easy, direct question. Anybody can think about it, expresses their personality. Yellow might be like, what's one of your favorite business books?\r\n\r\n\r\nA red level, which Nick has chosen, is like, what's one of your worst date stories? And a red level question is what a lot of people think that icebreakers should be. They're looking for the brain teaser. They're looking for the emotional vulnerability. They're looking to pry you open and rip you out from the inside out. And I think it's why icebreakers get a really bad rep. That being said, I will indulge you and I'll show you one of my worst dates.\r\n\r\n\r\nNikolas Hulewsky (01:20.046)\r\ndown.\r\n\r\n\r\nNikolas Hulewsky (01:41.942)\r\nNo, no, I love that. Okay.\r\n\r\n\r\nNick Gray @nickgraynews (01:43.701)\r\nI want to tell the story just because it is funny. I was in New York City dating and New York City dating is just totally wild. But I went to the Metropolitan Museum of Art on one of my dates. And I love just running around the museum and just show just looking at all the cool art. And this was before I had started my business museum hack. And at the time of this date, I was\r\n\r\n\r\nfocused on learning every single room, visiting every area of the museum. And so I'm exploring. And when I was on this date with this woman, I saw this stairway in this one area that was roped off. But I was like, I think that stairway goes down into this big room because I was building a mental map of the Metropolitan Museum of Art. So I told her, was like, do you wanna go see and go sneak back there?\r\n\r\n\r\nNikolas Hulewsky (02:30.062)\r\nMm-hmm.\r\n\r\n\r\nNick Gray @nickgraynews (02:36.871)\r\nAnd she's like, okay, yeah, so we went and we snuck down and sure enough, the stairway went down to where I thought and I was like, I'm a genius. This huge space, I know the layout. And so as we walk back up and go out that door, as we open the door, there's a guard right there who had seen us go down this roped off area. And there's a guard there and we've gone through this roped off, like do not enter type spot. And the\r\n\r\n\r\nlong of it is that like a cat and mouse game is tailed where like we were kind of running through the museum to get away from this guard. She and I had to sneak into a different room and change outfits and like all this. Yeah. And then split up and meet up a few blocks away. And so that was one of my worst like first, just imagine this poor woman is like, my God, she thinks she's going to be arrested and all this stuff. I did go on a second date. That's a, it was a hard day to follow up, but I did go on a second date.\r\n\r\n\r\nNikolas Hulewsky (03:14.102)\r\nLiterally.\r\n\r\n\r\nNikolas Hulewsky (03:22.648)\r\nDude, did you go on a second date?\r\n\r\n\r\nNikolas Hulewsky (03:32.078)\r\nThat's gonna be one of those stories where it's like, either, and then we got married six months later, or yeah, then I never talked to that person again. Such a good start to a relationship. So what should I have asked? That's good feedback for me, because I usually try to start these conversations where it's like, highlight your experience, build some credibility, and then ask a really meaty question so that the listener gets hooked right away. But I screwed it up, so I'm glad that I screwed it up, because I don't mind being wrong and people can learn from me. How should I have done it instead? What's a better way for me to do it?\r\n\r\n\r\nNick Gray @nickgraynews (03:36.243)\r\nRight.\r\n\r\n\r\nNick Gray @nickgraynews (03:48.959)\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNick Gray @nickgraynews (04:01.585)\r\nNo, see, you didn't screw it up. You know more about podcasting than I do. I don't know how to hook the listeners. I know that in social interactions, there's value to icebreakers and to doing questions like that to get the conversation going. But more and more, I think about like introverts and people with social anxiety and how when we host groups and we're trying to build relationships, how we can make space for those people.\r\n\r\n\r\nNikolas Hulewsky (04:21.742)\r\n.\r\n\r\n\r\nNick Gray @nickgraynews (04:28.999)\r\nand not for just people like myself who may present as extroverts who's like, all right, I'll tell you exactly the question. So I do these ice breakers with just a little bit of scaffolding, but the reality is that a podcaster, YouTube person, they wanna get right into it. They want the juicy meat of it. So I don't know, I don't know the right answer.\r\n\r\n\r\nNikolas Hulewsky (04:32.856)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (04:48.59)\r\nIt's well, no, no, it's, it's, it's hard balance. Cause in this conversation, what I want to talk about is like, how did first time entrepreneurs, watch banners who are getting into the game, position themselves within their local network as a connector. And in order to do that, you've got to build trust and relationships with people. that first, that first question, whether it's hosting a cocktail party or not is so important to just start building rapport. I'm going to, I'll give one example. I hate when I go to either things for my kids or if I go to like a conference, you know,\r\n\r\n\r\nMain Street conferences, I guess are a little bit different, but these big social gatherings. If somebody asks me like, what do you do? What's your business? First question. I just, I don't like it. Cause to me, that's not the social currency that I'm trying to play in. And like, if I get into the measuring contest, I'm going to lose, right? There's always going to be somebody smarter, better, richer, more successful. I like to ask questions like, cool. Where are you? Where are from? What school did you go to? Just to like get to know the person better. But I don't know that my first question is always great.\r\n\r\n\r\nNick Gray @nickgraynews (05:38.729)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNick Gray @nickgraynews (05:48.373)\r\nHmm. So why do you like to ask that question of like, where are you from or what school you went to?\r\n\r\n\r\nNikolas Hulewsky (05:54.534)\r\nso I have a pretty eclectic background. I'm one of nine kids. oldest brother's Hispanic. My older sister's half Chinese. we adopted my twin cousins because my aunt was a drug addict. My dad's a foreigner. grew up in Brazil, but he's full blooded Ukrainian was a professional soccer player. So I grew up around Latin Americans, very eclectic. So usually if I hear somebody say like, I'm from XYZ place almost immediately I can say, that's interesting. Here's the thing that I have also experienced that instantly connects us.\r\n\r\n\r\nThat's how it's worked for me anyways.\r\n\r\n\r\nNick Gray @nickgraynews (06:29.951)\r\nSo you asked that question to build rapport, to seek the connection. Yeah, just to build kind of a connection. Yeah, yeah, yeah. That's neat.\r\n\r\n\r\nNikolas Hulewsky (06:32.846)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:38.072)\r\nTo get them comfortable, yeah. But I don't know if that's right, it's just what I've always done.\r\n\r\n\r\nNick Gray @nickgraynews (06:44.917)\r\nYeah, yeah, I'm not saying that that's right or wrong. And I think that that's how like most people, I think there's some there's something like messed up in my brain that like I lived in New York City for so long. And when you're in New York City, you live in Boise, when I lived in New York, on an average day, I would literally see see 10s of 1000s of people, because you're out on the street and you're surrounded by 10s. I'm not just that's not an exaggeration 10s of 1000s of people. And so\r\n\r\n\r\nNikolas Hulewsky (07:05.281)\r\nYeah. Sheesh.\r\n\r\n\r\nNick Gray @nickgraynews (07:13.257)\r\nThere becomes a filtering mechanism that like just by survival, like you have to do because even in a city like New York, every single day I'm going to multiple events having, you know, maybe honestly, a dozen conversations on a small, on a non-traffic day. What I'm saying is there's probably something messed up in my brain because I am used to, I was a tour guide for so many years. I worked in sales, I worked in marketing, like\r\n\r\n\r\nI have to do some sort of sorting mechanism that I have to do. so at conferences and events like that. Yeah.\r\n\r\n\r\nNikolas Hulewsky (07:48.814)\r\nThose are kind of two different things, right? Like if I've built a filter to decide like, where am I gonna put my time and energy? That's totally fine. If you have constructed like you do with these cocktail parties, or if I'm going to a networking event, or if I'm meeting people that are in the same social network as me because our sons play soccer together, et cetera, the filtering's already kind of happened. Do you know what I mean? Like we've all already opted in there. We're already there. It's been filtered. So in those settings is what I'm saying. It's like,\r\n\r\n\r\nNick Gray @nickgraynews (07:52.98)\r\nMm-hmm.\r\n\r\n\r\nNick Gray @nickgraynews (07:59.796)\r\nMm-hmm.\r\n\r\n\r\nNick Gray @nickgraynews (08:07.177)\r\nMm-hmm.\r\n\r\n\r\nNick Gray @nickgraynews (08:12.233)\r\nGot it. Correct. Correct.\r\n\r\n\r\nNikolas Hulewsky (08:17.208)\r\nWe're all here. We've already filtered. I want to get to know you like quickly as opposed to have to filter out those things.\r\n\r\n\r\nNick Gray @nickgraynews (08:20.489)\r\nYes. Yes.\r\n\r\n\r\nThat's a really great point that, wow, I never thought about this before. I feel like we could just talk about like social dynamics, but in an event like that, where, as you said, there is no filtering needed. You are committed to your sun soccer practice. You will be there for the rest of the season. You will see this person. You have already made the decision that like, this is a person I want to get to know. When you have made that choice and decision, then I can understand why you don't want to ask those questions. Anyhow.\r\n\r\n\r\nNikolas Hulewsky (08:41.262)\r\nMm-hmm.\r\n\r\n\r\nNick Gray @nickgraynews (08:54.431)\r\nHere's what's important for listeners. If you are a entrepreneur, if you are a new entrepreneur, if you are starting a business, you need to have an army of people who support you. And you need to break out of every other entrepreneur that's launching new businesses these days. The reality is that it has never been easier to launch and start a business, but it's never been harder to get customers and get some traction. And the way that I found to be successful, the one way\r\n\r\n\r\nthat nobody else is doing is to host meetups. To host these meetups maybe once a quarter, some people go ham and they do once a month, but to host these little gatherings that can build these relationships and these connections in your town that I promise you will pay dividends in ways that you can't even imagine. Because the reality is, sorry, sorry, go ahead.\r\n\r\n\r\nNikolas Hulewsky (09:44.622)\r\nHow did you start doing that? Because you can't just be like, hey guys, I'm hosting an event. You've got to have at least a small group of people maybe that you build off of. When you did your first one, who were those people? How did it start? Was it organic? Or was it this preconceived, like, nope, I'm going to do the cocktail party. And this is what it's going to be. And we're going to have name tags. We're going to do icebreakers.\r\n\r\n\r\nNick Gray @nickgraynews (09:56.925)\r\nYes.\r\n\r\n\r\nNick Gray @nickgraynews (10:07.029)\r\nYeah, yeah, yeah. So I'll try not to talk my book, but like I wrote this book called The Two Hour Cocktail Party and I've since helped like 800, maybe 900 people host their very first event. These are people that know nobody that like have never hosted an event before and then they host an event. By the way, when I say event, I'm talking about 15 to 22 people gathering for a two hour happy hour. This is not a dinner party, it's not expensive like anyone can do it.\r\n\r\n\r\nI started to do it in New York City because I was not good at nightclubs and networking events. I would go out to those things and I would, you know, I just wouldn't do well. It was loud. I don't drink that much. I'm not at the time. I wasn't very outgoing or very assertive. And I would talk to two or three people. I get business cards shoved in my face and I would be like, God, this networking stuff is horrible. Like I'm never going to make new friends or meet new people. And so.\r\n\r\n\r\nI kind of had this realization instead of going to bad events, I'm going to learn how to host good events. It's that thing where it's like, if they won't give you a stage, then build your own. but honestly it started like I was just having a birthday party and I didn't drink and I wanted to host my friends for something different. like we all came over and like made coffee and tea and played board games. And that was like one of the first times I ever hosted something, which by the way, I feel very strong about this.\r\n\r\n\r\nNikolas Hulewsky (11:14.552)\r\nYeah.\r\n\r\n\r\nNick Gray @nickgraynews (11:34.011)\r\nIf you're hosting your birthday party, if you're doing something for your birthday and all adults should do something on your birthday and for your birthday, it has to be on your actual day of your birthday. Like I'm pretty strict about that. That I just don't really accept anything else. Because I just think that...\r\n\r\n\r\nNikolas Hulewsky (11:47.959)\r\nWhy?\r\n\r\n\r\nNick Gray @nickgraynews (11:58.805)\r\nIt's literally called your birthday and it is stretched to this so much so much like it's my birthday week it's my birthday month Or like my birthday this this day, but we'll do it two weeks later I I don't know it's hard for me to say but I just believe in celebrating the actual day is Really important for your birthday and it doesn't have to be big doesn't have to be a huge thing But you have to honor and celebrate that exact day not like time shifting to some other time\r\n\r\n\r\nNikolas Hulewsky (12:26.926)\r\ngonna squirrel for a second here and maybe we'll cut this, I don't know. Dude, you're very particular. Yeah, yeah, yeah. So for somebody to be like, it has to be on your actual birthday, right? And then here's the Nick method that I've created. You've got your systems in place. That almost feels like the other end of the spectrum of somebody who's gregarious and like, you freaking took a trip to Tokyo.\r\n\r\n\r\nNick Gray @nickgraynews (12:34.867)\r\nYes, I am. very particular.\r\n\r\n\r\nNick Gray @nickgraynews (12:41.204)\r\nYeah.\r\n\r\n\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (12:52.706)\r\nand went on a date, a first date with somebody to Tokyo, right? Like you famously said, you only buy one way tickets because you like to have flexibility. So it's this interesting dichotomy of super flexibility, but then you're also very strict with some of the rules that you implement. Am I reading the tea leaves right? Or like, how do you manage that part of your personality?\r\n\r\n\r\nNick Gray @nickgraynews (12:53.033)\r\nRight.\r\n\r\n\r\nRight.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNick Gray @nickgraynews (13:06.481)\r\nIt's yeah, it's true.\r\n\r\n\r\nI don't know. feel for my fiance. how do I manage? just feel like there are certain things that I have like tried and tested. So for example, for hosting events, I feel pretty strongly that, that, that dinner parties are a terrible way for people to start to learn how to host events. And I've done it enough. I've talked to enough people. I've just got the reps in enough that I have.\r\n\r\n\r\nstrong opinions that I've tested and that I've tried. I have strong opinions about museums and museum tours. I know that maybe my birthday, only host your birthday on the actual day of your birthday, might be controversial. But I'll tell you what, that is the one day that you can ask your friends to do anything when it is on your actual birthday.\r\n\r\n\r\nNikolas Hulewsky (14:01.464)\r\nHahaha\r\n\r\n\r\nNick Gray @nickgraynews (14:04.541)\r\nAnd so what I mean by that is let's say that you love board games and like you and your friends are like, not board games. If you were trying to be like, dude, I'm having a birthday party. This is my actual birthday. Like I wanted to come over and play board games. If you try to pitch that on the Tuesday, that's your actual birthday versus like, yeah, it's my birthday party versus like, well, when was your birthday? It was like two weeks ago. This seems like a stretch. I can just tell you that it connects so much more on your\r\n\r\n\r\nNikolas Hulewsky (14:05.08)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (14:31.95)\r\nThere's a difference.\r\n\r\n\r\nNick Gray @nickgraynews (14:33.829)\r\nactual day of your birthday and we have to get back to honoring that specific day when we celebrate it.\r\n\r\n\r\nNikolas Hulewsky (14:42.712)\r\nSo tell me a little bit about your philosophy, like why do you find this important and not the birthday thing, creating connection, creating an environment for people to actually meet and what results or like what success has actually come out of hosting a bunch of parties effectively.\r\n\r\n\r\nNick Gray @nickgraynews (14:51.029)\r\nand\r\n\r\n\r\nNick Gray @nickgraynews (15:02.335)\r\nSo let me think how to say this right now. Like here's the problem. There's a lot of noise out there. If you think that you're going to launch a business and it could be a software company, a new AI tool, it could be a bakery, whatever it is. If you think that you're just going to launch that on social media and that people are going to somehow care beyond your like extremely core group of friends.\r\n\r\n\r\nI think you're in for a rude awakening. The amount of noise that exists today as we scroll on our phones is overwhelming. What I found was that the way to create connection, the way to get people to actually care was to figure out how to add value to them as soon as possible. How do I give them something? And so I found that by hosting events, I was able to give someone the gift of\r\n\r\n\r\nNikolas Hulewsky (15:56.875)\r\nNick Gray @nickgraynews (15:59.645)\r\nnew connections, meeting new people, host a little happy hour. get to host them. And then I was able to get them into my world. Now specifically how did it work for me? I launched a business. I launched this museum hack tour company from hosting all of these happy hours and then getting people to come. And I built that up to a multimillion dollar business. I've heard from so many people, this woman in Seattle who read my book, who said,\r\n\r\n\r\nI know just wanted to get together with the moms in the neighborhood. She starts to host these wine Wednesdays. I talked to her six months later. She said she launched this like stroller moms workout thing where they do workouts in the park and she charges and and folks pay her and they love it. And she said I never would have done that if I didn't start hosting those wine Wednesdays because now people want to come to my stuff. People know me that I get them off the screen and into real life. And so\r\n\r\n\r\nIt's a small thing, but I think it's just crazy important.\r\n\r\n\r\nNikolas Hulewsky (16:58.766)\r\nWhen I, I have a small story for that. I was working in Southern California and I went to this marketing event and I had just gotten fired from this company. It was, it was not good. And the guy that replaced me was there. And I knew that it was a mess there. It was a mess at the company. I knew what the people that he was working for were like, et cetera. And I'm, and I saw his name. He literally I'm signing in the book. He had signed in just before me and I saw Justin Stenquist. I'm like, Oh my gosh, that's the guy.\r\n\r\n\r\nAnd so I sign my name and I walk up to him I'm like, what's up Justin? How's it going? I'm Nick. And obviously he had heard about me because I had been fired and it was a whole to do. He's like, dude, Hey, what's up? And I was like, how's Angeles man? That was the name of the company that we were running. He's like, dude, it's great. So good. Things are great. And I like, put my hand on his shoulder and I was like, you don't have to BS with me, man. How's it really going? He's like, just like instantly the facade drops and he's like, it's terrible, man. I don't know how much longer I have there.\r\n\r\n\r\nI'm pretty sure they're going to be firing me in a few weeks. Sure enough, they did fire him. But from that conversation, Justin and I became incredibly close. And when I built a home health and hospice here in Boise, I recruited him to come up. He ran it. We built that into a $15 million company. that's the one we sold a few years ago and he's still running that agency. But it was just that like willingness to be in a place where serendipity happens. And I, I think you talk about this, right? Like,\r\n\r\n\r\nNick Gray @nickgraynews (18:23.859)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (18:26.87)\r\nyou increasing your surface area of luck, especially as a first time entrepreneur, you don't think about it like you can't quantify it necessarily, but it's so important because you don't know when serendipity is going to show its beautiful face, right? You don't know what moment, what conversation, what person might be that door that leads you to success.\r\n\r\n\r\nNick Gray @nickgraynews (18:39.317)\r\nHmm.\r\n\r\n\r\nNick Gray @nickgraynews (18:46.143)\r\nHmm. I love that. I'm vibing off that idea of which you're totally right. And I may have said, which is increasing your surface area for luck. What do you think would be most helpful to your listeners and viewers? Because I want to actually give them, I think my story is interesting, but what's more interesting is that I've helped hundreds of people to increase their surface area for luck. And there's various ways that I have done that with my stuff online.\r\n\r\n\r\nwith my events, but now I really like helping people learn how to do it themselves because I have found that it does not take an outgoing, super charismatic, in fact, sometimes the most introverted, socially anxious people are the ones who love having structure at an event like a two hour cocktail party because they know exactly what to do.\r\n\r\n\r\nNikolas Hulewsky (19:38.06)\r\nYeah, yeah, yeah. Have you ever heard of a textrovert? They're like an extrovert over text that could be texting on the phone or like written, right? So they're like this gregarious outgoing person. Chris, my best friend Chris is an introvert and he's got like 4 million now followers across social media platforms. And he hates interpersonal interactions. I'm the opposite. I'm like, dude, Chris, let's go. Let's go have fun, meet people. So he loves it when I go to those things.\r\n\r\n\r\nNick Gray @nickgraynews (19:42.962)\r\nNo, what is that?\r\n\r\n\r\nNick Gray @nickgraynews (19:48.168)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (20:07.31)\r\nHe's grown online because he's been able to write. And I think that's a really good point. You don't have to be an extrovert in order to build a network. Let me, let me frame it. I want to frame it. And then I think we can have a really cool conversation. So you said it a little bit at the beginning, but this is something that I really believe in first time founders focus on product and second time founders focus on distribution. What that means is it doesn't matter how, like how good your product is, right? If you don't have a means to sell it and your network.\r\n\r\n\r\nfrom many entrepreneurs becomes your distribution network, right? Like the people that I know who want to go to bat for me that I've built a reservoir of respect and trust with, I can then tap into. You've done two really cool things that I want to mention. The first one is you've now started a company where you're building personalized websites for people, which I think is genius because I don't want to go to LinkedIn. I don't want to go look at somebody's curated manicured, like I worked at this company and these were the things that I did there. Right.\r\n\r\n\r\nNick Gray @nickgraynews (21:00.415)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (21:04.93)\r\nI think it's a beautiful way to like put yourself out there. And then the second thing is in order to build relationships, you've got these cocktail parties. So I'd love to hear about the first of why you built the website business and then tactically, how do I do the cocktail parties? How do I launch it? Who do I contact? How does it go? Who do I do for the catering? Et cetera. I think those two paired together would be really cool. Rest of the conversation.\r\n\r\n\r\nNick Gray @nickgraynews (21:24.853)\r\nYeah, and let me paint the picture of the website thing and how your listeners can do this themselves. They don't have to hire my company. They could even build a business doing this themselves if they wanted to. But first, let's talk about the importance of why I think everybody needs a personal website. And if you're listening to this now, if you're watching this on YouTube and you don't have like your name.com or net or co or something with your name.\r\n\r\n\r\non a domain name and a personal page, you need to make the $20 investment to buy the domain. You can go to card.com or card.co, C-A-R-R-D dot C-O. You can go to wordpress.com and get a $4 a month WordPress, but you need to have some homepage on the internet, even if it's just a simple text page with some family photos or something. And I'll tell you why, because as we talk about that surface area of luck,\r\n\r\n\r\nI think there's also the surface area of your personal reputation on the internet. And by the way, if you are looking for a job or if you think that at some time you may need to be, I have heard repeatedly from recruiters that whenever someone has a personal website, that is a strong positive signal for them. Because like you said, it's beyond just having a LinkedIn or something like that. We want people, what shows up when you search for your name? So when you go online and you search for your name, I try to get people to...\r\n\r\n\r\nNikolas Hulewsky (22:41.548)\r\nHmm.\r\n\r\n\r\nNick Gray @nickgraynews (22:53.311)\r\nto hopefully have really good results in that. And we know that day to day, it may not be every day actually, maybe it's a couple of times a week, somebody might be searching for you. It could be an employer, a coworker, if you're buying businesses, it could be new employees. If you're thinking of starting a company, it could be freelancers or people you wanna hire. It could be parents just in school with your kids that are just curious who these other parents are that are inviting to a birthday party.\r\n\r\n\r\nBut you wanna control that narrative online and you wanna set it up before you need it. And so that's what I talk about with like the surface area of your online presence and what shows up.\r\n\r\n\r\nNikolas Hulewsky (23:29.528)\r\nWell, once like how many times I know for me, how many times have somebody asked like, hey, Nick, tell me about yourself. And I'm like, I've gotten better because I talk to people all the time about this stuff. But many people it's like, well, I went to the school and then I did this. I, they just stutter and stammer through it. Whereas this is an easy way for them to put something curate, like what they want out there in the way that they want it formatted mess. Do you have an example we can look at? there like, is there somebody who has a personal website?\r\n\r\n\r\nNick Gray @nickgraynews (23:57.469)\r\nYeah, yeah, sure. Yeah. So someone that we made, you can go to danlerman.com. D-A-N-L-E-R-M-A-N.com. This is a guy who's a SAT tutor. you know, parents are probably looking him up. He only had his business page and his Instagram and his LinkedIn. And we made a just simple homepage for him. And by the way, since I've been...\r\n\r\n\r\nsharing so much of myself online for many years. I've hired all these folks who work for me. So I have like a little team of three full time people that helped me with my stuff. But now I'm wanting to help other people. So we do it for like $30 or 100 bucks a month. You get on a phone call with one of my people once a month, they talk to you, they do an interview, they record the call, they help write it. Anyone that is like super savvy that's listening and watching you can do this all yourself.\r\n\r\n\r\nbut I also find a lot of people just will never do it. They simply say like, I should probably do that, but they'll never make it a priority. And I found, you know what, through a 20 minute phone call with someone on my team, we can just knock this out for you.\r\n\r\n\r\nNikolas Hulewsky (25:04.514)\r\nYeah.\r\n\r\n\r\nAll right, so here's Dan's page. Dan Lerman, I'm a Columbia professor and human intelligence expert. The go-to tutor for families who want top scores, dream schools, and lasting confidence without the guesswork. I'm gonna say one thing. AI has ruined the dash for me. It's ruined it. I hate it so much that, no, I don't hate the dash. When I get like output from AI, it's always got the dash. And I'm like, man, now everyone thinks it's AI written. Anyways.\r\n\r\n\r\nNick Gray @nickgraynews (25:20.756)\r\nYes.\r\n\r\n\r\nNick Gray @nickgraynews (25:34.909)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:36.578)\r\nWhy is this the first thing that I'm looking at on his webpage? Like, you're smart, you know how to get attention, you know how to hook people. There's a reason that you started with this. Can you walk me through like, why this first?\r\n\r\n\r\nNick Gray @nickgraynews (25:49.949)\r\nI think people want to know sort of reputation or they just want an easy like, what is this person? And so he's a Columbia professor and a human intelligence expert. If his goal is to get clients to help hire him so the kids will like ace the SATs, I think that is really important and that that's what they want. What's more interesting though is on his page, if you click on articles, I'll show you this is the kind of unique thing that we're doing for people.\r\n\r\n\r\nNikolas Hulewsky (25:57.709)\r\nMm-hmm.\r\n\r\n\r\nNick Gray @nickgraynews (26:19.817)\r\nThe name of the business I've been playing with is called Minor League Famous, which is like, hey, for 30 bucks a month or so, like I'll set up your website, I'll host it. And about once a month, we'll scrape and create these articles from what you're already posting on the internet. And so if you click any of these posts, these are just stories that he's posted on Instagram, tweets that he's written, LinkedIn posts, and we've just turned them into blog posts. Once again,\r\n\r\n\r\nNikolas Hulewsky (26:24.438)\r\nI love it.\r\n\r\n\r\nNick Gray @nickgraynews (26:47.599)\r\nAnyone can do this. You are watching this podcast on YouTube. You know how to use the computer. You know how to use AI tools. You can do this yourself, but you probably never will. And you'll just never get around to it.\r\n\r\n\r\nNikolas Hulewsky (26:57.934)\r\nDid he tell you like, I want the SAT bootcamp in London to be featured on my website? Because he's probably putting a lot of content out, right? Like, how did you know to pick this one?\r\n\r\n\r\nNick Gray @nickgraynews (27:04.008)\r\nNo.\r\n\r\n\r\nNick Gray @nickgraynews (27:07.977)\r\nWe look for stuff that has like engagement and that looks like it could be good content for what they're doing. And so someone like Dan who posts maybe twice a month, maybe we can just choose something. Okay. So that's another one. So he was on a podcast. We found that he was on a podcast. We just stripped the transcript, wrote the article, took all the stuff. And so we do this for people. It's like, if you're on a podcast, we're just going to write it up so you can scroll. Yeah. Yeah. Yeah. I think it's really helpful.\r\n\r\n\r\nNikolas Hulewsky (27:10.414)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (27:14.093)\r\nreally smart.\r\n\r\n\r\nNikolas Hulewsky (27:31.19)\r\nNick, that's so good. Nick, that's so good. Well, I have a lot of podcasts that I've been on and my assistant keeps like a spreadsheet for me as I can go to the link and stuff. But people do ask like, have you been on any podcasts? Because I don't usually talk about all of my history, right? I'm usually interviewing people. This is freaking perfect for him to have a place where, hey, if you want to listen to something that I talk about, go check out this podcast interview that I did. So good.\r\n\r\n\r\nNick Gray @nickgraynews (27:46.249)\r\nMm-hmm.\r\n\r\n\r\nNick Gray @nickgraynews (27:53.501)\r\nYeah. Yeah. And scroll down. If you go to that, keep scrolling. I think in the full transcript, we actually do the full transcript of it, which really helps. This isn't hard to do, by the way. The tool we use for this, by the way, that I like, if you want to do this at home, we use a software called assembly.ai. You can also get transcripts out of this in Google Gemini. And I think AI Studio, if you can't do it on Gemini.\r\n\r\n\r\nNikolas Hulewsky (28:03.16)\r\nYeah.\r\n\r\n\r\nNick Gray @nickgraynews (28:21.161)\r\nBut on AI Studio, you can just upload it and say, hey, give me back the transcript. Here are the two speakers. Give me speaker labels. I don't need the timestamps. So we have a whole bunch of prompts that we've written to make these things.\r\n\r\n\r\nNikolas Hulewsky (28:31.042)\r\nYeah, I've.\r\n\r\n\r\nNikolas Hulewsky (28:35.15)\r\ncool so a lot of those businesses run on AI then.\r\n\r\n\r\nNick Gray @nickgraynews (28:38.005)\r\nWe use a lot of AI, but I found that it's not to the point yet where we can just let it rip. And so at, at $30 a month, I'm like, I'm basically break even cause we have a lot of human involvement still. And so one example is if you go back to the page of the articles, oh yeah, this is the best. Yes, this is the best. If you click playground, uh, from their menu. So it's really meant for you to use this based on their, um,\r\n\r\n\r\nNikolas Hulewsky (28:44.024)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (28:54.466)\r\nYeah, I just wanted to look at this really quick.\r\n\r\n\r\nNikolas Hulewsky (29:01.005)\r\nOK.\r\n\r\n\r\nNick Gray @nickgraynews (29:07.093)\r\nAPI but within the playground if you click into the playground you can actually upload your transcripts and then what you want to turn on is speaker labels and so thankfully speaker labels is turned on already and\r\n\r\n\r\nNikolas Hulewsky (29:18.786)\r\nWell, so hold on. Hold on. So I thought this generated the transcripts. Is there another tool you're using? it does. So how do you?\r\n\r\n\r\nNick Gray @nickgraynews (29:22.675)\r\nYes. Yeah. This will generate the transcript in like plain text. Yeah.\r\n\r\n\r\nNikolas Hulewsky (29:28.162)\r\nHow do you import it? you just, let's say there's a YouTube video of Nick Gray and I want to get that conversation that he had with somebody. Like, how do I get that? Does that make sense?\r\n\r\n\r\nNick Gray @nickgraynews (29:34.323)\r\nYeah, you would upload the transcript. I don't know if they can take video files here in assembly AI. So you can click upload audio, I think, for the most, yeah, yeah, you could upload the audio, but for someone who just doesn't even want to do that, I would use probably Google Gemini or AI studio. And then you can upload the video file to that and then ask it for the transcript.\r\n\r\n\r\nNikolas Hulewsky (29:41.774)\r\nHmm.\r\n\r\n\r\nbut you can upload the audio. Okay.\r\n\r\n\r\nNikolas Hulewsky (29:57.87)\r\nThe other one, Descript. So Descript has something, if anyone's ever edited with that, you can just copy the link from Google, from YouTube, and paste it in and it'll do the whole video with transcripts. I'll use that sometimes, but I've never used assembly. I like having something where I can put the audio because, you messed much with Notebook LM?\r\n\r\n\r\nNick Gray @nickgraynews (30:04.393)\r\nYes. Nice.\r\n\r\n\r\nNick Gray @nickgraynews (30:20.817)\r\nI've only used it like five times.\r\n\r\n\r\nNikolas Hulewsky (30:23.342)\r\nI love notebook LM because it doesn't hallucinate. I, when I put in transcripts to a lot of the other AI models, there's a lot of hallucination involved for whatever reason. No, but got, let's just like really locked down. And so everything that it spits out is cited, but notebook LM has this insane function. got to show it to you where I can, I can take a conversation. So I'm going to share my tab. Um, for example, this is Nick Gray. All right.\r\n\r\n\r\nNick Gray @nickgraynews (30:26.206)\r\nHmm\r\n\r\n\r\nNick Gray @nickgraynews (30:35.914)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (30:50.306)\r\nBefore we had our conversation, I went here and I did a bunch of research on you and I had a huge, you know, lot of big research documents. You can see it here. This is, these are all the, anyways, all the research that was, that was spit out. But my favorite thing is I can come here to audio overview and it, it actually creates a podcast for me. And so then like I got to listen to a podcast about Nick Gray.\r\n\r\n\r\nNick Gray @nickgraynews (31:09.203)\r\nYes, I love this.\r\n\r\n\r\nNikolas Hulewsky (31:18.68)\r\nBefore I did this podcast, right? Cause I'm an audio learner and I just thought that that was a really cool trick. So if you ever want to mess around with notebook LM, you should go, you should go check that out. But back to,\r\n\r\n\r\nNick Gray @nickgraynews (31:18.783)\r\nThat's cool.\r\n\r\n\r\nNick Gray @nickgraynews (31:29.629)\r\nMy craziest Notebook LM story that I'll just tell you is I went to a dinner with Brian Johnson a few months ago and I recorded the conversation that we had at dinner and then uploaded it to Notebook LM and then listened the next morning with my now fiance about what we talked about at dinner, which was so freaking cool. It was awesome.\r\n\r\n\r\nNikolas Hulewsky (31:35.232)\r\nmy.\r\n\r\n\r\nNikolas Hulewsky (31:50.04)\r\nReally?\r\n\r\n\r\nWhat did you record it with?\r\n\r\n\r\nNick Gray @nickgraynews (31:55.231)\r\nJust my phone, and pro tip, by the way, I live in Texas, which is a single party recording state, check your local laws. But what that means is whenever I go into a doctor's appointment, I just open up voice recorder and I set record and then set my phone on the desk. And I record my entire doctor visit. And then afterwards I upload that doctor visit, I get a transcript. And so then I'm compiling all of these notes and I'm like, hey, what are my doctors saying?\r\n\r\n\r\nNikolas Hulewsky (32:02.254)\r\nYou're welcome.\r\n\r\n\r\nNikolas Hulewsky (32:24.334)\r\nNick! Nick, feel like, have ever seen Step Brothers? okay, you've probably seen the GIF where they're like, did we just become best friends? Yup! Dude, I freaking love that. I gotta show you something, hold on, stay here.\r\n\r\n\r\nNick Gray @nickgraynews (32:24.499)\r\nWhat do you agree with, you know, like all this different stuff? So yeah.\r\n\r\n\r\nNo, but I bet it's a great movie.\r\n\r\n\r\nNick Gray @nickgraynews (32:33.747)\r\nYeah. Yeah. Yeah, please.\r\n\r\n\r\nNick Gray @nickgraynews (32:41.747)\r\nBy the way, if you're watching this, you've got to do your own site and you have to make your own website and just put some content there because you want to give content for the LLMs and Google to scrape about you. And you just want to like be feeding the robots before you need it. Sorry, next back.\r\n\r\n\r\nNikolas Hulewsky (32:57.496)\r\nSave that, we're gonna edit this, don't worry. Save that, that, dude, I wanted to talk about that. I think that's a really, really big thing about your website. But I'm gonna stop sharing for a second. Have you messed around or ever seen this before?\r\n\r\n\r\nNick Gray @nickgraynews (32:59.871)\r\nOkay.\r\n\r\n\r\nNick Gray @nickgraynews (33:10.685)\r\nYes, I have one, but I haven't set it up. Do you love it?\r\n\r\n\r\nNikolas Hulewsky (33:13.102)\r\nBro, yes, yes, you've got to set it up. To be honest with you, I don't use the AI functionality within the Limitless app. Sometimes I'll go through it and be like, and ask it questions. Most of the time, I'm exporting conversations and then uploading the transcripts and doing exactly what you're saying. But then there's no wonkiness with my phone. You know what I mean? Like I don't have to pull that out. The other thing that it's amazing for and the reason you need to do this today is because when I go to conferences,\r\n\r\n\r\nNick Gray @nickgraynews (33:16.116)\r\nYeah.\r\n\r\n\r\nNick Gray @nickgraynews (33:20.916)\r\nMm-hmm.\r\n\r\n\r\nNick Gray @nickgraynews (33:28.245)\r\nMm-hmm.\r\n\r\n\r\nSo cool. Yeah, yeah.\r\n\r\n\r\nNick Gray @nickgraynews (33:42.101)\r\nSo.\r\n\r\n\r\nNikolas Hulewsky (33:42.99)\r\nI wear this thing and I ask the question, what's your name? Where are from? What do you do? Oh, that's cool. I don't have to write anything down. I don't have to go and like put notes in my phone. I just go back later that night and I'm like, who did I talk to? Oh yeah, where were they from? Did I say I was going to follow up with anybody? It's amazing because I have the transcript there and I don't have to worry about like just going back to my notes. Like, especially for somebody like you or this is your thing. You need to set it up ASAP. It's really good.\r\n\r\n\r\nNick Gray @nickgraynews (33:59.701)\r\nSo good.\r\n\r\n\r\nNick Gray @nickgraynews (34:05.147)\r\nIt's so good. It's so good. I need to set it up here, right?\r\n\r\n\r\nNikolas Hulewsky (34:08.65)\r\nand, and a quick rabbit hole. I'm, have a company that, so my background is entrepreneur multi-time. My, my brother-in-law and I just launched a venture studio. has a $500 million healthcare company. And so we'd launched a venture studio within his healthcare company. I just worked as an advisor for this team at UC Berkeley, where we developed a product similar to this, but the whole thing that it's solving our families that do not understand what's happening with their loved one as they age. And so.\r\n\r\n\r\nMom, dad, grandma, grandpa can wear one of these things. They go to the doctor's visit and what does it do? It summarizes the visit, sends it to the family so that they're in the loop. And like what you just described there is like the perfect use case because now they can track and trend and they can see, what did they say last time? what medication was that? And it doesn't stress mom out or grandma who's 75 years old and trying to like, did you say I have to take Larazapan? You know what I mean? So dude, that's what's so cool about.\r\n\r\n\r\nNick Gray @nickgraynews (34:45.749)\r\nMmm.\r\n\r\n\r\nNick Gray @nickgraynews (35:00.211)\r\nYes. You're right. You're right.\r\n\r\n\r\nNikolas Hulewsky (35:05.432)\r\nthis AI stuff. So anyways, that's one of the projects that we're working on in our venture studio. And you just brought it up like, I happen to do this myself. It's freaking amazing. Yeah. All right. So back to, back to the website. The reason I really liked the website is because AI is kind of killing the old search and the old search engine optimization. So in the past, you used to write blogs and you strike keywords and it's like everything wanted to point back. You had to rank right on Google.\r\n\r\n\r\nNick Gray @nickgraynews (35:13.429)\r\nCool project, I like that.\r\n\r\n\r\nNick Gray @nickgraynews (35:35.017)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (35:35.49)\r\nWell, now AI is answering these questions. And what I have found is that the more specific that you can be and unique, the better the the linking will be to you. I've also found that video is a huge differentiator. So even having video on your personal website of any podcast that you've done is a huge differentiator. But to your point, if you just start posting on here, you're building credibility with that site. You start ranking. You start getting Google to point towards\r\n\r\n\r\nyou, if I Googled a two hour cocktail or two hour happy hour, Nick Gray is probably going to pop up just because you've put out so much content around it. You're, building an ecosystem for people to find you. Was that part of the thought process in creating this company?\r\n\r\n\r\nNick Gray @nickgraynews (36:18.853)\r\nYeah, yeah, yeah, 100%. And by the way, I'm still figuring this out. I don't know if I'm a minor league famous or Friends News Network, but for any listeners or viewers on YouTube, I will make you a free site. And if you buy the domain name, we'll do it for free for a couple months for you. Hopefully you'll love it enough that you'll start to pay me 30 bucks a month afterwards. But if not, you can save the site, put it on any WordPress host that you want. The thing is, is that you kind of need to be posting online elsewhere.\r\n\r\n\r\nat least like once a month. We found that this plan doesn't work if you're someone who never posts online because then I don't have stuff to pull from to create content for you and then it's a lot of work and you have to get on phone calls with us and stuff like that. Anyhow, I think that what I'm trying to do is create these digital honeypots for people. I'm trying to create a domain with all of this content that the LLMs can sort of chew through\r\n\r\n\r\nNikolas Hulewsky (37:11.598)\r\nHmm.\r\n\r\n\r\nNick Gray @nickgraynews (37:18.259)\r\nso that you get to tell your story when people go to research you. And when people are asking, who is this person? Who should I hire to be a realtor in Alpharetta, Georgia? There's stuff online that's about you that has depth and that has richness and that has content and a history of being online. Something that I don't think a lot of people think about is that if you are only posting on Twitter, know that ChatGPT, like they are aggressively blocking Twitter from ChatGPT.\r\n\r\n\r\nNikolas Hulewsky (37:48.28)\r\nHmm, makes sense.\r\n\r\n\r\nNick Gray @nickgraynews (37:48.775)\r\nElon and Sam Altman. So if that's where you're posting all your content or on LinkedIn or other places, it can't be scraped for these other large language models. But when you post it on your website, and so while someone like Dan may only get a few dozen visitors a week to his website, we know that it's getting scraped and crawled hundreds of times every week by these LLMs. And so that's kind of what we want. It's sort of a long play just to say, look, I want you to show up in these search results.\r\n\r\n\r\nI want you to tell your story online and just allow people that are trying to do a deep dive about you not to dead end on like a private Instagram page.\r\n\r\n\r\nNikolas Hulewsky (38:27.694)\r\nHave you thought about tying it into two hour cocktail or two hour famous or like two hour website or because how much how much time would it actually take? Like, let's say I was like, hey, Nick, I want your company to build me a website. You said you meet with me, you talk to me, get, you know, spend time getting to know me. Like, how much time does it take to go from I'm in to website launched from my time, not from your team's time, but like from my time.\r\n\r\n\r\nNick Gray @nickgraynews (38:35.544)\r\nI never thought about that. Ooh, ooh, ooh.\r\n\r\n\r\nNick Gray @nickgraynews (38:54.259)\r\nI never thought about that. I like that idea. So you like 2HourFamous more than MinorLeagueFamous?\r\n\r\n\r\nNikolas Hulewsky (39:01.174)\r\nonly reason I like it more is because I know it's Nick Gray. Because Nick Gray's got the two hour cocktail, and now we've got two hour famous. It's like, OK, these are things that are falling in line. It makes sense to me.\r\n\r\n\r\nNick Gray @nickgraynews (39:04.978)\r\nYeah.\r\n\r\n\r\nMm hmm. Mm hmm. I feel bad like I'd be like stealing off of Tim Ferriss's stuff where where he really had the four hour something. Yeah.\r\n\r\n\r\nNikolas Hulewsky (39:18.296)\r\nFeel bad? That dude has so much money, he doesn't give a rip. He'd probably see it and be like, you go, Nick.\r\n\r\n\r\nNick Gray @nickgraynews (39:24.117)\r\nI like this idea. like this idea\r\n\r\n\r\nNikolas Hulewsky (39:29.122)\r\nBut and then and then you're also like selling it to me where it's like, I don't have to mess with it. You only need a little bit of my time. Amazing. Cool. Here's two hours of my time. I'll answer all your questions and your team takes it and runs with it. The reason I like it is because you've had to learn social media and like, dude, you're friends with the guys from my first million. You're friends with Cody Sanchez. You're friends with Andrew Wilkinson, like individuals who have a real social presence. And so you understand what it takes at the writing chops, where you place things, how you highlight things in order.\r\n\r\n\r\nNick Gray @nickgraynews (39:34.899)\r\nYeah. Yeah.\r\n\r\n\r\nNick Gray @nickgraynews (39:44.469)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (39:59.374)\r\nto hook people as they read. So I know that if I'm outsourcing that to you, I have a high level of confidence that you're gonna create an engaging and compelling website for me. So that already sells itself, right? Anyways, for those reasons, I like it and keeping it to your brand makes sense to me. Could be wrong.\r\n\r\n\r\nNick Gray @nickgraynews (40:06.355)\r\nYeah, yeah.\r\n\r\n\r\nNick Gray @nickgraynews (40:16.309)\r\nNice, I like that a lot. I've never thought about it. I'm just trying to make these sites. We've done like 80 or 90 of them so far. I don't know what name I'm gonna use for it. Most people are paying us either 30 bucks a month where we just automate the scraping and we just post and manage it. Or we have a handful of people who pay us $100 a month and then they get a monthly phone call where if they're not content posting,\r\n\r\n\r\nNikolas Hulewsky (40:23.384)\r\nHow much do you charge?\r\n\r\n\r\nNikolas Hulewsky (40:30.733)\r\nMm-hmm.\r\n\r\n\r\nNick Gray @nickgraynews (40:41.651)\r\nWe'll call them once a month and just have a conversation, brainstorm. And I kind of have a menu of things to pick from that I know have worked for me. And so we go through that and each month we come up with a couple articles from that phone call.\r\n\r\n\r\nNikolas Hulewsky (40:56.578)\r\nand how much for the initial setup.\r\n\r\n\r\nNick Gray @nickgraynews (40:59.197)\r\nI don't charge anything. know I probably should, but now I'm just trying to set this stuff up and just figure out right now. The biggest problem that I have is how to make this from a nice to have to a need to have. And so I'm doing these sites for free for people at the beginning because I'm like, Hey, can we figure out how to make this a need to have for you? Because I'm so careful about the things that I sell and my brand reputation that\r\n\r\n\r\nLike I don't need the money to do this. I really want to create something that people love and would refer to their friends. So yeah, I'm still figuring it out.\r\n\r\n\r\nNikolas Hulewsky (41:34.082)\r\nmean, for content creator like myself, 30 or 100 bucks a month is a no-brainer. Are you kidding me? It's a no-brainer. Jeez.\r\n\r\n\r\nNick Gray @nickgraynews (41:40.181)\r\nRight, Yeah. Set it and forget it is the goal where, where you never have to think about it and you show up online. Somebody else that we did one for is, Cody Sanchez, his husband, Chris, Chris Petkus.com. He has never touched his website. He frankly might not even know it exists, but his site is so tight and we have so many good articles and we're, ranking so well. And so I think that's the type of stuff is.\r\n\r\n\r\nThere are people out there searching for you on the internet at various times in your life, whether you need a bank loan or you're hiring employees or starting a business or something, you'll go through moments where people are looking you up online. And I want you to show up in the best way possible for those moments.\r\n\r\n\r\nNikolas Hulewsky (42:27.244)\r\nI like, this is so funny, this is not what I planned on talking about, little episode with you, but I like, dude, I really like this idea of starting out with that niche product of, right, content creators, let me help you put your content out online. And then even expand the whole land and expand model, you know, in SaaS, even expanding to like, I can use Delphi, I don't know if you've seen Delphi AI, to build you a chat bot, have you seen that? Or I could create a chat bot for you.\r\n\r\n\r\nNick Gray @nickgraynews (42:50.677)\r\nand\r\n\r\n\r\nNikolas Hulewsky (42:57.226)\r\nand using Replet or Lovable, go ahead and just create a chatbot. I'll show you Delphi. So Delphi is cool because you can upload.\r\n\r\n\r\nNick Gray @nickgraynews (43:00.468)\r\nMm-hmm.\r\n\r\n\r\nNick Gray @nickgraynews (43:04.489)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (43:11.552)\r\nCody's apparently got a Delphi. So you can come here and I could go and upload, give links to all of my podcast episodes. And basically what it does is it digests all that information and then creates a custom chat bot if somebody wanted to come and quote unquote talk to me. But the point I was making is on this website that you're creating, you can add these AI add-ons of like, do you want to...\r\n\r\n\r\nNick Gray @nickgraynews (43:14.815)\r\nCool.\r\n\r\n\r\nNick Gray @nickgraynews (43:32.723)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (43:36.95)\r\nchat with Nick or Cody or do you, do you want to ask a specific question? And it's, it almost becomes the next step down the funnel for many of these creators who have businesses to get them in that sales cycle, if that makes sense, right?\r\n\r\n\r\nNick Gray @nickgraynews (43:38.516)\r\nMm-hmm.\r\n\r\n\r\nNick Gray @nickgraynews (43:53.127)\r\nIt does make sense. I, I love what you're thinking about. I'm wrestling with two things. Number one, well, I'm wrestling with two things. Number one, your listeners and your viewers are really smart. And so the reality is, is that they could build their own website in 10 minutes with an AI tool. But what I know is that they will never, or they'll probably stop updating it once they get bored after a few months. And so the sites that I'm creating for people.\r\n\r\n\r\nNikolas Hulewsky (43:56.866)\r\nBut you hate it.\r\n\r\n\r\nNikolas Hulewsky (44:11.16)\r\nYes.\r\n\r\n\r\nNick Gray @nickgraynews (44:22.953)\r\nThey don't look that beautiful. Like to be honest, I'm not really focused on how it looks on the desktop. I'm obsessed with how it looks on your mobile phone, how it ranks on search engines, and whether we keep the content at least updated once a month. And so I think that the value of design, when anyone can spit out a website, when anyone can design something, I think that the value of design goes down and the value of content goes up.\r\n\r\n\r\nAnd so I'm trying to create something that you know you can set it and forget it and your site keeps getting updated and is still fresh. Cause there's nothing such a bummer as like finding someone has a personal homepage. And the last time I was updated was three years ago.\r\n\r\n\r\nNikolas Hulewsky (45:07.0)\r\nWell, just building on that, a lot of people think AI is a silver bullet. Like, I've got AI, now it's going to build me this really cool thing. No, it's not a silver bullet. It's a tool in the tool belt. It makes you a lot smarter and a lot more efficient. What it does, though, is it takes your native superpowers and your differentiators, and it can accelerate them if you use it properly. And you using it, even if it's a prompt to spit out the first version or iteration or to take these conversations, synthesize it, and then build the websites, it's taking your native genius.\r\n\r\n\r\nNick Gray @nickgraynews (45:14.185)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (45:36.29)\r\nwhich is helping people communicate and create relationships with other individuals. And now AI is helping you accelerate that by helping other people create that brand, create that moment that people get when they're meeting them for the first time. I really like it. Yes, anybody could spin up a website, but there's not anybody who's Nick Gray other than the Nick Gray. You know what I mean? It's such a cool accelerant for people.\r\n\r\n\r\nNick Gray @nickgraynews (46:01.525)\r\nSo one quick tip that I'll give to people is that I think everyone should have a friend's newsletter. And I learned about this when my parents were in the military and each year they'd send out these annual Christmas cards to people all around the US that they'd met through service or whatever. Some people do it, like did your folks ever do it or do you guys send out like an annual card with a letter?\r\n\r\n\r\nNikolas Hulewsky (46:22.67)\r\nMy, yeah, my in-law, my wife's family does for sure. Every year on Christmas. And we do too, it's not a letter, but just a postcard.\r\n\r\n\r\nNick Gray @nickgraynews (46:26.867)\r\nYeah.\r\n\r\n\r\nNick Gray @nickgraynews (46:30.653)\r\nYeah, but I love reading those letters and I love doing that because you keep building this network of loose connections or weak ties. And I think that everybody can do this by sending out like a quarterly friends newsletter. You don't need software for this. You don't need to set up kit.com. You can just send it in your Gmail and put everybody on BCC. It's not going to thousands of people. In fact, it may just go to 20 people the first time you send it out, but sending that out with one or two photos.\r\n\r\n\r\nNikolas Hulewsky (46:45.422)\r\nMmm.\r\n\r\n\r\nNick Gray @nickgraynews (47:00.179)\r\nAnd the important thing I want to say is you need to start the letter by adding value. so tell people some of the best books that you've read, some of the best shows on Netflix you watched. If there's a cool article, list some of those great articles at the top. Look back through your life over the past three months. Look through your Amazon order history. What are some great things you've bought? Give people little nuggets of value, then some life updates and include a photo. And by doing this, I promise you're going to\r\n\r\n\r\nNikolas Hulewsky (47:17.612)\r\nlove that.\r\n\r\n\r\nNick Gray @nickgraynews (47:28.795)\r\nOpen that surface area to lock in connections.\r\n\r\n\r\nNikolas Hulewsky (47:31.128)\r\nDude, I love that. I love that. We are almost out of time. Can I ask you just one quick question? This is like a question that I had that I'm mad I didn't get to. People like you somehow find ways to manufacture viral moments. had a guy on my previous podcast, his was Tarek. He launched an app. I can't remember exactly what it does, but it's like the...\r\n\r\n\r\nIt's like open table, except a better version of open table because people are actually selling buying and selling open table reservations. Well, he like cuts that out. His business exploded because he got featured in the New Yorker and it was like, how do you manufacture that? I don't know how you manufacture that. Your business exploded when you were featured on a blog about museum tours, right? And it's like, boom, business exploded because you got featured on the blog. But there's these like moments where, this news publication picked me up and the business exploded. And I just found people like you somehow.\r\n\r\n\r\ncontinually find these opportunities to create organic virality? Do you have any thoughts around how you do that?\r\n\r\n\r\nI could you OK.\r\n\r\n\r\nNick Gray @nickgraynews (48:37.673)\r\ndo have a thought. Yeah, yeah. I think my thought is that I build things that I genuinely want and would be proud to share to my friends and my family. And that's a weird answer. But I'll tell you that I'm not starting a business from the root of I got to do this to make money. I'm starting it from like, God, what would I be really proud? How can I make something that somebody needs not once? How can I make these museum tours that have an NPS score of over nine? How can I create something amazing?\r\n\r\n\r\nAnd so I think it's that focusing so much on the product and the, and the great stuff. It's not like really a sexy, good answer. It's really hard to get press and media these days. so I think just spending more time on something than anyone else getting to be the very best at it. Being so proud of it for your friends and family that you'd want to share with them. when I wrote my book, yeah. Yeah. Yeah. Yeah. Being known for something.\r\n\r\n\r\nNikolas Hulewsky (49:32.012)\r\nbeing known for something.\r\n\r\n\r\nNick Gray @nickgraynews (49:36.437)\r\nI wrote a book called the two hour cocktail party and I wanted to, it took me six years to write the book because I said, I want to be so proud of it that if I saw a celebrity or a CEO that I really respected at the airport that I'm chasing them down. And I'd be so proud that I'd be like, wrote this book. would, I'd really love for you to have a copy of it. Something that I was so proud of that I really thought was full of value. And so I guess I think about that when I make products and stuff.\r\n\r\n\r\nNikolas Hulewsky (50:01.102)\r\nI love that. All right, to wrap up, I wrote this note to myself. You've probably said this, but I just wrote it after I was doing research on you. And the key to real wealth isn't about market analysis. It's about fostering deep and real connections. And just after kind of doing my due diligence on you, that's really what has stuck with me is your ability to connect deeply with people has led to you leading a rich life, not necessarily.\r\n\r\n\r\nI did the market analysis and there's arbitrage here. And so I went ahead and made this bet. and I think for people listening, go follow Nick. puts out amazing content. Nick made a really cool offer to me before we started. He said that he will give the first 10 people who respond his book for free the two hour cocktail. If you promise to host a cocktail party, because that's where this magic happens. That's where the magic starts at building these relationships and fostering these, these social connections.\r\n\r\n\r\nSo if you're interested in that, that would be amazing. Reach out to me, reach out to Nick and we'll get it started.\r\n\r\n\r\nNick Gray @nickgraynews (51:02.867)\r\nYes. Yeah, I'll ship you a copy. I'll send out 10. You just should host a party. Like I promise you, it can be cheap. don't have to, like in the time it takes you to watch a movie on Netflix, you can host a little happy hour that's less than a hundred dollars for your friends, your neighbors, for just people that you want to see. The type of people you're like, dude, we should get coffee sometime, but you never actually do. We need more of this human interaction. We need more human connection and more neighbors and friends and stuff like that. So yeah, send a note.\r\n\r\n\r\nNikolas Hulewsky (51:31.864)\r\nJust to reiterate, the guy who has created billions of dollars in value by fostering real connections is letting you have his book for free if you decide to start your own happy hour in your market. That's it, you just have to do it one time. It's freaking, like that's an incredible offer. So you better jump on this. Otherwise I'm gonna buy 10 copies myself and host 10 happy hours. So it is what it is. Nick, thank you.\r\n\r\n\r\nNick Gray @nickgraynews (51:32.661)\r\nthrough me.\r\n\r\n\r\nNick Gray @nickgraynews (51:51.145)\r\nThank you. Thank you, Nick. I'll include some show notes. I'm gonna include some more show notes for some other stuff that I'm working on and other things. Thanks for having me. Folks, if you take away one thing from this, it's this. Like Nick said, it's the greater surface area for luck and connection. And you can do that in a few easy ways. Have a simple quarterly friends newsletter, host a quarterly happy hour or meetup for people in your neighborhood. Get a personal website, make one yourself. It's not expensive. You can figure out how, but just increase your surface area online and think about adding value.\r\n\r\n\r\nNikolas Hulewsky (51:55.298)\r\nPerfect.\r\n\r\n\r\nNick Gray @nickgraynews (52:20.969)\r\nand there's a lot more opportunities. You might be surprised what comes around.\r\n\r\n\r\nNikolas Hulewsky (52:24.334)\r\nI it.",
  "metadata": {
    "duration": "",
    "date": "2025-08-18",
    "platform_source": "Google Drive"
  }
}