{
  "episode_number": "30",
  "episode_title": "From $350k to $1.7M Using This Little Known Google Tool with Buddy Rathmell",
  "guest_name": "Buddy Rathmell",
  "business_name": "Google Business Profile Optimization Agency",
  "transcript": "﻿Welcome to another episode of Nickonomics, the show for entrepreneurs and wantpreneurs curious about the economics of small business. I of course am your host and chief curiosity officer, Nicholas Halewski. And on today's episode,  what if I told you  that there was a digital marketing growth strategy proven  to give you access to more than a billion monthly active users? \r\n\r\n\r\nThat would increase the number of your clicks  by up to seven times  resulting in a 5 percent conversion rate on those encounters and was a hundred percent free.  And what if I told you that 60 percent of small businesses haven't used it in the last year and that 40 percent of all small businesses have never even tried it.\r\n\r\n\r\nNow, everyone knows that you have to be online with your business. And if you're watching this, you probably understand the importance of digital marketing.  You might've even paid a couple thousand dollars to have your website search engine optimized,  or you might be paying a couple hundred dollars a month to have a search engine optimization company, SEO company writing content for you every month.\r\n\r\n\r\nShoot. You might even be paying thousands of dollars a month to Google and meta so that you rank higher on search results because you understand its importance.  But odds are, you've never tried this. What the heck am I talking about? I'm talking about the artist formerly known as Google, my business,  Google business profile.\r\n\r\n\r\nAnd in today's episode, I sat down with Buddy Rothmo. He's the owner of a digital marketing agency that focuses on this strategy. And I'm just trying to answer one question.  What the freak is Google business profile? And how did it take one company from 350, 000 a year in revenue  to 1. 7 million a year in revenue? \r\n\r\n\r\nYou're not going to want to miss this. Enjoy.  All right, buddy. Welcome to Nikonomics. Super stoked to have you. I'm excited to be here. Let's start from the beginning in its simplest terms. What is your business? How do you make money? Yeah, so I do Google business profiles for local businesses used to be called Google, my business, but basically just helping businesses get found on Google maps.\r\n\r\n\r\nSo  wealth manager clients, all the local services, they all knew Google business profiles, even things like Bitcoin, ATMs, and there's some larger businesses that use it as well. Like. Things you wouldn't think of like Amazon stores and different things. But my bread and butter is local businesses. In general, I charge an annual fee.\r\n\r\n\r\nI started at five grand. Then I went to seven, then 10. Before we get into all the pricing, because Yep. We're going to go down tons of rabbit holes here. Sure. How long have you been doing this business and how did you get into it?  My very first client was a client I was just doing marketing stuff for. And I just said, Hey, how about I just charge you like 300 bucks.\r\n\r\n\r\nI spent three hours on this. And he was the guy, he was my first guy. He went from. 350, 000 to 1. 7 million four years later. And all we did was, yeah, all we did was optimize that. Now, just in the last six months, he's like, Hey, I need you again because other people are starting to do this. But solar installation, no one else optimized near him.\r\n\r\n\r\nHe just,  yeah, I didn't know how well it had worked for him. Until a year later, and then I was like, I was going, holy crap. And that's when I dove into it. And I was like, yeah, this can be a game changer for businesses.  Okay. So is it like a set it and forget it service you do at one time it's changed and you're good to go because if you didn't check in for a year and it grew that much, it doesn't matter. \r\n\r\n\r\nSo in general, I would say no. So this was 2019 and no one had optimized for solar installation. So yeah, nowadays,  did you ever play king of the hill when you were little?  Throw somebody off the top of the hill. And you're trying to get to, I think Google business profiles are like King of the Valley. Like when you get in, it's way hard to get in.\r\n\r\n\r\nSo if in third grade, you have the big chubby guy at the bottom of the valley, it's super hard to get them out. So once you like. You have some kind of preeminence, it is harder to get somebody out. And that's why I think right now, every local business, if they're not already, they should be going all in on this.\r\n\r\n\r\nIt's so much more effective than like SEO or anything else.  Okay. I'm an idiot when it comes to this stuff. So help me understand. I get SEO search engine optimization. I'm writing content. I'm optimizing for keywords, pay per click. I'm paying Google to rank. My search higher, what is the Google business profile?\r\n\r\n\r\nI know that it's a thing, but like, how are you optimizing that? What is it?  It's the panel that is on the right side when you search on Google or on your phone. And so there's four, 14 different things that can pop up for the local business. And so most businesses,  if they do anything, they'll like do a little work one time and then maybe they post on it.\r\n\r\n\r\nOnce or twice a month, but if you're  doing the work well, then that's what shows up like that's showing up before websites,  people can call right off of it like right now, 80 percent of businesses that are contacted local businesses, they're hitting that before they're hitting a website and mostly what they're doing is they're hitting that checking the reviews. \r\n\r\n\r\nClicking on the website to make sure it looks good and then either calling from there or going back and then checking from that.  When you say it's on the right hand side, I just went to Google. I searched soccer stores, Boise,  and then there's three places.  Yup. It's so it says the name of the store reviews, the city when it's open, when it closes in store, pickup, yada, yada.\r\n\r\n\r\nIs that what you're talking about? This is the Google profile. When you say somebody goes on one time, sets it, and then doesn't really mess with it. Like what else is there to update on it?  So just like there are, you know, links for SEO. So there's down there, there's posts  and Google will show only two in search and only for seven days.\r\n\r\n\r\nSo at minimum, if you want to do well, you need to have two posts every week, roughly around the same time. Those can be up to 1500 characters. What does that mean? Posts? I'm sorry.  I know that's stupid on the Google business profile. Like when you're managing it on the backside, there's a thing that says you can do events.\r\n\r\n\r\nYou can just do a regular update. You can have an offer. And so you, when you post on that, it shows up down on that panel. And like I said, two of them will show up in search. And after seven days they drop off of search, but I think it still has an impact. But anyway.  For sure you want to have two every week that are updating and you want those to be semantic keyword rich and then obviously end with a call to action. \r\n\r\n\r\nGive me an example. What post? Let's say I own a soccer store. What would I be posting once or twice a week? Yeah, you'd write in there about, I mean, you might have a local interest story about a team that you sponsored and how they're doing. But then you have, we gave them soccer cleats and soccer jerseys and soccer bags, whatever.\r\n\r\n\r\nLike obviously making it sound good. And then at the bottom. Just human nature. There's a call to action, like  come into the store, call us today, order, order your jerseys, just something that's like, get them off their butt and take action. So you're  at the same time, you're writing for Google and you're writing for the customer. \r\n\r\n\r\nAnd so it'd be easy to repurpose content that you're already doing for SEO.  A hundred percent.  To put on this is the reason that it's become, cause I've seen a lot more posts about it, right? Google my business. Again, I'm using the old school term, but yeah, I've seen a lot of posts on it. Is it because it's just been neglected?\r\n\r\n\r\nLike it's another channel for marketing,  but people have viewed it more as an informational channel as opposed to one that's, they're trying to drive business and people have found creative ways. To now use it as a  business channel to funnel leads is that why it's become more popular? Like, why is it becoming more popular? \r\n\r\n\r\nWell, I think it's becoming more popular because Google has given it more emphasis and it works. So  people that discovered it five, six years ago and we're using it well, we're just cleaning up compared to competitors. So I think it's starting to become, if you're not doing this, you're getting left in the dust where it used to be like, if you're doing this. \r\n\r\n\r\nYou're just killing everyone else, you know? And it's still like that a little bit, honestly, like  people are able to drop a lot of other marketing things if they spend money on this, because it's just pretty powerful. I think it used to be like you wanted your site at the top, right?  And now it's like your profile's showing up. \r\n\r\n\r\nIsn't this just the story with any new marketing channel is like, there are first movers who adopt it. TikTok, for example. The first people who went to TikTok and were marketing their businesses was like, Oh my gosh, these guys are crushing it.  And then everybody sort of saw, Oh, I should be marketing on TikTok.\r\n\r\n\r\nAnd now it's almost table stakes. Like, Hey, you gotta be marketing on there. Otherwise you're going to get left behind.  That the same here, like, is that why it's shifting just because it was a new marketing channel and people weren't paying it enough attention and now they starting, they're starting to. \r\n\r\n\r\nYeah. And I think for different businesses, different things are important to them. Right. So like a lot of DTC brands, maybe we're jumping on Tik TOK clothing, brands, lifestyle, brands, lifestyle coaches, those kinds of things. I think if you're a local business.  And you're not doing Google business. You're just an idiot.\r\n\r\n\r\nOr maybe you just don't know you're an idiot, but you are an idiot, right? Like, because it just, it's almost, most idiots don't know they're idiots to be fair, right? Yes, that's true. That probably what is, what makes them an idiot, but it just, now the hard thing is like, if you don't want to do it yourself, knowing who to trust, right?\r\n\r\n\r\nLike I met a kid. 17 year old, he grabbed five clients for Google business stuff. He like bought a course, he got five clients and I'm looking at what he's, I'm looking at the Google business profiles and I'm like, dude, you need to do this and you need to do this and you need to, and I said, how many of these five clients are you getting like good results for?\r\n\r\n\r\nAnd he's like, well, only one so far. And I was like, Oh my gosh. Like I couldn't sleep at night, you know, like he doesn't even know what he's doing. And I'm like, I was just talking to him. I'm like, maybe we partnered down the road and he does sales and I do the backend for him or something. But I remember,  I was just gonna say, I remember in the 2010s when it was like,  Oh, we're a business and we have no online presence.\r\n\r\n\r\nAnd so people would go and just create them a profile on Google period, or  create them an Instagram or create them a Facebook page, right? Cause just cause they weren't even on the platform. That's what that reminds me of is they didn't need, they didn't even get somebody super technical. It's just somebody who knew how to go and, you know, Create a Facebook page that was then creating this company's Facebook page. \r\n\r\n\r\nSo I think right now it just makes sense. So have any of your businesses been local businesses that you've owned? Yeah. Most of them have been local businesses. We have one right now. It's called Fast Tree Care. It's based in Dallas that we use a lot of. Again, the Google My Business is what I keep. Using, but that's one of the sales channels for us is optimizing that.\r\n\r\n\r\nAnd we work with somebody who has a lot of experience in that space. But even that I knew that we were using it. I just didn't know. I still don't.  I know you've been explaining it to me now for 10 minutes and I'm still like, okay, how exactly does it fit into this world?  Because I look at pictures and it's like, Chris will always send me pictures and I'll be like, A map, and then there'll be a bunch of circles and some of the circles will be green and some of them will be yellow and some of them will be red.\r\n\r\n\r\nAnd I'm like, I don't know what this means. I don't get it. What is that? I think everybody's seen those circles. Why do people focus on that?  So every dot in that or star, whatever the shape is, that is, if you're sitting in that spot with your phone or you're on your computer and you're searching  tree service, tree cutting, whatever the different terms that you're trying to rank for,  green is usually like one to five, like you're ranking one to five and really you want one to three, like if what does that mean?\r\n\r\n\r\nOne to three, you want to be ranking One, two, or three on Google maps for your companies in that space with that keyword. You want to be right. Yeah. Got it. Okay. And if you click down on those grids, you can see your competitors. Like you can see who's doing really well at that and who's not. So it's worth it.\r\n\r\n\r\nIt's worth it to, to spend 30 minutes someday for him to walk you through. Like, okay. Here's your competitor. Here's how they're doing.  Here's who's ranking all over. That's not going to happen.  That's not going to happen. The closest we're going to get is this conversation right here, buddy. You're my last hope.\r\n\r\n\r\nYeah.  So  I'm curious to hear your thoughts because I've, I had a post, the best post I ever had over a million impressions recently that was talking about SEO.  Pay per click and the changes that are happening right now. So Google has introduced  first it was barred. Now it's Gemini. And when you Google things, it's actually answering questions.\r\n\r\n\r\nSo whereas I used to Google,  Hey, what are the, Oh, this is one. I'm trying to set up a camera today and I Googled, how do I get my new Sony camera to connect as a webcam?  Typically in the past, I would get a bunch of web pages either through SEO or paid ads, and they would all have an article or be recommended based on all the things that Google uses in their algorithm now.\r\n\r\n\r\nI got an answer from Google that was like, well, here's what you should do. Here's how you hook it up. Try this X, Y, Z, et cetera, et cetera.  That  I think is going to destroy a lot of businesses that are relying on that traffic  to push to their websites, to then  bring customers into a funnel and sell them on something later.\r\n\r\n\r\nI think it's going to destroy those businesses. And I think it's actually good for Google because now they're going to be able to charge more for pay per click ads as opposed to just SEO. And it introduces this weird dynamic of like, okay, well, who owns that The content creator is a Google cause Google's using that content.\r\n\r\n\r\nNow to answer the questions you got to get up,  but I understand where SEO and I understand where pay per click fall with within that ecosystem. How does this, the Google business profile fall into that space? And is it going to be as impacted as I think SEO is going to be?  So  my thought is no, it's not going to be as impacted because.\r\n\r\n\r\nThose results where you're seeing generative AI results, typically those are a different sort of question. Like how do I install my camera or whatever? Now, if you had put in where's the closest camera shop to me, you're not going to get a generative AI search. You're going to get a local search with camera shops yet.\r\n\r\n\r\nSo yeah, right now, now. Already, like just today, I don't know if you know, at Brad Smith coach on X, but just today I was at his masterclass and he was showing he is the result within the generative AI in like three different places, all of his content and.  Then when you get below the generative AI, he is the first YouTube video under it.\r\n\r\n\r\nAnd so he just did a free masterclass. Is that something,  so it's just something he figured out. Yeah. Is it something he figured out or is it like he was already the most trustworthy site? So Google. Put him in as one of the answers. Now he's gotten to a hundred thousand YouTube subscribers since like last August, he heard about generative AI last summer, it got on his radar and he was like, let me just figure out how to do this.\r\n\r\n\r\nAnd so, so he's gamified it essentially. Yeah. Yeah. And it's what people have done forever for the last 20 years with Google, right? Yeah, for sure. And. So he's just figured out what's going to be next. I think you're absolutely right. There's a lot of these SEO sites that are going to be destroyed, but the next people are going to figure out how to produce content that Google wants.\r\n\r\n\r\nSome of that is just going to be their own AI, but then some of these are going to be trusted resources  they're going to pull in and  YouTube videos are ranking really well, like. He had a whole process today. If you have a podcast, here's how you give it to your team. And all of this content is like, then they have eight different steps where it's like, it's turned into a blog post and then you don't release the video until the blog post is like, just all these different steps that he's got.\r\n\r\n\r\nAnd he's figuring it out. So will you send me that? I'd love to look into some of his stuff. Cause I'm super curious about this.  In particular right now,  do you do any SEO pay per click stuff or are you focused strictly on the Google business profile? Yeah, I just do 100 percent Google business. So obviously in the past, when did you shift to a hundred percent? \r\n\r\n\r\nSorry. So yeah,  yeah, yeah. So after I got that first client, I was like, what the heck, this is amazing. And I just went to one of my friends that's a business owner. And I was like, dude, I'm telling you, give me 3, 500 bucks. You'll be so glad you did a year from now. Like it wasn't even, I wasn't as even a sales pitch.\r\n\r\n\r\nI was just like,  you need to do this. And so for him, I did a little bit more. I learned a little of the tools. I was just doing it on the side for a few years. Like I'd get two or three clients. The next client I was like, dude, Give me nine grand. You need to do this. And  about a little over a year ago, we were with an organization called stop slavery.\r\n\r\n\r\nI knew that was coming to an end and I needed to have a business. So I was like mastermind for entrepreneurs and Google business and all the, and different things  that I've jumped into. Yeah.  Yeah. You just like freaking threw it out there. Like it was nothing. So I was with this organization called stop slavery and we decide like, hold on a second.\r\n\r\n\r\nOkay. You were with an organization called stop. Slavery.  We did  anti human trafficking work in Thailand and Cambodia, primarily a little bit India.  And yeah, so we were, we heard about it in 2009 started this nonprofit. Originally we were just going to raise money and then I was praying about it. I'm a Christian and I felt like, God, you know, you got to stop this.\r\n\r\n\r\nAnd one night I was in Colorado and I just felt like God was like, well, if you wanted to stop, maybe you should do something about it. So long story short, picked up the family. We moved to Thailand. There was basically three areas like prevention, like what we did, investigative work, and then aftercare.\r\n\r\n\r\nAnd we mainly worked with police to bring in investigators, special forces, like Americans, Australians, to do investigative work with the local police. Thai police.  Oh my goodness. How long were you in Thailand?  11 years, 11 and a half years. You're not still in Thailand. Are you? No, I'm in Roanoke, Virginia,  back in America, Roanoke, Virginia. \r\n\r\n\r\nWhat brought you back? Why? Why did you stop the geez Louise? You just opened a freaking can of worms for me. Yeah. So a couple of things. One, I burned out on anti trafficking work after five years, which was not my plan to burn out, but I was like, okay, I'll do this for five years. God, then I'll go back into business. \r\n\r\n\r\nAnd. Kind of burned out. And so I jumped into business. Then I really burned out, lost a quarter million dollars in two escape rooms, one in Chiang Mai, Thailand, one in Siem Reap, Cambodia, amazing rooms, like literally some of the best rooms in the whole world, like we had elevators that you moved by hand and running water and rooms that moved, they were amazing.\r\n\r\n\r\nAnd I was losing 10 grand a month. So that, that kind of hurt. And. Yeah. And so then like  kids were graduating high school and we knew we were going to be moving back to the States. And so we, we landed here in Roanoke, Virginia. And I always like, I actually, we moved to Japan. I did youth ministry for a lot of years on an air base.\r\n\r\n\r\nI thought we were leaving corporate America for two to five years. And then we'd come back and do business. I just two to five turned into 22  and a half.  And so now we're back, finally, 22 and a half years later, back into business.  I got to collect myself. A lot of things in there. You move your whole family.\r\n\r\n\r\nHow many kids do you have? Three. Three.  You move your whole family to Thailand.  I can't even imagine what that's like being a young father with young children and you're helping  trafficking victims  while you're in Thailand, you end up losing a quarter million dollars that you put into these escape rooms  and then obviously you move back to the States.\r\n\r\n\r\nHow did you get your wife comfortable?  With going into business again after you lose a quarter of a million dollars.  Well, we went to a lot of counseling. That's my first thought. Yeah. So  we went to a lot of, well, we, we did like eight sessions of counseling and what we came up with at the end was no, no intermingling of the business and personal finances ever again. \r\n\r\n\r\nAnd so I actually started a school for entrepreneurs. From a couple of investors that I'm actually still paying off. So out of this school that I started called the BAM school, which is what my podcast is, the BAM school podcast. We were looking at different things, like if buying businesses, starting businesses, and I came back to the agency, like this agency after that, because I was like, okay, I have experience.\r\n\r\n\r\nLike I was SEO trained and like. 2010 making money from Google like AdWords way back in the day in 2003. And so I just came back to this cause I knew it and  like customers were happy. And so the wife piece was just like, keep these things separate. And I would say. Probably a hundred times. My wife has said to me, why don't you just get a job?\r\n\r\n\r\nAnd I didn't say this to her, but like in the last three weeks, I've had 54, 000 in contracts and 20 something cash collect. Oh my goodness. And like, that doesn't happen. That doesn't happen if I take a job, right? Like what job could I get as somebody who's spent 20 years overseas where I'm like, Hey,  do you want to pay me 50 grand in three weeks?\r\n\r\n\r\nLike, no, that happens in business. And so that's what I just kept telling her is, listen, our dreams are on the other side of a business  and, uh, my dreams are a little bit bigger than hers. And she's like, well, my dreams could be fulfilled with just a job. And so I'm like, you know, that's it. You are, you're preaching to the choir here, man.\r\n\r\n\r\nThat's, uh, that's my wife. Just very, she can't comprehend why I can't just get a job.  She's like, why are you spending so much time on  Instagram and YouTube and Twitter? Like, why don't you just go get a job? And I'm like, you don't understand. I can't at this point, I can't unsee what I've seen.  Cause I worked in corporate America and now I've owned businesses for the last seven years.\r\n\r\n\r\nLike I can't go back. It's just not going to happen. So, okay. I'm going to have to get you back on for this story. Cause I think it's an amazing. Story in and of itself. I'd love to hear how you launched the human trafficking or excuse me, stopping human trafficking business. Yeah. Launch the human trafficking business.\r\n\r\n\r\nHow did that turn out? I'm going to, I'll let's go back over here. So  how do you make money? Doing the  tell me how to call it. I know it's not Google my business anymore. Is it just Google? Google business profiles? Yeah. Google business. Okay.  What do you charge? You just charge a monthly fee? Do you charge a percentage of whatever business is generated?\r\n\r\n\r\nDo you charge hourly? How do you charge currently?  Yeah. So typically I, I have an annual contract for a client and, and I have a 200 percent ROI guarantee. So it's like profit. So it's like, wow, you will make 200 percent in profit over what you're paying me. Now as I've gotten to higher price points in the last month, I've gone from, or I'd say in the last six weeks, I've gone from like  10 grand to 12 to 15 the last client, which is a lot of, is this a year? \r\n\r\n\r\nA year. Or is this a month? A year.  So 15, 000 a year. And the last client is 24, 000. So 2, 000 a month. So they were like, can we do a month? You know, then it's starting to get harder to collect everything up front. So some of these people, yeah, I'm just going, okay, let's do two grand a month. Cause that, that starts to be a big risk, like 10 grand.\r\n\r\n\r\nIt's like, okay.  But for some of these businesses to throw out 20, they're like, ouch, that, that hurts a little bit. Let's see. So thankfully it's like.  I was just going to say, for somebody like you who has experience, and if somebody's listening that has experience in this space,  what does the workload look like for you on the backend?\r\n\r\n\r\nAll right. You charge somebody 20, 000 for the year. Obviously the more money you charge, the more work you're going to be doing. Is it just you? Do you have a team on the backend? How are you doing the fulfillment?  So originally, about a year ago when I jumped into this, the dream was just outsource everything to some  white label company, you know?\r\n\r\n\r\nAnd some people that I'd been following for years. I tried multiple  people. I'd give them one of my accounts and be like, okay, let's see how they do. I just tried again like two months ago, and in the end I just had to do it all in-house. And right now I have one person. That works for me full time out of Latin America and probably soon another person.\r\n\r\n\r\nLike we're getting our systems and processes down a lot better. So yeah, right now it's just two of us and there's a lot of work. Like, especially the first few weeks of onboarding a client,  but  right, right now I've spent 10 days in the last three weeks in these three weeks. When I brought all these people on.\r\n\r\n\r\nI've also been gone 10 days cause I now have somebody that I can just check in in the morning and go, Hey, is this getting done? This getting done. And so it's been a game changer. Like how you've hired probably from overseas for some of your stuff.  How do you currently acquire customers? Is it all word of mouth? \r\n\r\n\r\nAre you  doing cold outreach? What's the process for that? I tried one week of cold outreach. I hired a guy to do it. That didn't go so well  so far. Literally I've had. Just about all my clients have come from word of mouth and referrals like, Hey, this, the first client I got was a coworking space  and I told the lady, I said, Hey, I need a desk.\r\n\r\n\r\nWe were doing work on this house, so I had to get out and I just said, Hey, I need a desk. I see you have seven empty desks.  I'm happy to pay for one, but if you want, I'll fill up the rest of your desks.  And. And I said, if I don't fill them up in two, that's kind of cool. Kick me out. So I've left the place. I still do work for her because now she's a big cheerleader.\r\n\r\n\r\nShe got me my next three clients. She was like, Hey buddy, filled out my place in two months. That's right.  The one guy was in there. And he saw it fill up and now he's the number one wealth manager ranking on Google all across Roanoke. Is that your niche?  I do everyone. Okay. About three months ago, my wife said, Hey, do you do this stuff you do for other people for yourself?\r\n\r\n\r\nAnd I was like, eh, people aren't really searching for that. But I was like, I might as well. Doesn't hurt. And so  about a month in of doing my own, I just saw my own stats.  I got three desktop searches in April, 120 in May and picked up my first client just from doing my own stuff in May. I picked up a lawyer at like, you know, I forget what it was,  15 grand for the year or something.\r\n\r\n\r\nThat was going to be my question. As I always find it interesting, people who have these agency businesses, Yeah. To ask them where they got their business from. Cause you would think if you're going out and selling these services.  You should be using those services to go and acquire customers. So that's cool that,  yeah.\r\n\r\n\r\nUh, you, you've actually started doing it and took me a  Yeah, it took me a year that I was like, I get it. Yeah. Okay. I'll do it for myself. And now I wish I had done it sooner 'cause I was like, oh, people don't know to look for Google Business profile. And actually they didn't. They've searched. SEO and I just came up, I actually came up number two.\r\n\r\n\r\nYeah. In my city. But I wasn't even,  I wasn't optimizing for it. Now I am. Next month I'll be number one. So now you are.  That's awesome, man. All right. Well, let's end this with some rapid fire questions. You ready? Let's do it. I'm ready.  What do you love about this business? I love that my clients are super happy and that now a few years in, I figured out a way that I can do the business that I'm happy as well. \r\n\r\n\r\nAwesome.  What do you hate about it? Probably figuring out how to get new clients.  This is going to be an interesting question because you've had quite the past.  All of us suffer from a grass is greener.  Real estate guys like business guys, business guys are jealous of real estate guys, whatever,  as you sit here today in 2024,  what businesses or what industries are you the most jealous of? \r\n\r\n\r\nPeople that run catamaran chartering companies out of BVI or St. Martin's talk to a guy that he has a 3 million boat of his own, and then he has a bunch of other boats that he's chartering as well. So that'd be mine.  Okay.  What are you obsessed with right now? Like if you have two hours in your day and there's nothing scheduled,  What are you doing with those two hours right now? \r\n\r\n\r\nI'm trying to implement it. And so learning right now, what do I need to implement to get new clients and customers and create systems? So things that I've been reading about for 20 years now, I'm like, how do I do this?  Systematizing. Awesome. All right. Last question. What advice would you give yourself 10 years ago?\r\n\r\n\r\nNot somebody in your shoes. You,  what would you give buddy? What advice would you give buddy 10 years ago? I think pick one idea and go for it. I think of an idea that I was working on in 2011 that I chucked too soon. Pick one idea, go hard after it.  What was the idea?  It was local lead gen sites, which I don't really like.\r\n\r\n\r\nThey're a little bit  parasitic in my estimation, but it was something that if I had stuck to would have. You know, it would have done well as a business. \r\n\r\n\r\nWell, buddy, this was a, this was awesome. Where can people find you if they want to come look for you? Yeah. Yeah. Map winners is my site. Map winners. com. I'm on Twitter at buddy seven,  and I'm the only buddy Rathmell in the world. So if you Google me, you'll find me.  Awesome. Well, this was great. We'll see you around. \r\n\r\n\r\nAll right. Thanks, Nick. Great being on the pod.  You know, buddy said something in there that has stuck with me since we spoke and you may or may not have heard it, but. For me, I've been thinking a lot about this.  It was around the time that his wife asked him, Hey, if this Google, my business stuff works so well, why don't we use it on our own business?\r\n\r\n\r\nAnd he had this sort of self reflect and think about, yeah, why, why am I not using it? And as he started to use it, he's seen a lot of success from that.  But as entrepreneurs, it's really easy for us to get lost in the weeds. We're so concerned with how we're building, what we're building, what the next step is, what the next goal is like, when are we going to reach the next level that many times it's hard to see the forest through the trees.\r\n\r\n\r\nAnd for buddy, he's lucky he had his wife. And for many of us, there are partners in our lives. They could be business partners. They could be wives, spouses. They could be friends, but many times these individuals, they don't have the same level of detailed knowledge as we do.  And so it's very easy for them to ask the painfully obvious question. \r\n\r\n\r\nAnd if you've never experienced this, I promise you will someday,  but there comes a moment where you're explaining to someone all your frustrations. And then they ask you, well, what's wrong?  Why are you doing that? Why aren't you doing this?  And just the way that they're phrasing it, it's not a novel idea,  but you just kick yourself.\r\n\r\n\r\nLike, how could I have been so stupid not to see this idea?  But the truth is you can't, you can't see it because you are so committed to what you're doing that to pull back and take a broad inventory of what you're doing is near impossible. And so we need these individuals in our lives that can ask the painfully obvious questions.\r\n\r\n\r\nBecause I have found that in answering the painfully obvious questions.  I've seen some of the greatest successes in business and in my personal life.  So I would encourage you and I'm reminded for myself, I need to find more time  in my weeks or months to really think about why am I doing what I'm doing  and to try and elicit the painfully obvious questions. \r\n\r\n\r\nBecause those are the opportunities. Those are the nuggets  that can change.  Our entire lives. So I hope you enjoyed this episode. Please do me a favor. If you've made it to the end of this episode, you're probably one of those individuals who either just left it on because you're doing yard work or you're actually committed to following this podcast.\r\n\r\n\r\nCan you go to Apple or Spotify and just leave me a review, preferably five star, but I'm trying my best to get as much out there about the show. And obviously the more reviews that we have, the better it looks, the more reputable it is. And the more people I'm able to reach. So I would really appreciate that.\r\n\r\n\r\nAnd remember, there's no such thing as a dumb question. There's only dumb people unwilling to ask the dumb questions. I'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-07-12",
    "platform_source": "Google Drive"
  }
}