{
  "episode_number": "104",
  "episode_title": "Why a Talent Partner is Key to Your Company's Growth with Kelie Morgan",
  "guest_name": "Kelie Morgan",
  "business_name": "10th Street Talent",
  "transcript": "﻿Nikolas Hulewsky (00:00.13)\r\nlooks even better. Holy crap, that looks good.\r\n\r\n\r\nKelie (00:01.814)\r\nIt's gigantic, I know. And this cropped in screen doesn't get our signed BYU football, which is one of our family's prized possessions. it does now? Okay.\r\n\r\n\r\nNikolas Hulewsky (00:12.576)\r\nIt does for me it does now because usually it's side by side. But if you look at the screen, you can click on the expand frame and now I have you expanded so that I can see you while we talk. Well, Kelly, very excited to have you. Okay, so let's hop into this. Why don't you give me the 30 second one minute elevator pitch on what your company does.\r\n\r\n\r\nKelie (00:36.834)\r\nAlright, 32nd elevator pitch. So, 10th Street Talent. We are an executive recruiting firm and I actually consider ourselves more as talent partners than executive recruiting. sometimes I think recruiting gets known for being a service provider. You kind of like know the job you need to hire and you go to them. They find the person. It's very transactional. It's an external service partner.\r\n\r\n\r\nWe're more of an internal talent partner in the way that we do our search, build our materials, collaborate with our clients. And that's just because of the nature of being built and growing up inside permanent equity as the talent partner for permanent equity. And so we kind of built the firm around that model. And so, yeah, I would say it's talent partner meets executive search.\r\n\r\n\r\nNikolas Hulewsky (01:31.086)\r\nSo you're looking for executives within companies, like not necessarily just the CEO, but anybody who's either C level or just manager or like, where's the cutoff?\r\n\r\n\r\nKelie (01:42.764)\r\nYeah, so in small and medium businesses, think you're probably aware, your audience is probably very aware that sometimes the org chart gets pretty messy and it's not necessarily C level and then VP level and then director level. So we really focus on functional area leaders, whatever the title is. So whoever is leading your accounting and finance function, whoever is leading your marketing function. So we're hiring\r\n\r\n\r\nmarketing managers, all the way to CMOs, we're hiring directors of operations, VPs of operations. it's really, particularly as we started in the permanent equity portfolio, we were taking on any hires that we felt like were directly tied to, you know, culture, team, people, growth. Those are hires that we wanted to be a part of.\r\n\r\n\r\nNikolas Hulewsky (02:35.714)\r\nSo I'm really excited to have you because I love entrepreneurship. I think there's a million ways to make a million dollars. That's like a, you know, kind of a trite saying, but it's true. And I know a lot of people who have worked at large companies that have had stock vest that have become millionaires or become, you know, financially wealthy, whether it's you think of Google or just any other privately held company. But the thing I love about what you're doing is you worked at permanent equity.\r\n\r\n\r\nAnd now you've spun out 10th Street talent. So it's not just that you've earned equity within permanent equity. You've also now spun out a company and are starting a company. Talk a little bit about the Genesis. Like, how did it start?\r\n\r\n\r\nKelie (03:22.318)\r\nYeah, so I started with permanent equity, I guess, six and a half years ago now. And the genesis was really that we needed to solve a problem. And the problem was around talent for our portfolio companies. We wanted to get better talent into our portfolio companies. We wanted to do a better job of developing that talent. At that time, we had, you know, we were producing content. Content has always been kind of a core.\r\n\r\n\r\npillar of permanent equity. So we were having people come inbound saying, you hey, we love what you're doing. We're interested in working with you. We weren't doing anything with those people. So we needed to just get better all around at how we were curating our talent pool, what we were doing with them, how we were finding and placing talent into the portfolio companies. So that was the problem to solve when I came on. And so I went to work trying to solve it.\r\n\r\n\r\nInitially, early days, we were partnering with outside search firms on some of our searches and were really disappointed in what that partnership looked like. We were disappointed in their understanding of the lower middle market. And so we kind of have a core philosophy that's like, do more of what works and less of what doesn't work. And so to us, it just felt like that didn't work. And so I pitched Brent the idea. I basically just said,\r\n\r\n\r\nhey, I think I can build something better than we're getting out in the market. And he was like, okay, cool, let's do it. And so we just went to work building something internally and it was a lot of reps, a lot of iteration that allowed us to kind of try and fail. And the cool thing about building it internally with our own companies, running the searches on those is that we had really tight feedback loops, right? Like we knew we placed a person.\r\n\r\n\r\nAnd we knew within four weeks, six weeks, eight weeks, if that person was going to be successful, if it was a good placement. so through some trial and error and through those tight feedback loops, we were able to really hone our process and develop a process. Along the way, we got a lot of, sorry, I can stop at any point if I'm going too much. Yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (05:35.79)\r\nNo, no, no, no, no, no. I just, this is my fault because you know, you're dropping gold here and there's like every 30 seconds I'm like, I want to ask about that. And so it's my own fault. It's my own ADHD. So, one of the really cool frameworks that I've heard that I really like is if you're looking to either start a new business, like, so let's say you're operating a business. One of the ways that you start that business is you look at your own P and L and you say, where are my cost centers? Right. So one of the cost centers,\r\n\r\n\r\nKelie (05:42.766)\r\nOkay, I'll pause.\r\n\r\n\r\nNikolas Hulewsky (06:05.132)\r\nin this example would be recruiting outside recruiting. And sort of that's how you came up. And it was a logical conclusion for Brent to turn to you, right? Because you're an MBA, you've got 17 years of corporate experience and you've started seven businesses, right?\r\n\r\n\r\nKelie (06:22.024)\r\nfalse, false and false.\r\n\r\n\r\nNikolas Hulewsky (06:26.232)\r\nNo, this is what I love. Like your story is so freaking cool. So how did you even get with permanent equity in the first place? I think Brent is a very good collector of people. I had Emily Holdman on and like her story of how she got on with permanent equity was fascinating. Tell me yours.\r\n\r\n\r\nKelie (06:42.316)\r\nYeah, so I think describing Brent as a collector of people is a correct kind of moniker, if you will. I always say he has a spidey sense about people. Sometimes I'll send him a message that just says, hey, I you to spend 15 minutes with this person, deploy your spidey sense. know, like, that's all I need. I 15 minutes, I need your spidey sense, like, and then we can move on. But yeah, so.\r\n\r\n\r\nNikolas Hulewsky (07:05.996)\r\nI love that.\r\n\r\n\r\nKelie (07:09.614)\r\nI'll give you a little bit, speaking of Spidey sense, I'll give you little bit of my origin story, my superhero origin story here.\r\n\r\n\r\nNikolas Hulewsky (07:17.23)\r\nHey, as a lit major, as an English lit, that was beautiful prose. I don't, or I don't even know what I'm supposed to say. That was beautiful alliteration there. Keep going.\r\n\r\n\r\nKelie (07:22.728)\r\nHa ha ha ha ha.\r\n\r\n\r\nokay, all right, good. So I graduated from college. I had kids very young. So I had my first daughter when I was 21, my second daughter when I was 23. So my career was flipped. I didn't go college to career. I went college to motherhood. so English Lit, yep, English Lit major.\r\n\r\n\r\nNikolas Hulewsky (07:46.52)\r\nTell me your major.\r\n\r\n\r\nOkay, you're an English Lit major, mother, very young.\r\n\r\n\r\nKelie (07:53.482)\r\nMother very young, my daughter I had when I was a senior in college and so I brought her around to class in like a baby Bjorn with me and it was just, know, like that was the life, you know, just made it happen.\r\n\r\n\r\nNikolas Hulewsky (08:05.902)\r\nAnd for those who don't know, she went to BYU. So that was like, they were like, you're you're just now bringing your baby around as a senior. Like that was that was nothing.\r\n\r\n\r\nKelie (08:12.428)\r\nRight. It was not uncommon. It was not uncommon. So yeah, was me and other people had our kids in class with us. So it was not, I was working as a graphic designer at BYU Broadcasting. I brought her into work with me. She played on the floor next to my desk. Like it was just very kid friendly. So.\r\n\r\n\r\nNikolas Hulewsky (08:21.24)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (08:33.524)\r\nWait, when were you broadcasting?\r\n\r\n\r\nKelie (08:36.084)\r\nIt would have been in 2004.\r\n\r\n\r\nNikolas Hulewsky (08:39.118)\r\nOkay, this was, did I, I told you my brother was the COO of BYUtv?\r\n\r\n\r\nKelie (08:45.198)\r\nI feel like maybe you did, but, you know, I don't remember.\r\n\r\n\r\nNikolas Hulewsky (08:46.966)\r\nHey, yeah, he literally just left there to start his own production company. He and his wife have been in the entertainment industry for anyways. Sorry, that was weird. Yeah.\r\n\r\n\r\nKelie (08:55.65)\r\nVery cool. Yeah, that was a fun time. I was doing their graphic design for a lot of their print publications and stuff. At that time, they were sending out a lot of print. Like we were sending out print TV guide directories to their like membership base and stuff, which just seems so funny right now. I mean, maybe they still do it. Who knows? But anyway, so.\r\n\r\n\r\nI did all of that to say I did motherhood first, right? So was a stay at home mom for about seven years until my youngest got into school. And then I had started working part-time at a local family owned fitness center. So founded in 1982, classic family business doing about probably 10 to 15 million in revenue. I started working there.\r\n\r\n\r\nNikolas Hulewsky (09:45.012)\r\nthey were good price. Yeah.\r\n\r\n\r\nKelie (09:46.316)\r\nYeah, I mean, legit, yeah, they had four locations. They had a tennis club, a beach club. So yeah, it was not just kind of your local Planet Fitness location or something like that, you know? And so I started working there as a group fitness instructor, very part-time, few classes a week. And that, as my girls got older, that started expanding into, then I was doing personal training, then I was running small groups.\r\n\r\n\r\nNikolas Hulewsky (09:57.954)\r\nRight, right.\r\n\r\n\r\nKelie (10:15.954)\r\ntraining classes. Then I was designing my own bootcamp program and training coaches, how to run this bootcamp program. And then, eventually around the time my girls were both in school, they asked me to come on, as a director to their leadership team and really oversee those areas that I had sort of been working in the last five to seven years. And so, I joined the leadership team at this club and was there for several years.\r\n\r\n\r\nNikolas Hulewsky (10:27.726)\r\nyou\r\n\r\n\r\nKelie (10:45.366)\r\nyou know, over a group.\r\n\r\n\r\nNikolas Hulewsky (10:45.528)\r\nWait, wait, wait, wait, wait. You were working there as the fitness instructor or the 90 day challenge, you get your body in shape for five to seven years before you got put into that role.\r\n\r\n\r\nKelie (10:54.497)\r\nYep. Yeah.\r\n\r\n\r\nYeah, so I started there when my youngest was like six months old. I started teaching step aerobics classes. And so while they were kids, while they were not in school, I just stayed part time. But I was doing all of these different things. And then as soon as they went to school full time, the owner approached me and offered me a position on the leadership team and to come on full time. there's salary positions and fitness are really rare. It's just it's like\r\n\r\n\r\nThere's very few, most people who are in fitness, particularly like at a club or a chain of clubs, it's a very part-time career, right? Your personal training or you're doing some group fitness, but it's not a salaried career or anything. I felt...\r\n\r\n\r\nNikolas Hulewsky (11:35.854)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (11:41.848)\r\nAnd what was the leadership role they asked you to step into?\r\n\r\n\r\nKelie (11:45.206)\r\nit was called director of fitness. so it was over, you know, we were, departments were personal training, small group training, boot camps, group fitness, really all these revenue streams that were apart from membership. So membership kind of like pays the bills, right? But then all of these other revenue streams are actually like where the margin is. yeah.\r\n\r\n\r\nNikolas Hulewsky (12:09.166)\r\nInteresting. You know, I'll share, I'm going to share a quick story because we're about to get into like the real business of it. But my wife, one time, so we go to the gym frequently and we have a, we have a membership. And one time a few years ago, my wife was like, you should come to my body pump class. And I was like, body pump. These ladies are in there like five, six. I'm like, okay, how hard, you know, I'd been like putting it off. And so finally I go, I don't remember what the reason was, but I like, I ended up going to the body pump class.\r\n\r\n\r\nI could not hang. I could not hang and like afterwards she's like, Yeah, it's your cardio dude. It's like you're just out there lifting weights or and I'm not big or anything like that. But anyways, those classes are freaking legit. Okay, I just want to say\r\n\r\n\r\nKelie (12:49.994)\r\nWell, they're legit. And funny you should say, but that was the line of programs I was certified in. So I had a body step, a body pump. I had like eight different certifications through that program. Then I went on and got my yoga certification. Then I morphed into CrossFit. So then I was doing CrossFit. But yeah, I've been all over the map in terms of group fitness in varying degrees. Yeah.\r\n\r\n\r\nNikolas Hulewsky (13:00.898)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (13:16.696)\r\nOkay, so they bring you in and they're like, want you in the leadership team and what did that mean? What were you doing?\r\n\r\n\r\nKelie (13:22.19)\r\nThat meant basically I was responsible for those areas. So it was hiring, it was development, was like program creation. So I was like writing all of the programming for our boot camps. At that point we were bringing on the boot camp model as a monthly subscription. So you added it to your membership for a certain set fee a month. And so it was, you we needed that programming, we needed that coaching team developed.\r\n\r\n\r\nAnd so all told, was about 120 people that I was responsible for. Interesting work environment though, because they're mostly part-time employees in that setting and there's high degree of turnover. And so you're always having to be bringing new people in. So that's actually where this was the long story to tell you that that's where I met Brent's wife, Erica. She was a fitness instructor. So she teaches body pump.\r\n\r\n\r\nand she teaches spinning and some other classes. So I met Erica there and came to know Brent sort of socially through her. And it was in 2017, one day she kind of came in to my office or I may have been at the front desk, I can't remember. She came up to me and was like, hey, I think you should talk to Brent. Like he's kind of doing something, he's building something here and he needs some like just.\r\n\r\n\r\nreally operationally like well-rounded people to come and join the team. And I was like, what's he doing? Like I really didn't know what he did. I had no idea what he did. And so she explained it to me and I listened and I thought, okay, so he's like Mark Cuban from Shark Tank. So that was my first thought. I was like, okay, he's like Mark Cuban. I love Shark Tank. I watched Shark Tank. I know exactly what you're talking about. And\r\n\r\n\r\nSo anyway, then I met with Brent and it was over the course of really like maybe eight or 10 months where we had conversations and really it was kind of a honing of me being like, what exactly do you need me to do here? Like, what's the job? And him kind of being like, I don't know what the job is, but I just know we need good people, know, hardworking.\r\n\r\n\r\nNikolas Hulewsky (15:36.664)\r\nSo what was... I get why you would say yes, because it's like, you probably had a relationship with his wife, friends. She's like, I think you should talk to my husband. You're like, okay, Mark Cuban, whatever. Yeah, I guess I'll take the conversation because we're friends. Why did Brent take that conversation? I think that to me, that's very interesting.\r\n\r\n\r\nKelie (15:57.486)\r\nSo I think he knew a few things about me. He didn't know much about me. And he actually told me this at one point. He didn't know much about me, but what he did know is that I'm really hardworking and that I have really high integrity. So those were two things that he knew through Erica, through our experiences together, and that were really, really important to him. And so this was in 2017. He was fundraising the first fund in 2017.\r\n\r\n\r\nNikolas Hulewsky (16:23.63)\r\ngoing to say this is before permanent equity is what it is today. They were a small, I mean small is a relative word, but they owned their own companies and then they ended up raising a fund and buying companies with that fund and that was at the time he brought you in.\r\n\r\n\r\nKelie (16:37.454)\r\nYep, this was the fundraise. so there were about four companies kind of in a hold co at that point that were direct owned and acquired by Brent. And then 2017, the fund was raised. And so that's when our conversation started. That was also the same time when him and Patrick O'Shaughnessy were starting to talk about this like capital camp idea and what this event capital camp could be. So there was a lot of kind of irons in the fire in terms of things that were building.\r\n\r\n\r\nand he needed someone to come in that was a builder. And I think he had seen that at the fitness centers I was at, I was a builder, I built programs, I developed new revenue streams. And so I think it was just a combination of like, know she works hard and I know she has a builder mentality and like, we've got a lot of building to do here.\r\n\r\n\r\nNikolas Hulewsky (17:28.83)\r\nI just want to tie this in a bow because this is one of my favorite things. I'm a poor man's, sure, but I collect people as well. I just like when I see somebody who, it doesn't matter to me what their pedigree is, if I see them and I'm like, they're hard worker, or they're smart, or they're resourceful, or whatever it is, I just like to keep them in my orbit because I don't ever know what kinds of opportunities are going to pop up.\r\n\r\n\r\nKelie (17:39.33)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (17:57.218)\r\nand it has served me really well. think of someone we brought onto our billing team, Christy, who's probably gonna listen to this right now, freaking phenomenal, Sarah, who is somebody I brought onto my home health and hospice team is now a business office manager, was just doing a very low level job before that, that have just blossomed into these roles. And it's not just about the pedigree, you've gotta be good about finding people who are also your humans, like your tribe that-\r\n\r\n\r\nthat really connect with you but are going to just figure stuff out. you're like, I mean, you had two kids in college and then you're a part-time fitness instructor. You're just like making it happen. You get into this leadership role. Like it's pretty apparent pretty quickly. It's like, yeah, Kelly just figured stuff out and kudos to him for it would seem like a risk, but kudos to him for continuing that conversation. So I love it.\r\n\r\n\r\nKelie (18:50.734)\r\nAnd I think one of the things I love about Brent and just permanent equity in general is that we very much have this mentality of kind of trying to figure out what people's highest and best use is. We call it highest and best use. And so when I started, I was doing a lot of different things. Like I was really involved in Capital Camp the first year and I was really involved in kind of developing our talent network and\r\n\r\n\r\nWe weren't doing a ton of hiring. So the little bit of hiring in the port co we were doing at that time, I was overseeing. But like I said, we were partnering with executive search. So the first year was really like exploratory. was like, let's have Kelly do these 10 different things. And then I remember sitting down with Brent and him being like, okay, what are you doing that you love? What are you doing that you feel like you're really like good at? And we just started like\r\n\r\n\r\ncutting stuff off of my plate and letting me shift more and more and more into fully the talent side of things.\r\n\r\n\r\nNikolas Hulewsky (19:50.552)\r\nYeah. And when you're when you're building something and when you're in that scaling mode, you need people like you, Emily around who are just utility players, right? Like you're you're fantastic. You can kind of get anything done because there's so much going on as you get older and more mature. That's when you start getting special specialists to come in. You're like, you're playing this role, you're playing this role. But in that scaling phase and that growth phase, which I love, you've got to have people around you that can just figure stuff out. Otherwise, you're you.\r\n\r\n\r\nas the whatever CEO founder are doing way too much work. Tell me, when did the idea of 10th Street come about? So you're working with Brent, you're kind of whittling down your role. When was the first conversation of like, we should do this for other people.\r\n\r\n\r\nKelie (20:38.83)\r\nYeah, so it wasn't called 10th Street back in those early days, but it was an idea in the back of our heads because we, Capital Camp, which is now rebranded to be called Scratch Made Events, but they had done a similar journey, Like Clayton had built this event company that was now starting to take on outside clients. so,\r\n\r\n\r\nNikolas Hulewsky (20:50.22)\r\nyou\r\n\r\n\r\nKelie (21:03.65)\r\nI would say probably around 2022 in the back of my mind, I'm thinking like, okay, this is the path for our internal agency. This is the path that we can go. Yeah, yeah, would say yeah, capital camp and what Clayton did there was the first spin out. Yeah, get it out. Here we go. Double C alliteration, that's hard.\r\n\r\n\r\nNikolas Hulewsky (21:13.026)\r\nWas Clayton the first? Kind of spin out.\r\n\r\n\r\nNikolas Hulewsky (21:21.006)\r\nYou can do it.\r\n\r\n\r\nNikolas Hulewsky (21:26.424)\r\nCollapidal clink.\r\n\r\n\r\nKelie (21:30.166)\r\nLet's just call it Scratch Made. Much easier, that's its new name. So yeah, let's call it that.\r\n\r\n\r\nNikolas Hulewsky (21:32.334)\r\nClayton capital camp doesn't flow off the tongue.\r\n\r\n\r\nKelie (21:37.428)\r\nNo, it's terrible. Yeah, so Clayton had done it. It's like he kind of paved the way to say that this is possible. Although in 2002, they hadn't fully spun out yet, but it was kind of in the works to do that. And they were starting, I think they were starting to pick up some events for David Senra, maybe in 2023. And so that was in the works for us and we were already getting interest.\r\n\r\n\r\nThat's why I say like we just want to do more of what works and more of what kind of feels like people are asking us to do. So we were getting people that would come in asking me or asking Brent or asking Mark, Hey, can Kelly run a search for us? You know, we're a $5 million, you know, search fund acquisition and we need to hire a general manager, but no big search firms are going to.\r\n\r\n\r\nNikolas Hulewsky (22:27.886)\r\nOkay.\r\n\r\n\r\nKelie (22:30.658)\r\ntake on a GM search for a $5 million company. They're just not. There's no one in the space that's interested in that.\r\n\r\n\r\nNikolas Hulewsky (22:37.068)\r\nnor do they really understand that role, right? If they're big, they're gonna understand like, big corporate VP, got it, I'm gonna go for that person. Those people are not successful in the SMB space.\r\n\r\n\r\nKelie (22:39.936)\r\nExactly. Yeah.\r\n\r\n\r\nKelie (22:44.799)\r\nGot it.\r\n\r\n\r\nKelie (22:49.375)\r\nExactly. So we saw the need and it was actually the first year at Main Street Summit, which I think you were at. You were at year one, Main Street Summit, right?\r\n\r\n\r\nNikolas Hulewsky (22:58.146)\r\ndid not know it was year one, but yes, I was there. I was there.\r\n\r\n\r\nKelie (23:00.94)\r\nYes, in the inaugural Main Street Summit, we were...\r\n\r\n\r\nNikolas Hulewsky (23:03.18)\r\nI'm waiting. I'm waiting for like a founders Main Street, just something to denote that I'm one of the original attendees, one of the one of the 10,000 original attendees, you know.\r\n\r\n\r\nKelie (23:09.358)\r\nand OG, yeah.\r\n\r\n\r\nYeah, it's coming. I'm sure Clayton's team, they're always high touch like that. You're gonna get something. But yeah, so that first year at Main Street Summit, the conversations were just plentiful of people that were like, we need this search, can Kelly run this search? And so at the end of Main Street Summit, Mark and I just looked at each other and we're kind of like, this is the time, let's do it. And that was, I guess that was November of 23.\r\n\r\n\r\nAnd so January of this year, we officially like created the LLC and kind of went to work trying to be professionals about standing it up officially came up with the name 10th street talent for people that don't know all of permanent equities campus is on 10th street in downtown Columbia. So that's the relevance there and kind of a also kind of a nod to small main street business.\r\n\r\n\r\nNikolas Hulewsky (23:42.958)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (24:05.102)\r\nI do love the name. And personally, I'm a big believer in meaningful names. I've had partners in the past who are not big believers in meaningful names. They're like, well, let's just name it anything or let's just name it Huluski Enterprises. Like, no, want it to mean something. So I do love the name. How big was your team before you spun out? So you were doing all the internal executive recruiting for the permanent equity portfolio companies. Can you give me an idea of like how many placements that was a year or how many companies you were working with?\r\n\r\n\r\nKelie (24:17.134)\r\nRight.\r\n\r\n\r\nKelie (24:32.066)\r\nYeah, so the permanent equity portfolio at that time was maybe around 14 portfolio companies. We had actually done a couple external searches that I will call like friends of the firm searches. So we've done a couple placements for good friends of Brent's who he was like, hey, we're going to do them a favor. You can work on this search type of the thing. But at that point it was just me and I had actually hired\r\n\r\n\r\nNikolas Hulewsky (24:46.241)\r\ncool.\r\n\r\n\r\nKelie (24:57.866)\r\nmy first overseas employee out of the Philippines to help me with kind of research and some of the sourcing side of things. That's a whole other podcast.\r\n\r\n\r\nNikolas Hulewsky (25:05.632)\r\nOverseas talent?\r\n\r\n\r\nNikolas Hulewsky (25:10.998)\r\nmy gosh, this is great content. need to tweet about this. You will get so many eyeballs.\r\n\r\n\r\nKelie (25:15.97)\r\nI'm gonna get, my huge follower count of 700 will increase to 710.\r\n\r\n\r\nNikolas Hulewsky (25:22.702)\r\nKelly, that's a very good improvement, okay? That's a very good improvement. Okay. So you just had a VA at that time.\r\n\r\n\r\nKelie (25:26.254)\r\nAll right, yeah, I'm not gonna knock it.\r\n\r\n\r\nKelie (25:32.578)\r\nYeah, had a, yeah, essentially we'll call it a VA. It was just somebody that was helping to magnify my time to do. We were running, I would say like 16 to 17 searches a year that was pretty much just me and they were all for the permanent equity portfolio at that point.\r\n\r\n\r\nNikolas Hulewsky (25:48.878)\r\nSo this is gonna be a quick squirrel, hopefully a quick squirrel. I just hired my first virtual assistant in the last year. That's not true. I've hired virtual assistants over the years and like within the first week I'm like, I can't do it, I'm out, right? It was just, it's hard when you're dealing with two different things, you're dealing with time zone and cultural differences. So you're like having to get them up to speed because there's a language barrier potentially and.\r\n\r\n\r\nthere's a time lag. It's like, okay, seven hours later, they respond to an issue. So I just didn't want to put the time and energy into solving that. But then in the last year, I hired my executive assistant, Kelly, who's amazing. She's actually British. So for me, it was like, cool, I don't have the cultural dynamic there, but there is the time difference. And it took a lot of work to systematize things. it takes a lot of work to get them to be successful. Because like the reason they weren't successful wasn't their fault, it was my fault, right? I didn't set them up for success.\r\n\r\n\r\nDo you still use outs like VAs or is everybody internal?\r\n\r\n\r\nKelie (26:52.128)\r\nNo, so I still have that same VA. She does all of our kind of just back office operations. You know, she does sourcing for us. She does. And I'm getting ready to add more to that team as well. So, but you're exactly right. Like your process has to be crisp and documented for that to be successful. And so that was a learning curve for me to say, and it's actually been the first step of what I'll say.\r\n\r\n\r\nhas been several other steps that I've taken this year to actually kind of document and create systems around this process that heretofore had just been like my own brain child, you know.\r\n\r\n\r\nNikolas Hulewsky (27:28.75)\r\nYep. Yeah, I and I, it's a forcing function, right? Like it forces you to figure out, okay, how do I do this? What's the next step? And to be clear about it, like to clarify it, because you're not just handing it off to somebody who's sitting next to you that can just look over your shoulder and be like, that's how she sends. that's what she does. that's the next thing. You're sending it to someone again, who has the cultural difference and the time difference. So you've got to be very clear. And that's where I think a lot of people mess up is they're like, VA is a lot cheaper.\r\n\r\n\r\nAnd then they think, the quality sucks. The VA doesn't know what they're doing. they can't speak English. It's like 99 % of the time, that's not the issue. The issue is you as the entrepreneur didn't set them up for success. Like you've got to spend time in actually clarifying what you do. Anyways, sorry, that was my quick aside because I think a lot of people want, they want VA's. They think it sounds like really cool, but then they don't know how to execute it at a high level. And that's when you've really got to be clear about your systems and processes when handing off.\r\n\r\n\r\nKelie (28:29.1)\r\nYep. And I think for someone who's trying to go from a solopreneur to an actual company, like it's such a painful process at some points to document and kind of create these things, but it's the only way that you'll be able to scale the business beyond yourself. And in professional services, this is the challenge. This is the bottleneck to the business in professional services is expanding and scaling beyond the principle.\r\n\r\n\r\nLike it's just really, it's hard.\r\n\r\n\r\nNikolas Hulewsky (28:59.426)\r\nYeah, that's very true. Can I, I want to make a suggestion for you. You probably already thought of this, but just pretend like you haven't and then make me feel good about myself. If you're not already doing it, you need to offer recruiting services like placing VAs with executives because have you guys thought about that?\r\n\r\n\r\nKelie (29:09.006)\r\nOkay, yeah, I'll do it.\r\n\r\n\r\nKelie (29:24.35)\r\nNo, and the only reason I'll say is because it feels like there's a ton of people flooded into the market doing this job.\r\n\r\n\r\nNikolas Hulewsky (29:30.776)\r\nThere are, there are a ton of people flooded into the market. And frankly, I've thought about doing it myself. Here's why. It takes so much time and energy to do those things that we just talked about, systematize it, right? Be very clear. But now I understand, in order for someone to be successful with a VA, these are the things that they need to do. So I've thought about like, I could place VAs and then I could help the entrepreneur be successful. The problem is the distribution.\r\n\r\n\r\nI'd have to go out, have to market it, I have to go find people who are willing to pay, then I'd have to go to the talent pool. You've kind of got the distribution piece taken care of because you've already got people coming to you who are like, hey, I want you to find an executive for me. It's very easy then to say, well, I could also help your executives with a personal assistant or with a virtual assistant because now you've sort of built out the process for understanding what they need in order to be successful. You would have to still build out the talent pool, but you could go to a company like a Sagan or you could go to somewhere, you could white label their services. But anyways,\r\n\r\n\r\nI think that would be a really cool additional service, especially because you're servicing executives. And for me, having a personal assistant was like a major unlock.\r\n\r\n\r\nKelie (30:34.542)\r\nAnd I like the expanded service offerings for the market we're already serving. That's one of the things we're thinking about strategically kind of for road mapping into 2025 and 26 is like, what are the other services that the people who are already servicing need, right? It's a natural expansion opportunity. So good idea. Great idea, Nick. I really hadn't thought of it before.\r\n\r\n\r\nNikolas Hulewsky (30:49.536)\r\nYeah\r\n\r\n\r\nNikolas Hulewsky (31:00.492)\r\nYes. Yes. And now because I set you up that way, I believe it. I believe that you've never thought of it before. And so I feel good about myself. Thank you. Okay. Were you managing the P &L in 2023, 2022? Like did you have a team and it was like, this is your budget. This is how much revenue you're bringing in because it was all internal or was 2024 the first time that you were like, all right, this is a real business. I'm managing a P &L.\r\n\r\n\r\nKelie (31:29.378)\r\nA little bit of both. Prior to that, we were billing the portfolio companies. We had revenue coming in from those searches that we were running. But it was much more of, I would say it was more like managing a budget versus the full P &L. We didn't have any expenses. Permanent equity wasn't charging me for my seat in the office and the electricity to run the building and all of that stuff.\r\n\r\n\r\nIt was much more like managing a budget, which is what I had done in my previous career. So yes, that, and then in 2024, it became the full P &L.\r\n\r\n\r\nNikolas Hulewsky (32:10.638)\r\nWhy did you charge? Do you call them portcodes? What did you charge the portcodes? Was it like a flat? In my experience, in working for companies that had this centralized services model, we called it a home office, they would just charge a flat 5 % for quote unquote home office services. Were you just a flat percentage or was it based on the placement and the fee associated with it?\r\n\r\n\r\nKelie (32:13.838)\r\nYeah, we call them pork co's. Yeah.\r\n\r\n\r\nKelie (32:38.41)\r\nYeah, the way that we kind of decided to handle that was that permanent equity portfolios, our goal, and really even one of our core guiding principles for 10th Street is to be able to service the permanent equity portfolio with above average or above industry service success skill for below industry prices. typically in industry for an executive search.\r\n\r\n\r\nyou're going to pay around 30 % of first year total cash comp is pretty average industry rate. I've seen it as high as 35%. Yeah. yeah.\r\n\r\n\r\nNikolas Hulewsky (33:13.518)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (33:18.84)\r\npaid 10%. That's the most, that's, but obviously I wasn't going high end.\r\n\r\n\r\nKelie (33:23.534)\r\n10 % yeah, was gonna say it depends on if it's retained search or if it's contingent search, totally different. Like a retained search is gonna be like a white glove kind of retained search, talent partnership. They should be more involved in the strategic conversations around developing. Yes, yeah, that's gonna be, that is what it is sort of, well, that is our service offering, not all executive search.\r\n\r\n\r\nNikolas Hulewsky (33:42.742)\r\nThat's 30%.\r\n\r\n\r\nKelie (33:53.228)\r\noffers that full kind of service offering, but in the executive search space, 30 % is very kind of industry standard. So we wanted to charge our portfolio companies substantially less than that. So our portfolio companies, we charge 15%.\r\n\r\n\r\nNikolas Hulewsky (34:08.75)\r\nSo when I paid the 10%, I was basically just hiring a hired gun. Like, yeah, just go get me resumes, bring them. Well, I'm not, you're like, I don't know what you did. What I did was I would go and find a recruiting firm. They would just send me resumes essentially. I would sit through them. I would tell them who I liked, who I didn't like, and then we'd set up interviews. And for that, I'd charge 10%. That's not what you're doing though. You're doing way more than that.\r\n\r\n\r\nKelie (34:33.366)\r\nRight. Yeah, so what you are doing is typically have contingent search firms run and that's really a numbers game for them. They try to get as many contingent searches as they possibly can. They use their kind of database to just send you over resumes that they have within their database. They're doing very little actual value add to that process other than the sourcing. So they're sourcing for you.\r\n\r\n\r\nNikolas Hulewsky (35:00.78)\r\nOkay. Okay.\r\n\r\n\r\nKelie (35:02.36)\r\nSo with a full service, like a white glove executive search, the search partner is participating in the strategy of the search. Like what is the role? Who are the types of people that we want to go find for this role? And then crafting the marketing materials. It's kind of a combination of sales and marketing work. So crafting the marketing materials to go out to market and sell your position, your company to a potential candidate.\r\n\r\n\r\nAnd then we're doing all of the kind of interviewing and vetting, personality assessments, cultural assessments, so that we are really delivering to your plate a small handful of very hireable, already vetted, already interviewed and assessed talent that we have sold on the opportunity of leaving their current job and coming to work for you.\r\n\r\n\r\nNikolas Hulewsky (35:56.142)\r\nAll right, well, let's talk about the economics of the business. Can you give me, and I know permanent equity is very cagey about revenue numbers, partly because culture, mainly because you've raised funds and you can't necessarily disclose certain things. So I get that. Can you give me an idea of the size of this company, whether it's top line revenue that you're generating, number of employees that you have, number of placements per year, per month, like kind of give me a ballpark so I can understand the size and scope currently of 10th Street.\r\n\r\n\r\nKelie (36:24.78)\r\nYeah, for sure. So we are in low seven figures revenue for our top line. are\r\n\r\n\r\nNikolas Hulewsky (36:32.268)\r\nReally? In year one?\r\n\r\n\r\nKelie (36:36.566)\r\nIn year one, yeah, mean, technically, I think we officially launched March 1st. So we're like, you know, eight, nine months into this bad boy. I think I expected it because I have very high expectations. And so I told Mark and Brent and they're on my board. I said, I think we can hit seven figures in year one. And I think they're both like, okay, like just\r\n\r\n\r\nNikolas Hulewsky (36:44.664)\r\nKelly, you know that's really good,\r\n\r\n\r\nKelie (37:06.528)\r\nDo what you can, like, and yeah, and we did, so.\r\n\r\n\r\nNikolas Hulewsky (37:10.67)\r\nThat's incredible. I'm not just blowing smoke, especially for a services company like yours. Seven figures in the first year operating is really good. Now, yes, you have the permanent equity brand behind you you've had some experience there, but just to operationally pull that off, it's one thing to drive the revenue. It's another thing to actually pull off the service and the fulfillment piece of it.\r\n\r\n\r\nKelie (37:36.236)\r\nRight. And that's really, that is the business, right? You live and die by fulfillment. And if you don't service your client well, like that's the company, that's the brand. And so that's been my highest priority. It will continue to be my highest priority is like, we have to service the company, the client really well. have to fulfill with excellence. And if that\r\n\r\n\r\ncan be our primary focus, like everything else will come, everything else will fall into place. So we don't spend, I don't spend any effort right now on business development, on marketing, like everything that we're focused on right now is wholly fulfillment oriented and building the team to support that. And the searches that have come in, the external searches to permanent equity's portfolio are just coming in from our.\r\n\r\n\r\nclose network of friends really, know, they're friends of the firm saying, you know, Hey, will you run the search for us? And we're, being pretty selective about who we say yes to. It needs to be, like I mentioned earlier, it needs to be in that white hot core of what we're really, really good at. And we're not getting distracted with, with other things. And so it's allowed us to really focus on, okay, how do we build the fulfillment side of this in a way that can scale beyond.\r\n\r\n\r\nKelly is running a search for me and Grow into 10th Street Talent is running a search for me.\r\n\r\n\r\nNikolas Hulewsky (39:06.894)\r\nTell me about, sorry, now I gotta make a note, because you just made me think of something.\r\n\r\n\r\nAre you charging 15 % or is it 30 % that you're charging now outside to the general market?\r\n\r\n\r\nKelie (39:22.606)\r\nYeah, so portfolio companies get a discount. So portfolio companies as a benefit of being a permanent equity portfolio, they get charged 15%. Anyone that we work with outside of the firm gets charged between 25 and 30%. It just kind of depends. We sort of have two different levels and if it's an executive or not executive. So it ranges.\r\n\r\n\r\nNikolas Hulewsky (39:26.862)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (39:47.66)\r\nOkay, so I am going to.\r\n\r\n\r\nI'm gonna ask you a question, and, I'm now doing it on my calculator, and you can blink twice if I'm close, or just blink once if I'm not close. I'm gonna guess you've done somewhere in the ballpark of like 50 placements this year.\r\n\r\n\r\nKelie (40:08.15)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (40:08.622)\r\nOkay. All right. And that's just like back of the envelope. All right. $150,000, 20 to 30 % of that is, you know, $30,000. Seven, low seven figures would put you in that range. How, so you just said you don't, you're not currently marketing. It's all word of mouth.\r\n\r\n\r\nKelie (40:28.034)\r\nYeah, all of our external searches. Yeah, I'm good on time. I blocked an hour after this.\r\n\r\n\r\nNikolas Hulewsky (40:29.324)\r\nBut sorry, by the way, sorry, sorry. Are you good on time?\r\n\r\n\r\nNikolas Hulewsky (40:35.682)\r\nOkay, cool. We'll probably go another 15 if that's okay. Okay. It's been a little longer than I usually do, by the way.\r\n\r\n\r\nKelie (40:39.572)\r\nSure, yeah. So yeah, all of our...\r\n\r\n\r\nyeah, no worries. I'm having a good time. yeah, so all of our searches that have come in from external clients this year have been, like I said, friends of the firm, actually Main Street Summit attendees. Some of them were in the Orbit, which is our talent network. Some of them are, you know, close friends of Brent's. And so I'm really proud of the fact that we've not only taken on these outside searches, but all of them have run\r\n\r\n\r\nNikolas Hulewsky (40:45.688)\r\nYeah. Good. Good.\r\n\r\n\r\nKelie (41:14.966)\r\nmultiple searches with us. So we've done a first search and they've come back to do another search. really that's, that is the goal, right? We want one of our clients said, you know, you guys are a premium product. he, he knows that he could go out to market and find someone to do it for 15 % or find someone to do it on a contingent basis for less. But, you know, he, said, you guys are a white\r\n\r\n\r\nglove service and a premium product and I'm willing to pay for it. And so that is really the market that we're looking to serve, right? The people who are willing to pay for the expertise and the process and the diligence that comes through the process.\r\n\r\n\r\nNikolas Hulewsky (42:01.55)\r\nI was making notes to talk about this later, but that's one of the things that I've focused a lot more on in the last few years, is being really clear on who your target demographic is. I had Jessica Miller on, she's a coach, but she focuses on sales and marketing. And she's like, you got to know what your hell yes offer is. Many people just suffer from having too many offers and that dilutes the brand, that dilutes the experience.\r\n\r\n\r\nAnd many times, because as entrepreneurs, you're like, I want to capture as much business as possible. so like in your example, you're a search company and or you're an executive recruiting company. And maybe somebody comes up to you and says, hey, I need actually I'm in the health care space. I actually need a nurse. Could you find me a nurse? And it's hard to turn down the prospect of making more money when you're growing and scaling a company. But the ones that have been, you know, the most successful are the ones that can really double down and say, no, this is our core offering.\r\n\r\n\r\nOkay, you can go and get 10 or 15 % from somewhere else, but are they going to work with you to understand what you're really looking for, what the attributes of that position are, to really sort through the onboarding and making sure that you're not just hiring them and hoping that they're successful, but that you're actually going to see them be successful over the next six, 12, 18 months. That's a different offering than just giving someone a bunch of resumes.\r\n\r\n\r\nIt's easier said than done. It's very easy to sit here and be like, yeah, you should just focus on your one service offering. It's very, very hard to overcome that natural inclination to want more revenue and expand services. So kudos to you on being able to do that.\r\n\r\n\r\nKelie (43:40.63)\r\nAnd yeah, I'm not saying it's easy because I totally agree with you. It's really hard. And it's particularly hard if you have a personality like mine, which is I kind of have this personality type that feels like, how hard could it be? Or like, I can figure that out. You know, it's like this, I'll figure it out. How hard could that be mentality? So if someone comes and pitches, you know, could you run this search? And I think to myself, like, well, I'm sure I could run that search, you know, like I.\r\n\r\n\r\nNikolas Hulewsky (44:05.516)\r\nwith it.\r\n\r\n\r\nNikolas Hulewsky (44:10.722)\r\nYou're an entrepreneur.\r\n\r\n\r\nKelie (44:11.0)\r\nhave full confidence that I can get up to speed and make it happen. should I spend my time doing something that is outside of our core focus? It's something that's evolved through the year and as I'm maturing into the business and trying to create a business that is, like I mentioned, bigger than myself. How do you scale beyond the principle?\r\n\r\n\r\nNikolas Hulewsky (44:37.068)\r\nYeah. All right. Nitty gritty. I'm going to ask some questions. So you're not spending any money on marketing. So you don't really measure customer acquisition cost or market. OK. What do margins on a business like this look like? Do you are you looking at gross margins and net net margins or is that not on the radar yet with the size that you are?\r\n\r\n\r\nKelie (44:59.278)\r\nYeah, I mean, we look at it. We're noticing it. Margins in the industry, in professional services are good margins, right? You don't have any, you know, inventory costs. You don't have any kind of a lot of the expenses. So it's all just the people and software expenses. And I think one of the things that I'm really focused on for Ten Street Talent is like, we have these good margins and what are we doing with those profits? What are we doing with that?\r\n\r\n\r\nmoney and it's almost exclusively putting it back into the business for two things, to hire ahead of the need. So we're building a team, we're hiring ahead of the need so that we are very well positioned to deliver the service that we need to scale as the demand scales. But then also I'm investing pretty heavily in AI tools for the company. One of the things that I've noticed is that\r\n\r\n\r\nexecutive recruiting is an antiquated industry. Like when you talk to traditional executive search, yes, it's all people that have their databases of people and they do things the same way they've done them for 30 years now. And there's not a lot of innovation in the space. So I'm working on building systems. We've built some custom AI software this fall that's helping\r\n\r\n\r\nNikolas Hulewsky (46:02.605)\r\nnow.\r\n\r\n\r\nKelie (46:26.594)\r\nmy team spend less time doing anything that's not talking with candidates and serving clients. So all of these kind of operations that aren't value add, I'm trying to be as forward thinking as possible on how we can use AI. And I think that that is only gonna help to increase margins because the more time we can actually spend on the value add parts of fulfilling the service.\r\n\r\n\r\nI think there's a lot of opportunity there to streamline time consuming things.\r\n\r\n\r\nNikolas Hulewsky (47:00.504)\r\nTell me, speaking, what are typical net margins on a business like this?\r\n\r\n\r\nKelie (47:07.746)\r\nmean, it's gonna range, but you could find 20 to 40%.\r\n\r\n\r\nNikolas Hulewsky (47:13.358)\r\nOkay, cool. So what's interesting though is you may not improve your margins by using AI, but you may improve the experience and the quality of the product. And by that, mean, when you use a traditional search firm, they're not gonna find me at Kelly Morgan. You're not on their radar, right? Like their tools currently are not finding people like you who have a high ceiling or have a high upside.\r\n\r\n\r\nAnd I don't know what it would be. I don't have a good idea for it. But I think with AI, the ability to go through and like mine data and actually look in places that people aren't looking, maybe you're spending more on it. But if you can find those types of candidates, that's what people are going to be willing to pay top dollar for, right? Is people like you who maybe aren't on the traditional background, but are still going to get the job done in the right way. And I think that's, that might be one place where AI can augment your services.\r\n\r\n\r\nKelie (48:12.95)\r\nYeah, exactly. It's like, I think about what I rather have my recruiters spending.\r\n\r\n\r\nNikolas Hulewsky (48:15.054)\r\nHold on one second. Hey buddy, you built an iron giant? Yeah! I love it. I love you. Sorry.\r\n\r\n\r\nKelie (48:25.646)\r\nwas an important, that was an important update. He built an iron giant.\r\n\r\n\r\nNikolas Hulewsky (48:27.79)\r\nHe had he built an iron. They are obsessed with iron giant right now. Hold on a second. Hey, what's up? You that piece, you know that piece down to my bumbi. Yeah, I made it. You found it. Yeah, but I made it. my goodness. Nice job. Hey, when I'm we can go build it the rest of the way.\r\n\r\n\r\nNikolas Hulewsky (48:55.022)\r\nI saw Iron Giant. showed me. Sorry. We did Legos for like two hours last night and there was this one piece that we couldn't find and Robbie just told me he fixed it. So, sorry, I interrupted you. You were talking about augmenting AI services to find people like you.\r\n\r\n\r\nKelie (49:08.78)\r\nNice.\r\n\r\n\r\nKelie (49:14.954)\r\nYeah, mean, guess the point is that if I can free up 10 hours a week of my recruiter's time to spend that 10 hours talking with more people and building relationships with more people, that's how you find the diamonds in the rough, you know, is not being constrained to, you know, I can only interview seven people for this search because I don't have time to do more. I want to be able to talk to more people.\r\n\r\n\r\nto spend time developing relationships. because that's where, and that's the fun part about hiring in the S &B space is that most S &Bs are looking for more kind of universal athletes, if you will. They need to wear a lot of hats, they need to have a high ceiling, they need to be utility players. And that's very hard to find on a LinkedIn profile or understand from someone's resume alone.\r\n\r\n\r\nNikolas Hulewsky (50:10.05)\r\nI think what's interesting about your business as I'm like understanding everything that you do, you haven't said this and you might totally disagree, but there's a lot of fractional companies out there, fractional CFO, fractional COO, even fractional CEOs. Like to me, this is a fractional recruiting team, right? Because you're not just placing, like again, my experience has been send me the resumes, I'll sift through them because you have your database.\r\n\r\n\r\nyou are actually spending a lot of time understanding the needs of the business. And so you're coming in as a partner as opposed to just a vendor. And I think that that's a big differentiator, especially in the SMB space, because as an operator, I don't really have anybody else to talk to, especially when I'm that size. My resources might be limited. The available talent that I have to talk to is limited. So to have somebody like you come in and give them a professional assessment and then help them.\r\n\r\n\r\nfind that person I think is incredibly valuable. And it's, it's, again, a fractional talent partner or it's not even head of HR because HR is totally different, right. But many times we think of those two as the same thing.\r\n\r\n\r\nKelie (51:17.166)\r\npartner. Yes.\r\n\r\n\r\nNo. In the private equity world, the role is generally called like a talent operating partner or operating partner over human capital or chief talent officer. And really that is the service. You hit it on the head. It's kind of this fractional operating partner focused on talent that is coming in to provide the service for you and also execute the search and the interview process for this service.\r\n\r\n\r\nNikolas Hulewsky (51:29.656)\r\nOkay.\r\n\r\n\r\nKelie (51:50.996)\r\nAnd you're right, none of these companies need to carry that person on staff full time. Like it doesn't make sense. You're probably hiring this level of role maybe once or twice a year. So it doesn't make sense for you to have your own chief talent officer on staff, but we can plug in and support fractionally on those roles that are really, really high importance and high value. And that's how it started with the...\r\n\r\n\r\nportfolio companies, right? It was like our portfolio companies don't need to own this capability internally. They don't need to be really, really good at hiring controllers. They should be only hiring a controller every several years, you know, so they don't need this capability, but we can develop that capability and plug in fractionally to support.\r\n\r\n\r\nNikolas Hulewsky (52:37.218)\r\nWell, and I think a lot of people look at the expense and are like, for just hiring people. But in my experience, and Brent's a great example of this, being able to collect people, like hire good talent, is the differentiator between companies that are highly successful and ones that are just sort of mediocre. So in my mind, there's not really a better place to spend than to find good talent to bring onto your team, because then they will solve all of the other problems that you have.\r\n\r\n\r\nthat you're looking at. All right. So I am going to ask you and you're going to tell me what your equity split is and how big you want to get this company to be. But before I ask that, the reason I do that is because I want you to have a chance to plug where can people come find you and where's the best place to find more information about your company.\r\n\r\n\r\nKelie (53:27.554)\r\nYeah, so people can find me on Twitter, I guess, but I'm really not on there, so don't come look for me on Twitter. Yeah, I'm not. I occasionally lurk in the comments and post a GIF every now and then, but that's about it. So yeah, you can find me on 10thStreetTalent.com is our website. I'm also on the Permanent Equity website, of course.\r\n\r\n\r\nNikolas Hulewsky (53:34.776)\r\nShe's not.\r\n\r\n\r\nKelie (53:52.494)\r\nMy email kelly at 10th Street talent.com, but just make sure that Kelly's spelled kind of strangely Kelly's spelled differently. So yeah\r\n\r\n\r\nNikolas Hulewsky (54:02.284)\r\nYeah, yes. Can you give a brief size? Like what's your target size of company? If I'm an entrepreneur and I'm listening, I'm like, I only do 500,000 in revenue. Is that big enough? Like what's your sweet spot for helping operators?\r\n\r\n\r\nKelie (54:22.478)\r\nSo we've helped companies as small as four or five million in revenue and as large as over a hundred million in revenue, top line revenue. But I would say the sweet spot is really anywhere in there where this is kind of a transformational leadership role. Maybe you're a solopreneur doing 2000 on your own and you're looking for kind of a GM to come in and\r\n\r\n\r\nbe a partner to you in the business and grow and develop. Like that could be an interesting search that we might take on. And then maybe you're a hundred million dollar firm that's doing a platform roll up of whatever the case may be and you need to develop out your C-suite team. Like those are searches we run as well. So there's a lot of variety when you go from two million to a hundred million, but I think the consistency.\r\n\r\n\r\nNikolas Hulewsky (55:13.774)\r\nOkay, I like that.\r\n\r\n\r\nBut I like that criteria.\r\n\r\n\r\nKelie (55:19.82)\r\nYeah, I think the consistency or the similarity between all of those is that they're in growth mode trying to get to the next step. So whatever that next step looks like, typically it's people and talent that are going to help you unlock that.\r\n\r\n\r\nNikolas Hulewsky (55:33.282)\r\nWell, I like that criteria is just like, it's a transformational hire. If you're feeling like, man, this hire would change my business, then let's talk to Kelly. And then tell me briefly, are you 100 % contingency based or do you have a retainer? How does the payment work?\r\n\r\n\r\nKelie (55:51.598)\r\nWe're a retained search. So what that means is that we charge you a percentage of the contract upfront to start the search. And that starts kind of all of the collaboration, the strategic collaboration, the materials and marketing building. And then when the search is finished and someone is placed, we charge the remainder of the balance. So we're retained with a 25%, 75 % billing split.\r\n\r\n\r\nA lot of retained executive search does like a third, third, a third, but that felt a little messy for me and we want to be simple, we want to be easy, and that just felt like a cleaner billing model.\r\n\r\n\r\nNikolas Hulewsky (56:20.728)\r\nGot it.\r\n\r\n\r\nNikolas Hulewsky (56:33.582)\r\nSo for easy numbers, if I'm hiring an executive that's $100,000 a year, and I'm gonna pay you 30%, so it's $30,000, I'm gonna pay you 25 % down, so $7,500 down, and then the remaining, what is that, 22,500, I'll pay you once they're placed. What happens if in the first six months they suck and I fire them? Like is there a guarantee or do you continue working with us or like what does that piece look like?\r\n\r\n\r\nKelie (56:54.446)\r\nThat's right.\r\n\r\n\r\nKelie (57:03.342)\r\nYeah, so we have a guarantee that's roughly, you know, it ranges depending on the search and the level, but it's roughly, you know, a three month guarantee that says in the first three months we'll replace 100 % fee covered, we'll replace it 100%. And a lot of that, the time constraint with that is that it allows us to still be recent enough to the search that we have kind of still a warmish pipeline. We can go back to the pipeline and\r\n\r\n\r\nand re sort of re kick off that search. Beyond that 90 days, we do a 50 % replacement. So if we were to rerun the search between that and six months, we would charge 50 % of the fee. So that's our kind of replacement guarantee. Yeah.\r\n\r\n\r\nNikolas Hulewsky (57:50.67)\r\nAll right, so I'm actually gonna cut that part and put it much earlier, because I think that that's a very important piece to understanding what you do. All right, I'm gonna ask you some uncomfortable questions and I'm not expecting a real answer, but I'm hoping for one. I'm hoping for one. I just think it's so cool that this is spun out and Clayton has done a really good job with the Main Street Events, the Scratch Events Company, I think is the name.\r\n\r\n\r\nKelie (58:07.128)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (58:19.63)\r\nand really high touch, but obviously it's now a standalone business and your business, I think is going to do really, really well. What does the equity look like? So is this fully standalone? Is it owned by permanent equity? Is it just Brent who's a piece of it? Are you vesting over time? Can you talk about what the equity piece looks like?\r\n\r\n\r\nKelie (58:44.652)\r\nYeah, so we are a portfolio company of permanent equity, but we are not, there's no outside investors. So there's no investment from any of the funds into 10th Street Talent. So it's solely owned by permanent equity. so that's kind of the equity piece is permanent equity owns 10th Street Talent. And then I participate in a profit share agreement as part of my arrangement.\r\n\r\n\r\nNikolas Hulewsky (58:55.246)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (59:13.518)\r\nOkay. Was that weird negotiating that or was it pretty straightforward?\r\n\r\n\r\nKelie (59:20.622)\r\nI mean, it was pretty straightforward. think like, you know, Brent is permanent equity. So when I say permanent equity owns Ten3 Talent, it's Brent, right? Brent owns. And he's very generous. He's very entrepreneurial. And so it wasn't, I don't think it was hard or uncomfortable. He's also a really good negotiator. So if you go into negotiations with Brent, just know that he's better than you.\r\n\r\n\r\nNikolas Hulewsky (59:50.52)\r\nYeah, but you trust him, right? So it's like, he may be a better negotiator than you, but I'm sure he was looking out for your best interest as well as you're going through the process.\r\n\r\n\r\nKelie (59:58.988)\r\nYeah, and he does feel, he has in a lot of ways developed me into where we are now. So there's a lot of like, just pride, coaches that have their like coaching trees that they develop or whatever, like, yeah, I'm a part of his coaching tree.\r\n\r\n\r\nNikolas Hulewsky (01:00:12.482)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:00:17.58)\r\nYeah, for me, that's the most important thing. don't really care how big the company is or how much money it makes. I get the most fulfillment from seeing people who I've brought on. Maybe I found them early or maybe I helped refine them and then they're able to go out and be successful in other places because I feel some pride of like, I helped them along the way. What's your goal with this company? Is this like...\r\n\r\n\r\nI'm good if it's a $10 million company or $5 million company or are you like, no, 50 million or bust $100 million company. What, like, what do you want to see this be?\r\n\r\n\r\nKelie (01:00:50.85)\r\nHahaha\r\n\r\n\r\nYeah, you know, I would say to be determined a little bit, yes, I know we can grow to 10 million. I know we can grow beyond that. But part of growing beyond that is making sure that we don't lose like what makes us really great. Like the reason I didn't like partnering with those search firms six years ago was because they kind of lost touch with what\r\n\r\n\r\ntheir customers needed and spending the time to understand their customer. And so I'm happy and willing to grow as big as we can, as long as we never kind of lose sight of the reason we started in the first place and the ability to service that client really, really well.\r\n\r\n\r\nNikolas Hulewsky (01:01:39.807)\r\nWell, this has been awesome. I'm just going to stop the recording. I have a million other questions that I could ask, but I've kept you for long enough.",
  "metadata": {
    "duration": "",
    "date": "2025-01-06",
    "platform_source": "Google Drive"
  }
}