{
  "episode_number": "108",
  "episode_title": "Sky Lanterns and Music Festivals: Building a $10M Empire, with Spencer Humiston",
  "guest_name": "Spencer Humiston",
  "business_name": "Night Lights, Great Crowd",
  "transcript": "﻿Nik (00:00.366)\r\nAll right, Spencer, it is recording. So I am freaking stoked to talk to you because you have an experiential business and that is so hot right now and I know nothing about them. So I can't wait to pepper you with millions and millions of, will you just give me an idea of like, okay, this is who I am and these are the companies that I have at the moment and this is what they do.\r\n\r\n\r\nspencer h (00:22.137)\r\nYeah, so I'm technically a lawyer. I have a law degree, which has been of varying use throughout my life. for about 10 years, I thought it was of no use, but I found it to be of a little use. I feel like the nature of entrepreneurship is there's always some sort of you're going to get sued and probably get sued a lot. So having a little background has helped with that.\r\n\r\n\r\nAbout seven years ago, I founded a company called Night Lights, which does sky lantern festivals around the country. We're one of a couple of businesses that do it. I was there at the very beginning when we first came up with the idea of doing it in America. It's based around Thai or Chinese sky lanterns, those types of festivals. So I'd love to talk about that. There's a ton of misunderstandings about it. I think that, and a lot of misunderstandings get to the heart of entrepreneurship as well about\r\n\r\n\r\nwhere people are like, how can you possibly do that without understanding all of the work that goes on to make sure you can keep doing it? The other things I do is I'm involved, we've taken that and then partnered with Large Country Music Festival, south of Dallas. And that's been incredibly fun. I own a lime farm in Oaxaca, which has not done well. Like limes, like the citrus fruit. Yeah.\r\n\r\n\r\nNik (01:42.614)\r\nA what farm?\r\n\r\n\r\nNik (01:46.86)\r\nYeah, yeah, okay.\r\n\r\n\r\nspencer h (01:48.599)\r\nThat's been terrible. And then we've also started a company that I'm incredibly proud of called Great Crowd, which does marketing and ticketing for events similar to my event. So it kind of was organic extension of what we do, kind of serving the marketing and ticketing needs of mid-size events. So not like a fun run, not like a Taylor Swift concert, but something that kind of sits in between.\r\n\r\n\r\nNik (02:16.398)\r\nCan you give me an idea of size and scope of those businesses? Maybe like, hey, total combined, here's the top line revenue and here's the number of employees that we have, number of states we operate in, just something to give me context.\r\n\r\n\r\nspencer h (02:25.824)\r\nYeah, Night Lights top-laying revenue is really depending on the year, depending on a variety of factors is somewhere between four and six million dollars in revenue. I mean, it's a massive amount of marketing goes into that and you continue to have to market the idea of like events are going to go viral and you're to sell a bunch of tickets doesn't really exist anymore. And then there's a million other little costs in there.\r\n\r\n\r\nNik (02:50.51)\r\nThank you.\r\n\r\n\r\nspencer h (02:54.072)\r\nBut we do that, we do about, depending on the year, eight to 12 of those events a year. And we have out anywhere from 100 to 150,000 people come out to those events across the country.\r\n\r\n\r\nNik (03:06.795)\r\nmy gosh. eight to 12 events a year, those are gonna be like eight different locations you're saying, not like eight different locations.\r\n\r\n\r\nspencer h (03:11.659)\r\nYeah, yeah, totally. we have eight locations, well, eight different locations, and then at those locations, we might do multiple events. So we might do multiple weekends, or we might do one in the spring, we might do one in the fall. But yeah, so we move. Most of the events we do are in May, early June. We take the summer, and then we are in September, October, and early November.\r\n\r\n\r\nNik (03:36.928)\r\nInsane. Okay, so then you got the lime farm and random in Oaxaca. And then tell me a little bit about the country music festival because that's super interesting.\r\n\r\n\r\nspencer h (03:39.513)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nspencer h (03:48.906)\r\nYeah, the Country Music Hells was actually incredibly interesting. When we dreamed up Night Lights, we wanted to bring on live artists. We kind of this idea that we'd have like really cool live musicians. To be completely honest, the cost was prohibitive for live music. And then also we found very quickly that what we were paying for live musicians wasn't pushing the revenue.\r\n\r\n\r\nIf you get a band that no one's heard of and you have to pay $20,000 for it versus you get a guy who's just a singer, songwriter, or local bar, we're gonna end up selling about the same amount of tickets. It's really interesting. The whole nature of live music and concerts is incredible. But we ended up teaming up with a venue that we had done our lantern event there. They were looking to do kind of a country music festival to kick off\r\n\r\n\r\nNik (04:27.404)\r\ninteresting.\r\n\r\n\r\nspencer h (04:45.035)\r\ntheir week of drag racing. do nationals for drag racing. And we really felt like partnering nightlights with them could lead to kind of make the concert stand out. You see country concerts all over the place, but doing a lantern release before the opener or during the headline act, we thought would drive a different crowd out to it. And so we've done that now for three years.\r\n\r\n\r\nThis year was the first year I think we really felt like things really broke and it did really well for us.\r\n\r\n\r\nNik (05:21.678)\r\nHow many people attended? you like?\r\n\r\n\r\nspencer h (05:23.804)\r\nyeah, yeah, yeah. mean, can get those numbers. Over the course of the weekend, had between 25 and 35,000 came out to it. we did, let's see here. And some of those were multiple, some of those were single day. We did three days. We did a Friday night, a Saturday, and then a Sunday. Yeah, that was awesome.\r\n\r\n\r\nNik (05:43.022)\r\nCan you me an idea, top line revenue in one weekend?\r\n\r\n\r\nspencer h (05:45.303)\r\nYeah, I can do that one. that one did about, I mean, this is just the top line revenue of ticket sales involved in all this stuff is always merge and F and B, but that was about a $2 million, $2.5 million.\r\n\r\n\r\nNik (06:01.91)\r\nReally? One weekend?\r\n\r\n\r\nspencer h (06:03.168)\r\nYeah. Yeah, yeah, yeah, one weekend.\r\n\r\n\r\nNik (06:07.22)\r\nWhat? That blows my mind, dude.\r\n\r\n\r\nspencer h (06:11.507)\r\nI mean, if you think about it.\r\n\r\n\r\nNik (06:12.59)\r\nYou're saying it's so cool. And like, I couldn't tell if you were not wanting to say it because you were you thought it was low, or maybe you thought it was high. I don't know. But like, that's one weekend. I mean, I know there's a lot more work than just one weekend that goes into it. But that seems crazy to me.\r\n\r\n\r\nspencer h (06:26.879)\r\nYeah, no, that's about what, and there's economics involved in that kind of stuff. mean, artists' budgets are huge. If you want to throw a concert, it's going to have main names. mean, stages are a big deal. And then of course, the amount of marketing that goes into pushing that. It's crazy because we talk about it all the time, but events...\r\n\r\n\r\nWe say it all the time, everybody's an e-commerce company now. Literally, everyone's e-commerce company. Because most of your tickets are sold off of Instagram or Facebook, you're competing with every other e-commerce ad that people are seeing on there. So large part of our costs are towards ads like that.\r\n\r\n\r\nNik (07:10.776)\r\nStill, that's pretty incredible. And then this new business that you've launched, which sounds like digital marketing for similar events-based businesses.\r\n\r\n\r\nspencer h (07:19.414)\r\nYeah, yeah. So digital marketing and then the ticketing platform forum. We just kind of found very early on that, you know, we're not like a neighborhood fun run, but we're also not like a Taylor Swift concert. so, you know, we're not going to, Ticketmaster isn't going to kind of give us the time of day. They're happy to take your money. But then also like, you know, the next star guy who developed a ticketing platform, not going to be able to, is robust enough to deal with 100, 250,000 different orders a year.\r\n\r\n\r\nAnd so what we tried to do was figure out how to cater to events like ours, both with the marketing and the pricing, dynamic pricing strategy, and then across the entire sales cycle and having your ads tied to those with then the ticketing being the last step in this. Yeah. We launched that, we soft launched it in...\r\n\r\n\r\nNik (08:11.534)\r\nWhen did you launch that one?\r\n\r\n\r\nspencer h (08:18.805)\r\n2021, it was right after COVID. And we really just, all we just ended up doing was taking the money that we were dumping into ticket processing on a third party, hired an engineer and just had him cobble together a solution for us, for nightlights. We found it to be incredibly useful and then started kind of rolling it out to people that we do business with.\r\n\r\n\r\nNik (08:43.628)\r\nOkay, so Spencer, do you go by Spencer? Is there like a better nickname? Cool. So Spencer, you've got businesses that are essentially doing at least $10 million top line revenue ish. I'm just doing some back in the envelope math. Okay. You live in Utah, but you've got an event in Dallas, you've got at least 12 events for the nightlights around the country. I don't know where your marketing team is based, but I'm assuming they're not all based locally.\r\n\r\n\r\nspencer h (08:46.878)\r\nYeah, yeah, Spencer's great. Yeah.\r\n\r\n\r\nNik (09:11.36)\r\nSo but if I'm looking at you as an entrepreneur starting out, I'm like, man, this guy's got an eight figure business. He's got multiple locations that he's running. He's been doing this for a number of years. It's it would be pretty intimidating, right? Like looking at this and thinking, holy crap, how did he do this? Was this your plan seven years ago when you started this? Or like, what what was the thought process behind? Hey, I'm a lawyer. Let's get into lighting lanterns on fire and setting them free.\r\n\r\n\r\nspencer h (09:29.353)\r\nNo.\r\n\r\n\r\nspencer h (09:34.793)\r\nYeah, no, not at all. honestly, as you describe it that way, also sounds much, and I think maybe this is the nature of most entrepreneurs, it sounds much bigger than it actually feels most days. Like, it's kind of like, yeah, that's what's going on, but it just kind of, you know what it is? I feel like for me, it's like you solve one problem and then another and then another and it just kind of just ends up building into something else, you know?\r\n\r\n\r\nYeah, so I wasn't planning on any of this. actually, had a buddy who was big into events and he was involved in those really long marathon, the relay ulcer, Ragnar. Yeah, yeah, he was involved in Ragnar. And he started a company that did mud runs that was incredibly successful around the country. At the same time, I was finishing law school and\r\n\r\n\r\nHe had visited us in Thailand. We were living in Thailand and we led off like Sky Lanterns together. And he was like, this would be incredible in America. And I was like, there's no way you can do this in America. We left Thailand, moved to Alaska and started working there as a lawyer. He was having trouble getting it off. So he tried to do that event in America, but between fire codes and a bunch of different other things, he was having trouble doing it.\r\n\r\n\r\nAnd he called me and was like, hey, what are you doing? I told him, was like, you know, I think probably going to, this is real talk, probably kill myself if I keep doing, like everyone laughs about it, like, honestly, like I've been like years of therapy over it. Like if I keep, if I keep doing this, it's just not, it's just not cut out. I'm not cut out for it and it's not a good fit. And so I helped him get this going, the Sky Lantern thing going really early on.\r\n\r\n\r\nI had to solve a myriad of problems around it, like what happens to lanterns, picking them up, making sure you're not causing fires. I mean, those are the two big things, like are you going to cause fires? And isn't this litter?\r\n\r\n\r\nNik (11:41.326)\r\nWell, that's, that's I was going to ask is like, first of all, I think it's funny because I lived in Tacoma, Washington, which is not Alaska. But I could see practicing law if you don't like law and both of my brothers are lawyers. So I get it. And you live and you live in like Alaska where seasonal affective disorder is like night of the year because you don't see the sun. Did he call you because it was your idea? Like because you guys did it together in Thailand or all you because he's like, Hey, you're a lawyer. Could you help me figure out some of this zoning\r\n\r\n\r\nspencer h (11:47.281)\r\nRight.\r\n\r\n\r\nspencer h (11:54.355)\r\nyou\r\n\r\n\r\nspencer h (11:58.248)\r\nRight.\r\n\r\n\r\nspencer h (12:05.885)\r\nYou\r\n\r\n\r\nspencer h (12:11.131)\r\nWe were kind of buddies and like they'd come up and visit him and his wife to come visit. We were kind of like, I don't know if we can stay up here. I'm not doing this well. He's like, I've actually done this. We kind of got it off going. It was based upon what we did in Thailand. He had another company that he wanted to put most of his time into another event. And he was like, we just need somebody who seems to have like a skill set around law. like events, events are just 99%.\r\n\r\n\r\nNik (12:11.316)\r\nyou know, whatever requirements out.\r\n\r\n\r\nspencer h (12:39.546)\r\nAt the beginning, events are like 99 % just like problem solving. There's just not really anything else behind it. You don't need a specific skill. You just need a willingness to like, I want to make this happen. How does it happen?\r\n\r\n\r\nNik (12:55.138)\r\nWalk me through some of the legal stuff because I'm sitting here. I'm like you light this thing on fire and then you release it. And knows where it lands. This is me. This is me like ignorant me right like if you're releasing them in anywhere in the West during the summer like that's just the wildfire waiting to happen. So it just screams legal liability. You're super cool looking but obviously it's a it's a thriving business. What were some of the logistics that he was having problems with?\r\n\r\n\r\nspencer h (13:01.659)\r\nYeah.\r\n\r\n\r\nYeah, right.\r\n\r\n\r\nspencer h (13:08.838)\r\nYeah.\r\n\r\n\r\nRight.\r\n\r\n\r\nRight.\r\n\r\n\r\nspencer h (13:21.149)\r\nWell, they're ongoing as well. mean, that's just kind of interesting about it is it's like, so like, I mean, logistics are is like exactly what you said. It's like, hey, you're going to light flaming garbage into the sky and then just like ghosts. I mean, we that's not a sustainable business model at all. Like, right. It's not like it's like you're going to. And it's funny because it's like one those things we get on Facebook. The feedback's always like, that's what you guys are doing. It's like, well, you can't you can't do that in America. You can't just like light.\r\n\r\n\r\ngarbage and then take off. And it's certainly you can't come back to the same town and do it over and over again for like eight years. So the biggest thing we kind of ran into early on was the fire concern. And it's just not a concern for us. They're essentially a the fuel stem is like a little tissue packet of wax paper. it burns from like somewhere between three to five minutes.\r\n\r\n\r\nIt takes about usually a minute and a half, two minutes to actually fill up the lanterns. So it's actually burning in the air for about a minute, minute and half. And then it's just physics. It only starts to come down when it gets cold. Yeah, yeah. And so like now, and like when I was trying to sell that to people, initially they're like, cool, that's not true. But now I kind of feel like after we've done a million and a half of these things, it never started a fire. It's kind of like, well,\r\n\r\n\r\nNik (14:32.334)\r\nthe sets come down when it's no longer burning.\r\n\r\n\r\nspencer h (14:48.306)\r\nThat's actually, it's funny, I'll go to talk to Fire Chiefs still and I'm like, there's literally no one on Earth that knows more about sky lanterns than I do. We just have never started a fire. So that was the first issue, is like fire. You're right about the West, we do work super closely with Fire Chiefs, work in places where there's a ton of, they call it defensible land. So usually it's a city that has large open fields next to it. If it's in the East, it's a place that is like,\r\n\r\n\r\nwell vegetated around it. We try to work, and that's why we usually do it in the early spring or fall, is when we don't have as much fire. Yeah, yeah. And we work incredibly closely with fire marshals. So they'll be like, hey, we're actually comfortable with it. And we give up discretion to them as well. So it's a red flag day, stuff like that.\r\n\r\n\r\nNik (15:26.935)\r\nlittle wetter.\r\n\r\n\r\nNik (15:36.782)\r\nOkay, did you have to get a bunch of liability insurance before you launched this business or no?\r\n\r\n\r\nspencer h (15:43.291)\r\nSo this was crazy about it is we do have insurance, we've always had insurance. Essentially like we just haven't had, I don't think the insurance rates were much harder than any other large public event. And I don't know, insurance is like a black box. Anybody who has had to deal with insurance, I have no idea. You find out people are insuring the insurance.\r\n\r\n\r\nNik (16:12.482)\r\nYeah, reinsurers and yeah.\r\n\r\n\r\nspencer h (16:13.393)\r\nYeah, there's reinsurers of reinsurers. Like I don't even know. Like that seems insane. But it and I think it's because we don't we don't do a lot of personal injury stuff, structure damage, stuff like that just isn't that expensive. And so the insurance wasn't has never been that big of a deal.\r\n\r\n\r\nNik (16:29.486)\r\nDid you have to do a bunch of groundwork? Where was your first location? Where did you do this first?\r\n\r\n\r\nspencer h (16:37.356)\r\nYeah, the first location was outside of Spokane.\r\n\r\n\r\nNik (16:40.171)\r\nOkay, so in Spokane, you're going up to Spokane. Do you have to get permission or could you just light these off? Like I have no idea.\r\n\r\n\r\nspencer h (16:45.553)\r\nNo one knows, no one knew. Yeah, like no one knew. Like that was the thing is no one knew. And so it was funny, the place we, and no one knew like what the ideal situation for this was, right? Like can you do it in a city park? The biggest thing was we had to clean them up. Like that's the thing is like we had clean the canterns. So was kind of like, how do you do that? That was kind of the thing that, well, there was two issues. Parking, this is the thing for all public events. Parking, on-site parking.\r\n\r\n\r\nis like a deal breaker. is like, it is like, it is the biggest thing. It's the biggest choke point on venues is whether or not it's on.\r\n\r\n\r\nNik (17:22.816)\r\nand any events based business parking.\r\n\r\n\r\nspencer h (17:25.552)\r\nYeah, yeah, people, honestly, it's like a huge deal, like parking, because like anytime you're doing shuttles, anytime people are having to park in street, it's a massive pain in the ass. like on-site parking is like a giant prohibitive factor of the ability to be able to do events. Because the parking space needs to be 10, 15 times the size of the actual event space to bring things in. it's where can we park? Where can we park cars for 10,000 people? So you're looking at where can you park 3,000, 3,500 cars?\r\n\r\n\r\nAnd then where can you pick up these lanterns afterwards? And essentially it's like you need to have pretty open spaces around it. The lanterns don't travel very far. So anyway, so those are kind of the big things that we ran into. Yeah.\r\n\r\n\r\nNik (18:06.03)\r\nBy the way, I'm gonna edit this part out, but if I'm looking down like this, I'm not tweeting or texting anybody, I'm taking notes. So I have a monitor up here and my computer down here. I get really insecure if I'm talking to somebody and then all of sudden they're looking around and I'm like, crap, am I not being interesting enough? So I just wanted you to know that is like, am listening, you're spitting gold here and I'm just trying to write myself for later. So anyways, keep going.\r\n\r\n\r\nspencer h (18:12.658)\r\ncool.\r\n\r\n\r\nspencer h (18:19.108)\r\nYeah.\r\n\r\n\r\nspencer h (18:22.639)\r\nDoesn't bother me.\r\n\r\n\r\nOkay. So that's honestly something that's like a huge deal for us is parking lots. Like I cannot stress enough that like that ended up becoming like a massive prohibitive factor. And it's like one of those things that we keep seeing event spaces around the country. Like it's like dudes who just like have a massive parking lot. I'm serious, like a giant parking lot, whether it's a big field or whatever and has fairly easy access. So they're not going to jam up traffic for hours.\r\n\r\n\r\nis a huge deal. And it's also become, if you look at music festivals, EDM festivals, all sorts of things. It's a massively prohibitive thing because to have people be able to park conveniently is like, that's a huge deal for events.\r\n\r\n\r\nNik (19:09.976)\r\nThat's so funny. I would think with events businesses, you're worried about the ambiance, the vibe, who's coming, what does it look like? How does it feel? And you're like, if your parking sucks, like those other things don't really matter. I mean, they matter, right? But if parking is an issue, that's the first thing that they're experiencing. So of course they're going to have a bad experience. It's the first thing that they see when they're coming.\r\n\r\n\r\nspencer h (19:32.739)\r\n100%. Like we talk about like really cohesive experience. So like, kind of feel like your customers start experiencing with you the first time they see your ad, right? So like your ad all the way through to the follow-up email at the end of it should be seen as one cohesive, seamless process. And I think you're judged as a company, you're judged as what you're doing from every single one of those moments. And so the way I've always kind of thought about it, it's kind of breaks down into two different things. There's the entire...\r\n\r\n\r\npre-event experience, which is the ad all the way through where the person leaves their house for that day. That's the ad, it's the ticket buying process, it's the follow-up emails, it's the text messages, it's every communication with your customer or the attendee until they leave the house that morning. It's the CS side of it.\r\n\r\n\r\nNik (20:28.194)\r\nLet's see, yes, sorry. Okay.\r\n\r\n\r\nspencer h (20:28.975)\r\ncustomer service, so if they able to get questions, it's their interactions on all your social media platforms. All those things will drive. So a person will be like, I want to go see Sky Lanterns. And they'll go do it. And depending on how good that interaction is, I think contributes to how excited the person is to come out to your event. And if you're screwing those things up on the front end, you're going to end up with people that are\r\n\r\n\r\nare coming out and doing it, but they're already disgruntled. It's the weirdest thing about events is that people can already be like, well, I wanna do this, but I have a bad attitude about it. It's wild. Then once you have them at the event, the venue, that's a whole different thing. And you're 100 % right with parking. We've seen it happen all the time. If there's traffic, bad traffic coming into the event, the entire vibe of the event for the first two or three hours is affected by that.\r\n\r\n\r\nLike people having to wait in their car for 40 minutes, an hour, hour and a half in a traffic jam, or they're coming into parking and the parking lot's a mess, they don't know where to park. Those people, once they come into the gates, are in a different mindset than if that stuff goes seamlessly. So yeah, it's wild, but the traffic and parking is like a huge part of events.\r\n\r\n\r\nNik (21:46.239)\r\nWhy was Spokane your first event?\r\n\r\n\r\nspencer h (21:48.877)\r\nSo we found really early on that the best place to do this is racetracks. Like one of the best places to do it. like they're usually, it's changing now in the last 10 years, but they're usually in fairly rural places. They're usually surrounded by pretty open land. Kind of think about like, you know, a county racetrack or like a, I don't mean horse racing track, I mean like a car racing track. Yeah, yeah.\r\n\r\n\r\nNik (22:13.443)\r\nBecause they're loud right like it's like hey nobody wants their house\r\n\r\n\r\nspencer h (22:16.43)\r\nYeah, yeah, so like 40, 50 years ago, they built them out in the middle of nowhere because they're loud and nobody really wants to develop around them. And so you don't have like big developments around them. So it's usually like horse pasture. In the West, there's a lot of places that sit right on BLM land. And so, yeah, they're loud. And so, and they also have parking lots because racing was huge in America like 30, 40 years ago. So a lot of these guys would bring in 20,000 people and they built parking lots for 20,000 people in the 70s.\r\n\r\n\r\nNik (22:44.782)\r\nSo your friend calls you up and he's like, hey, I'm trying to figure out how to launch this. I want to do this thing. You're not happy in Alaska. And you're like, yeah, man, let's roll. And the first thing you start doing is like, you know what? I think racetracks are probably where we should build this business around. like, how did that kind of roll out?\r\n\r\n\r\nspencer h (23:01.33)\r\nYeah, it didn't go that way at first. It kind of went, it was just kind of like throwing whatever at the wall, thinking like, okay, well, we can't do it in a city, like we can't do it in city parks, because it really, the factor was we have to clean up these lanterns. And so if you're doing it like right next to a neighborhood, it's like, how are you gonna go clean those up? So it's kind of started looking at like,\r\n\r\n\r\nNik (23:25.422)\r\nyou have to like literally go and pick up every lantern?\r\n\r\n\r\nspencer h (23:27.777)\r\nYeah, we do incredibly well with it. Yeah, we pick up.\r\n\r\n\r\nNik (23:31.598)\r\nYou have 25,000 people come to an event, you're picking up 25,000 lanterns?\r\n\r\n\r\nspencer h (23:35.317)\r\nYeah, never did. mean, about 15,000 is about the maximum we can do at an event. We've scaled it down to about 10. Right. Yeah. No, dude, it's crazy. We pick them all up. And it's especially easy in the West where it's kind of open fields. It's easy in Texas. The East Coast is a little harder because there's trees, but we will do several rounds as they get blown out over the course of like the week or two weeks that they come down. And the first event we did it\r\n\r\n\r\nNik (23:40.366)\r\nOkay, pardon me, I'm sorry, 15,000 lanterns? Like.\r\n\r\n\r\nspencer h (24:03.385)\r\nI remember they all kind of blew into this field and it just looked like they went forever. And I was like, we're never going to do this. Like it's never, we're never going to get these things picked up. The wild thing and no one believes it is that with a crew of about 15 people, we can pick up all of the lanterns at about four hours, five hours. It's nuts. It's crazy.\r\n\r\n\r\nNik (24:29.07)\r\nDude, that's nuts. That's are they the same crew? Or is it like every city that you go to, you're like, Hey, whoever wants to come pick up lanterns with us, probably don't need a tree.\r\n\r\n\r\nspencer h (24:36.716)\r\nYeah, it's not like licensing. So like licensed lantern picker effort. We have a crew of anywhere from seven to 10 people that are full-time employed at other jobs who come out and run our events. So think like a ticket manager, a parking lot manager, a stage manager, an infield manager, a merch manager.\r\n\r\n\r\nNik (24:40.513)\r\nYeah.\r\n\r\n\r\nNik (24:44.942)\r\nYou\r\n\r\n\r\nNik (25:02.499)\r\nYeah.\r\n\r\n\r\nspencer h (25:03.636)\r\nAnd then we, depending on the size of the event, we work with either nonprofits, local sports teams, club teams who want to do fundraisers. we, those are the people that then staff most of the things.\r\n\r\n\r\nNik (25:21.166)\r\nHow much does it typically cost for some, like let's say I wanted to take myself and the five members of my family, right, my wife, my four kids, how much cost me to go? Is it a different cost if I just want to see it versus if I actually want to set off a lantern?\r\n\r\n\r\nspencer h (25:28.031)\r\nYeah.\r\n\r\n\r\nspencer h (25:33.993)\r\nYeah, only do, you have to come in and do the whole thing. there's no just like looking at it, you actually have to come in. really, so, and this is kind of one of the things that we've done really well is we structure our ticket pricing differently depending on the country. And then also depending on the sales cycle. if you bought tickets, say a year before our event on Black Friday, your tickets would end up being about 50 % less than if you bought it say a week ahead of time.\r\n\r\n\r\nBut we kind of go for an average ticket price on an event. like, if you came down to Salt Lake and did ours, it would be about, I think our average ticket price over the cost of the entire sales cycle is somewhere between 35 and $40 a person. So.\r\n\r\n\r\nNik (26:16.63)\r\nOkay. And so I get that you have to have lantern picker rappers licensed, excuse me, licensed lantern picker rappers. But like, what does the back end look like? What is your what's the rest of your team that's probably full time throughout the rest of the year? What does that look like?\r\n\r\n\r\nspencer h (26:23.072)\r\nYes.\r\n\r\n\r\nspencer h (26:32.843)\r\nSo it's real, and I think this is something I'm actually incredibly proud of as an entrepreneur. Like I've kind of said that like if you're looking to hire people and you're at like at the beginning of a company, so zero to one or even one to two, I know that's not a real thing, but I feel like it is. If it's like zero to one, one to two, and you're looking to hire somebody, it just means you're lazy or you haven't thought enough about doing it yourself. I feel like that's the truest thing in the world.\r\n\r\n\r\nto a certain extent. And I think once you've gone through that, like, am I being lazy? No, I actually, like, I can't do this. Or have I not tried to figure it out hard enough myself? And like, no, I actually have tried to figure it out myself and I can't do it, then you hire. And most of that stuff ends up just being incredibly specialized stuff, accounting, people that are really good at digital marketing. And so what the team looked like.\r\n\r\n\r\nis that I have two people that work for me full time that do the logistics. So, do what you would consider like a COO logistics. And then we have somebody who does full time operations. So actually, they are the head of the person at the event. I don't step on their toes, I never really have too much. And then we have a third party marketing firm that does most of our marketing.\r\n\r\n\r\nNik (27:37.646)\r\nMm.\r\n\r\n\r\nNik (28:00.034)\r\nAre you planning on like bringing that in house at some point because now you have the marketing company that you just launched or no? OK.\r\n\r\n\r\nspencer h (28:05.597)\r\nWell, that's him. over the course of the year, we became such good friends and we were incredibly good clients. And then we ended up building this together. So he still has his own marketing company and now we are doing this more integrated marketing ticketing platform.\r\n\r\n\r\nNik (28:24.792)\r\nCan you give me an idea, let's just say 5 million, because it's an easier number for me to do math on. If you're doing $5 million top line, what are typical net margins or like what would be your expectation of net margin off of that revenue?\r\n\r\n\r\nspencer h (28:36.49)\r\nYeah, we'd be really happy. We'd be really happy at 20 to 30%.\r\n\r\n\r\nNik (28:44.179)\r\nokay. And like, I'm assuming this is really lumpy. Like if most of your events are happening in spring and fall, you've probably got some dead months in the summer and the winter. Right?\r\n\r\n\r\nspencer h (28:54.12)\r\nYeah, yeah, yeah, yeah, 100%. And so like from, mean, so we start selling tickets for events Black Friday for the next year. And so there is, so we have revenue that's pretty consistent across the entire course of the year. The scary thing about events, and this is like honestly one of the scariest things for me that always like leaves me up at night, is that if you're selling individual products, like a ticket,\r\n\r\n\r\nproduct, right? Like someone buys that product, you deliver that product. They could have an issue with the product, they could send it or they keep it. But you know, within 30 to 60 days. When you're doing events, events that are weather dependent, legislative dependent, a million different COVID dependent, that was incredibly clear. If you sold, say, 70 % of your tickets three weeks before the event, you're on the hook.\r\n\r\n\r\nfor that, right? And so let's just say, let's just say, you have an event that does a half million dollars in revenue? And you've done, say, 90 % of that revenue a week before the event. So you're sitting at $450,000.\r\n\r\n\r\nIf that event doesn't go off, whether if it's canceled, if it's impossible for it to go off the next year, if the city government says, hey, you actually can't do this anymore, you're on the hook for that $490,000 to be refunded. But you didn't actually make that money. That money already has a bunch of associated costs with it. marketing behind it, the fees behind it, behind it, things like that.\r\n\r\n\r\nNik (30:33.486)\r\nYeah.\r\n\r\n\r\nspencer h (30:37.873)\r\nAnd so it's incredibly stressful in that way because up until you get the event off, have, I mean, you're running in the red, if that makes sense.\r\n\r\n\r\nNik (30:42.03)\r\nMm-hmm.\r\n\r\n\r\nNik (30:49.358)\r\nI had read somewhere and I don't know if this is for conferences specific, but for conferences, it's like 80 % of their revenue comes in the final two weeks or something ridiculous like that. Is it the same with your tech with your business or not?\r\n\r\n\r\nspencer h (31:01.289)\r\nSo, yeah, so that's like, that's something we've kind of figured out as well. We like, we really wanted to try to sell as many tickets ahead of time. We don't, we try to sell almost no tickets day of. Probably no tickets a week of, to be completely honest, because we already have all of the goods, the crew, the food trucks. It's kind of hard to like call an audible. But we've now said it, and this is also incredibly scary, we try to sell 50 % of our tickets the last month.\r\n\r\n\r\nbefore the event. we price tickets and then do it in essentially lots all the way through the sales cycle. 50%. We try to hold off 50 % of our tickets. And so then we push a giant advertising thing. We do wait lists, stuff like that.\r\n\r\n\r\nNik (31:40.344)\r\nSay that percentage again, how much before, one month before?\r\n\r\n\r\nNik (31:46.2)\r\nWow. Dude.\r\n\r\n\r\nNik (31:51.116)\r\nYeah, that would give me anxiety.\r\n\r\n\r\nspencer h (31:53.232)\r\nThat gave a ton of anxiety the first year we did it.\r\n\r\n\r\nNik (31:56.14)\r\nWell, how do you measure demand? Like I'd be sitting there like, okay, we're 50%. All right. I don't even know if people are interested in this. Like, how do even know that that's going to actually get sold?\r\n\r\n\r\nspencer h (32:05.48)\r\nWell, now we have a better sense of it than we did when we first started doing it. Yeah, yeah. And we ended up doing that. We ended up doing that because we saw that people were buying tickets at a much higher price the week before. But we were just selling a lot of times because we'd sold almost to capacity. But the tickets that we were selling were coming at a much higher price. And so...\r\n\r\n\r\nNik (32:08.59)\r\nexperience.\r\n\r\n\r\nspencer h (32:32.829)\r\nThe next year we said, let's hold back and we held back I think like 30 % of our available tickets until the two weeks before and that went well. And then we just kind of started pulling that back because I think the nature of people buying tickets is there's a handful of people that buy tickets six months a year ahead of time. But I think most people are driven by the idea of, I don't know, immediate gratification and scarcity. And so...\r\n\r\n\r\nAnd the nature of our event, because it's not a $2,000 Taylor Swift purchase, it's sitting in that price range between $30 and $60, people can kind of make the last-minute decision of like, hey, I don't know what we're doing next weekend, this looks really fun, we've been seeing ads for it eight months. Yeah, cool, I could have bought the ticket for $30 eight months ago, I'm happy to pay it for $55 for it.\r\n\r\n\r\nNik (33:20.206)\r\nto. I am so this is such a cool freaking business. All right, first question, changing gears just a little bit. I think that there I mean, there's just been a change since COVID people are really, really passionate about experiences, whether it's calling or meeting people that you're like cooped up for two years. And then all of sudden, it's like, all right, let's go meet everybody. So I think that there is a ton of opportunity in this space, besides the businesses that you're doing.\r\n\r\n\r\nspencer h (33:36.314)\r\nYeah.\r\n\r\n\r\nNik (33:49.922)\r\nwhich sounds like you're some really cool things. What do you really like in the experiences space? Is there anything that you're like, man, that would be kind of a cool business to have, or are you done with experiences? Are you like, I'm kind of done with the experiences space, I'd rather do something different.\r\n\r\n\r\nspencer h (34:03.912)\r\nMan, I'll tell you what, weather-dependent events are the worst thing on earth. so, because we're dependent on both rain and wind, which is kind of an issue in a way that very few events are dependent on, right? We can't, if there's wind, and no one ever looks at wind when they think about weather, like it's raining or it's not raining. We're like, if it's more than five miles an hour, we can't do it.\r\n\r\n\r\nNik (34:32.578)\r\nMmm.\r\n\r\n\r\nspencer h (34:34.085)\r\nwhich for me is like so stressful. So I have almost no desire to do any events that are weather dependent moving forward. What I really have found interesting this last couple of years is I think that there's a giant place for, I think music festivals are something that I'm super interested in, but I also think the model around music festivals is fairly broken.\r\n\r\n\r\nAnd so I think what we're doing with Stars of Texas, which is our music festival, is actually incredibly cool. So what do you think about music? So I actually am like fairly passionate about this. And we're kind of thinking about like, if there's ways to kind of do more of these moving forward. I don't know, like so many events, there was like kind of a sweet spot pre-COVID. It's funny you said COVID, like there's a sweet spot pre-COVID where you think all of the mud runs, color runs, electric runs, these things, they're just not getting as much traction.\r\n\r\n\r\nas they used to. And I kind of keep thinking like where are people going? And it kind of feels like it's music festivals. But even the music festival, a model is broken. So you think of music festivals like 800 different bands, right? You got four, you got like three different stages. I don't think that's what, and then you have the artists driven crosses are huge. I think what people are looking for when they come to music festival is more like coming out,\r\n\r\n\r\nthere's live music, they can see it, but then having really cool events going on during it. like what we do, yeah, I think it actually is interesting. And I think it's actually something that no one's, I mean, you kind of see it with EDM shows. EDM shows have these massive installations. They have all these kinds of different things people get involved in. You don't see that too much with like country music or rock music or anything like even like ACL, like Austin City Limits. And so.\r\n\r\n\r\nNik (36:08.887)\r\nit's.\r\n\r\n\r\nNik (36:29.262)\r\nOkay.\r\n\r\n\r\nspencer h (36:29.617)\r\nWhat we started doing is we do an event that has a barbecue cook-off. has a PBR, Professional Bull Riders Association qualifying event. So we actually have a bull riding ring we set up in the event. It's cool, we do it at a venue that has a drag racing. They host national drag racing. in between sets on the main stage, we run drag races, walk over and watch literal drag races.\r\n\r\n\r\nAnd then during the headliner, we do a lantern release.\r\n\r\n\r\nNik (37:03.278)\r\nInteresting. It's almost like you've got the county fair vibe going on built around music as opposed to music being brought to the county fair.\r\n\r\n\r\nspencer h (37:12.442)\r\nYeah, I think so as well. And I think that's kind of what people are looking to. And I think people are more willing to bring their kids out to it. And I think that people are more willing to spend the entire day there. And I think they're also like, attract people that are like, you know what, I'm cool with seeing Lady A, but Lady A plus bull riding plus a Lantern Elise plus, you know, drag racing. That sounds like an awesome day.\r\n\r\n\r\nNik (37:18.21)\r\nMm-hmm.\r\n\r\n\r\nNik (37:36.366)\r\nthink the kid the kid factor is a big one. Like I would never go I'm not going to go to Burning Man. I'm not going to go to Stagecoach. I'm not going to any of these big festivals. But if you're like, hey, there's a thing in Caldwell, whatever that's like similar to what you're doing in Dallas, which Caldwell is very close here to Boise. And it was like, there's gonna be good music there and bull riding and good food and drag racing. Like, yeah, I probably bring my kids here.\r\n\r\n\r\nspencer h (37:38.491)\r\nYeah.\r\n\r\n\r\nRight.\r\n\r\n\r\nspencer h (37:58.886)\r\nRight, and have you ever tried dragging your kids around to a music festival where there's bouncing from one stage to another stage with bands that you can't a fuck about? Yeah, no one would do it, right? And that's kind of the same thing, but think there is, I think millennial parents are much more attuned to doing things with their kids. They just are, before any generation. And so that was also kind of the thing that I thought was like, this is awesome, because it actually is something you can bring your kids to.\r\n\r\n\r\nNik (38:06.382)\r\nNo! No! I would never do that!\r\n\r\n\r\nspencer h (38:28.111)\r\nYou don't have to, it's feels to anybody else. Like if you just wanna sit and drink and watch music, you can.\r\n\r\n\r\nNik (38:33.432)\r\nThat's a really cool thesis. Can I tell you, can I tell you a thesis? It's silly, but I really want to do something called the anti conference. So have you ever been to like an industry or association conference? They're the worst. All they are are people going and like listening to other people talk to them about how cool they are and like, I accomplished this and this is what you can do with this. Yeah, they're bad. They're bad. And where do you hang out 99 % of the time? You're like in the foyer or the lobby.\r\n\r\n\r\nspencer h (38:34.692)\r\nYeah.\r\n\r\n\r\nspencer h (38:40.965)\r\nAll right. Yeah, yeah, yeah, yeah.\r\n\r\n\r\nspencer h (38:52.709)\r\nDude, they're so fucking bad. Right? Yeah.\r\n\r\n\r\nspencer h (39:01.21)\r\nYeah.\r\n\r\n\r\nNik (39:02.508)\r\nmeeting other people. Okay, so I'm like, all right, if the goal of going to conferences is just to meet other people anyways, when I have a conference that is specifically geared to facilitating conversations and connections with other people. So I would want to have an anti-conference. You could bring your kids and we'd have, this would be hard with the liability, but you know, full schedule. It's almost like a camp for the kids as well that they could have like little tracks that they could do. Will your kids come? And then you as the parent, you go and it's like, all right, we have a pickleball tournament. We have\r\n\r\n\r\nspencer h (39:23.898)\r\nYeah.\r\n\r\n\r\nNik (39:31.95)\r\ncooking classes, have improv classes, we have ping pong competitions, like things that are just like designed to get you interacting with other people. They can be competitive in nature, or they can be fun in nature. But like at the end of it is like a little bit of downtime where you can then connect and like, man, did you see that shot you did? so cool. thanks. I've been playing for a little while. Right. And then all of sudden you're talking about not just your business, but also like you're making interpersonal connections. And then once a day, maybe you have a keynote or\r\n\r\n\r\nspencer h (39:45.163)\r\nRight.\r\n\r\n\r\nspencer h (39:52.364)\r\nYeah, right.\r\n\r\n\r\nspencer h (40:01.348)\r\nMm-hmm.\r\n\r\n\r\nNik (40:01.89)\r\nsomebody really cool come talk to the conference, but I'm like, I think I think that conference, like I would pay to go to that conference. And I think people would really enjoy that. But what you're articulating is, you don't want the same experience. Like, let's go to the music festival and have music playing at me. Like, I do want to my kids with me or I do want to have other experiences if I'm going to go. Tell me how bad ideas.\r\n\r\n\r\nspencer h (40:16.964)\r\nMm hmm. Yeah. No, I think it's great. I honestly think like I think like I mean, I would want to make it price prohibitive, right? So that you have the people that you actually want to network with. But like, I mean, like that's and I think that's something that's really interesting. Like that idea is interesting because I feel like, know, within.\r\n\r\n\r\nIf you're doing things like playing pickleball with somebody, you know very quickly, I want to work with that person. That's a person that I want to keep in my life. That's someone that I'm interested with. I think that most entrepreneurs are able to quickly figure out who fits their vibe. And for me, that's the most important thing as well, is it's like, hey, am I going to be able to work with this person? And so to be able to actually do that, where the walls are broken down, where it's not like, here are.\r\n\r\n\r\nMy bottom line, like, you know, all those kinds of things, like, you're playing pickleball with somebody. Sounds awesome.\r\n\r\n\r\nNik (41:12.778)\r\nAll right, so I have a couple questions left. One of them is going to be what the hardest thing about scaling these businesses was. So that's in the future. But before I that, where's the best place for people to come and find you?\r\n\r\n\r\nspencer h (41:29.75)\r\nnightlightsevent.com. Yeah.\r\n\r\n\r\nNik (41:32.11)\r\nNightlightsEvent.com. Okay, cool. You said something earlier when we were talking, when I described your businesses and you're like, man, yeah, when you say it like that, it sounds a lot more impressive. I had a similar experience a couple of years ago where I was like, doing the math and I realized, my gosh, my company's did $30 million this year. Like it was just so, not EBITDA, that was top line revenue. And it was just so crazy to me that I would have anything that was approaching that size. And I think\r\n\r\n\r\nspencer h (41:50.34)\r\nGreat.\r\n\r\n\r\nNik (42:01.25)\r\nI think it's crazy because you just know everything that sucks in your business. Like it did. Yeah.\r\n\r\n\r\nspencer h (42:04.354)\r\nYeah, it's the only thing you dwell on. It's like the only thing you dwell on. And like, it's crazy because as it started going, I was like, we're making like, you know, like, it's funny. I was able to start this. went to my father-in-law for a loan after being married to my wife for 15 years. And he was like, you know, you've never done anything that I've ever thought was, he's like straight upset. He's like, I've never done anything that's ever been like very impressive to me. And I was like, wow, thanks, Yeah, his name is actually Gary. But like, yeah, yeah. But he loves me, but like.\r\n\r\n\r\nNik (42:27.726)\r\nThanks, Gary.\r\n\r\n\r\nspencer h (42:34.031)\r\nAnd I felt like it was a fair assessment. I'm like, yeah, that's probably about right. That doesn't go away though. That's what's crazy is it's like every single year, I'm like, we did this, but this could all fall apart tomorrow. that is like, yeah, sorry, sorry, go on with your question. It's like, it's so frustrating.\r\n\r\n\r\nNik (42:56.93)\r\nNo, no, no. I think it's two things. think one thing is, even if your business is doing 10 million or $30 million a year, and you haven't had a liquidity event, it's not like you have that money in your bank and you feel like, yeah, I built a $30 million company. You're not you're reinvesting everything back into the business. You're trying to grow, you know, you made mistakes and wasted money. But then the second point is like, you know, everything that sucks with your business. And you're like, I don't think a $10 million business should have x, y, problems.\r\n\r\n\r\nspencer h (43:11.882)\r\nRight, right, right.\r\n\r\n\r\nYeah.\r\n\r\n\r\nspencer h (43:25.922)\r\nright?\r\n\r\n\r\nNik (43:26.51)\r\nThat's like your own preconception. That was all like a pretext for this question. What advice would you give yourself 10 years ago?\r\n\r\n\r\nspencer h (43:39.867)\r\nman.\r\n\r\n\r\nNik (43:42.2)\r\nPre entrepreneurial self, you're thinking about, know, you're in Alaska and you're like, I hate my job. I want to do something different. If you could go back in time, like what advice would you give yourself?\r\n\r\n\r\nspencer h (43:55.308)\r\nFuck, probably get started. I don't know. Get started, but then also there's no easy money. Anybody who makes it look like this was easy, you know, and it's kind of the thing I always see in the Twitter, like grind us for your space is like, no, Airbnb, your house is hard. Managing rental properties is hard. Everything's hard, but it's also...\r\n\r\n\r\nNik (43:59.48)\r\nGet started.\r\n\r\n\r\nspencer h (44:23.679)\r\nyou gotta get started, I guess. And then, I think it's like the mindset, right? Once you get started, the things that seem hard become easy, but there's always something hard that's next. And so it never feels easy, because there's always a new hard, I guess. And I think that that would be the thing that I would tell myself is like, if you get started, yeah, it's never going to be easy.\r\n\r\n\r\nNik (44:33.966)\r\nand new heart.\r\n\r\n\r\nspencer h (44:51.682)\r\nthat's challenging and rewarding at the same time. I haven't really thought about that too much.\r\n\r\n\r\nNik (44:54.702)\r\nto that.\r\n\r\n\r\nChris, my business partner and I have talked about this recently. We get a lot of people who are asking us for advice and I'm like, dude, if you like really knew who we were, you would not be asking me for advice on stuff, right? Like it's just.\r\n\r\n\r\nspencer h (45:08.866)\r\nThat's everybody, right? I don't have any wisdom on it. guess, like, I don't know. Don't do things that you know are illegal. I really don't.\r\n\r\n\r\nNik (45:21.9)\r\nthat's your point is where we come back to is like, just get started. And and Chris gets a lot of crap because he posts a lot of like, I don't even know hustle porn where it's like, no, you could do this side hustle, you could do this business and people give them crap work because they're like, Why are you making this look so easy? Why? you're actually if you did that, you wouldn't be able to do this, this and this. And Chris's whole thing is like, Well, if I told you everything, you'd never get started. My hope is that I inspire you to get started. And that naivete, you know, carries you forward. So like there is\r\n\r\n\r\nspencer h (45:31.81)\r\nI don't know. Right.\r\n\r\n\r\nYeah.\r\n\r\n\r\nspencer h (45:44.737)\r\nRight.\r\n\r\n\r\nNik (45:51.01)\r\na lot of value in just getting started.\r\n\r\n\r\nspencer h (45:53.026)\r\nYou know what it is? I guess it's get started and keep showing up. Cause I feel like that there is like, I mean, there are so many days where I don't even want to show up anymore. Where I'm just like, God damn it. Like this is like, you solve a problem and then it's another problem. And you're like, shit, this is a bigger problem than the last problem. And like, it's like, and I, and in my head, I think, well, there's got, there's going to be a day where there's no more problems.\r\n\r\n\r\nwhich I hope, like I think that's going to be the case eventually, right? You do a liquidity or whatever. But I think it's like, get started and then just keep showing up. And I think like usually the people that keep showing up end up having really good things happen for them eventually. Is that fair to say? I think that's fair to say.\r\n\r\n\r\nNik (46:40.014)\r\nIt is. I like what I would say to you as well is when and if you sell Spencer or you put in an operator and like you have smooth sailing, I promise you in a month or two months, you'll be like, OK, I'm bored. want some problems. I said, getting started in entrepreneurship is solving problems like I love solving problems. I don't like when I saw my company is like I sat there kind of twiddling my thumbs like, all right, what's next? This is boring. And as sucky as it is to say, it's like I do like.\r\n\r\n\r\nspencer h (46:53.909)\r\nYeah, yeah.\r\n\r\n\r\nNik (47:09.312)\r\nfixing things and and I think for your personality as well you would find that okay yeah I don't have the problems anymore but I kind of miss figuring it out.\r\n\r\n\r\nspencer h (47:16.897)\r\nDude, 100%, like I tell my wife all the time, I hate working. I hate it. I hate working, but I really love solving problems. And like, I don't really care. And I've like realized this about myself and it's kind of debilitating as well because it's like, I don't really care about what I'm doing as long as there's a problem to solve. So as people are like, you know, like it's like, don't, I think I could probably go and start like a car repair shop. And if it was like,\r\n\r\n\r\nthere's interesting problems here to solve. think it would be as fulfilling as anything else, which I feel like that's very much the truth.\r\n\r\n\r\nNik (47:53.326)\r\nI edit this part out, but dude, so, sold some businesses. It's been a year and I've realized I really like helping people, right? I don't wanna become a coach where you're paying me 10 grand a month, like, here's my community, or here's my course. But at the same time, I have a wife and she's like, hey, are you just dicking around on YouTube all day? Or like, what's going on? Guilty.\r\n\r\n\r\nspencer h (48:10.803)\r\nMm-mm-mm.\r\n\r\n\r\nspencer h (48:16.648)\r\nright? Like yes.\r\n\r\n\r\nNik (48:22.56)\r\nBut for me, what I realized is like, I'm now getting questions from people and like, you know what coaching, I am helping you solve a problem. And guess what, I don't have to have the infrastructure of like a massive team, I don't have to investment, I don't have to have like all the mental load of growing a big business, but I can have still the same payoff of seeing you be successful or like helping you fix the problem. Right. And so I've really leaned into it, and I'm really enjoying it. And I'm trying to get over the like,\r\n\r\n\r\nspencer h (48:32.96)\r\nHmm.\r\n\r\n\r\nspencer h (48:40.97)\r\nRight.\r\n\r\n\r\nNik (48:47.438)\r\ncringy of like, are you just a guru? And like, I want to come off and I'm not that I'm even big enough to be a guru. But in any sense of the word, but that I'm like trying to get over that because I do find a lot of joy and fulfillment in helping other people. And I don't want to jump back in to operations. I've had many opportunities from private equity funds or other individuals who are like, Hey, I'll back you. And I'm like, Yeah, I don't have any interest in that. I just don't.\r\n\r\n\r\nspencer h (48:49.407)\r\nYeah.\r\n\r\n\r\nspencer h (49:03.326)\r\nYeah.\r\n\r\n\r\nspencer h (49:07.614)\r\nYeah.\r\n\r\n\r\nspencer h (49:12.032)\r\nYeah, I mean...\r\n\r\n\r\nNik (49:12.999)\r\nThere's someday someday for you my friend.\r\n\r\n\r\nspencer h (49:15.424)\r\nI've thought about how I think I'd be happy just being a sheriff sometimes, going around and like, and I don't really like cops that much, it's like, it'd be, yeah.\r\n\r\n\r\nNik (49:22.83)\r\nYou would you would be happy for a period of time you'd find something else anyways. Do this has been this has been awesome. I don't have any other questions for you. I will. We'll get this edited up. I'll stop recording right now, but I'll send you the transcript.\r\n\r\n\r\nspencer h (49:34.483)\r\nYeah.",
  "metadata": {
    "duration": "",
    "date": "2025-01-15",
    "platform_source": "Google Drive"
  }
}