{
  "episode_number": "51",
  "episode_title": "Building a 7-Figure Coffee Business with Mouyyad Abdulhadi",
  "guest_name": "Mouyyad Abdulhadi",
  "business_name": "Pax and Beneficia Coffee",
  "transcript": "﻿Nik (00:01.492)\r\nAll right, Mouyyad, welcome to Nicanomics. I'm stoked to have you, my friend. How are you?\r\n\r\n\r\nMouyyad Abdulhadi (00:06.51)\r\nI'm great man, how are you?\r\n\r\n\r\nNik (00:08.18)\r\nI'm doing fantastic. Let's just hop into the nitty gritty here. Tell me about your business, what you do and how you make money.\r\n\r\n\r\nMouyyad Abdulhadi (00:16.366)\r\nYeah, so I am the CEO and co -founder of Pax and Beneficia Coffee. We are a five, soon to be six location coffee company in Dallas Fort Worth. We are a modern coffee shop with subtle influences from different regions, mainly around the Mediterranean and the Middle East. That's where I'm originally from, but lived in Dallas my whole life, so this is home.\r\n\r\n\r\nWe started PAX in August 2019, so in two months, this will be our five -year anniversary. So it's been a while. Thank you so much. It's been a wild ride. PAX and Beneficio. Yeah, PAX. So PAX and Beneficio means Peace and Blessings in Latin.\r\n\r\n\r\nNik (00:49.108)\r\nCongratulations, man.\r\n\r\n\r\nHow do I say the name again? Tax. Okay. What's the difference between the two?\r\n\r\n\r\nNik (01:04.564)\r\nMouyyad Abdulhadi (01:04.59)\r\nAnd we wanted to be the reason that really resonated with us. We were picking names and I'll give credit to my partner Mamdouh. He's a physician out of Columbus, Ohio. And we literally came up with the entire concept on a train ride from Oslo, sorry, from Stockholm to Oslo on a trip. We talked about coffee, we talked about everything. And then he taps me on the shoulder and says, hey, I got the name for the coffee shop. And I said, cool, what is it? And I said,\r\n\r\n\r\nNik (01:25.268)\r\nAmazing.\r\n\r\n\r\nMouyyad Abdulhadi (01:34.606)\r\nHe said, Paksim Benethesi means peace and blessings. And one, it's a part of our Islamic reading, as well as part of our language. And then two, it allows us to kind of fulfill the mission of the brand, which is to provide an environment, an ambiance, a source of peace and blessings to everybody that walks in through our doors, whether it's employees, honored guests, vendors, partners, whoever it may be.\r\n\r\n\r\nNik (02:02.292)\r\nYeah, that's awesome. I do have to ask, I've always thought the restaurant business, and I know coffee's not exactly a restaurant, but it's customer service. You're selling a product that somebody ingests. Those are hard businesses. What's your background? Why did you choose to get into opening a coffee shop?\r\n\r\n\r\nMouyyad Abdulhadi (02:22.318)\r\nYou know, it's funny, I was actually having a conversation earlier today with someone. I have, I had no restaurant or coffee experience before this. Coffee was a passion, a hobby.\r\n\r\n\r\nover through college and after that as I got into the workforce it just became just something that I love doing so from aero presses to V60s to finding cool unique coffee shops in different cities and attaching them to itineraries and and that became a hobby and it became wait one day I'd love to open a coffee shop which I think\r\n\r\n\r\nmaybe half the people listening might have that thought one day. They're like, I'd love to open a coffee shop. And I'd literally get asked at least twice, three times a month by somebody having those same thoughts. And then when we had the concept and found the first location, it was, hey, you already do this. And we dove right in and we had no idea what we were doing. We didn't know what we didn't know, but we made it work.\r\n\r\n\r\nThankfully, built a reputable brand in a tough market that's recognized for the quality customer service. And no brand is perfect. And no business is perfect, but we strive to be as close to as we can.\r\n\r\n\r\nNik (03:41.812)\r\nYeah. So I'm going to, I'm going to ask you about the business and all that stuff in a second, but I'm really curious. I don't drink coffee. I don't drink alcohol. but I grew up in Northern California. So Northern California, Napa Valley, tons of vineyards. And I always thought it'd be amazing to have a vineyard, right? Like just you retire, you buy a vineyard, you're growing grapes. Even though I don't drink alcohol, I just thought it'd be cool. But I know that there's a lot of VCs who have retired.\r\n\r\n\r\nbought vineyards and then like wasted a bunch of money because they didn't know what they were doing. It's a hard business to actually operate. I'm assuming, is it similar in this space? Like, hey, I'm gonna open a coffee shop. Like, is that, are there a lot of people who open coffee shops and realize within one or two years, like this isn't for me and I'm out?\r\n\r\n\r\nMouyyad Abdulhadi (04:15.922)\r\nyou\r\n\r\n\r\nMouyyad Abdulhadi (04:28.633)\r\nI haven't seen the I'm out as much and I don't know if it's because of People feel stuck or they're so into it that they can't get out of it type thing\r\n\r\n\r\nNik (04:37.94)\r\nMm.\r\n\r\n\r\nMouyyad Abdulhadi (04:38.83)\r\nBut I feel like, and I'm in a lot of like Facebook groups and talked to a lot of owners, people in the coffee industry really love what the coffee industry represents, which beyond the coffee is the connection to humans, the human connection, the empathy, the personal touches. People don't go to coffee shops. And I say this to my team all the time is coffee is just a tool. It's a mechanism for us to connect with each other. So when somebody comes in to Pax and Beneficio,\r\n\r\n\r\nThey're they might be there for the coffee and they've heard good things but more than likely they're either there to either meet with someone else, they're there for a job interview, they're there on a first date, they're there to get work done. So if you take out the coffee part of it they're there for a very humanistic need to be in a place that they might not want to just be stuck at home or in the office or any other area. And as owners whether it's one location or multiple locations\r\n\r\n\r\nNik (05:31.444)\r\nMm -hmm.\r\n\r\n\r\nMouyyad Abdulhadi (05:38.592)\r\nThat's ultimately why we do what we do. It's really cool to see people come in. Like right now I'm in one of our locations talking and there's two ladies there just crocheting while they're sipping on their coffee. And I'm just like, that's just cool to see, right? The reason is irrelevant, but the coffee or the food or the drinks or the channel by which they come. So I don't know why if that's... Sorry, so to answer your question,\r\n\r\n\r\nNik (05:52.692)\r\nYeah.\r\n\r\n\r\nNik (05:56.5)\r\nYeah, yeah.\r\n\r\n\r\nMouyyad Abdulhadi (06:08.496)\r\nThat's why people kind of stay, I think, more in the coffee industry because of that human connection.\r\n\r\n\r\nNik (06:11.668)\r\nSo talk to me a little bit about coffee in particular. I know like in the wine industry, people get really obsessed with their wine, where it came from, what the vintage is, like what the topography, not topography, but the climate of where the grapes were grown. You kind of see it as well in the barbecue space. I mean, you're in the South, right? Like, Kentucky has the best brisket or Texas has the best brisket.\r\n\r\n\r\nMouyyad Abdulhadi (06:20.59)\r\nThank you.\r\n\r\n\r\nNik (06:37.684)\r\nPeople get really obsessed with the food and, what kind of wood chips did you use? Is it smoked, et cetera? I've found there's a very similar aspect to that in coffee, where people are very particular about their coffee. Tell me a little bit about coffee. Why does it differ across the spectrum of coffee? To me, why doesn't it all just taste the same?\r\n\r\n\r\nMouyyad Abdulhadi (06:37.998)\r\nYeah\r\n\r\n\r\nYep.\r\n\r\n\r\nMouyyad Abdulhadi (06:48.206)\r\nAbsolutely.\r\n\r\n\r\nMouyyad Abdulhadi (06:54.15)\r\nyou\r\n\r\n\r\nman, well that's a good question. So there's so many variables and there are people that are a lot more knowledgeable and that's scientific part of it than I am. But I will say just by virtue of the different climates that coffee's in, the different altitudes that it's grown in, the different soils, the different methodology, there's so much variety of different.\r\n\r\n\r\nthe different coffee, even to the point where like if you go to Columbia and there's two farms right next to each other in the mountains of Antioquia, there are, there are completely different tastes in coffees because of how the farmer handled something different than the other. So when people...\r\n\r\n\r\nNik (07:43.188)\r\nIs it the taste that's only differentiated or are the effects of it different as well? Like does one have a higher, I don't know, caffeine concentration than another?\r\n\r\n\r\nMouyyad Abdulhadi (07:53.166)\r\nThat more depends on the roast levels.\r\n\r\n\r\nSome beans have different caffeine varieties, but then you're talking about kind of the origins of the coffee, which is mainly at the caffeine level. We're talking about arabica beans versus the ragoosta beans. Ragoosta is a lot more caffeinated than arabica. 99 % of the coffee people drink is arabica beans. So it won't venture on that. Like it just the roast levels might dictate how much coffee or how much caffeine is on the. So that's kind of where that happens.\r\n\r\n\r\nNik (08:16.564)\r\nReally?\r\n\r\n\r\nNik (08:25.62)\r\nWhere are the beans from?\r\n\r\n\r\nMouyyad Abdulhadi (08:27.822)\r\nThe arabica beams originated in Ethiopia or Yemen, but depending on which\r\n\r\n\r\nmyth and legend you heard, right? The story is some shepherd on the mountains had a flock of sheep and the sheep were eating some berries off of a tree and then they started acting jittery and running around and then he took the cherry and ate it and he's like, man, and then that evolved into us putting it in water and brewing it and grinding it and then the rest is history over the course of...\r\n\r\n\r\nNik (08:48.244)\r\nReally?\r\n\r\n\r\nMouyyad Abdulhadi (09:02.414)\r\ntwo, three, 5 ,000 years where we are right now.\r\n\r\n\r\nNik (09:05.876)\r\nYeah, I mean, have you ever, sourdough has like a starter, right? In order to bake sourdough bread, you have to get a starter from somebody else, which like boggles my mind. Kefir, have you ever heard of kefir? All right, so kefir is the same way, like you have to get a starter from somebody else. And those have always fascinated me, because I'm like, somebody had to figure that out first. Coffee is like similar as well. It's not like you just pick the bean up, grind it and drink it, right? Like there's a process.\r\n\r\n\r\nMouyyad Abdulhadi (09:18.222)\r\nYeah?\r\n\r\n\r\nNik (09:34.356)\r\nto what you do. Can like walk me through the process from harvesting that crop to like drinking it. What does the bean go through?\r\n\r\n\r\nMouyyad Abdulhadi (09:41.902)\r\nYeah, yeah, so multiple stages. So one, the harvest, we'll say the tree is ripe and the cherries are harvested. Coffee is essentially a fruit. The bean itself is essentially the seed of that fruit. So if you eat the cherry, it's actually very, very sweet.\r\n\r\n\r\nSo then the, yeah, it's very, very sweet. So, and then depending on the methodology by which the farmer processes that coffee, so there's like wash where they wash the pulp out and dry the beans or a natural or honey process where they add a little bit of honey into it and the cherry kind of shrivels with it. It kind of gives that same coffee might have different.\r\n\r\n\r\nNik (10:22.74)\r\nMm -hmm.\r\n\r\n\r\nMouyyad Abdulhadi (10:28.014)\r\ntaste based on that processing methodology. And then from there it gets all processed and packaged up into these burlap sacks and depending on which importer you're dealing with or which roaster orders that coffee it gets shipped to wherever. So here there's a lot of great importers in\r\n\r\n\r\none of my cafe imports or Falcon Coffee or Red Fox or Caravello, some of these other big ones. They buy those beans directly from the farmers, but they also work a lot with the farmers to make sure that the crop is very good. It tastes good. It's up to standard. Like don't use these pesticides, use these fertilizers, use, try this processing method.\r\n\r\n\r\nto get the best coffee out. And then for us, then we buy it from the importer. So we get pallets shipped in with the burlap sacks and we get green coffee in. So it's literally like green. And then we roast it here in our, and that's where the whole, that's a whole other fun scientific process. So roasting is about, it's a function of time and temperature.\r\n\r\n\r\nhow much temperature you put in and to how much time to get the flavors that you want. And what's interesting there is two roasters might have the same coffee and because of their roasting methodology, they have my taste completely different. Somebody might like it a little bit darker. Somebody might like a little bit lighter. Some like it medium. Some like it where I like this part where I get the kind of floral and fruity flavors out of it. Some like it more on the chocolatey darker side. And then from there, from the roasting day, it's packaged up in the bag.\r\n\r\n\r\nor sent to our cafes and then people might either buy the bags online or buy the bags in store or buy a latte or a flat white and grind it and sell it.\r\n\r\n\r\nNik (12:16.244)\r\nreally hope when people listen to this, they're as interested in this as I am. I just find it fascinating. I want to take a this will be my last like coffee specific question that I'll actually ask you about your business. But I took this class in college. I can't remember what the name of it was. But it was like the history of food. And a couple things that they talked about chocolate, like the discovery of chocolate in the Americas was game changing, obviously for the world. But I always remembered for some reason that coffee\r\n\r\n\r\nMouyyad Abdulhadi (12:22.094)\r\nYeah.\r\n\r\n\r\nMouyyad Abdulhadi (12:32.078)\r\nYeah.\r\n\r\n\r\nMouyyad Abdulhadi (12:41.838)\r\nyou\r\n\r\n\r\nNik (12:45.3)\r\nbecame popular from the Americas. But it wasn't this guy, like, obviously, there's probably a brand within the Americas, but it originated in the Middle East, right? Ethiopia, Yemen, but they're both really close in that region. When did it start becoming really popular? Do you have any idea?\r\n\r\n\r\nMouyyad Abdulhadi (12:48.469)\r\nYou did that already!\r\n\r\n\r\nMouyyad Abdulhadi (13:02.621)\r\nYeah, so there's multiple what they call waves of coffee and I might I might be a little bit rusty on my history so I believe the first wave I Mean, let's say before the first wave. Let's say like when Ethiopia MN so then the the trade route started taking coffee towards like\r\n\r\n\r\nNik (13:13.46)\r\nOkay.\r\n\r\n\r\nMouyyad Abdulhadi (13:25.55)\r\nIstanbul and kind of southern Europe where because of like the\r\n\r\n\r\nIslamic Empire influence so it started kind of proliferating the Empire so all around the Mediterranean and all those areas and then there's also stories of Sufi Imams and drinking coffee at night for their prayers and stuff so then that started going into Europe and in Europe around the time of the Enlightenment so right after the\r\n\r\n\r\nNik (13:56.628)\r\nRenaissance period.\r\n\r\n\r\nMouyyad Abdulhadi (13:57.422)\r\nReformation, the Renaissance, right around those times. So people started drinking coffee in these coffee houses. And that's where they discuss politics and religion and science and all of this. Phrases over cups of coffee. So then naturally when those coffee houses became popular and then colonialism started happening, it started coming to the Americas and then coffee started showing up here and in these areas. And then around the time of the Industrial Revolution and fast forward\r\n\r\n\r\nthrough the 50s, 60s, 70s, 80s, you had coffee on a mass scale because then like your Folgers and your Maxwell House and these like the big coffee companies started coming up.\r\n\r\n\r\nAnd then from there, and I don't remember where the distinction of the first and second wave kind of specific. I think Starbucks technically is like second, third wave where it kind of became a more popular thing. And then third wave coffee came in, which is kind of around when we kind of entered into the market at the tail end of the third wave, which is people wanted specialty coffee where specialty coffee tastes a little bit more elevated than your standard commodity grade coffee. What I mean by that is coffee is\r\n\r\n\r\ngenerally scored on a hundred point scale. 80 and above is specialty. Starbucks might get their coffee Brazil or what some of these other companies it might be like in the seventies. Whereas specialty is like 80 and up. 90 and up is like some of the best cups you ever drank.\r\n\r\n\r\nNik (15:21.108)\r\ninteresting.\r\n\r\n\r\nNik (15:27.252)\r\nWho scores them? Is that subjective or is there like a clear rubric for grading coffee?\r\n\r\n\r\nMouyyad Abdulhadi (15:32.142)\r\nIt's a very, it's a, there is some subjectivity to it, but it is a clear, clear scoring system based on the body, the roasting, the sweetness, the aroma, the aftertaste, where it sits on your palate, the uniformity in the roast, all that. So there's a thing called Q graders. It's kind of like sommeliers essentially. These Q graders will go cups to coffee and they score based on these different metrics. And then these Q graders are, it's a, it's a, it's an organization called the Specialty Coffee Association.\r\n\r\n\r\nNik (15:35.508)\r\nand\r\n\r\n\r\nInteresting.\r\n\r\n\r\nNik (15:54.196)\r\nMm -hmm.\r\n\r\n\r\nInteresting.\r\n\r\n\r\nMouyyad Abdulhadi (16:02.048)\r\nThese Q creators go and have to calibrate their Q palates so everybody in the industry has generally the same baseline of understanding of what a good coffee tastes like, what a bad coffee tastes like, what an excellent coffee tastes like. So specialty coffee third way, that's kind of what people were seeking which is that higher quality coffee where\r\n\r\n\r\nNik (16:11.86)\r\nMm -hmm.\r\n\r\n\r\nMouyyad Abdulhadi (16:25.302)\r\nyou'll, I think even if you like, even my parents, for example, drink Folgers, right? Still, even to this day, they drink Folgers at home. But when I make them a cup, exactly, exactly, exactly. It doesn't matter where you are, you know that jingle. And between, when I make them a cup of coffee, they immediately taste the difference, right? And they don't, I mean, they're not coffee people. They're not, they don't have a trained palate on that side of things.\r\n\r\n\r\nNik (16:33.236)\r\nbest part of waking up.\r\n\r\n\r\nMouyyad Abdulhadi (16:52.238)\r\nbut they know there's a difference. And when you go to Starbucks versus any specialty coffee shop, you should be able to taste the difference of espresso. And now we're entering kind of the fourth wave of coffee where cafes are becoming more than just coffee shops. They're becoming a place where people are not only hanging out, but they also expect more from the experience from the hospitality side, the culinary side. They want food, they want better pastries, they want a better ambiance, a better environment. And that's kind of where we're entering now.\r\n\r\n\r\nNik (17:19.764)\r\nThat's interesting. I mean, I know there's a lot of economic history on the influence of coffee, because once coffee was implemented, people became more productive. And like, it was at first kind of looked at as the hangover cure, because a lot of people in Europe obviously drank a lot. But just its adoption around the world has also coincided with a productivity gain that's that's pretty noticeable. So for you, as you were looking at this, you entered the market as a specialty\r\n\r\n\r\ncoffee house. You don't just buy the coffee and like you actually roast the beans there. So there's a differentiation. Okay.\r\n\r\n\r\nMouyyad Abdulhadi (17:57.582)\r\nWe do now. So we started roasting two years ago. The first two years we were ordering from a roaster, Merritt Coffee in San Antonio in Austin, Annandale's, and they were, they're a phenomenal roasting company. Yes, yes, yes. Yeah, no, no, no, exactly. Not commodity -grade, not at all.\r\n\r\n\r\nNik (18:12.82)\r\nBut it was still roasted locally, right? You weren't just buying kind of like industrial scale coffee.\r\n\r\n\r\nSo like, you know, there are some coffee places that have very clear differentiation. Starbucks is on like every quarter, right? And like McDonald's, it's just standardized. You know what you're gonna get every time you go. Dutch Bros is this like smaller, you're not really going inside. It's just drive through and you're trying to get in and out as quickly as possible. You've decided to differentiate on quality and experience. Is that a fair characterization? So how does that manifest itself in the price\r\n\r\n\r\nMouyyad Abdulhadi (18:42.318)\r\nYep. Yep. I see so.\r\n\r\n\r\nNik (18:49.3)\r\nyour coffee. Let's say like a cup of coffee at your shop versus Starbucks. Like what's the average?\r\n\r\n\r\nMouyyad Abdulhadi (18:50.062)\r\nYeah.\r\n\r\n\r\nMouyyad Abdulhadi (18:54.83)\r\nYou know, it's funny you say that because so we are perceived to be higher end on pricing, but we just did an analysis literally, I got it yesterday. We are actually undercharging on most of our menu compared to the specialty coffee market. And when I saw that and I was so hesitant to raise pricing, so from a business side and I'm like, I feel like we're there, we're there, we're there. And then I got this analysis back.\r\n\r\n\r\nNik (19:10.548)\r\nReally?\r\n\r\n\r\nMouyyad Abdulhadi (19:23.694)\r\nAnd I'm like, all right, time to increase pricing. So I think pricing is a very interesting thing, right? So when you buy a luxury car, you know you're paying a higher price, right? When you go to stay at a Ritz -Carrollton, you're paying the higher price because you know you're getting the top of the line service. But...\r\n\r\n\r\nfor a coffee for most people, they either appreciate, so let me kind of change, like spend this a little bit different way. Most people, I'd say 95 % of people know good coffee versus bad coffee, but they don't care what the origin is, what the processing method is. They just want a good cup of coffee. But I'd say there's probably 5 % of people that,\r\n\r\n\r\nWe genuinely care where the coffee comes from, where the processing is, is it roasted to perfection, all of that stuff. So in our company's perspective, I've said this from day one, if we can appeal to the 5%, then 95 % will get tamed care of, regardless, just by virtual. So coffee for us, so it's always about...\r\n\r\n\r\nhighest quality beans, does it fit our profile? We're always on like the medium, medium light, sometimes rarely a little bit darker, but we're always on the, at least in that medium tier. And when you get to that level of coffee, you have the opportunity to taste different things in the coffee. For example, I am very partial to fruity and floral flavored coffees. We just had a geisha that was sold out within two weeks, which is one of the highest quality coffees\r\n\r\n\r\ncan get and you're drinking that you're literally drinking it's almost as if you're drinking like an Earl Grey tea. That's how that's how floral and aromatic it is. All that to say for when it comes to pricing so we are perceived to be higher but I even think in our own company we can even push the envelope a little bit further because of the analysis I just got. I literally got it yesterday which is very funny question you're asking.\r\n\r\n\r\nNik (21:31.028)\r\nYeah. That's awesome. Well, I mean, yeah, I'm just curious because like you are you're differentiating on quality and obviously Starbucks, we get it Dutch Bros, I get it. They're they're trying to optimize for scale because if they reach those economies of scale, they can achieve really margins and that's fine. I think what you said, though, is really important. You decided to niche down on the 5%. It wasn't just I'm gonna open a coffee shop and the ambiance is gonna be great. And you're like,\r\n\r\n\r\nNo, I'm going to go for the 5 % who can act and you were very clear, like very specific, who can actually identify the difference who are willing to pay a premium, who want this vibe who care about where it's sourced like there. You named like four or five things in there, where some people just do that first step analysis where it's like, I'm looking for, you know, middle aged men, that's what I'm going to market to. You went like a step further. Was that intentional upfront or\r\n\r\n\r\nAs you've gone through it, you're like, actually, yeah, these are our customers. Did you like back into it later?\r\n\r\n\r\nMouyyad Abdulhadi (22:34.158)\r\nNo, I think that was intentional from day one and for us in a unique way, this part was by accident. So we knew the coffee was going to be that 5 % but because of the way we set up our cafes and the ambiance and the environment in each cafe,\r\n\r\n\r\nGood.\r\n\r\n\r\nMouyyad Abdulhadi (22:53.038)\r\nWe also, by virtue of doing that, also attracted the rest of the crowd that cares about the environment and ambiance and I guess for like a better term the Instagram cafe where they can take pictures and it looks pretty and stuff. So both those together kind of happened simultaneously, which was the accident.\r\n\r\n\r\nNik (23:02.836)\r\nYeah, yeah, yeah.\r\n\r\n\r\nMouyyad Abdulhadi (23:11.438)\r\nRight, so like now in hindsight, I'm like, yeah, we did make those right decisions because we were able to cater on the coffee side to 5%. But the rest of the 95 % not only get great coffee, but they get a great environment and ambiance.\r\n\r\n\r\nNik (23:25.396)\r\nWell, like, for those who are watching, I can like there's a guy behind you who's working, obviously, which is fine. But it's like it's like a we work mixed with a coffee shop, right? It was like, yeah, you can come work.\r\n\r\n\r\nMouyyad Abdulhadi (23:29.998)\r\nYeah\r\n\r\n\r\nMouyyad Abdulhadi (23:35.247)\r\nYeah, people are... I mean, so a lot of... there's another differentiator, I think, for us, but we're getting more specific, is generally coffee shops don't like it when people sit and work all day because they're taking up the seat and they're only buying one... I made it from day one. I'm like, I don't care if people sit here for two days and they don't order anything.\r\n\r\n\r\nThey're here, they're honored guests. They've chosen to come in and spend their money here. They've chosen to come in and spend their hard -earned dollar and their time in our cafe. That means something. I don't care if they stay all day.\r\n\r\n\r\nAnd that's the kind of message that we've pushed forward is what we've been calling and I've been kind of reiterating to our team is the honored guest experience. Everybody coming in is an honored guest with the full meaning of that word. It doesn't matter why or how or from where or wherever or what they're doing. They are honored guests and we treat them as such. Specific examples. And that's kind of why we're able to, I think, maintain the differentiated. There's other cultural coffee shops.\r\n\r\n\r\nNik (24:30.996)\r\nYeah.\r\n\r\n\r\nMouyyad Abdulhadi (24:37.808)\r\nThere's plenty of Yemeni coffee shops. Those are fine. There's a lot of specialty coffee shops. They're great. Yemeni. Yemen, Yemen, Yemen, where they've in the last, I'd say two years, they've taken their coffee heritage and culture and embraced it fully and started building cafes all across the country.\r\n\r\n\r\nNik (24:42.26)\r\na lot of work. BME.\r\n\r\n\r\nokay.\r\n\r\n\r\nNik (24:59.092)\r\nThat's rad.\r\n\r\n\r\nMouyyad Abdulhadi (24:59.374)\r\nAnd they're phenomenal. They're phenomenal. There's a lot of specialty coffee shops that arguably might be better coffee than us. And that's okay too. But for us, we've been able to marry and kind of carve our own niche between ambiance, environment, and specialty coffee.\r\n\r\n\r\nNik (25:14.996)\r\nSo I don't know, this is gonna, if it comes across as an ignorant question, then I'm sorry. I don't think you'll take offense to it. Is it a different experience to drink coffee in the Middle East versus the United States? Like everything in the United States, right? We have fast food. It's like get in, get out, right? We're just trying to get in, get out. Is it like there, is it like, hey, come meet for an hour or like sit for an hour, enjoy your coffee? Like, is that kind of where this ethos comes from, your background or?\r\n\r\n\r\nMouyyad Abdulhadi (25:22.318)\r\nNo, no such thing. No, no.\r\n\r\n\r\nNik (25:44.82)\r\nIs that just something you've kind of philosophically always felt and decided you wanted to have it and that's kind of independent from any any background that you have?\r\n\r\n\r\nMouyyad Abdulhadi (25:48.814)\r\nNo, I think it comes from our from our background and and and I'll go back to kind of our childhood and me and my partner have this was great because we have kind of a similar upbringing there. For example, coffee was served when we had guests over at the end of the night. So you'd be ready to leave and you'd say, no, no, no, the coffee, the coffee is the water is boiling or getting the coffee ready.\r\n\r\n\r\nAnd that is an indication for them to stay longer. And I don't remember ever a time where somebody in, like I guess at my parents' house, didn't stay another hour, hour and a half after that coffee was made. It doesn't matter what time of the night it was. It was like, it could be one o 'clock at night. We're like, no, no, coffee's getting ready. Stay, stay, stay. And that's the ethos that we've kind of tried to instill in our company.\r\n\r\n\r\nNik (26:27.988)\r\nThat's awesome.\r\n\r\n\r\nNik (26:35.603)\r\nHmm.\r\n\r\n\r\nNik (26:41.588)\r\nYeah.\r\n\r\n\r\nMouyyad Abdulhadi (26:43.598)\r\nPeople are here, again, back to the beginning, it's the human connection. Coffee is just a tool. Coffee is a channel by which we connect with others. If they're here, they're honored guests and they should be treated as such regardless of what they order or how long they stay.\r\n\r\n\r\nNik (26:57.588)\r\nSo how does that translate to the business? Like what metrics are you looking at? Like what is, I have so many questions. Let's just start here. Per location, what do you average revenue?\r\n\r\n\r\nMouyyad Abdulhadi (27:09.838)\r\nSo revenue depends on which location. So our busiest location does close to 900. This year might do a million. Our two second busiest locations will do anywhere from five to six hundred thousand. Our third, our fourth location is probably about 450, four to 450. And then our smallest location would just open last year, it'll do about maybe 200, 250.\r\n\r\n\r\nNik (27:13.108)\r\nOkay.\r\n\r\n\r\nMouyyad Abdulhadi (27:39.182)\r\nOur average ticket size is about $12, $13.\r\n\r\n\r\nNik (27:42.868)\r\nThe last one's not like they're not stabilized yet, right? Like maybe you will always have an outlier of a million is always the busiest, but on average you're kind of what are you shooting for five to 600?\r\n\r\n\r\nMouyyad Abdulhadi (27:46.958)\r\nUhhh...\r\n\r\n\r\nMouyyad Abdulhadi (27:52.558)\r\nThe average, if I can get to 600, then it's solid. That's kind of my average. And yeah.\r\n\r\n\r\nNik (28:00.468)\r\nAnd how do you, so how does that compare to say Starbucks? How is Starbucks?\r\n\r\n\r\nMouyyad Abdulhadi (28:04.238)\r\nI think Starbucks does, I don't know if it's still accurate, but I remember when I was researching for practice, I think they used to do a million a store, but that's how busy they are. And they have drive through and some were in a lot of areas a little bit bigger, but I think very similar to Starbucks locations. I think they're also like 1800 feet. Our biggest cafe specifically is 1700, so it's not that different.\r\n\r\n\r\nNik (28:10.58)\r\nOkay. And is there square footage? Is there square footage similar to your square footage? Are you a little bigger?\r\n\r\n\r\nNik (28:31.572)\r\nAnd do you look at like revenue per square foot, profit per square foot, revenue per customer? Like what are your key metrics?\r\n\r\n\r\nMouyyad Abdulhadi (28:39.182)\r\nI should look at that in more detail, but I don't. Especially revenue per square foot. I know that's a very important metric that we should be looking at. I don't look at it as much. I'm mainly just looking at sales per day, sales per month location, and then average ticket sizes. And then that kind of gives me the idea of what each person is spending. And we're at about $13, which is on the higher end for coffee shops.\r\n\r\n\r\nNik (29:02.484)\r\nI was going to ask that. So your average ticket price is $13. What would it be at like Starbucks?\r\n\r\n\r\nMouyyad Abdulhadi (29:09.198)\r\nProbably closer to eight nine if they order pastries\r\n\r\n\r\nNik (29:13.124)\r\nokay, so you're 50 % higher than Starbucks.\r\n\r\n\r\nMouyyad Abdulhadi (29:15.182)\r\nYeah, well, that's my design because we've added food. We've like, especially so in end of 20. Right before COVID to 21, we started adding toasts and toasts like avocado, ricotta, different kind of things there. It became a about 9 % of our food of our sales was food. This past year through the end of Q4, it became about\r\n\r\n\r\nNik (29:19.54)\r\nMmm.\r\n\r\n\r\nMouyyad Abdulhadi (29:44.942)\r\n12 % because we updated the food menu to add more items like sandwiches, sweet, savory, kind of more unique things. We just relaunched the food again and elevated it again and we're now at about 16, 18 % food. So, and each of these food items is the cheapest one I think is $9 because it is elevated food.\r\n\r\n\r\nNik (30:04.18)\r\nHow does that compare? Let's say you're 16, 18 % food, Starbucks is what, 10 %?\r\n\r\n\r\nMouyyad Abdulhadi (30:12.75)\r\nSo their paste use are probably 10%, I would say. I mean, without looking at it, they'll probably tap that 10%.\r\n\r\n\r\nNik (30:15.636)\r\n10%. Okay.\r\n\r\n\r\nWell, because like, I mean, it makes sense, right? Starbucks, they're going to have to optimize for volume. And if you're not optimizing for volume, which is just not your ethos, that's fine. Then you get.\r\n\r\n\r\nMouyyad Abdulhadi (30:27.15)\r\nRight. Yeah, we can't, we can't, we have by virtue of how we're like as busy as we are, we can't be as busy as a star. It's just by virtue. Yeah. Yeah. So it depends. So this full transparency here, we weren't actually profitable until the end of last year.\r\n\r\n\r\nNik (30:35.86)\r\nNo. What is your net margin on these locations? Is there a percentage that you're like in a range of?\r\n\r\n\r\nMouyyad Abdulhadi (30:51.726)\r\nbecause all of the money was being invested back into the company. We were optimizing labor, optimizing cogs, all this stuff. But then this year, we're looking at our goal is at least 10 % every month, at least. I would like to be at 15%. I think the higher, like the high, high goal would be 20 % of our jobs. That's going to be extremely hard to reach, but I think we could be able to get to 10 to 15 % consistently.\r\n\r\n\r\nNik (31:18.996)\r\nDo you have any idea how does that compare to a Starbucks? Do you have any idea what their net profit margins are?\r\n\r\n\r\nMouyyad Abdulhadi (31:24.494)\r\nI don't know Starbucks typically, but I know the specialty coffee industry, it's generally around 10%, 10 to 15%. I would imagine that somebody like a Dutch Bros or I'm not sure Starbucks, I'll say like a Dutch Bros or like a Seven Brews kind of these companies, their margins are a lot higher because they're smaller footprint. Labor is probably a lot higher, rent is probably a lot lower. So they're probably getting closer to that 20 % margins.\r\n\r\n\r\nNik (31:31.444)\r\n10 to 15 minutes.\r\n\r\n\r\nNik (31:48.596)\r\nYeah, I think you've entered the industry in the right way. You decided to focus on a niche and you doubled down on it, right? Like you're not trying to be everything to everybody. You're very clear with what your customer profile is and you've gone hard at that. I think that's awesome.\r\n\r\n\r\nMouyyad Abdulhadi (32:01.166)\r\nHelp.\r\n\r\n\r\nYeah.\r\n\r\n\r\nAnd that's going to be the way forward as we grow as a company, whether this year, for example, the focus has been on DTC e -commerce. So as we grow that channel by itself, you're looking at 40 to 50 percent margins there easily. It's just a lot of effort to get that up and running. As we add more locations, the exciting things about adding more locations, sure, it's complex, operationally complex and the people side and all that stuff. But from a say, from a corporate perspective, which is this year,\r\n\r\n\r\nsitting at home, your corporate overhead gets spread off across more stores meaning you'll be more profitable. Like the roaster salary is a roaster salary, the director of ops salary is a director of ops salary, but as you get more locations that kind of gets split out across more people. The marketing is the marketing.\r\n\r\n\r\nNik (32:39.796)\r\nYep. Yep.\r\n\r\n\r\nNik (32:52.276)\r\nHere's my last question on the business. What's your goal with it? So I think you said you're about to open your sixth location, which is fantastic. Are you planning on just staying in DFW? Do you want to grow this regionally, nationally, or are you kind of just taking it one day at a time?\r\n\r\n\r\nMouyyad Abdulhadi (33:01.934)\r\nThanks.\r\n\r\n\r\nMouyyad Abdulhadi (33:09.294)\r\nSo it's fun, I get that question a lot and I always have a tough time answering it because even getting to this point was a series of trial and error and just seeing what works and growing with that. But where we're at now, there's only a few things we can do. We can keep building more locations, which is great, which requires a lot of capital. We can do nothing and keep optimizing and just enjoy what we've built and keep it moving.\r\n\r\n\r\nwe can franchise, which personally I'm just not for because of managing. I think I feel like you lose the brand and what we and the brand is so important to what we've built that if we start losing that, I think we might struggle. But again, not saying no, but maybe. And then ultimately, I think the other fourth option is a series of like either merger acquisitions or exits, right? Meaning we sell to a bigger company.\r\n\r\n\r\nAll of those are on the table until something materializes. Like I'm not gonna stop working until I get a buyer or whatever. That's just crazy. But we're gonna keep going.\r\n\r\n\r\nNik (34:15.412)\r\nYeah, I mean.\r\n\r\n\r\nMouyyad Abdulhadi (34:21.038)\r\nWe're going to keep building until the right opportunity comes. I would love to be in other states. I think that would be awesome to be able to say your national brand. That would just be incredible. Of course, it would become one of its own challenges and opportunities. But even here in DFW, the market is so large here in DFW that we don't know where we're going to end up. We could be at 10 locations by next year and we wouldn't even still scratch the Dallas market.\r\n\r\n\r\nbecause it's so big.\r\n\r\n\r\nNik (34:52.436)\r\nTrue, Dallas is a massive, massive market. All right, well, I have some rapid fire questions for you. Are you ready? All right, what do you love about this business?\r\n\r\n\r\nMouyyad Abdulhadi (34:54.606)\r\nIt's crazy. It's crazy. Let's do it. Do it. The people. So seeing people come in and enjoy the coffee, enjoy the drinks and they come up and they're like, are you the owner? And I try not to be visible, but I'm like, yeah. And they're like, man, we love it. Thank you. And all this. That's awesome. Always awesome.\r\n\r\n\r\nNik (35:17.652)\r\nThat's awesome.\r\n\r\n\r\nYeah, the hospitality. What do you hate about it?\r\n\r\n\r\nMouyyad Abdulhadi (35:24.493)\r\nManaging people at this level with this many locations is hard. So having everybody row the same direction is hard. And as many frameworks and leadership philosophies and stuff as you employ, it's still a tough, tough way to run a business. So that's kind of what I, I wouldn't say hate, but always a challenge. Yeah.\r\n\r\n\r\nNik (35:31.924)\r\nYeah, that's true.\r\n\r\n\r\nNik (35:51.636)\r\nDon't enjoy. Yeah, I get it. I get it. For you, as you sit here, everybody's jealous to some capacity of other industries. Like I'm jealous of the commercial real estate industry, because I'm like, that would be amazing. Triple net lease, collect rent, don't have to worry about it. What are you jealous of? What industries are you jealous of right now?\r\n\r\n\r\nMouyyad Abdulhadi (36:05.166)\r\nYeah. SAS. Yeah. SAS because somebody told me once, move pixels, not people. And it's sat in my mind since then because it is a lot easier to move pixels than people.\r\n\r\n\r\nNik (36:12.692)\r\nSass, that's a common one too.\r\n\r\n\r\nNik (36:19.988)\r\nMm.\r\n\r\n\r\nNik (36:27.572)\r\nYou know, you though have a product that could become sass like you could start selling subscriptions to your coffee, right? Because you're roasting it now you could start selling online. Okay, so that's, that's a that's a potential. That's a that's a potential good business.\r\n\r\n\r\nMouyyad Abdulhadi (36:32.302)\r\nYeah.\r\n\r\n\r\nMouyyad Abdulhadi (36:37.774)\r\nYeah, we do. We do.\r\n\r\n\r\nMouyyad Abdulhadi (36:45.038)\r\nWell, let me, hold on, I missed, hold on, this quote was actually, like that'll actually change it. It moved pixels, not atoms.\r\n\r\n\r\nNik (36:53.876)\r\nyeah, yeah, okay. Yeah, because you're still, yeah, you're still, you're still selling a product. That makes sense. They are. Yeah, they are.\r\n\r\n\r\nMouyyad Abdulhadi (36:55.886)\r\nYeah, because then even the coffee, right? Physical products are hard. I mean, even the D2C folks, I'm sure they can vouch for this too. All that stuff is really hard.\r\n\r\n\r\nNik (37:08.5)\r\nIt is, I agree. All right, last two questions. If you had two free hours in the day, you didn't have any family responsibilities, you didn't have any work, what are you obsessed with right now? What would you do with those few hours?\r\n\r\n\r\nMouyyad Abdulhadi (37:24.878)\r\nI will learn Spanish.\r\n\r\n\r\nNik (37:26.932)\r\nMouyyad Abdulhadi (37:28.302)\r\nreally focused on learning Spanish. I've been trying to learn for a long time. I go to Columbia and the coffee side and the South America, it's so valuable to learn that part of it. And two, there's an Arabic musical instrument called Oud. It's like the big round, it's like a guitar, but it's 11 strings. And each, it's five, two strings and one unique. So I learned, I started learning the basics like four years ago, five years ago.\r\n\r\n\r\nNik (37:34.772)\r\nYeah.\r\n\r\n\r\nNik (37:47.252)\r\nOkay.\r\n\r\n\r\nMouyyad Abdulhadi (37:57.838)\r\nbut I haven't committed to learning it. So I do one hour Spanish and one hour of that.\r\n\r\n\r\nNik (38:01.908)\r\nOkay, awesome. That's awesome. All right, last question. What advice would you give to your pre -entrepreneurial self?\r\n\r\n\r\nMouyyad Abdulhadi (38:13.973)\r\nDon't be so hard on yourself. It's gonna come. So I was like, I'm a very, I'm very hard on myself, I think.\r\n\r\n\r\nNik (38:17.268)\r\nWhat do you mean? Okay.\r\n\r\n\r\nMouyyad Abdulhadi (38:25.39)\r\nbeing all the sibling, straight A student, trying to make sure it works, everything works. You just get really hard on yourself as you're building because you see stuff and like, man, it should be this way or why is it this way or what happened here? And you get into these rabbit holes and it's very demoralizing. But if you just take a step back and enjoy the fruits of your labor and just see what you built, it's actually...\r\n\r\n\r\nDon't be so hard on yourself because it's great.\r\n\r\n\r\nNik (38:54.804)\r\nI always have a hard time with that one because yes, don't be so hard on yourself, but part of the reason you're here is because you are hard on yourself. And there's always a balance there, right? Like you don't wanna be unhealthily hard on yourself, but you also don't wanna lose that edge that you have that's gotten you to a point where you're concerned about quality. But I do agree with you. Yeah. Well, this was, Moya, this is...\r\n\r\n\r\nMouyyad Abdulhadi (39:02.958)\r\nbecause you are yourself.\r\n\r\n\r\nMouyyad Abdulhadi (39:12.782)\r\nyou\r\n\r\n\r\nYou're absolutely right. You're absolutely right. Absolutely.\r\n\r\n\r\nNik (39:21.972)\r\nbeen an awesome conversation. Where can people find you?\r\n\r\n\r\nMouyyad Abdulhadi (39:24.017)\r\nLikewise. On Twitter, Instagram, or I guess X these days, Instagram, LinkedIn, yeah. It handles -O -U -Y -Y -A -D -A on X. Yeah, that's probably the best way.\r\n\r\n\r\nNik (39:28.692)\r\nOK. That's right.\r\n\r\n\r\nNik (39:35.956)\r\nI'll link that. Yeah, I'll link that one in the show notes and then and DFW people were the name of your company again.\r\n\r\n\r\nMouyyad Abdulhadi (39:43.566)\r\nHacks and Beneficia, we have five locations, soon to be six all across DFW, so stop in and say hi.\r\n\r\n\r\nNik (39:48.436)\r\nOkay, packs and benefits here. Hey, this was awesome. You had a good one.\r\n\r\n\r\nMouyyad Abdulhadi (39:51.886)\r\nThanks, John. You too.\r\n\r\n\r\nNik (39:53.972)\r\nAll right.",
  "metadata": {
    "duration": "",
    "date": "2024-08-30",
    "platform_source": "Google Drive"
  }
}