{
  "episode_number": "70",
  "episode_title": "How I Overcame $250K Fraud to Build a Thriving $9M Company with Austin Linney",
  "guest_name": "Austin Linney",
  "business_name": "Anti-Private Equity Group",
  "transcript": "﻿nik (00:00.673)\r\nAll right, the man, the myth, the legend, Austin Linney. Welcome to Nicanomics, my friend. Yeah, yeah, there's nobody else here. It's just you. All right, I'm stoked to have you.\r\n\r\n\r\nAustin Linney (00:07.986)\r\nIt's me. It's me. I was talking about me. Well, here, I want to talk about something first. And I thought about this morning, knowing I was going to talk to you. When I first had you on my podcast, I called the Navy SEALs. I called some other people. I was worried that you were being held hostage in your camp. And now we're upgrading. We got the lights. We got the soft. Your screen looks great. You got the mic. Let me tell you something. What I love about you...\r\n\r\n\r\nnik (00:17.345)\r\nOkay.\r\n\r\n\r\nnik (00:27.137)\r\nHeh!\r\n\r\n\r\nAustin Linney (00:37.006)\r\nis if you're gonna do something, you do it the right way. And your shift to upgrading is so quick. I love that when you decide to do something, you're in and it shows. Because the clips I'm seeing on X or Twitter and the podcast guests you're getting are absolutely amazing.\r\n\r\n\r\nnik (00:50.241)\r\nThank you.\r\n\r\n\r\nnik (00:56.385)\r\nWell, thank you, man. Honestly, it's all due to you because you made me feel so insecure about it. I had to run out and just buy all the best equipment. Austin told me I look like I'm in a Russian prison camp. No, thank you.\r\n\r\n\r\nAustin Linney (01:11.069)\r\nHey blink blink blink blink twice if you need help. How come died?\r\n\r\n\r\nnik (01:17.057)\r\nThank you, man. Yeah, I've spent a lot of time and energy just trying to get it so it looks presentable. There's still a lot I need to do. Like it's not, it's not where I want it to be, but I'm like, okay, cool. Camera's good. Lighting's good. Like we're, it looks, it looks good enough for the, for the time being. all right, my friend, for those who don't know you, tell us what your business is and how you make money.\r\n\r\n\r\nAustin Linney (01:25.902)\r\nMm -hmm. Yeah. Love it. Love it.\r\n\r\n\r\nAustin Linney (01:39.63)\r\nSo we own a what we call anti -private equity group. So we actually give a shit about humans. So that's right off the bat. I mean, if I just didn't shoot across the bow right off the gate. And I cut my teeth in real estate and we will get there, but this company right now buys trade companies. We started with HVAC, plumbing and electric. We purchased that 16 months ago.\r\n\r\n\r\nnik (01:49.345)\r\nOkay.\r\n\r\n\r\nAustin Linney (02:06.03)\r\nThere's a first acquisition and we just opened our second. We do plumbing, HVAC, electric, commercial, install, residential install, home hold generators.\r\n\r\n\r\nnik (02:15.553)\r\nSo your thesis essentially is services, in particular home -based services, is where you're getting into?\r\n\r\n\r\nAustin Linney (02:23.822)\r\nWell, spending seven years in real estate, you have investor houses and an AC breaks and until an AC breaks, that's kind of your first foray into the game. Right. And so my brother -in -law who had been around the block a couple of times, I got some AC quotes in the middle of July in San Antonio. And one was like, I felt like you felt like it's high, but you're not really sure it's high. And so you're like, I might go with that. And, and, you know, you don't know, you know, and so he calls, he said, call this guy named Philippe.\r\n\r\n\r\nHe's like, I think it'll be cheaper. And I called him and he's like, yeah, it was like $7 ,000 cheaper. And I was like, what? I was like, what? And so I called back the company and I go, well, I got a bid for this. He goes, I mean, we could do it for this. And he came down like six grand. And I was like, OK, hold on. I was like, so then I started, you start getting into the game, right? And you start learning. And what I did, Airbnb is at a large scale, hotels all around the country.\r\n\r\n\r\nnik (03:01.153)\r\nmy god.\r\n\r\n\r\nnik (03:13.249)\r\nWhat the f -\r\n\r\n\r\nAustin Linney (03:22.382)\r\nAnd I realized that the investor is always the one that gets paid last. These companies seem to get paid. And so then I read Buy Then Build, and I was kind of just over lenders. And what we decided, the basic thesis was, we're tired of going to banks. We're tired of dealing with lenders. We want to create and buy cash flowing businesses. We want to become the bank.\r\n\r\n\r\nuse the profits from the businesses to then go invest in real estate. So flip the paradigm on its head was basically why we started this kind of venture.\r\n\r\n\r\nnik (03:50.465)\r\nMm -hmm.\r\n\r\n\r\nnik (03:57.249)\r\nYeah.\r\n\r\n\r\nAnd the first thing you got into was HVACs.\r\n\r\n\r\nAustin Linney (04:03.63)\r\nHVAC plumbing electric. Yes, sir.\r\n\r\n\r\nnik (04:05.889)\r\nDude that is so crazy to me. $7 ,000 difference?\r\n\r\n\r\nAustin Linney (04:09.486)\r\nI'll do one better. We've been interviewing, right? We're hiring. So I interviewed with my local, the biggest competition we have. They own seven different companies. It's a long story. I interviewed their lead installer. Okay, this is the dude that does all of North Pittsburgh and everything. And I said, just for shits and grins. I said, we feel like we're high in our area. I said, for shits and grins. I said, if we were to install this HVAC in this furnace, what would you charge? He goes, well, it's funny that you say that.\r\n\r\n\r\nHe goes, I just got my cousin a price. They gave me a friends and family discount that was $19 ,700. We sell the same system for $11 ,000. And we feel like we're high. And so, okay, wait, we're hitting all of our margins at this number. Okay. So you start, when you start like, and what you realize in this space is like data is everything, right? And what I mean by that is\r\n\r\n\r\nnik (05:06.433)\r\nYeah.\r\n\r\n\r\nAustin Linney (05:07.79)\r\nSo we bought a company that had closed down in our local area. So I live in a rural area with small towns. So I had been looking for the owner of this company for six months. I could not find him to save my life. One of my sales... So I thought they were still in business. I wanted to talk to him about maybe... I heard he was wanting to retire. So I couldn't find him. He lives off the map.\r\n\r\n\r\nnik (05:20.289)\r\nWhat does that mean? You knew that there's a company, but you're like.\r\n\r\n\r\nAustin Linney (05:35.534)\r\nlike, and then my sales guy sends me a DM and he goes, this guy selling two garage full of HVAC equipment. That has to be a company. I was like, it has to be a company and it's in the area. I said, give me his number. I said, give me his number. So I go out there the next day and his wife answers the door and she goes, please get all of this crap out of here. She goes, she goes, she goes, he's been doing this 50 years.\r\n\r\n\r\nShe goes, I want to go RVing. She goes, please. And so I said, okay, well maybe, I said, what you got to have? And she said, I said, it's a little much. So I said, look, here's the deal. I'll give you this if you give me the phone number and you give me the GMB and you give me your customer list. And she goes, I don't care. And so she says, look, you got to add another thousand onto it. So listen, this is...\r\n\r\n\r\nThis is people that had no, they literally shut everything down. They didn't want anything. He had made plenty of money. So when I tell this story, I don't want anybody to get frustrated and say I fleeced them because I gave them more than they asked for. OK, just so we're clear. So they wanted the equipment gone. So I said, I will be here tomorrow. I'll be here tomorrow. OK, with the trailer, it'll be gone. I paid them the money. They went RVing the next day. They're happy as a clam. I have since.\r\n\r\n\r\nmade in eight months, I think I made like $300 ,000 off of that customer list. And so when you\r\n\r\n\r\nnik (07:11.297)\r\nso you just bought the customer list. You didn't buy any of their supplies or inventory or.\r\n\r\n\r\nAustin Linney (07:14.318)\r\nNo, I bought all the equipment. I bought all the equipment. I bought the GMB. I bought everything for 9500 bucks.\r\n\r\n\r\nnik (07:22.977)\r\nIs that the business that you bought or is this like attack on or just a roll up? Geez.\r\n\r\n\r\nAustin Linney (07:25.024)\r\nNo, this was a tack -on. This was a tack -on. So yeah.\r\n\r\n\r\nnik (07:30.913)\r\nSo, okay, I feel like the scientists at Los Alamos right now, when they discovered that they could split the atom and they were like, my gosh, nuclear power is incredible. Could we harness this? You know what, if we could harness this, you know how much power we could generate through what I feel like them right now, because I'm like, Austin Linney, if I could harness him, can we harness him? I don't know. But if we could, it would be amazing. So I'm going to try to harness you a little bit here.\r\n\r\n\r\nAustin Linney (07:59.726)\r\nYeah, you're fine.\r\n\r\n\r\nnik (08:00.897)\r\nYour first acquisition was in a rural town. It was, okay. HVAC plumbing electric.\r\n\r\n\r\nAustin Linney (08:02.798)\r\nYes. 3 .74 million.\r\n\r\n\r\nHVAC, 80 % commercial HVAC, 80%. They did plumbing, a little bit of electric, if not nothing, but mainly focused commercial HVAC, electric plumbing. 23 years in business, yes.\r\n\r\n\r\nnik (08:20.577)\r\nAnd you moved from Texas to rural Pennsylvania to oversee this operation.\r\n\r\n\r\nAustin Linney (08:27.918)\r\nSo the seller had been in the business from 16. He was 66. He'd been in the trade for 50 years. Okay. So when we get in contract and we know we're going to close, that was a stupid move on my own part too, when we know we're going to close. Don't ever say that in a transaction ever again. Okay. But I was interviewing CEOs to run the business. Okay. We're talking about like, we got big plans. So we're talking about, I'm flying around the country.\r\n\r\n\r\nnik (08:35.809)\r\nGosh.\r\n\r\n\r\nAustin Linney (08:55.694)\r\ntalking to guys that had built $100 million portfolios and trying to convince them this was 18 months ago. So I'm trying to convince them to not go with PE, go with us, give them a huge chunk and then grow it. And I'm meeting them and they say all the right things and they know all the right people and they do all the right things. And I had like eight meetings in Pittsburgh and it was the middle of winter and I was driving up, it's an hour and 45 minutes to where we bought.\r\n\r\n\r\nnik (08:58.689)\r\nAnd what year was this?\r\n\r\n\r\nAustin Linney (09:24.942)\r\nSo from the airport, I'm driving, my mentor sends me a song. This is a true story, I swear to God. He sends me a country song about living on a big ranch and having your family and having everything that you need. It's the first time I heard this song and it hit me. It's nine o 'clock at night, I'm exhausted. It hit me. Are these people gonna get me closer to my dreams than I am of myself?\r\n\r\n\r\nAnd so I called all the owners the next day and I said, I've told every CEO, no thanks. I'm taking the CEO.\r\n\r\n\r\nAnd they go, okay, well that's new. So then I called my fiance back in, I called my fiance back in Texas. I said, pack up all of our stuff, we're coming up here in six days. So I literally like was there and flew back. Yeah. There you go. Well, good news is she's down for an adventure. But I really think, right?\r\n\r\n\r\nnik (10:08.193)\r\nThanks for the heads up, Austin.\r\n\r\n\r\nnik (10:17.473)\r\nAnd she said, well, guess what, Austin, all of your exes now live in Texas. Okay, I'm not moving to Pennsylvania.\r\n\r\n\r\nnik (10:29.697)\r\nThat's awesome.\r\n\r\n\r\nAustin Linney (10:32.91)\r\nAnd I think this is something that's not talked about enough and this is why I want to bring this up to point. Especially if you're getting into your first business. I thought I ran businesses. Like I thought I knew like I had like three four person shops in different you know residential coaching consulting. The business would not be around today if I wasn't on site. Period. End of story. And I've only shared bits and pieces of the fraud\r\n\r\n\r\nthat we uncovered, the quarter of a million dollars that was missing, stolen from the business by the former office manager, and the toxic people that were doing 5 % sales projects, like in making sure they got their, I mean, all these things. So we have to hit a 40 % gross margin, 35, 40 % gross margin, they were hitting 5%.\r\n\r\n\r\nnik (11:20.161)\r\nWhat does that mean? 5 % sales project.\r\n\r\n\r\nAustin Linney (11:30.414)\r\nSo they were getting their commissions, they were selling projects so they could keep, so they could get their commissions, but the company wasn't making any money, but there was no bookkeeping, so nobody knew that the company wasn't making any money. And so all these things that you uncover, and look, I'm all for passive ownership, right? And here's what's crazy, in the 17 months of doing this, I've changed my entire viewpoint on almost everything I believed up in business. Everything. You cannot get me to purchase another business if it doesn't.\r\n\r\n\r\nnik (11:33.793)\r\nOw.\r\n\r\n\r\nAustin Linney (11:59.694)\r\nmake me want to sing from the mountaintops because of all the pain of basically rebuilding this entire business. And here's where it gets fun. So through all that pain, we're going to go from doing 3 .2 million last year to almost 8 .5 to 9 million this year. That's a huge...\r\n\r\n\r\nnik (12:19.585)\r\nHoly crap, that's a massive jump, Austin.\r\n\r\n\r\nAustin Linney (12:22.158)\r\nYes, it's big. I feel every bit of it right now. Yeah, I feel every bit of it. We can't hire enough. The leads are flowing in. The commercial projects, the commercial projects that were supposed to be last year got all pushed to the same month.\r\n\r\n\r\nnik (12:31.009)\r\nShe's slow, isn't she?\r\n\r\n\r\nnik (12:37.153)\r\nWell, I want to touch on one thing before we get into like the economics of the business. And you said it, I think that is one of the most dangerous things that I see on social media. It's not, hey, anybody could buy a business. I don't agree with that, but I also don't think it's the worst thing in the world, right? I think, you know, theoretically, almost anybody could buy a business, but not anybody should put that to the side. This like idea of, I'll just, I'll just buy it and hire a CEO.\r\n\r\n\r\nAustin Linney (12:46.766)\r\nMm -hmm.\r\n\r\n\r\nnik (13:06.785)\r\nIs the wrong idea man like if you do not understand this business or if you don't understand business at a high level and have the support and infrastructure necessary to give you insights and transparency into how that business operates in real time, you're screwed. You are at the mercy of that operator or that seller and I'm not saying it can't.\r\n\r\n\r\nAustin Linney (13:26.766)\r\nLet's have a conversation that nobody talks about ever, and it needs to be talked about more. And I'm the president of the company now. I handed over CEO Reigns three months ago to my CEO. He is absolutely amazing. I swear to God, I've never met somebody as driven, detail oriented, 20 years in the business. We gave him ownership in the private equity group. That's how amazing this human being is. He's not allowed to leave. He's in the witness protection program.\r\n\r\n\r\nnik (13:51.873)\r\nThat's rad, man.\r\n\r\n\r\nHe's not allowed to leave.\r\n\r\n\r\nAustin Linney (13:56.11)\r\nI'm in best friends with his wife. I made him buy a house here. He's not going anywhere. He's amazing. He's amazing, right? But let's call it what it is. This is a true story. My pulse, and don't get me wrong, I'm everywhere. I'm hiring, I'm down at projects, I'm everything. But my majority, besides my reports I get, my pulse on the business is a Google review of three cents.\r\n\r\n\r\nnik (14:00.321)\r\nOkay.\r\n\r\n\r\nAustin Linney (14:25.454)\r\nThink about that. Hear me out. I have 44 employees. We went from 18 to 44 employees in 13 months. I'm probably going to go to 60 in the next three months. Probably go to 80. Okay. So there's a million sales out there. There's a million vans. We're in five different customers houses a day. There's a $2 million project there. $2 million project there. There's eight people over there. We're down there. Parts are coming in everywhere. Right. How can you keep track of all that stuff? And then Frank.\r\n\r\n\r\nnik (14:25.697)\r\nWhat do you mean? Okay.\r\n\r\n\r\nAustin Linney (14:54.798)\r\nsays, Pat did a good job. I'm really happy with the work that the company did. Five star review. That's actually my only full time feedback loop in the business. Yes, I can look at the P &Ls, but that's still what people don't understand. If you don't understand the mechanics of this business and the lead times and all these things and the technology that's changing, you know, if you talk to all these owners,\r\n\r\n\r\nBecause I do. I talk to all these owners at the golf tournaments and everything. Do you want to know why they're getting out of the business? It has nothing to do with wanting to retire. They're tired of all the technology changes. They don't want to do it again. They think the free on stuff is stupid. They think the Wi -Fi things are stupid. They don't want to do it. It's not that they're tired of making money.\r\n\r\n\r\nnik (15:48.993)\r\nWell, so again, you're hitting on this point where had you just hired a CEO, you wouldn't have known that that was the metric. And that seems like a really simple metric. Google reviews, are we still getting five star reviews? But after getting in and seeing the whole scope of the business, you decided actually that is the best metric that we need to follow. And you've probably set up the CEO for success and said, hey, this is your job description. This is what you need to focus on, et cetera.\r\n\r\n\r\nAustin Linney (16:16.398)\r\n1000 %\r\n\r\n\r\nnik (16:18.849)\r\nbut you've got one key metric and that's reviews.\r\n\r\n\r\nAustin Linney (16:23.534)\r\nWell, it's also a thing of this. So I'm also... There's multi layers to this. I'm also the face. I'm the one going to the chamber, he goes to, but I'm the one going to the chamber. I'm recruiting people. I'm setting up new projects. I'm sourcing business, new acquisitions. And this is the truth. This is the true story. Because I just have a weird personality. This was right into our relationship, three months in our relationship. And he's like, man. He's like, we had a killer day today.\r\n\r\n\r\nAnd I'm like, yeah, we did. I'm like, what's the deal? He's like, dude, 300 grand. I'm like, no shit. I'm like, fuck yeah, dude. He's like, no, you don't get it. He's like, we paid $300,000 worth of bills to vendors. I was like, hey, don't ever tell me that again. I was like, understand that I operate from an inflow point of view. I was like, I get that you're excited about paying bills, but let me know when the money comes in.\r\n\r\n\r\nAnd I'll feed off of that because I'm out there selling for us. And I was like, keep your, keep your bills to yourself. And like it was such a.\r\n\r\n\r\nnik (17:25.441)\r\nmy gosh.\r\n\r\n\r\nnik (17:30.113)\r\nDude, I've had that situation before where like I handed it off and they're like, hey, man, we got caught up on AP. And I'm like, I was purposely delaying those payments. How that was like $300 ,000. I was doing like, we don't have the cash.\r\n\r\n\r\nAustin Linney (17:48.846)\r\nNo, it's so funny, right? And this is something also that people don't talk about, right? People don't get this. I'm 41 years old. I don't know how old you are, but what happened? What happened when I was a kid? This is a true story. When I was a kid, you made 50 to 70 grand a year. You were killing it. When the hell did we reach the, you need to make 250 to 400 grand a year to survive, right? And so what I mean by that is you gotta understand what I grew up with. My dad was\r\n\r\n\r\nnik (17:59.233)\r\n38.\r\n\r\n\r\nAustin Linney (18:18.766)\r\nvery wealthy. My dad was a doctor and he made plenty of money. But it wasn't for me. It wasn't me. Okay. I've been on my own since I was 17. But what I'm saying is, it's amazing how comfortable you can get paying ridiculously large bills and seeing ridiculously large checks. I mean, dude, this is a true story. We brought in in the last 44 days what they did almost in all of 2020. Like, that's, it's insane, dude.\r\n\r\n\r\nnik (18:44.705)\r\nThat's insane, man.\r\n\r\n\r\nAustin Linney (18:47.854)\r\nBut guess what? We also have about a million dollars worth of vendors to pay too. So, you know, it's like you just get, I don't know, you just like, I'm not comfortable is not the right word, but you just get like, here's $120 ,000 check. Cool. well here's $120 ,000 payment. Awesome.\r\n\r\n\r\nnik (19:09.249)\r\nWell, and when you have people in your office, like your business office manager, or if you have an AP clerk is just making payments out to vendors, their job is to manage the vendors. Their job is to make sure that they're caught up and paid. Like they're not thinking about what the cash balance is. They don't care that they're pushing it out, you know, an extra two weeks so they can buy us some time. So for them, that is an exciting day because I've had this before where they're like, Hey, we got caught up on AP and it's like, Whoa, crap. That was not what I wanted to.\r\n\r\n\r\nAustin Linney (19:35.15)\r\nDamn, dude. Dude, true story. I can only say this because I know they won't listen. The day that I lost it, like there was no inventory, no nothing in the business. Like period. There was nothing. I mean, everything was done on paper. Like, I mean, we rebuilt the business. Period. Look, I'm actually not blaming him because this is what they were doing. But I had a guy in our company who buys stuff for us. He went and bought $4 ,000 worth of Sawzall blades.\r\n\r\n\r\nand we needed like two. And we didn't have a lot of money in that week. And I just looked at my CEO and I was like, what is going on? I was like, that's enough Sawzall blades for like the next three years. Like, what the fuck are we doing? And, and you know,\r\n\r\n\r\nnik (20:20.961)\r\nDude, dude, you're in the phase. You're in the phase. This is one of my favorite phases, okay? I've been, I've been managing healthcare businesses for a long time, but you're in the phase of people either who are in real estate or managed a fund that like went and managed a business and then like actually got their hands dirty. And I liken it to when somebody comes up to me and is like, hey, Austin, did you know that health insurance costs like a thousand dollars a month?\r\n\r\n\r\nAnd you're like, you're like, yeah, man, welcome to being an adult. Like your stories, your stories are fantastic. And it's like, it's like, yep, yep. You've done it. You're finally in. Those hands are dirty.\r\n\r\n\r\nAustin Linney (20:55.962)\r\nDude, I got an even better one for you. I got an even better one for you. This is, hey, I got an even better one for you. I've been on site the last two weeks. I've been on site. I'm talking about steel toe boots, hard hat, middle of the fucking summer, hot as shit, picking up garbage, delivering. I mean, like we're behind, we got caught up on this project, okay? I got a new guy.\r\n\r\n\r\nnik (21:19.283)\r\nYeah, yeah.\r\n\r\n\r\nAustin Linney (21:20.718)\r\nNew guy, he's been around for like a month. He was gone in the military for two weeks. He's on deployment. He came back. He came back, right? This is a true story. You ready? There's nine fucking guys there. Everybody knows who the fuck I am. He's new. All right? I walk up the stairs. He looks at me dead in the face. He goes, hey, not to be rude. He was like, what do you do for Deets? And I went, yeah, what do you do for the company, my company?\r\n\r\n\r\nnik (21:25.281)\r\nunacceptable.\r\n\r\n\r\nnik (21:45.025)\r\nWhat are you doing?\r\n\r\n\r\nAustin Linney (21:49.198)\r\nthe company's name and I go.\r\n\r\n\r\nI go, I'm the fucking owner. He goes, he goes, fuck. Because they so weren't used to seeing me in a hard hat and a yellow visor and like work boots because they're used to seeing me at the office. And he was like, I'm, I was like, I'm be honest. I didn't recognize you. He's like, you normally look dressed up nicer. Like, you know, but it's like, but that's how much in the trenches we are.\r\n\r\n\r\nnik (22:15.361)\r\nYeah\r\n\r\n\r\nAustin Linney (22:21.038)\r\nthat like that's the conversation that I got a new guy who I've barely even spoken to. Like that's you're in it baby. Yeah.\r\n\r\n\r\nnik (22:27.137)\r\nYou have to be like and you have to be and I liken it to being a musician. If there's any musicians out there, if you look at songwriters like Neil Young, even Bob Dylan. Like their chord progressions are simple. C G D E minor like they're not playing, you know, I don't know F major minor seven with this six suspended. They're very easy, but they've they've had to put in the time.\r\n\r\n\r\nso that now they can play the easy stuff. They could write the easy stuff. Like it takes a lot to even get to the point to make it look easy. And that's where I think you are, right? Like you've been in the trenches. You've really gotten to know the business. And now you can understand the easy things. Like, yeah, we focus on this.\r\n\r\n\r\nAustin Linney (23:05.806)\r\nThere's\r\n\r\n\r\nAustin Linney (23:11.502)\r\nThere's two things that have come with this 16 months that I think has changed my life and they're very important, right? And I don't think it's anything anybody talks about. And one, I've coined as leadership through the generations. Okay? And what I mean by that is you got to understand, I have employees from 17 to 70 on my payroll. Okay? My 50 and up guys, if you bring any rah rah shit\r\n\r\n\r\nnik (23:34.689)\r\nCheers.\r\n\r\n\r\nAustin Linney (23:40.878)\r\naround them, they'll tell you to pounce sand. They don't care. Okay? Then you go 30, 40, they're starting to have families, they want to buy a house, they're more about is there growth potential? And then you have the 17 and 21 year olds and 18, guys who just got out of high school, that would run through a brick wall if you asked them to. And so you can't talk to them in a broad stroke, you have to understand where they're coming from. That is on the back of the second thing.\r\n\r\n\r\nYou have to understand the lens that everybody in the company in their role sees the company. Okay. My job is a president visionary person. I have to be three, five, 10 years ahead. I also have to be a week ahead, a day ahead and a minute ahead. Okay. So I have to be all those things. Okay. A project manager who's scheduling the jobs and ordering the parts is on a two week time schedule.\r\n\r\n\r\nThat's as far as you can see. The dispatchers on a one day to two days. The person that's answering the phones on an hour by hour. The technicians on a day by day. When you understand the way that everybody looks at the business, then you can understand where they're coming from. And nine times out of 10, we're all saying the same thing, but we're all looking at it on a different time horizon.\r\n\r\n\r\nnik (25:01.985)\r\nYeah, and if you don't understand people's differing perspectives, you can blow the whole thing up. Turns into a real problem.\r\n\r\n\r\nAustin Linney (25:09.837)\r\nEven in the divisions within the company, each sector is a different person. My service technicians, because I tell them so I can say it out loud, those are my prima donnas. They're my real housewives. They deal with a lot of people's things. The heat doesn't work. The AC doesn't work. They're in people's homes all days. They have dogs. They have... That's a different game altogether. You know who the installers talk to?\r\n\r\n\r\nNobody, okay. The installers are your Clydesdales. They're your Budweiser horses They want to work if they don't have work. They want to go home and they want to go fishing They don't want to be around they don't do the hang around. They don't do that They show up they don't talk they go to work then you got the plumbers the plumbers It's kind of like the outsiders They're wearing a lot of weird boots because they're dealing with shit all the time. You never really hear from them It's the truth\r\n\r\n\r\nnik (26:06.209)\r\nLiterally, they're literally dealing with it.\r\n\r\n\r\nAustin Linney (26:07.918)\r\nLiterally doing shit, but here's my favorite quote to them when they complain about being up in a sewer all day. I said, did your job description say florist? I was like, you work, you, I said, you work where the poop goes.\r\n\r\n\r\nnik (26:24.961)\r\nYou must be a joy to be mad at the end of the day wading through crap. Austin, this one customer, I don't know what they eat, but their turds just clog up every pipe. It's really hard. I got.\r\n\r\n\r\nAustin Linney (26:36.462)\r\nDude, I got a story, but you ain't ready for this story. I'm telling you right now, it's...\r\n\r\n\r\nnik (26:40.641)\r\nAustin, Austin, it's really hard. I actually contracted HIV and hey, let me ask you one question. Did your job description say florist? Then get back out there, get back to work.\r\n\r\n\r\nAustin Linney (26:45.646)\r\nNick.\r\n\r\n\r\nAustin Linney (26:50.286)\r\nI got a customer story that I don't think we could share on the podcast, but it's so good. It's ridiculous. It's also really nasty. But I mean, you know, and that's what's interesting, right? They don't put that in the books, bro. Where do they put what is going on over there? Stop it.\r\n\r\n\r\nnik (27:07.009)\r\nSorry, my mic, can you hear it? Sorry. You're very loud.\r\n\r\n\r\nAustin Linney (27:09.582)\r\nYes! It's very loud.\r\n\r\n\r\nAustin Linney (27:14.638)\r\nYou said I was too quiet in the beginning.\r\n\r\n\r\nnik (27:15.297)\r\nSorry. All right, I'm ready. No, they don't put that in the books. You know why? Because those guys don't write the books.\r\n\r\n\r\nAustin Linney (27:19.246)\r\nNo they don't.\r\n\r\n\r\nnik (27:23.713)\r\ntheorizers write the books and they talk to people firsthand and say like, Hey, what was that like?\r\n\r\n\r\nAustin Linney (27:27.87)\r\nI want to say something and it sounds so stupid because I want to say things that people don't say out loud when you're a business owner because this is real life, okay? We had a lot of theft and bad expenses in old AR in the first year, right? And we're trying to invest in the company and we're buying vans and we're trying to grow and we're hiring and I'm investing in iPads and we're spending a ton of money, right? Like one -time expenses.\r\n\r\n\r\nand we had some months where the business wasn't profitable, right? But we fixed that, right? In like a two -month stretch, we fixed it. Now we're killing it, right? I had somebody look at the P &L to give us their point of view, had been in the business. And here I am, like embarrassed to hand them the P &L, like fully embarrassed.\r\n\r\n\r\nAnd he says this and it changed my entire life. I think I got off the call and just ran through a field with no shirt on. I was so excited. He said, look how fast you fixed it. I go, what do you mean? He goes, look how fast you fixed it. He goes, you were hurting here. You fixed it there. You're profitable there. He goes, that's really amazing. He goes, you did great work. And I go, hmm.\r\n\r\n\r\nOkay, so your P &L doesn't always have to be perfect, but how you respond to it matters more to people. Like I know that sounds so simple to say, but I come from a world where real estate, you have to perform every month. It's not a question. And so for them to say like, no, you did a good job. Like look at how quick you did it. Like you're like, and then, and then a month ago, the bank sits down in a meeting with us at our office.\r\n\r\n\r\nAnd he goes, damn, this is a really good P &L. And I went, I went, okay, I'm good. I was like, dude, you can get out now. I was like, you just made my day. dude, I think I cried. And like, it's amazing those like one sentences can change your whole life because that's what it's about, right? Like this is, Reg talks about this all the time. If you're not willing to operate your business when your business is being able,\r\n\r\n\r\nnik (29:28.993)\r\nDid you start crying?\r\n\r\n\r\nAustin Linney (29:45.902)\r\nasking it to be operated. I'm sorry. It's gonna be rough for you. Like, if you're not willing to go pick up the furnace so you can do an install the next, dude, let me explain something to you. Do you know how many times I've had a rabbit's foot in my pocket saying prayers, walking up to the mailbox?\r\n\r\n\r\nnik (30:08.833)\r\nFor what? What are you talking about? okay.\r\n\r\n\r\nAustin Linney (30:10.702)\r\nfor checks to pay bills. Like, you know, like this, what they don't understand is like, think of all the things that have to happen in order for a business to be great, right? And so unlike what I would classify as, and I can say, cause I spent two years in it, we don't classify health businesses in the health sector as actual businesses. We just call that insurance piggy banks. That's not an actual business. You don't have to operate. You just send in money.\r\n\r\n\r\nand then the insurance company sends money back, or you file money with the government and the government just sends money back. That's not real business. We're talking about a real business where we have Bob and Frank and Jane, and we have to hope that Jane pays. Right? And so we stepped into a business. Let's get down and dirty in the business here, because I'm going to tell you stuff that you think is not real. You think there's no way that this can be real. It's real. OK, they would do work in October. Ready for it?\r\n\r\n\r\nThey would do work in October, finish the work, and bill in January.\r\n\r\n\r\nAustin Linney (31:19.438)\r\nNo deposits. No deposits. No deposits.\r\n\r\n\r\nnik (31:19.969)\r\nBut that office manager was getting that AP out, right? She's getting those checks cut.\r\n\r\n\r\nAustin Linney (31:27.022)\r\nThere was there was two million in past AP\r\n\r\n\r\nnik (31:34.465)\r\nNow, look, you are describing a lack of urgency within an organization. They were misaligned. They had no idea where their priorities should be. You had salespeople just trying to get any contracts they could so they could make their bonus, whether or not their gross margin was 80 % or 5%. You got office managers just paying all the AP to get caught up because, hey, that's my job. Got to get AP caught up.\r\n\r\n\r\nAustin Linney (31:55.982)\r\nand stole a quarter of a million. That was office manager, yeah.\r\n\r\n\r\nnik (31:58.881)\r\nYou got somebody stealing a quarter of a million dollars because there's no internal checks or controls. And then you've got people who are like, well, what does it matter if we bill like today or three months from now? What does it matter?\r\n\r\n\r\nAustin Linney (32:10.158)\r\nAnd so the question that you have to ask yourself as a business owner is...\r\n\r\n\r\nDoes your urgency affect other people's day to day? Because I want, here's what I had to tell, here's what I kept saying over and over again. Look, we can worry about everything else later, one battle at a time. Are we answering the phone? When we answer the phone, are we booking it? When we book it, do we do the work?\r\n\r\n\r\nand do we collect the money? If we're not doing those things, then what are we doing? Period, end of story. Doesn't even matter, right? And so we made so many missteps. And my suggestion to every business owner, because I made every bad one, is number one, hire a great bookkeeper, spend the money, do the bookkeeping, do not overlook this.\r\n\r\n\r\nEspecially when you have a CRM that's a Ferrari like ours and there's so much data out there You have to do it number one best money you ever spent system six Chris Williams We played a golf game together He was supposed to go to dinner with his wife But we went into extra holes and he was so adamant about making money and we took him we took him We took their money and I love this guy ever since that day And we actually fired another bookkeeping company to bring him on as the best decision we ever made they've been amazing It took them six months to clean up our books. It was that\r\n\r\n\r\nLike seriously, right? Best money. But understand that as a business owner, I heard something from some guy before I bought the business. He said, the number one thing I would have told myself is don't worry so much about the systems because when we get to 10 million, 5 million, 15 million, we're going to break them anyway. He goes, I wish I would have started building the systems at 20 million, meaning farther out. And so I've always thought to myself like, should we spend the money now? Because we're going to build into it.\r\n\r\n\r\nnik (33:44.865)\r\nJeez, man.\r\n\r\n\r\nAustin Linney (34:12.814)\r\nRight? And so that means with the bookkeeper, with the CRM, like where does the business want to be? Right? And I'll just talk about myself. Okay? If you're a three to two million dollar HVAC plumbing company, get on Jobber. You don't need service time. You don't. You don't need it. It's very expensive. It's the most expensive thing we spend money on. But it holds everything. I could run the business and see what's going on in Spain. Like seriously, like that's, but we want to be\r\n\r\n\r\na big company with multiple locations. So we had to go out of the gate. I have a marketing company that's been in the space for 13 years that's handled a hundred and they have 150 clients in the private space. Like we picked a fucking Ferrari marketing company. Like, but guess what? You can teach yourself to run some Google ads and you can scale to one million. You don't need, but I think\r\n\r\n\r\nI think we are so scared of the things that we don't know. And so we outsource them. Then we take our eye off the ball and we look back four months later and we don't realize why we're not getting results.\r\n\r\n\r\nnik (35:20.929)\r\nI think for me, as I'm hearing you talk, I'm just reminded that as an entrepreneur, there's a couple of things. I will never ever not have an eye on collections. You have to understand how the money is coming in. Number two, you have to do what Austin's done and really understand your business. If you outsource the management of that business to a CEO,\r\n\r\n\r\nthen you're riding with them whether they win or lose, right? If you don't understand the business. If you understand the business, it makes it a lot easier to collaborate with them as opposed to just telling them what to do and hoping that they succeed. And then the last thing is in every transition I've ever had, accounting is paramount. You have to know, you have to have insights into what's going on. How's the money coming in? How's the money flowing out?\r\n\r\n\r\nso that you can make timely decisions. If you don't have those things, you're in a world of hurt. You can be successful. It's just the likelihood of there being something catastrophic is much higher in those examples.\r\n\r\n\r\nAustin Linney (36:30.062)\r\ntwo men in my life who spent, one spent many years, he worked for, I think he's on his third billion dollar hedge fund that he worked for, he's their mercenary, he's their &A guy, and I have another guy who's been in the HVAC space for 50 years, he's built multiple billion dollar companies, right, and these guys that I talked to. No, no, no, no, hear me out, hear me out, no, no, no, hear me out. So these are the best at what they do. You ready for it? The best at what they do, and I asked him, I said, man.\r\n\r\n\r\nnik (36:41.409)\r\nPeace.\r\n\r\n\r\nnik (36:47.937)\r\nWe get it. You know cool people. All right. Geez.\r\n\r\n\r\nAustin Linney (36:58.574)\r\nI really love doing deals. This is the &A guy. I really love doing deals. Man, you've been doing this at the highest level. Smile direct was you. Like you did that. Like everybody knows about that. Like what do I do? What books do I read? What pocket? Who do I need to talk to? This is actual advice he gave me. So here's the deal, man. It's fucking crazy. You ready for it? He goes, this is amazing. He goes, you know how you get better at buying companies? He said, you buy them.\r\n\r\n\r\nAnd he goes, you want to know how you get really good at selling companies? You sell them. He was like, I don't know what to tell you, man. And so the HVAC guy, are you ready for it? The HVAC guy goes, I go, man, I need to know the space. You're one of the best salesmen I ever met. And he goes, well, I mean, the biggest thing is, he said, everybody's making it way too complicated. He goes, it's a wild thing. He goes, here's the thing. You pick up the phone. They want to AC.\r\n\r\n\r\nHe goes, you sell it to him and you put it in. It's like, it's the craziest thing in the world. And so I laugh because he'll be on the phone structuring deals with me. And he's like, you're making it way too complicated. He's like, you want to know how you buy a business? He's like, it's very simple. He's like, you put in one third cash, you get one third seller note, and you get one third from the bank. Boom, you got a deal. And I went, my God, I've read 500 books.\r\n\r\n\r\nAnd this is what you like and he goes, he goes also he goes also there's no value in buying a $30 million company. I'm like, well, hold on. I'm like, hold on. And he was like, well, hear me out. He goes, unless they are clearly expanding across multiple locations, he goes, they've maximized the growth potential within that business so they can only grow to, you know, three to 5%. He goes, but he goes, but at a multiple, he goes, you could go scoop up multiple businesses at around five to seven million.\r\n\r\n\r\nnik (38:26.881)\r\nWalk as we -\r\n\r\n\r\nAustin Linney (38:54.286)\r\nYou could take him to 10, then your multiple jumps 3 to 5x. He goes, then you've arbitraged your money. And he's saying all this and you're going, where is this in the book? Where is it? This is a good old boy from Louisiana. Yeah.\r\n\r\n\r\nnik (38:58.017)\r\nSure, sure.\r\n\r\n\r\nnik (39:05.857)\r\nWhat we spend, it's because we spend all this time procrastinating and people think, no, I'm learning, I'm getting ready. But the bottom line is you're afraid to act. Like learning comes in the action of doing. It does not come in reading or studying. Those things are helpful, they're supplemental. I find them to be a good lens to look at experiences through after I've done them. But stop procrastinating, stop putting it off.\r\n\r\n\r\nAustin Linney (39:11.342)\r\nMm -hmm. Mm -hmm.\r\n\r\n\r\nMm -hmm. Yes.\r\n\r\n\r\nnik (39:34.337)\r\nyou have more than enough experience, you have knowledge, you have more than enough go and do. And in failing, you will learn way more than any book will ever teach you.\r\n\r\n\r\nAustin Linney (39:39.534)\r\nYou know?\r\n\r\n\r\nAustin Linney (39:42.958)\r\nYou know that I just sent this to my other owners today because don't get me wrong just so we're clear We're having a good year. We're scaling to a second location gonna be a third one Early next year. I still get nervous every day Every day. I'm like, my god, we're hiring all these fucking people payroll is gonna go high again Do we have the jobs right? Right? So I realized something, you know what I am. You know the meme the\r\n\r\n\r\nYeah.\r\n\r\n\r\nnik (40:01.601)\r\ndoesn't go away.\r\n\r\n\r\nnik (40:11.521)\r\nThe meme. The GIF.\r\n\r\n\r\nAustin Linney (40:13.102)\r\nNo, sorry, hold on. The Titanic meme with Jack and Rose on the front of the boat. I realized that Rose is my fear and Jack is the business guy behind whispering in the ear going, it's okay. Just keep pushing forward. Because the question that you have to ask yourself is a simple question, right? What's the alternative? What's the alternative? Not. My mission.\r\n\r\n\r\nnik (40:18.977)\r\nYeah, okay.\r\n\r\n\r\nAustin Linney (40:42.766)\r\nyoung man is very simple. I spent six months before we started this company and asked myself the question every morning on my walk, do you want this? Do you really? No, no, no. Not do you kind of want it? Do you want this? Because what you're embarking on is not a quick thing. This is going to consume your life for the next 30 to 50 years because that's how big our business plan is. And I said, OK, what's my why? It's jobs.\r\n\r\n\r\nJobs. Okay, you want to know why my why is jobs? Never shared the story. From 17, basically been on my own since I was 17, beat addiction, all that stuff. I started working in a bar at 17 and 18 as a bar back. It's basically where I learned life. I met successful people. I had a very hot girl that worked with us. I had a very good looking guy. The guy waited on the women, the girl waited on the men. I understood commerce.\r\n\r\n\r\nLike, I learned everything in high -end bars and hotels. I sold wine for 20 years. And for 20 fucking years.\r\n\r\n\r\n20 years, I dreamed of somebody on the other side of that bar who had a business, said, hey kid, why don't you come work for me? You're better than this. I see something in you, come work for me. And nobody ever did. Nobody ever did. And so now I'm gonna be that guy.\r\n\r\n\r\nand I've already pulled people out of Verizon stores, and I pulled people out of this job, and they've come work for me, and they're killing it, and 20 year olds, and younger people, and there is nothing greater than seeing my employees get married, have babies, buy a house. It is the most intoxicating slash infuriating thing in the world you can do, be a business owner. Because there's gonna be people that burn you, and you're gonna feel jaded.\r\n\r\n\r\nAustin Linney (42:44.494)\r\nbut I made a promise to myself, because I've been burned more than any, trust me, I've had money stolen from me, I've been fucked over more than times than I can count, but I made a promise to myself. I have gained more by giving people the opportunity than I've lost by not.\r\n\r\n\r\nI've gained more relationships, more friends, more positive things, meeting people like you, meeting people on Twitter by just saying, hey man, I like what you're doing, cool. Like I've had dinner with like people off Twitter and their wives and this is a true story, like two weeks ago, I go to Toronto to hang out with a dude who runs a fund. We're gonna go stay at a hotel and he's like, dude, just stay with us.\r\n\r\n\r\nAnd I'm like, dude, are you sure? Like you got me and my girl, you got your kids, your dog. So we sit on the couch. We just got there. We sit on the couch and his wife goes, who are you? And she goes, she goes, are you okay with kids and dogs? I go, yeah, I'm great. She goes, okay. And you're not going to kill us. And I go, no, I'm, I'm, I'm a, I'm a regular dude. And like, I'm thinking to myself like, and we had the best three days I've ever had. And I'm thinking to myself like, that's because\r\n\r\n\r\nI, you know, an opportunity, right? And I think to your point.\r\n\r\n\r\nPut down the books, put down the podcast and jump in, either work for somebody or buy your own business. But it's an amazing Alex Hermosy quote that I live by. Your work, no, your business works more on you than you do on it.\r\n\r\n\r\nAustin Linney (44:32.046)\r\nThere is no personal development course in the world that can make you a better human or worse than running your own business. Because the people that work for you will test you more than you've ever even imagined.\r\n\r\n\r\nnik (44:47.777)\r\nAustin, I'm gonna leave it there, man. That's a beautiful way to end it. Where can people come and find you dropping more jewels of wisdom like that? Where's the best place?\r\n\r\n\r\nAustin Linney (44:59.31)\r\nSo you can, AustinLinney .com, L -I -N -N -E -Y, if you want to check out my podcast or Twitter, Austin Linney. I want to say something, and you're going to, you've probably been asked this today, and I just want to hear it out of your mouth before I leave. You have such a joyful disposition. You find life very fun. You're always laughing. You're having a good time. Where do you think that's cultivated from?\r\n\r\n\r\nnik (45:29.697)\r\nGosh, I wish I could say it was cultivated. First of all, thank you. That's very nice of you to say. Honestly, I'm just lucky. I think I was born that way. I wish I could say like, it was a choice I made at this age, but I've just always been positive and looking on the bright side of things, even through really crappy situations. I consider it to be a huge blessing to my life because I've just been able to look at things positively. I'm one of nine kids.\r\n\r\n\r\nAustin Linney (45:40.142)\r\nMm -hmm.\r\n\r\n\r\nMm -hmm.\r\n\r\n\r\nnik (46:00.225)\r\nFive of those are from like I have three siblings that are my half siblings I have two siblings who are my adopted cousins because my aunt was a drug addicts I had a special needs sister who passed away just two years ago. I lost a son eight years ago You know grew up incredibly poor and I don't know why but I look back on my childhood and I'm like it was the best I had so much it was so amazing and my siblings look back and they're like man remember how terrible that was remember how we had no no food or\r\n\r\n\r\nAustin Linney (46:07.502)\r\nMm -hmm.\r\n\r\n\r\nAustin Linney (46:13.23)\r\nMm -hmm.\r\n\r\n\r\nAustin Linney (46:27.982)\r\nMm -hmm. Mm -hmm. Mm -hmm.\r\n\r\n\r\nnik (46:30.209)\r\nso I don't know what to say other than I've always just been lucky to be positive. I will say to echo your points. A few years ago, I was in the space where I used to think, man, I need to be a harder negotiator. Man, I need to be, I need to be a jerk. Like, look at these guys. They're alpha males. They're like, you know, getting deals and people follow them. And I've realized over time, I don't want to be like that.\r\n\r\n\r\nI don't want to change my personality because somebody screwed me over. I don't want to change it because I think, I need to be more of a hard A. I just want to be me and enjoy myself. And I think since that decision, I have felt much more comfortable in my own skin. But thankfully, I've just always been positive. Thank you for asking. That was very nice of you to say.\r\n\r\n\r\nAustin Linney (47:19.157)\r\nIt's my difference between do you want to be a one -hit wonder or a songwriter. The songwriter is going to take you longer to get your following, but once they become your following, they'll never leave you.\r\n\r\n\r\nnik (47:33.825)\r\nHmm. I love that man. This has been awesome, Austin. And I can't wait to have you back. We didn't even talk about your business. Dude. All right. We will have you back.\r\n\r\n\r\nAustin Linney (47:38.702)\r\nYeah, man. Thank you. Yeah, business, whatever. It's called widgets. I tell my sales guys all the time, I said, you're too smart for your own good. I have some of the smartest guys in the world. I said, I'm going to let you in on a secret. The lady who wants a new AC, she cares about one thing. When she turns on the on button, it turns on. OK? That's it.\r\n\r\n\r\nnik (48:05.889)\r\nDoes it turn on?\r\n\r\n\r\nI love it. All right, awesome. This has been fantastic, man. We will talk soon.\r\n\r\n\r\nAustin Linney (48:14.382)\r\nAll right, thank you, bud.\r\n\r\n\r\nnik (48:15.649)\r\nSee you.",
  "metadata": {
    "duration": "",
    "date": "2024-10-14",
    "platform_source": "Google Drive"
  }
}