{
  "episode_number": "146",
  "episode_title": "AI SERIES: 3 - The AI Disruption: Navigating the Opportunities and Threats with Mase Graye",
  "guest_name": "Mase Graye",
  "business_name": "AudioEye",
  "transcript": "﻿Nikolas Hulewsky (00:00.046)\r\nwhole thing if we don't want to. Mace, I'm excited. I'm excited to talk to you. Did I say your name right? Is it Mace? Okay. My name is, you see my name, Nicholas Lelouski. So I'm both sensitive and insensitive to names. I'm like sensitive to the fact that people will mispronounce names, but I'm also like, it happens. I'm not offended. Give us your background. You've got an awesome background to be talking about AI.\r\n\r\n\r\nMase Graye (00:06.532)\r\nYeah, that's correct, absolutely correct.\r\n\r\n\r\nMase Graye (00:20.452)\r\nYeah, it's all good.\r\n\r\n\r\nMase Graye (00:27.682)\r\nYeah. So I've been in the technology space for about 20 years. I came up in startups and then spent a number of years at Amazon, Oracle, Meta. And then more recently, I joined a small technology company where I've been working, was working for the past three and a half years as their CTO and chief architect. And then toward the end, I was working on their AI initiatives. And so I recently left to\r\n\r\n\r\nstart pursuing my own thing, take a breather and pursue my own thing, but I've been in this space for a bit now.\r\n\r\n\r\nNikolas Hulewsky (01:00.31)\r\nfor you. CTO role, what were you doing before you became a CTO?\r\n\r\n\r\nMase Graye (01:04.696)\r\nWell, I actually joined there as a chief architect, as an engineer, and then just through failing upward, I don't know, they just kept promoting me to like head of technology and product.\r\n\r\n\r\nNikolas Hulewsky (01:15.118)\r\ncurious, what has the last, I don't know, three years been like in a tech company? I would say AI, OpenAI's moment really came about two years ago-ish. So you kind of had a year before and then two years after. What does it look like?\r\n\r\n\r\nMase Graye (01:24.12)\r\nYeah, yeah.\r\n\r\n\r\nMase Graye (01:29.284)\r\nIt was one of those things where I think if, I think if you weren't paying attention, you might've been like, business as usual. But if you are, if you do sort of have your ear to the ground on, some of this stuff and you, and you'd be like, well, how could I use that in my business? How could I use that in my business? Suddenly you're like, oh, this whole thing that I have a team of people doing, that could be a model, right? This whole, this whole product here, we have to collect all this data to build a machine learning model. That could just be a foundational model. So.\r\n\r\n\r\nIt suddenly felt like, you know, Hey, if we weren't investing in machine learning for the past five years, it was like, we've got this freebie all of a sudden sort of dropped on our doorstep that we could use for stuff. And it came with some caveats, but to me, it was incredibly exciting. Now I also saw it as like, like potentially an existential threat because you know, it's like at some point, do these things get advanced enough that, that B2B software disk gets squeezed out altogether. That's sort of one of the big fears people have in the industry right now. But,\r\n\r\n\r\nI just see that as like you, if you're not disrupting yourself, know, like, so figure it out, right? If you should be the first, if it's going to happen, you should be the first to do it.\r\n\r\n\r\nNikolas Hulewsky (02:34.924)\r\nYeah, either it either eliminates B2B software or becomes Skynet. You know, those are are both. I'm curious, are you able to say what what the product was that you were working on at this tech company?\r\n\r\n\r\nMase Graye (02:40.791)\r\nYeah, yeah. Yeah, exactly right.\r\n\r\n\r\nMase Graye (02:49.983)\r\nI can tell the company I worked at audio eye, which is a company that, provided both technology and sort of consulting services for, businesses who wanted to make their, web properties and applications accessible to people with disabilities. And so a lot of that was, yeah, a lot of it was like, it's interesting because that's one of those things where accessibility, like people want to do it, but it's always very low on the priority lists relative to other things. And so if you can, you can use technology like machine learning or AI to like,\r\n\r\n\r\nNikolas Hulewsky (03:04.834)\r\nThat's awesome.\r\n\r\n\r\nNikolas Hulewsky (03:13.774)\r\nMm-hmm.\r\n\r\n\r\nMase Graye (03:19.575)\r\njust to solve that problem, people were really very willing to do it. And so that's why it was interesting to me.\r\n\r\n\r\nNikolas Hulewsky (03:25.678)\r\nDid the business change? Like, so you joined there three years ago, it's accessibility. Did it change from like, hey, this is the product that we're building in the typical UI experience, the typical SaaS product to, everything's got to be AI. Or did it stay pretty constant?\r\n\r\n\r\nMase Graye (03:40.38)\r\nI there was a temptation to do that briefly, but I think that the shape of our offering stayed the same for now. And I think that might change for them down the road, the shape of the offering stayed the same, but how we deliver it changed pretty substantially. Just within the three and a half years I was there because of\r\n\r\n\r\nNikolas Hulewsky (04:04.504)\r\nWell, and a lot of companies now are like, well, we've got to have somebody who's heading up our AI initiatives, or we've got to have somebody who's looking at, yeah, well, that's what I'm saying is like, all of sudden you become, I'm assuming that position wasn't there before two years ago.\r\n\r\n\r\nMase Graye (04:09.367)\r\nYeah, yeah, that was me.\r\n\r\n\r\nNo, no, no, no, no. It wasn't, if we had a small team doing like machine learning stuff, um, but it was, you know, in any machine learning effort just requires lots of resources and data and stuff. And like I said, like now all of a sudden you could just go to hugging face and there's models galore and you could just pull them down and use them. And it allows you to shortcut some of that upfront work that you normally have to do to start getting the value. You can sort of prove the value first and then collect the data and make it better. that kind of reshaped how you approach.\r\n\r\n\r\nAI investments in general because of all this.\r\n\r\n\r\nNikolas Hulewsky (04:49.71)\r\nSo you said, you viewed it for a time as an existential threat. I had the same kind of experience where, I don't know, I'm like rolling, right? Like one moment I'm like, this is amazing. And then the next moment I'm like, every job you've ever known isn't gonna be here in 12 months. And then you dig into it more and you're like, we're actually kind of far away. You know what I mean? So talk to me a little bit about where you are in that progression.\r\n\r\n\r\nMase Graye (05:00.269)\r\nYeah.\r\n\r\n\r\nMase Graye (05:10.391)\r\nWe're fine.\r\n\r\n\r\nMase Graye (05:18.939)\r\nI kind of approach this, I think there's two things that I think about when I think about that sort of doomsday scenario. One is that work sort of exists in strata, right? And there's like people doing sort of surface level work and there's people like down in the weeds doing crazy leading edge work. And I think we tend to like, we tend to think it's all just work, but like, no, it's like people doing chip designs and the people doing like,\r\n\r\n\r\nNikolas Hulewsky (05:47.745)\r\nHmm.\r\n\r\n\r\nMase Graye (05:48.686)\r\nphysical engineering, like, yeah, they're probably using AI tools to help them in some capacity, but we're nowhere near the point where these models have the integration necessary to like do that work in depth. And so maybe eventually, but it's going to be this sort of this like working its way down the strata, right? And so it's like, it's like, it's going to take a while for it to get into those deep, those deep things where it's doing it automatically. Now, on the flip side, like,\r\n\r\n\r\nNikolas Hulewsky (06:08.878)\r\nMmm.\r\n\r\n\r\nMase Graye (06:17.955)\r\n80 % of the work by volume that we do is probably like the super shallow stuff, right? And so, which, know, marketing websites and crud applications and like all the stuff that we had, you know, software engineers, they would go to coding school for 18 months and then get out and get a job like those people, maybe their, their work's going to get eaten up first, right? That's, and that's a sort of, that's still scary, I think, for people who have sort of their careers on this stuff, but\r\n\r\n\r\nUm, I said, I think it'll take a while. The other thing is that, um, and this is just like with all technology, it's like, it's like, it's unevenly distributed always all technology, all technologies that way. And so like, yeah, if you're doing a purely online digital only foo bar, then yes, a hundred percent of that might be addressable foo bar, pick it, make, make up a name, right. Um, widget, right. It's like, yeah, AI is going to do that.\r\n\r\n\r\nNikolas Hulewsky (07:08.184)\r\nFoo bar?\r\n\r\n\r\nNikolas Hulewsky (07:11.817)\r\nokay, okay. Okay.\r\n\r\n\r\nMase Graye (07:15.565)\r\nBut like most mainstream businesses have like a storefront or have like a physical fulfillment. And so again, again, it'll get there maybe eventually, but it's going to be a long tail, I think. And so, you know, until you solve like robotics and that kind of stuff. So.\r\n\r\n\r\nNikolas Hulewsky (07:30.988)\r\nWhat do you think of the pronouncements on places like Twitter, X, wherever else? What other platform there is about? This is it, 12 months, it's finally here, AGI.\r\n\r\n\r\nMase Graye (07:44.364)\r\nNah, I think it's always it's always 12 months away. Now I think it's I do think it's also I'm like of two minds, right? On one hand, I think it's it's it's always going to be 12 months out 12 months out. But on the other hand, it's like, it's like a frog in boiling water. It's like, all of sudden you wake up and all the you know, a bunch of works been automated that you might have done a year ago, and you won't have noticed, right? Because it's gonna like get you a little bit at a time. So I'm definitely have two minds of that. And especially when you have like\r\n\r\n\r\nNikolas Hulewsky (07:47.564)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (08:05.368)\r\nYeah.\r\n\r\n\r\nMase Graye (08:12.099)\r\nYou know, like this recent release from Anthropic, the 3.5 to 3.7 release, like, you know, there are flaws in the new release, but like, it's a leap. It's like a leap in capabilities and stuff that I, you know, three months ago was having to like laboriously tell the model, no, don't do that. Don't do that. Do this instead of this. You don't have to do it anymore. Right. And, and you don't only, you don't think of that as like a huge step in improvement, but it's like, it's like, what are you not doing? You don't notice what you're not doing as much. And I, and I think that's, that's going to keep happening.\r\n\r\n\r\nNikolas Hulewsky (08:29.774)\r\ninteresting.\r\n\r\n\r\nNikolas Hulewsky (08:37.902)\r\nRight, right.\r\n\r\n\r\nMase Graye (08:41.347)\r\nyou're gonna get to the point where you're like, if you'll notice it when the API is down, when Anthropic goes down or GROK goes down or something, you're like, no, like, what do I do? My tools don't work anymore. That's when you'll actually notice the progress because it'll be like, have to do all this stuff manually, so.\r\n\r\n\r\nNikolas Hulewsky (08:52.014)\r\nHa ha.\r\n\r\n\r\nNikolas Hulewsky (08:59.466)\r\nTwo comments, the first comment, well, one comment, one question. The first comment is, it's only been in the last 12 months that I have really come around on UBI, Universal Basic Income. There was an entrepreneur who ran for president. His name is escaping me. I could see his face. Yang, Andrew Yang. And he had this idea for a universal basic income. And a lot of people laughed at him and said he was stupid. I've started to feel like,\r\n\r\n\r\nMaybe we do get to a place where so many jobs are eliminated or changed or work is not what we think of it anymore, that the government doesn't need to provide some kind of a supplement. Anyways, something I never thought was fathomable now that I'm seeing the iterations of AI is kind of makes sense to me. That was just a random thought. The real question that I have for you is a lot of people use different models for different things. So you've talked about Anthropix model. So Claude released.\r\n\r\n\r\nSonnet 3.7, I think is the model now. Recently, which has totally changed the game. OpenAI has ChatGPTs 4.5. They also have Deep Research. They have Operator. You've got Grok, which is XAI or Twitter. Their AI model. Anyways, there's lots of different, there's a proliferation of models happening in the moment. What models are you using and what are you using them for?\r\n\r\n\r\nMase Graye (10:23.011)\r\nI'd say my daily drivers at this point are Claude, 3.7 for coding and for document writing, any sort of longer form business doc or blog post. I use GROK for just general research now, just because it's like hooked into X. And so you get livelier results. And I like its deep thinking thing that it does.\r\n\r\n\r\nAnd then, you know, I'll, I'll basically, I'll stick the switching costs for these things are pretty low, right? So I'll stick with it until someone shows me an example of something else being better. And then I'll try it out, decide if it's better or not, but that's pretty much what I'm day to day.\r\n\r\n\r\nNikolas Hulewsky (11:04.558)\r\nOkay. For you in your tech company, let's talk about that as a CTO. What did you actually start utilizing AI for in your business?\r\n\r\n\r\nMase Graye (11:15.105)\r\nYeah. Yeah. So, so at the last company I was at, so one of the components of what that company does is a company might pay audio eye to help actually fix accessibility issues on the site. And they do that using our technology platform and our technology platform does these sort of runtime fixes, live fixes of the site using small bits of JavaScript.\r\n\r\n\r\nAnd those small bits of JavaScript have typically been written by experts in the company. so, you know, they basically, a company installs our product, then installs our script. Every time a page loads for a user, that thing pulls down these fixes and runs these fixes. And, you know, we pay per fix, or we sometimes pay hourly, depending on the contract structure for those. And one of the things that I was working on before I left was...\r\n\r\n\r\ntrying to basically make 90 % of those written that we previously written by humans now be written by one of these models. And so that involved, you know, basically teaching the model to write fixes the way we write fixes within our frameworks that we get all the reporting and testing and all that kind of stuff while still sort of meeting the human quality bar. And so yet we had to stand up this whole process to make sure we could meet that quality bar.\r\n\r\n\r\nNikolas Hulewsky (12:38.254)\r\nYeah, so walk me through that. Were these, when you say fixes, how were you finding that there was a problem? Is it automatically generated to you or did somebody have to send it in? Like where did the problem start?\r\n\r\n\r\nMase Graye (12:53.431)\r\nYeah, we have our own automated test suite that would catch a lot of issues. And then another one of the things we're looking at is this rule suite, we call it, was written by human experts. But again, also, could we enhance that rule suite using AI to do like, hey, look at these 10 sites, find this class of issue. Can you help us write a general remediation for that? Or a general test for that, but...\r\n\r\n\r\nNikolas Hulewsky (12:58.252)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (13:17.55)\r\nOkay, so you were running these general tests, whatever the test suite was, once you found the problem, again, I don't know the flow, but it would batch it and a human would go and see, oh, there's these 10 problems. And then the human would go look at it, diagnose it, write the fix. And then they would go and upload it to the website, deploy it. Okay, so that's the old process. How were you utilizing AI in the new process?\r\n\r\n\r\nMase Graye (13:38.851)\r\nDeploy it to the customer site. exactly.\r\n\r\n\r\nMase Graye (13:46.936)\r\nYeah, so new process. the test suite runs automatically and reports to us. They can also run it manually, but the idea being that like customer consigns on with us, we run it through the automated test suite automatically, spits out a bunch of rule failures on any given page. Those get essentially sent off to our fixed service. We give the exact name for it, but then that thing using our...\r\n\r\n\r\nOur built-in knowledge base using past examples of how we fix these things using specific knowledge of our framework prompts the model to write a fix for that particular test failure. And then we take the output of that, test it again automatically. And then if it passes, then you can be reasonably confident that it was a good fix. And if it fails, you send it back. And so for us, we actually did send everything through human review still. So even though we were saving all the time of actually writing the code, wanted to make sure humans were reviewing.\r\n\r\n\r\neverything that was written because it's going to customer sites. But then, know, human basis says, yep, that looks good. Click and then deploys it. So they don't have to write the code anymore.\r\n\r\n\r\nNikolas Hulewsky (14:53.23)\r\nWere you using like Replet cursor AI or like what were you using for the coding?\r\n\r\n\r\nMase Graye (15:00.013)\r\nWe were using, so we have our own in-house test framework and these types of things. And then for the actual integration, we were just using the APIs. So we prompted with all our stuff and it comes back with an answer and we can, we have our own internal platform that we had to review and to deploy.\r\n\r\n\r\nNikolas Hulewsky (15:15.42)\r\nvery cool. And was the push of the failures happening manually, or was it happening automatically? did you have a, again, you're running the test suites, the problems show up, did a human still push it to the API to fix, or was it like once a day, it pushed the problems to the\r\n\r\n\r\nMase Graye (15:35.203)\r\nIt'll dispatch it and do it. And then as the Aussie operators come in, they could basically just look at it and approve or not. yeah. There's a queue, yeah, essentially, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (15:40.942)\r\nOkay, so then it's sitting in an approval status. Essentially it's waiting to be Okay, that sounds amazing especially for QA in businesses Did that save you money and if so, how does it how does it potentially save you money?\r\n\r\n\r\nMase Graye (15:54.34)\r\nYeah, so the unit economics of that, mean, I don't know how much I can go into on the specifics of dollars and figures, but like, when we do this to the traditional way, you're paying many dollars per fix, was what it comes down to, right? And then when you look at the cost of the models, they're falling like a rock. So even if you have to do many, many passes against the model and all, it's like, you're still coming out at cents per fix. And so it's a very, it's a large difference, especially\r\n\r\n\r\nAgain, work exists in strata. It's like, well, if 70 % of your volume is the easiest kind of fix that a model could conceivably make, then if you only fix those ones, it's still a huge amount of your overall, yeah.\r\n\r\n\r\nNikolas Hulewsky (16:38.082)\r\nWell, what's interesting about the way you're describing this, I want, cause I want to hear how you're personally using it, but I've had now four of these conversations and in two of them, the main use, not main use case, but a big use case is in this QA function. And it's something I hadn't even considered. I talked to this silicon manufacturer here in the United States. They do about $30 million a year in top line revenue. But anytime that they're creating a custom, I don't know, chemical, I don't know what to call it.\r\n\r\n\r\nusing silicon and there's an issue, if somebody on their team doesn't understand it, they have to go and reach out to a specialist. And this is fairly normal. They have to go reach out to a specialist, a chemist who specializes in whatever they're specifically that they're doing. Now they have an AI chatbot that is effectively their chemist specialist that can diagnose problems that they would have otherwise sent out and spent a lot of money on consultants for. Now they still use consultants because there's obviously gonna be those problems that are just way too hard to solve locally, but.\r\n\r\n\r\nThat's a QA solution that is effectively saving a lot of money in consultancy. This is a QA solution that's not necessarily saving money in consultancy, but just manual labor of the fixes. And I hadn't thought of that as a use case.\r\n\r\n\r\nMase Graye (17:49.398)\r\nYeah, think anything, anything where the model like anything we're in your current business, you need to exert like a small amount of judgment. that amount of, but that judgment is not like something you can easily codify and like one or two or three straightforward rules, right? That that is like a good spot for I think one of these models and that that space will expand over time. But it's like, you know, maybe sometimes hate to put it in these terms, but it's like,\r\n\r\n\r\nIf a high schooler could solve it in an hour, your model can solve it in a couple of minutes, right? And it's like a lot of problems, a lot of the low hanging fruit problems are just like basic stuff that you haven't gotten around to riding automation for, or like you have to do very light correlations for, and you just need a little bit of reasoning. And if you just need a little bit of reasoning, you can be pretty confident. And to your point, if there's a lot of reasoning, then sometimes it'll go off the rails and you don't want to trust it. But like the little bit of reasoning is pretty good. So.\r\n\r\n\r\nNikolas Hulewsky (18:24.653)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:43.189)\r\nthe rails. Yep.\r\n\r\n\r\nIt's pretty funny. I feel like a lot of things that people are saying are agents or a lot of things that people are saying are AI are really just the cool word for an algorithm or an RPA, a remote or a robotic process automation. And you kind of like hit it on the head. You're like, yeah, if there's one or two rules, it works fairly well. And like, that's the thing is it's still pretty rules based. Like if then statements, like if this happens, then do this.\r\n\r\n\r\nObviously it's going to get to the spot where it's autonomous and they can go and act by themselves, but the agentic age, it's starting, really they're really just souped up robotic process automations.\r\n\r\n\r\nMase Graye (19:29.805)\r\nYeah, and what you're really doing, I think what a lot of people are actually doing is like, there's a long tail of business problems that are like, they're small enough that no one's going to go right very specific solutions for like code solutions for how the optimize because it's not worth it, right. But if but if but now you can sort of wrap up, you know, circle around all those things and say, I can solve this long tail of problems with a general model, right. And it sort of gives it's been it's the same stuff you might have written regular automation for.\r\n\r\n\r\nif it were a big enough problem for you, right? Does that make sense? It's just lowering the overhead essentially necessary to do it.\r\n\r\n\r\nNikolas Hulewsky (20:01.25)\r\nTotally. Yeah, it makes total sense. Yep. Yep. Okay. I would love if you would show me some examples of how you're personally using AI in your daily life. know you were CTO, you've left, you're working on a stealth project. Where are you seeing a lot of value from AI in the moment? Is it with a bunch of automations? Is it with just being a thought partner?\r\n\r\n\r\nMase Graye (20:16.099)\r\nYeah.\r\n\r\n\r\nMase Graye (20:24.791)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (20:34.766)\r\nDo I have to give permissions? Yeah, here, do that. Do that. You can hop. I'll stop recording for second and you can hop out and hop.\r\n\r\n\r\nMase Graye (00:07.648)\r\nmy screen it's not too big. I want to keep the whole thing because I'll do a side by side.\r\n\r\n\r\nNikolas Hulewsky (00:20.92)\r\nSexy screen right there.\r\n\r\n\r\nMase Graye (00:24.249)\r\nSo I tend to think about it in sort of these scenarios. I don't know if you can see these scenarios, it's too small.\r\n\r\n\r\nNikolas Hulewsky (00:34.976)\r\nIt's too small for me, you can, if that's not a you problem, I have it on a very small screen. So if you want to just kind of walk me through what we're looking at.\r\n\r\n\r\nMase Graye (00:42.214)\r\nI'll speak to it. Yeah. Yeah. So I have five scenarios here and these are not all of them. This is just sort of how I think about it. The sort of first and most common scenario is a user who's using an AI tool directly to produce some work product. And this is what you're sort of typically seeing when someone's using like Grok or ChatGBT or something where they're actually using a web tool or using some tool, stuff's coming out.\r\n\r\n\r\nAnd then that's something that that person's using directly for work. There's people who use a tool, sorry, use AI to build a tool. And users can do this with products like Make or N8n. Developers are increasingly do this. This is the whole like vibe coding movement, where they're like using their cursor thing. Yeah, cursor, replit, any of those things. Love.dev, whatever. obviously there's like,\r\n\r\n\r\nNikolas Hulewsky (01:29.174)\r\nIs this cursor and replica? Okay, yeah.\r\n\r\n\r\nMase Graye (01:39.224)\r\nmore leverage here because it's like I'm using the AI sort of one time and it's cutting out a bunch of work, but ultimately you're still producing work product that is something that a human could have written, right? The next two, think is where it gets interesting. If you're using AI to build a tool that in turn also uses AI, and this is, if you think about this, this is like, you know, the developers at OpenAI probably are using\r\n\r\n\r\nOpen AI to develop open AI and then the product they're shipping is being used by users. Right. So like you're getting your internal organizations getting leverage and then like the users are getting leveraged through whatever AI functionality is being offered. Right.\r\n\r\n\r\nNikolas Hulewsky (02:21.71)\r\nisn't a company like Cursor, which is writing code, essentially taking natural language and writing code, they're using AI to make their product better as well, right? Okay.\r\n\r\n\r\nMase Graye (02:24.954)\r\nYeah.\r\n\r\n\r\nMase Graye (02:28.399)\r\nYes. Yes, exactly. And, know, and it's like, they're going to get better very fast because they're getting all this data from their users who using AI and then they're able to like consolidate it down and use it for building their own product with AI. it's like, can have, it's crazy. Yeah. High leverage. Yeah. And then like sort of the level beyond that, and this is sort of mostly beyond individuals, but you're starting to see, you know, developers using AI to build platforms that allow.\r\n\r\n\r\nNikolas Hulewsky (02:40.846)\r\nYeah, the feedback loop is just very quick. Yeah.\r\n\r\n\r\nMase Graye (02:58.373)\r\nexternal users to build apps that other users can use. And so an example of this is like, you know, the Salesforce is in the hub spots of the world where they're building these sort of, um, customer facing platforms that, that, that people can use it, can, can build apps with very easily. so that the leverage there is again, it's another level of leverage, right? And I think these are the rarest probably because they do require there'd be a platform and all this stuff, but like,\r\n\r\n\r\ncompanies that have that distribution rather with us through an existing companies like they're they're going to have the most leverage.\r\n\r\n\r\nNikolas Hulewsky (03:33.098)\r\nI've never thought of this idea. wanna like make sure I understand it. I think what you're saying is these things have already existed. Like Microsoft, for example, or Google, you could create your own custom software for it and use it on the platform, but you had to be really technical to do it. What you're saying is a company like...\r\n\r\n\r\nMicrosoft might allow maybe even more access for people to make custom tools using AI. So I'm using cursor to make a custom tool built on Microsoft's platform. Like, is that what you're saying? Okay.\r\n\r\n\r\nMase Graye (04:06.073)\r\nYeah. Yeah. So Salesforce for example, has this concept of like a, you you can install Salesforce apps, they're Salesforce native applications, right? But those today still have to be written by people, developers. And I'm saying like, well, now imagine that same customer base. They can just now make apps using sort of similar no code type tools and, and they can build Salesforce applications for their very specific Salesforce use case and then deploy them.\r\n\r\n\r\nNikolas Hulewsky (04:35.054)\r\nCan I, okay, let me ask you. Let's say I'm using Salesforce and I have a team that knocks door to door. They sell pest control, whatever. But I have a hard time getting to every single sales rep who.\r\n\r\n\r\nwho knocks, I have to go like one by one by one by one, coach them individually, make sure they're using Salesforce the right way, et cetera. But now I can take a product like, is it called Limitless? It's dependent from AI, where it's just on all the time recording conversations. And I say, okay, every single one of you wear this device, it's gonna capture all of your conversations, and then I'm gonna develop a software that integrates with Salesforce to\r\n\r\n\r\nMase Graye (05:05.349)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:21.152)\r\nessentially rate your sales skills and give me feedback on where you need improvement either closing the sale or pitching the sale or at know payment whatever but that software would be built on top of sales force let's call it would that be kind of describing what you're talking about with this last one\r\n\r\n\r\nMase Graye (05:29.497)\r\nYeah. Yeah.\r\n\r\n\r\nMase Graye (05:35.649)\r\nYeah, yeah.\r\n\r\n\r\nYeah. Yeah. And it's something that previously you probably wouldn't have been able to afford that because of what it required. paid $250,000 a year for an engineer. Now it's like, I'm going to vibe code my way to an app that's built for my business that like, that I can deploy from my specific sales agents. exactly. And you're either no code or light coding your way to success. I, yeah.\r\n\r\n\r\nNikolas Hulewsky (05:46.199)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (05:49.71)\r\nHa\r\n\r\n\r\nNikolas Hulewsky (05:59.626)\r\nI love this framework, Mays. Will you read the column headers for me just so I can... So scenario...\r\n\r\n\r\nMase Graye (06:04.133)\r\nYeah. So I have a scenario, the actor, sort of the first level of person using the AI, developer using AI, the output. So, you know, from all the way from direct work product to a workflow to a tool that accepts flexible inputs and creates flexible outputs to sort of three levels of, of output. And then, you know, the idea is like, as you go down, you're getting less, potentially less direct flexibility, you give them much more leverage. Right. So.\r\n\r\n\r\nNikolas Hulewsky (06:10.625)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (06:14.669)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:32.288)\r\nAnd is that last, sorry, you say language or leverage? Leverage, okay, cool. I love this framework, this is fantastic, man. Thank you.\r\n\r\n\r\nMase Graye (06:34.575)\r\nLeverage, leverage, sorry. Yeah. Yeah.\r\n\r\n\r\nYeah. So, um, so I just, as an example, I mean, this is kind of a contrived example, but you know, if I wanted to walk through scenarios, I'll just say one and two for now, right? Like, um, one example of me using the, using AI to, um, produce a product, you know, an output, a direct output would be like, if I wanted, if I was a PM and I needed to write a specification for a new feature, for example, right? Like we're previously.\r\n\r\n\r\nNikolas Hulewsky (07:08.942)\r\nPM being a... Yeah, it's okay.\r\n\r\n\r\nMase Graye (07:10.245)\r\nA product manager, sorry, a product manager has to write a new specification for a feature. So like, um, I've sort of made this control example for you, but like, um, where previously I might have to like, of drudgingly enumerate all the stuff. Like now you can, again, sort of vibe, vibe the PM your way to a specification. And, and my workflow right now is, um, I do it in two steps where I'll do like a translate, just a raw transcript first, and then I'll translate that into a spec.\r\n\r\n\r\nAnd then I'll take that spec and I'll have the model look at that and actually develop the feature if that makes sense Yeah Yeah, I'm just gonna show you so so I'm just gonna hopefully this still works while we're recording but um I'm just gonna like transcribe a feature here. So first I want to sort of show you this Toy app I've made so that we can talk through what we're gonna do here So this is Nick this is my to-do list classic to-do list demo\r\n\r\n\r\nNikolas Hulewsky (07:46.35)\r\nunderstand the words you're saying. Could you show me what that actually is?\r\n\r\n\r\nMase Graye (08:09.859)\r\nRight, I have like, hello, and there, and this is just, this adds to-dos to a list, right? But it doesn't save them, for instance. And so it's, see, I wanted to actually add persistence to this particular to-do list so that as I'm saving things, I refresh, they actually show up and are saved, right? So I might say, here's the transfer, I'll just do a voice transcription, so I'll say, the current NIC demo doesn't actually save things to the database.\r\n\r\n\r\nlet's write a schema that allows it to be saved via ecto. Don't worry about associating the to-do list with a user, just save them.\r\n\r\n\r\nMase Graye (08:52.367)\r\nSo it's not perfect, but so that's the Nick demo. That's the transcript. And then I might say, okay, given this raw transcript, so I'm just gonna type this over here. So say, given this raw transcript, list of steps to upgrade Nick live to use persistence.\r\n\r\n\r\nMase Graye (09:18.553)\r\nI'm just kind of going loosey-goosey here, but here it's just putting them in the chat, but I could actually say, add it to...\r\n\r\n\r\nNikolas Hulewsky (09:32.992)\r\nchat are you using? what am I looking at here? Is this clock? Cursor, okay.\r\n\r\n\r\nMase Graye (09:35.94)\r\nYeah, so this is cursor. Yeah, this is the actual editor that a lot of people use. And I'm writing all this in a markdown file. So this is just a file that's formatted using a particular way that can be translated easily in the markdown of HTML. And so I've told the model, look at this section and given that goal, write this particular feature specification. And it's basically taking my like very poorly specified thing and expanding it into a\r\n\r\n\r\na much more detailed less list of, of steps. I, and as I'm instructing the model to do that, I can link in files and say, Hey, this is where this is the thing we're going to update, et cetera. And so it's, it's, it's called this in particular is calling, um, Claude three five issues right now at three seven. And it's, it's writing out a spec given sort of these instructions and it's telling me what it's telling me what it just did. It provided a clear breakdown of the implementation tasks, technical requirements, implementation details, et cetera.\r\n\r\n\r\nAnd so I'll say, cool, accept that, this is now my spec. And then I'll say, I'll start a new session just to show it's doing this. Following the feature spec in Nick demo, make the updates to Nick live.\r\n\r\n\r\nMase Graye (10:54.725)\r\nAnd so now it's saying, okay, I'm going to help you implement persistence. First, I need to create the schema, which is how the database describes how to describe these things to database. It's creating a to do specification essentially, which just has a title and some timestamps and a way to validate it. Now it's going to create migration and migration as a way to actually update the database. I think now it's going to tell me\r\n\r\n\r\nIt should tell me how to run the migration, which again is to actually update the database.\r\n\r\n\r\nNikolas Hulewsky (11:27.404)\r\nSo like this Nick live view, which is essentially a to do app or to do tracker. Where is that hosted? Like, is that a website or?\r\n\r\n\r\nMase Graye (11:36.358)\r\nThis is just on my machine, but it's a website. It's got its own little local web server running. Yeah. Yeah. And so, yeah, I could deploy this to some service, some server somewhere and then run it. Yeah. So here, yeah. And now it's updating the live view module to use the schema and persist the data. So it's, if you notice it's creating these new files in all the right places for this particular framework I'm using.\r\n\r\n\r\nNikolas Hulewsky (11:39.512)\r\njust locally.\r\n\r\n\r\nBut in theory, could create, this could be an app. Like I could create this to.\r\n\r\n\r\nMase Graye (12:06.045)\r\nIt created a we call it a, well, I won't get into that. This is a boundary, an interface file basically for listing to-dos and creating to-dos.\r\n\r\n\r\nNikolas Hulewsky (12:17.528)\r\nSo for a normal entrepreneur who doesn't have as much technical experience as you have, how hard is it to create and deploy something like this?\r\n\r\n\r\nMase Graye (12:30.949)\r\nI'll say, you can kind of sort of come at it at two ends. If you're coming from someone who is technical, something like Cursor basically takes what you know and makes it like faster, right? I could do all these steps, but it's gonna do it for me, maybe more beautiful, maybe faster, maybe more correct, maybe with fewer bugs, right? To your point though, if you don't have that domain knowledge and you just wanna have an app, Like this tool.\r\n\r\n\r\nNikolas Hulewsky (12:46.924)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (12:51.608)\r\nSure.\r\n\r\n\r\nMase Graye (13:00.709)\r\nIf you make a mistake or if the model makes a mistake, you're kind of screwed, for my opinion. You have to know how to code well enough to correct it in the right language. Yeah, even to say, this is messed up. But I think there are other products that are taking this approach of like, hey, we're going to create models that are tuned to our specific app platform. So for instance,\r\n\r\n\r\nNikolas Hulewsky (13:10.392)\r\nto use this tool. Okay.\r\n\r\n\r\nMase Graye (13:30.327)\r\nIf you're an existing no code vendor, right? Where someone can already just drag and drop componentry and create a thing. Well, now if you add a model on top of that that knows how to do the dragging and the dropping essentially, well then if something messes up, you just fall back to dragging and dropping, right? So it's not you're having to drop back down to code. You're just dropping back down to that same level of abstraction that you're already sort of matched with.\r\n\r\n\r\nNikolas Hulewsky (13:51.79)\r\nIs Replet, is the software like Replet better than Cursor in that sense for somebody like me? Because it's more strict, I guess is probably the-\r\n\r\n\r\nMase Graye (14:03.321)\r\nI think Replit's interesting in that they're taking the first thing and they're bringing it all the way up to the user. so I actually, it's, and I think that's the better approach because I think ultimately for some period of time until these models get very good, at some point you're gonna need to drop down to the raw code level, which is what it's generating. It's generating framework code. But they're doing a lot of, I think, hard work to make sure that.\r\n\r\n\r\nthe thing it's generating is good and that the interface that you have for fixing these things is sort of, the default interface is sort of friendly. And so they're sort of in a weird in between those two things, but I think that that's sort of the winning version of this, if that makes sense.\r\n\r\n\r\nNikolas Hulewsky (14:47.448)\r\nSo, but do you think Replet is a better option for somebody like me than Cursor? Or no?\r\n\r\n\r\nMase Graye (14:54.691)\r\nI think it's...\r\n\r\n\r\nI don't know what better means. Yeah, if you have, if you have, yeah.\r\n\r\n\r\nNikolas Hulewsky (14:59.502)\r\nWell, better, here's what I'll define better. I'll define better. Better being, I wanna build a software that I can deploy without a bunch of intervention from an engineer or a coder who knows what they're doing. Which one of these two would, okay.\r\n\r\n\r\nMase Graye (15:16.581)\r\nI think Replet, and I think Replet because theirs is not just writing code. They actually own the whole life cycle of the application all the way through to like deployment and testing and all that stuff. And so the other half of this is not just authoring. It's like making sure it works and then fixing things if they don't work, right? And because they're integrated at the whole thing, they can feed all that context into the model to correct errors for you. Whereas in this thing that I'm doing, like this is, I'm basically just using an AI tool to\r\n\r\n\r\nright in my framework of choice. But like when there's an issue, it shows up outside of the context of cursor. I could do things to loop it in, but it's going to be a technical solution to give it the feedback necessary to automatically fix issues versus Replet. It's already there. It already knows what went wrong and it can say that didn't work. Let me try again. And so that's probably between cursor and Replet. If it's you, I would say Replet between like,\r\n\r\n\r\nNikolas Hulewsky (16:04.27)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (16:11.31)\r\nOkay.\r\n\r\n\r\nMase Graye (16:12.569)\r\nbetween replet and love, like love.dev, but is another one of these sort of no-code things. You know, short-term love, long-term replet. That's kind of, I mean, that's kind of my answer.\r\n\r\n\r\nNikolas Hulewsky (16:23.268)\r\nso is love the best option right now for somebody who doesn't have experience that wants to code in natural language?\r\n\r\n\r\nMase Graye (16:27.301)\r\nSo love's interesting because they're starting at the other end. basically saying you don't have to, I mean, I think they only recently just added the ability to actually look at the code. What they were basically saying was it's prompt only, it's prompt only development and you don't need to look at the code. And so they're coming up from the other end. so, but that tells me that again, when there's issues you actually do need today to drop down to the code or something does like the, whether it's you or the tool, the LLM and yeah.\r\n\r\n\r\nNikolas Hulewsky (16:38.712)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (16:53.858)\r\nLook, okay, we're coming up on time here. Can I ask your opinion? Do you think that, I'll call it a CTO, a CTO level position is gonna be necessary for a lot of small businesses? Somebody who can come in here and just like, here's your process flow, cool, I'll build you this custom software that handles what you need handled.\r\n\r\n\r\nMase Graye (16:57.509)\r\nSure sure.\r\n\r\n\r\nMase Graye (17:12.216)\r\nI-\r\n\r\n\r\nMase Graye (17:19.203)\r\nI think I have two thoughts. think from a, from a, from the development perspective, think you will probably only need a CTO as in like typical product team developing product, whether it's internal or external, typically has like a roster that's involved in this, right? It's like, there's a designer, there's a PM, there's a senior engineer, there's a couple of junior engineers that help carry water and all that stuff. like, and I'm saying the junior engineers are out. That's the model. The, the,\r\n\r\n\r\nthe PM and the engineer, those two probably merge into like a product focused person. And as the tool gets better and better, you only need one of those. And that person may as well be your CTO from a, from a development perspective. Now from a, this is a critical part of our business. It could go wrong. Business continuity planning, all that stuff. Like there's still the watering and updating of these things. And I feel like while the current sort of state of the art and the demos are very good at showing what\r\n\r\n\r\na new development experiences, they're less good at showing like, what happens when things go wrong? And today that part's not quite covered by models and tools.\r\n\r\n\r\nNikolas Hulewsky (18:28.294)\r\nIt just feels like for small businesses, this is such a high leverage position that could save a bunch of money or drive revenue that traditionally you're not hiring someone in that technical spot until maybe, unless you're a company that is technical, but if you're an HVAC company, you're probably not hiring an IT specialist until you're at least, I don't know, seven, eight, $10 million in revenue. Whereas,\r\n\r\n\r\nMase Graye (18:45.305)\r\nYeah. Yeah.\r\n\r\n\r\nMase Graye (18:53.765)\r\nI would do much sooner now. Yeah. Yeah. Well, cause yeah, before you wouldn't hire those because the, the, the given the expense needed to fund the team, you would only apply it to problems that don't exist until you're very large. And now since, since the effort required to build custom tools basically drops to the floor. Like, like I said, like instead of having a product team that builds something and releases every month or three months or six months, and it's a big thing. It's like,\r\n\r\n\r\nNikolas Hulewsky (18:54.166)\r\nMoving forward, you may want to do it way sooner now, right? Because it's so high leverage.\r\n\r\n\r\nMase Graye (19:23.341)\r\nNo, now you just have like two people whose entire business is just optimize the business.\r\n\r\n\r\nNikolas Hulewsky (19:24.878)\r\nHey, hold on one second. I'm on the phone, buddy. What's up?\r\n\r\n\r\nOkay, did you see did you see my message to you? Here, love you. Can you close the door for me? Sorry. Spring, it's spring break. So kids are home. Okay, keep going with that thought.\r\n\r\n\r\nMase Graye (19:43.556)\r\nYeah, yeah.\r\n\r\n\r\nMase Graye (19:47.514)\r\nYeah, honestly, like, you know, but before you need this large team, because you the problems are you wouldn't apply technology to a problem because you know how much it costs to put that team together. But now that the costs are so low, and the the speed with which you can attack problems is so high. And the number of problems you can attack quickly is probably pretty high. I think it's worth it much sooner. Like you can have a team of one or two people whose entire job is just like, go department by department. And once something is sort of like\r\n\r\n\r\nstable enough from a process perspective that you want to like really operationalize it. You say, okay, we'll build an automation for that. It'll take us three days. And now that person never has to do it again. Right. That seems, that seems so valuable to me.\r\n\r\n\r\nNikolas Hulewsky (20:30.496)\r\nSo valuable. Well, and in the past, my experience is in healthcare, you would need an IT specialist as you got larger because the things that you're worried about are where am I saving the data? How are we communicating? What is our reporting like? You get to a size and scale where you need technology to make the administrative functions smoother, better, more timely, et cetera.\r\n\r\n\r\nBut we're not talking about administrative functions anymore. Like we're talking about product fulfillment. We're talking about actually making the job of the end employee, the line employee, whatever you want to call them, easier. It just seems like a no-brainer to me at this point that that's going to be one of the earlier positions, not one of the later ones. So cool.\r\n\r\n\r\nMase Graye (21:10.085)\r\nYeah, totally. And like I said, I think you can do it in every area. You could all the way up in like sales land. It's like, okay, lead generation. There's you can build AI tool for that. You can build out, you can build AI automation for, for nurturing leads. You build automation for like helping your own salespeople follow up and like babysit them, right? Like you just go down the line, the whole value delivery. And it's like, there's something in there that someone has to do every day that can now be automated in less than a day by one of these people. And then it's gone. So\r\n\r\n\r\nNikolas Hulewsky (21:19.33)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (21:37.122)\r\nand say, you should just be a fractional CTO that only builds custom solutions for small businesses. That would be a cool business.\r\n\r\n\r\nMase Graye (21:46.277)\r\nI think that's pretty viable now. Yeah, it's it's quite doable. So I'm open to that. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:49.79)\r\nYeah, dude. Mace, this was amazing. Thank you. This is one of those conversations where like, I could go for another two hours and this is incredible. gonna...\r\n\r\n\r\nMase Graye (22:02.281)\r\nyeah, me too.\r\n\r\n\r\nYeah.",
  "metadata": {
    "duration": "",
    "date": "2025-04-08",
    "platform_source": "Google Drive"
  }
}