{
  "episode_number": "165",
  "episode_title": "AI SERIES: 11 - No Code, No Problem: Building Apps and Websites with AI with Minh Nguyen",
  "guest_name": "Minh Nguyen",
  "business_name": "Cash On",
  "transcript": "﻿Nikolas Hulewsky (00:01.264)\r\nMin, I'm very excited. I'm excited to learn some AI today. You are coming to me from the capital of the world of technology, the Bay Area. My first question, here's my first question. What tools do you use, LLMs, and for what?\r\n\r\n\r\nMinh Nguyen (00:09.326)\r\nYeah.\r\n\r\n\r\nMinh Nguyen (00:14.519)\r\nOkay.\r\n\r\n\r\nOkay. Yeah. So I use all the LLMs and they all kind of have different like they all excel at different things. So I use them for different reasons. for coding, anything coding related, I'll use, Claude because it's the best coding model for general specific or for general purpose things, but also just like research. I'll use chat GPT, especially a deep research that's been like super helpful. Like I'm actually trying to learn a bit of like\r\n\r\n\r\nquantitative trading right now, it's this little side project with a friend. And I know nothing about it, but like the deep research has been super helpful with that. And then actually, I feel like this is the one people sleep on, is Gemini. So for 80 % of use cases, I actually feel like Gemini, at least for people who code, it does, it'll get the job done at just as good as the other models, but at a 10th of the cost. And...\r\n\r\n\r\nNikolas Hulewsky (00:49.883)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:14.588)\r\nHmm.\r\n\r\n\r\nMinh Nguyen (01:15.854)\r\nPeople, I feel like they don't know about Gemini, they don't know how cheap it is, so I was talking to this guy the other day who was doing web scraping, spent $80 with Claude in one day, and then I showed him Gemini, switched over, did just as good of a job, but cost like five bucks to do what he had done. Yeah, so, people are sleeping.\r\n\r\n\r\nNikolas Hulewsky (01:29.83)\r\nNo way. Why do think people sleep on Gemini? Because almost everybody who I've spoken to has said, like, Gemini is not even on their radar. Two people have said, one person, one person, there was their main thing. And then another person was like, I just use it for the Google suite.\r\n\r\n\r\nMinh Nguyen (01:38.786)\r\nYeah.\r\n\r\n\r\nMinh Nguyen (01:44.482)\r\nYeah, so it's... The only thing it's good at is basically... Well, actually no. Okay, that's not true. There's two things it's good at. Give me one sec.\r\n\r\n\r\nNikolas Hulewsky (01:56.082)\r\nyou good?\r\n\r\n\r\nMinh Nguyen (01:59.918)\r\nSorry, hope we can cut that. Okay, so I think the reason people sleep... So Gemini is good... Okay, she just left. Okay. So Gemini is actually good at two things, okay? One is it has a really big context window, which means it can consume a lot of information. So for example, I think it has a million context window compared to other LLMs. Yeah, which only can do up to 200,000. So it can do... So I guess if you translated, let's say, chatgbt can...\r\n\r\n\r\nNikolas Hulewsky (02:00.902)\r\nNo worries, dude. No worries, we can cut that.\r\n\r\n\r\nNikolas Hulewsky (02:21.545)\r\nreally?\r\n\r\n\r\nMinh Nguyen (02:29.912)\r\nlike ingest 100 pages, then Gemini can ingest five times that. So 500 pages. Like that's just like an example.\r\n\r\n\r\nNikolas Hulewsky (02:38.29)\r\nYeah, well, I just know like Claude's context when it was a 200,000, ChachiBT's around 120,000. I had no idea that Geminis was a million.\r\n\r\n\r\nMinh Nguyen (02:42.422)\r\nYeah. So I think it actually can even go higher than a million, but I think like the cost kind of skyrockets up there or like it goes up and I haven't even I've never needed above a million. So I haven't tried it. Yeah. So.\r\n\r\n\r\nNikolas Hulewsky (02:53.264)\r\nYeah, makes sense.\r\n\r\n\r\nSo, okay, so you are an entrepreneur, you're a coder. You've built a company called Cash On, which tell me just briefly what that does.\r\n\r\n\r\nMinh Nguyen (03:04.898)\r\nYeah.\r\n\r\n\r\nMinh Nguyen (03:08.974)\r\nThat's right. Sure. Yeah. So Cash On, it's a Chrome extension that kind of hooks in a Zillow. And usually what real estate investors have to do is they kind of browse Zillow. They copy and paste the data, like the price and the mortgage and all that stuff into a spreadsheet and they run their analysis. So it probably takes about like five minutes per property, but you can only find like only maybe one in a hundred real estate investments or properties would be a good real estate investment.\r\n\r\n\r\nNikolas Hulewsky (03:27.132)\r\nMm-hmm.\r\n\r\n\r\nMinh Nguyen (03:38.892)\r\nSo what my app does is it will grab all that data for you, analyze it for you, and then tell you which of the properties on the map are the best ones. And so yeah, it takes a process that could take usually months and compress it down into like a week or two. So actually, yeah, my best success story is just like this guy was looking for real estate investments for like two years, couldn't find anything. I worked with him for...\r\n\r\n\r\nNikolas Hulewsky (03:49.146)\r\nInteresting.\r\n\r\n\r\nMinh Nguyen (04:06.04)\r\nWe basically identified a mark in two weeks and then within a month he put in and got two offers accepted on two different properties. Yeah, it's an economy extension and I have a free tier that like is pretty generous and that people can try out. It's pretty awesome, yeah.\r\n\r\n\r\nNikolas Hulewsky (04:12.018)\r\nThat's amazing. And it's a Chrome extension?\r\n\r\n\r\nNikolas Hulewsky (04:22.876)\r\nDude, the cool thing, I didn't realize this, but there are some companies that are like eight, nine figure companies and they're just Chrome extensions, which is insane to me.\r\n\r\n\r\nMinh Nguyen (04:28.238)\r\nYeah, no, mean like yeah Chrome extensions I feel like I don't want to say they're slept on but they they they have a specific kind of purpose and like superpower which is that they help you pull in data from different websites really well and Yeah, no, I think Definitely could probably be a lot more coming sentience in the world. So Yeah\r\n\r\n\r\nNikolas Hulewsky (04:53.618)\r\nVery true. So now I'm curious, the money question. How are you utilizing AI? Are you utilizing it for work? Are you utilizing it personally? Did it build or at least help build cash on? Like curious to see your use cases.\r\n\r\n\r\nMinh Nguyen (05:05.996)\r\nYeah.\r\n\r\n\r\nYeah. So I pretty much use AI like all the time now. I kind of mentioned in beginning, but yeah, it's like to learn new topics, to do research, to code, use Cursor to code. But maybe the thing that I kind of want to show you, which I'm kind of excited about is I use AI now. I built an AI powered web scraper. So yeah, so this is kind of cool. Basically.\r\n\r\n\r\nNikolas Hulewsky (05:35.73)\r\nOkay.\r\n\r\n\r\nMinh Nguyen (05:36.462)\r\nThere's this concept called directories that's kind of getting popular right now, like Greg Eisenberg, John Rush, they're talking about it. The idea is if you consolidate information and put a website up, then people will go to your website and that traffic can actually generate you quite a bit of money. I think the most, like here's an example. Have you heard of AllTrails?\r\n\r\n\r\nNikolas Hulewsky (05:58.16)\r\nYeah, the app.\r\n\r\n\r\nMinh Nguyen (05:59.02)\r\nYeah, the app altrails. Actually, I guess that's not a good example because it doesn't have your across the internet. let's say, for example, Yelp, right? Like Yelp is like people most often use it as a directory for restaurants. A directory I built is called pickleballcourtsnearby.com. And so people, they search it and then, you know, there's like, I think the search volume is like 200,000 plus per month. And with that kind of traffic, you can generate like easily like\r\n\r\n\r\nin the world of like five to 10,000 a month. And then the idea is.\r\n\r\n\r\nNikolas Hulewsky (06:31.602)\r\nWait, so are you making money off of pickleball courts near me.com? Okay.\r\n\r\n\r\nMinh Nguyen (06:34.966)\r\nNot yet. I'm just starting it up. That's why I built this web scraper. So the idea is I built a web scraper that will help me scour the web for pit ball courts and tell you information like, is it indoor? Is it outdoor? Is it, it can be reserved, does it have lights you can play at night and a bunch of other stuff. And actually I can show you what it looks like.\r\n\r\n\r\nNikolas Hulewsky (06:57.19)\r\nYeah, while you're pulling that up, I just found out about a tool. You're going to laugh at me. I'm sorry. It's called browse AI. Browse. Yeah, browse AI. So apparently what it does. good. Good. You hadn't heard of it. That means I'm like super smart.\r\n\r\n\r\nMinh Nguyen (07:00.91)\r\nYeah.\r\n\r\n\r\nMinh Nguyen (07:05.07)\r\nBrowse.ai Browse? Let's check it out. no, I think I have heard of it. Yeah, I've seen this before for sure.\r\n\r\n\r\nNikolas Hulewsky (07:17.886)\r\nit's a little bit different, right? Yours is like a general use case of scraping. This is like, Hey, this is the website that I want you to go and scrape specific data for. But I started thinking about this use case of using AI to go out and scrape information from the internet, as opposed to our current methods of going out and, and scraping information. So.\r\n\r\n\r\nMinh Nguyen (07:35.374)\r\nMm-hmm.\r\n\r\n\r\nMinh Nguyen (07:40.234)\r\nYeah. Yeah. So actually the context is, um, I was helping a friend. was building dog parks near me and he was basically saying that it was going to take him like 80 hours to kind of gather the data needed to build this website, to hopefully make something like two, three, $5,000 month. And that's kind how I got into it. I was like, wait, I can automate this for you, And then like it would take me about a day or two, but we got it running and, um, yeah. So I saved him like 80 hours and he launched his website and\r\n\r\n\r\nNikolas Hulewsky (08:08.816)\r\nNo way.\r\n\r\n\r\nMinh Nguyen (08:10.177)\r\nWe're kind of seeing, because SEO is kind of like a long game. So we're kind of seeing the traffic that you're able to acquire. But yeah, so there's a lot of potential with these directories, but also just LLM-based web scraping. Because they can browse like humans and automate what you're doing and extracting the information you need.\r\n\r\n\r\nNikolas Hulewsky (08:30.482)\r\nSo is it similar to programmatic SEO?\r\n\r\n\r\nMinh Nguyen (08:34.018)\r\nYes, yes. So actually, I mean, this would be just easier if I share my screen.\r\n\r\n\r\nNikolas Hulewsky (08:38.246)\r\nYeah, I'd love to see it. I'm like really new to all this stuff. I mean, I'm trying to learn as much as I can, but programmatic SEO has been really attractive to me because I, like you're saying, it's a long game. I need permissions.\r\n\r\n\r\nMinh Nguyen (08:50.52)\r\nYeah.\r\n\r\n\r\nno. Give me one, sorry. I had to. Okay.\r\n\r\n\r\nNikolas Hulewsky (08:56.102)\r\nNo, you're good. SEO is a long game, but programmatic SEO is really interesting because it's a very long game, but you're also, you're like taking advantage of a bunch, different geographies or different verticals. So I've been thinking about AI use cases around programmatic SEO.\r\n\r\n\r\nMinh Nguyen (09:03.298)\r\nYes. Okay.\r\n\r\n\r\nMinh Nguyen (09:18.028)\r\nYeah, so this I guess is like a pretty good example. So this is my website, pickleballcourtsnearby.com. And then yeah, the programmatic is like, you know, for every state and for every city. So this is California Irvine. There will be like a page and this is the kind of data extracted. like you can also go to Denver, Colorado. Yep.\r\n\r\n\r\nNikolas Hulewsky (09:23.493)\r\ngosh, I love it.\r\n\r\n\r\nNikolas Hulewsky (09:36.69)\r\nHold on one second.\r\n\r\n\r\nNikolas Hulewsky (10:52.082)\r\nSorry about that.\r\n\r\n\r\nMinh Nguyen (10:53.25)\r\nYeah, no problem.\r\n\r\n\r\nNikolas Hulewsky (10:54.746)\r\nOkay, so these are pickleball courts in Irvine.\r\n\r\n\r\nMinh Nguyen (10:59.628)\r\nYes. Okay. Yeah. Okay. So yeah, the idea is, so this is actually Denver, Colorado. But yeah, you can, the idea is you go to whatever city and then there's like a URL that's already been created. Right. So this is Texas, Dallas, and then all the data is here. And so then the idea is when you go to Google search and you know, like you search pickleball courts near me, this will say pickleball, in Dallas, Texas.\r\n\r\n\r\nNikolas Hulewsky (11:01.829)\r\nthat was Dallas.\r\n\r\n\r\nNikolas Hulewsky (11:14.993)\r\nMm-hmm.\r\n\r\n\r\nMinh Nguyen (11:26.572)\r\nOkay, I need to update the SEO and text a bit, AI generators, but that's the idea. And so, yeah, and then, you know.\r\n\r\n\r\nNikolas Hulewsky (11:30.074)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (11:35.548)\r\nSo how are you using AI to generate the information for these websites?\r\n\r\n\r\nMinh Nguyen (11:38.466)\r\nYes. Okay. So that I can show you. Can you still see my screen? Does it look at table to you? Okay. So, so what I first did is I use this platform called outscraper, which, awesome. Yeah. So I scraped Google maps for all the locations that have pickleball in the name or in like,\r\n\r\n\r\nNikolas Hulewsky (11:42.204)\r\nYeah, Yep.\r\n\r\n\r\nNikolas Hulewsky (11:53.234)\r\nSpeak my language, bro. I know how to scrape her\r\n\r\n\r\nMinh Nguyen (12:05.41)\r\nthe description and then that gives me a list of all the locations and it also usually comes with a URL. so that's actually, let's just start here. So it'll come with, okay, not exactly what this table is, but it'll kind of look like this where, you you'll have the name of the pickleball court and the URL for like the website.\r\n\r\n\r\nNikolas Hulewsky (12:27.09)\r\nAnd where are you? Sorry, where is this table? can't quite read it. It's a little bit small on my screen. Just for me, just for me, it's small on my screen. But is this like an Excel doc or is this what platform is this in?\r\n\r\n\r\nMinh Nguyen (12:31.488)\r\nOkay, let me see if I can make it Okay.\r\n\r\n\r\nYeah. So since I code, this is in my database, but usually it's given to you as a CSV that you can open up in your Excel sheet.\r\n\r\n\r\nNikolas Hulewsky (12:46.182)\r\nYeah, I didn't know if you'd put this in like an air table or something, but this is in your coding database.\r\n\r\n\r\nMinh Nguyen (12:49.176)\r\ngotcha. Yeah. Probably could work with Airtable too, but yeah, this is in my own database because I'm trying to build like a whole website and like a bunch of stuff. But the idea is you get the Pickleball Court or the location that has it, you know, like these sports complexes, and then you get the URL of these Pickleball Court locations. And then what I do is I use this open source software called Firecrawl. And what it'll do is I send it to this URL. So let's...\r\n\r\n\r\nNikolas Hulewsky (12:55.45)\r\nSure, yeah, yeah,\r\n\r\n\r\nyou\r\n\r\n\r\nNikolas Hulewsky (13:06.588)\r\nMm-hmm.\r\n\r\n\r\nMinh Nguyen (13:18.218)\r\nsay activityreg.com and I say, okay, I need, let me show you the information I grabbed.\r\n\r\n\r\nUh-huh.\r\n\r\n\r\nLet's see here, structured data objects. So I say, okay, I want Pickleball Cords and I want it to look like this. So I want the URL, I want the email and the contacts. I want to the phone number. I want to know the address and okay, this is all empty, but let me see if I can find a good one. Yeah, yeah. So this one has a bit more like address and stuff. And so I gather all this data.\r\n\r\n\r\nNikolas Hulewsky (13:50.898)\r\nNo, that's fine. I mean, you're just telling me the parameters that you're going and pulling from those websites. That make sense?\r\n\r\n\r\nMinh Nguyen (14:00.736)\r\nAnd so I tell it I want this data. So then what it does is it goes to the website and then it crawls it until it finds the data needed. And then it gives it back to me in the format I need to show to my website. yes, so it's AI because previously, if you were trying to scrape, you'd have to hard code everything. Like, for example, you can only like go to eBay.com and say like, okay, for this product, this is where you get the email and this is where you get the address or like whatever.\r\n\r\n\r\nNikolas Hulewsky (14:13.298)\r\nSo the software you're using, is that AI enabled? OK.\r\n\r\n\r\nNikolas Hulewsky (14:22.674)\r\nHmm.\r\n\r\n\r\nMinh Nguyen (14:30.798)\r\nBut now with AI, can, no matter where it is on the page, or even if it's on like a different page in the website, it can decide like which one to go to. So usually actually what happens is it goes to a website and then I get all the links on that website. And then I'm like, okay, this is the homepage and these are the 100 other links on this website. And actually you can see it in here, fire call maps.\r\n\r\n\r\nNikolas Hulewsky (14:52.454)\r\nSo, okay, again, I'm really stupid and I'm just trying to like process through this. The reason Outscraper is able to get all the information that it does from Google is because Google probably has some standardized way of gathering and displaying information. because Outscraper had all this information before AI, right? And they're able to do that because it was predictable. You could hard code and pull all this stuff. Now what you can do with that website information\r\n\r\n\r\nMinh Nguyen (15:10.722)\r\nYes.\r\n\r\n\r\nMinh Nguyen (15:15.715)\r\nYes.\r\n\r\n\r\nMinh Nguyen (15:19.809)\r\nExactly.\r\n\r\n\r\nNikolas Hulewsky (15:22.606)\r\nusing context is say like, go find me the phone number or whatever. And you don't have to tell it where it is, but it knows what a phone number looks like. So it's going to go through and like make a decision. man, how cool.\r\n\r\n\r\nMinh Nguyen (15:27.019)\r\nExactly.\r\n\r\n\r\nMinh Nguyen (15:31.502)\r\nYes. Yeah. Exactly. Actually. Yeah. So you nailed it. Basically, since people, like, you they either submit their business. Well, they usually, they usually submit their business and they fill out the information. Right. And then as we ever can scrape it from Google maps, cause it's always in the same place in the same format. But what happens if it's not in the same place in the same format, then you need a human to go do that. And so previously, like a job like this would have taken many people.\r\n\r\n\r\nNikolas Hulewsky (15:46.3)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (15:50.832)\r\nRight.\r\n\r\n\r\nMinh Nguyen (16:01.034)\r\nmany hours, like months, know. like, in this, in my database, have 16,000 Pickleball Horts. If you say, okay, let's see, 16,000. And let's say it takes five minutes per, that's 80,000 minutes. So that's 1,300 hours. So that would be like five days. Exactly. And so yeah, with AI, I of just let it run in the background.\r\n\r\n\r\nNikolas Hulewsky (16:02.534)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (16:21.766)\r\nhalf of a working year. It's more than half of a working year.\r\n\r\n\r\nMinh Nguyen (16:29.866)\r\nIt'll take me about seven days, I'd say, but I don't have to do anything. And actually, what I've noticed is it actually does a lot better than a human too. Because it's just like, with AI, you're basically getting a college-level graduate. And all you're doing is pulling data out. So it's not hard, right? It's just if you read it and then if it exists on the page, the AI can definitely grab it. Whereas a human might miss it.\r\n\r\n\r\nNikolas Hulewsky (16:33.434)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (16:53.368)\r\nor a human might be like, that's good enough. Well, that phone number might work. And they're just trying to get to the next thing as opposed to getting it right. Have you messed with operator?\r\n\r\n\r\nMinh Nguyen (16:55.702)\r\nExactly. Yes.\r\n\r\n\r\nMinh Nguyen (17:01.42)\r\nYeah. Thanks, I have, I have. Yes.\r\n\r\n\r\nNikolas Hulewsky (17:05.914)\r\nOkay, so you know how slow operator is, right? When it's like, it's going and executing a task and it's slower than the human would actually do it. Is it the same with this technology? Is it just slow? that why it takes seven days? Or is it just a massive data set?\r\n\r\n\r\nMinh Nguyen (17:17.71)\r\nIt's just a massive data set. So I think with Operator, I think it will get faster over time. But it's still slower now because it has to be kind of like a generalized use case. But mine...\r\n\r\n\r\nNikolas Hulewsky (17:31.098)\r\nYeah, I also bet operator is like in a sandbox with it like they don't want to give it total rain to do whatever, but.\r\n\r\n\r\nMinh Nguyen (17:37.774)\r\nYeah, and actually my guess is it actually could run faster, but it would cost OpenAI more. So I think they purposely really limit. That's my guess. That's my guess. But yeah, so since like for me, I just need to get the job done as fast as possible. I can let it run for as fast as possible. I'm actually more limited by the computer I run it on. And so I could technically like, you know, rent a computer in the cloud and like run the whole machines into it, but I'm not.\r\n\r\n\r\nNikolas Hulewsky (17:45.128)\r\nthat makes sense.\r\n\r\n\r\nNikolas Hulewsky (17:57.01)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (18:03.676)\r\nHow much coding does it take to do what you're doing? Like if I wanted to go not scrape all the pickleball courts, I wanted to go scrape all of the cupcake businesses in the United States. You know what mean? Okay, I know the software now, Fireflow, like a fire call. Like, could I just go do this? like, what would it actually take for me to do it?\r\n\r\n\r\nMinh Nguyen (18:16.35)\r\nYeah. How much is the premium of that? Fire call.\r\n\r\n\r\nMinh Nguyen (18:29.656)\r\nGood question. Let me think. so that handles us. So fire call handles a scraping for you and gives the date, the website in a format that the LLM can do. And if I guess, if you were going for like an MVP, let's say, you know, like I just want to get the data only for cupcakes. Don't need to generalize kind of scraper. You could probably get that done. If you're an engineer, a software engineer, you probably get that done in like a day, a day or two.\r\n\r\n\r\nNikolas Hulewsky (18:46.599)\r\nMm-hmm.\r\n\r\n\r\nMinh Nguyen (18:59.566)\r\nIf you didn't, it kind of depends on how good your prompting is, but I think you can still get it done. And I would say like, you know, like, yeah, I think, well, I think the thing with prompting from a non-engineers perspective is just like, you could probably try everything you could within like three days. And then if you, it's more like either you'll get it done in three days or you're not going to be able to get it done. Like you don't know how to prompt it in the correct way. I feel like that's kind of my guess. You know, it's like.\r\n\r\n\r\nNikolas Hulewsky (19:06.428)\r\nbut a couple days.\r\n\r\n\r\nNikolas Hulewsky (19:23.314)\r\nI see what saying. Yeah, I'm just thinking for a business owner who's like, let's say I have I have a PE firm and I'm rolling up cupcake shops and I want to know who all the cupcake shops are that are owned by mom and pops. And it's like, OK, I wouldn't get all the information from Google, but I want you to find the specific owner. I don't know some use case where you're scraping data like how would I do that? Would I just go to fire call and say this is what I want? Or do I have to build?\r\n\r\n\r\nMinh Nguyen (19:32.568)\r\nYeah.\r\n\r\n\r\nMinh Nguyen (19:35.886)\r\nYeah.\r\n\r\n\r\nMinh Nguyen (19:42.04)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (19:53.602)\r\napp essentially to run FireScrape on.\r\n\r\n\r\nMinh Nguyen (19:56.686)\r\nYeah, I think specifically for this use case, there isn't a product that kind of exists yet that can do end to end. I'm actually, I am planning to release this as like kind of a paid product, but it will cost a bit of money because just for reference, for the Pickleball data set, that will cost me like at least $150. I'm only halfway done. And then it also cost me seven days of running my own computer. But...\r\n\r\n\r\nNikolas Hulewsky (20:24.421)\r\nnothing.\r\n\r\n\r\nMinh Nguyen (20:25.88)\r\nYeah, no, it's nothing compared to like if you had hired someone, like a VA for like 10, 20 bucks an hour, because that would take them 55 days, which would be way more money. yeah, I think for someone just trying to get it done...\r\n\r\n\r\nI would say give it a shot. Like I think with AI, you definitely have a good chance at getting it done. This is just maybe on a little bit more on the technical side and I'm not 100 % confident, but I feel like you get very far as a business owner without any coding knowledge. I think you get pretty far.\r\n\r\n\r\nNikolas Hulewsky (20:58.375)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (21:04.326)\r\nIt's weird because this last week, like I had never done anything even remotely technical. And in the last week I've like, I now know what JSON is. I know what it is. I don't necessarily know like the definition behind it, but I know what JSON is. I've written a Python script in Google collab, which I was then able to like take my files and condense them. And I was able to get my transcripts cleaned up and I was like, this is freaking.\r\n\r\n\r\nMinh Nguyen (21:23.662)\r\nYeah, that's kind of the answer.\r\n\r\n\r\nNikolas Hulewsky (21:33.39)\r\nAmazing. I don't know what I did, but I know that AI wrote it and it gave me the output that I wanted. Do know what I mean? So.\r\n\r\n\r\nMinh Nguyen (21:36.504)\r\nYeah. Have you heard of Bolt.new and lovable and that kind of Okay. All right, Bolt. It's very similar to lovable. Products that will help you build websites without any coding knowledge. But my physical therapist friend, he's been trying to pitch me on this idea for a while to help like people kind of self-diagnose themselves.\r\n\r\n\r\nNikolas Hulewsky (21:43.268)\r\nNo, so lovable, yes, yes, I've heard of lovable, but bolt.new.\r\n\r\n\r\nMinh Nguyen (22:05.678)\r\nAnd I was like, all right, like I kind of gave him a couple of steps to do beforehand before I'm like, okay, before we can work on this together. But he was like, no, I don't want to do all that. So he just went on, he's like, I want to just do this myself. So I was like, okay, if you want to do it, try using lovable. He used it and he built like a product that without AI probably would have taken me like a solid month with AI, probably like, uh, like a couple of days, but he was able to build like 80 % of a working website, um, with just like a couple of bugs.\r\n\r\n\r\nTo help people self diagnose themselves like for physical therapy like kind of pains and that blew my mind because it really He's had like a bunch of ideas over the years and never been able to pursue them and now he can and so\r\n\r\n\r\nNikolas Hulewsky (22:40.914)\r\nNo way.\r\n\r\n\r\nNikolas Hulewsky (22:50.77)\r\nYeah, mean, how many people, I know a lot of people who are like, dude, I have this idea for an app. Like, what would you think if, and they tell you the app and it's like, yeah, you're never gonna do that. Cause you would need an engineer or coder or somebody to create an MVP for you. But you can actually do that now.\r\n\r\n\r\nMinh Nguyen (22:56.322)\r\nYeah.\r\n\r\n\r\nYeah. Yeah. Mm hmm. Yeah.\r\n\r\n\r\nI know it's crazy actually it's like he is beyond an MVP now I would say like there's like small kinks here and there but it's definitely working it definitely gets the job done.\r\n\r\n\r\nNikolas Hulewsky (23:14.77)\r\nWhat's the difference between bold and lovable?\r\n\r\n\r\nMinh Nguyen (23:19.704)\r\nI think they do the same thing, think they're just competitors.\r\n\r\n\r\nNikolas Hulewsky (23:22.586)\r\nOkay. What about, what about replet, bolt, and lovable?\r\n\r\n\r\nMinh Nguyen (23:30.912)\r\nI haven't actually tried Replet. I've only seen videos of it. I think it falls into a similar category. My guess though is that Replet would be a little bit more powerful because cursor is definitely like, I think, okay, so if I put it on a spectrum, full software engineers for people that don't know how to write any code, think Lovable and Bolt are on the side of, for people who don't know how to code. Cursor is definitely on the side for people that do know how to code.\r\n\r\n\r\nNikolas Hulewsky (23:35.003)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (23:42.322)\r\nWhat about cursor?\r\n\r\n\r\nMinh Nguyen (24:01.334)\r\nAnd I think, replicates in the middle, I think. Yeah, so it can, cause I feel like with lovable, like I kind of had to help my friend debug a bit. It didn't let me edit anything in the UI. It's really designed for people who just cannot code and just want the AI to do everything. But with cursor on the other hand, like you need to know how to like set up your environment. You need to like know like what to tell cursor, but it's way more powerful in terms of like.\r\n\r\n\r\nNikolas Hulewsky (24:30.524)\r\nSo if I wanted to build an app, would you recommend I try Lovable or Bolt?\r\n\r\n\r\nMinh Nguyen (24:36.878)\r\nWhat would you your dreaded?\r\n\r\n\r\nNikolas Hulewsky (24:46.098)\r\nOkay, I'm gonna try it. Next week I wanna try to build something.\r\n\r\n\r\nMinh Nguyen (25:06.894)\r\nIt's hard to say no to your friends, but now that they can go do it themselves, it's awesome.\r\n\r\n\r\nNikolas Hulewsky (25:09.606)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:13.09)\r\nOkay, if I were to build some product for myself, are there like some parameters you would give me or some framework you would give me to identify like what would be a good use case? Yeah.\r\n\r\n\r\nMinh Nguyen (25:23.042)\r\nYeah, like what's a good?\r\n\r\n\r\nOkay, this is a tip I would give is that I feel like the best projects to start are...\r\n\r\n\r\napp ideas where you don't need to aggregate data from across the internet. what's a good example? just, let's say these calorie tracker apps, for example, where like the user can like input the data themselves and you can kind of like do everything within the app, then those would do well. But the moment you kind of need to reference other data sources, you're kind of getting into.\r\n\r\n\r\nNikolas Hulewsky (26:02.386)\r\nMm-hmm.\r\n\r\n\r\nMinh Nguyen (26:10.464)\r\na part of software engineering that is harder because you need to rely on other services. So anything you can build that's like completely wholly encapsulated in your app. Those are good.\r\n\r\n\r\nNikolas Hulewsky (26:15.781)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (26:21.82)\r\nSo, okay, so I have like 130 podcast episodes. And let's just say that of the 130 podcast episodes, it distills my philosophy on many things.\r\n\r\n\r\nMinh Nguyen (26:26.808)\r\nYes.\r\n\r\n\r\nMinh Nguyen (26:34.743)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (26:37.648)\r\nThat would be a good use case for building sort of a closed system app, right? It's not gonna go out and pull a bunch of data, but it's, I don't know. The Nick Deal analyzer for all intents and purposes.\r\n\r\n\r\nMinh Nguyen (26:42.37)\r\nYeah. Yeah. Yep.\r\n\r\n\r\nMinh Nguyen (26:47.938)\r\nyet if you can prove that.\r\n\r\n\r\nMinh Nguyen (26:53.368)\r\nYeah, yeah, like, is the idea to like, kind of advise like, if it's something's a good podcast idea or not? Yeah.\r\n\r\n\r\nNikolas Hulewsky (27:01.746)\r\nYeah, it could be like, oh, I'll give advice on your business. If you're trying to scale or if you're if or hey, I want to buy this business. What do you think of the multiple or hey, I want to start a business. What do you think of this idea? Potentially, it just gives you feedback, right? But I guess that's just a chat bot, right?\r\n\r\n\r\nMinh Nguyen (27:06.018)\r\nYes. Yeah. Mmm.\r\n\r\n\r\nMinh Nguyen (27:15.694)\r\nYeah.\r\n\r\n\r\nMinh Nguyen (27:20.622)\r\nThat would be a trap up, but you would be surprised how helpful that is. feel like in this kind of age where you can build anything, you still need a lot of knowledge to do things well. I'm working with like like a bit of, he's an, he has a YouTube channel and he helps with like advice on like programmatic SEO and like trying to decide which websites to build. But he has a lot of knowledge in his head that would take a long time for you to kind of comb through YouTube videos, a lot of articles to kind of understand. So I'm actually,\r\n\r\n\r\nNikolas Hulewsky (27:42.066)\r\nMm-hmm.\r\n\r\n\r\nMinh Nguyen (27:49.73)\r\nbuilding something like a chatbot, but basically you give it an idea and then it'll just ask all the questions that he would ask and then assess your idea. And, you know, he doesn't have the time to meet with a hundred people, but now this chatbot can. So I still think that's really useful. Kind of can start.\r\n\r\n\r\nNikolas Hulewsky (28:04.399)\r\nRight, right.\r\n\r\n\r\nNikolas Hulewsky (28:08.594)\r\nHow would I, so how would I do it? I want to, I want to like walk through this. Cause my problem is that the context window, even if it's a million tokens is call it 20 podcast conversations. And I've got 130 of them.\r\n\r\n\r\nMinh Nguyen (28:16.76)\r\nYeah.\r\n\r\n\r\nMinh Nguyen (28:21.634)\r\nYeah. That's, yeah, that'd be probably not feasible. So I would say, I would start with, and this is kind of how I'm approaching it, is you probably have a framework to analyzing if a business is going to be a good idea or not. Like probably like, what's the monetization model? How are you going to do distribution? Like all these things. And then also you can like then assess like if that monetization model will actually work out or not. I'd say.\r\n\r\n\r\nNikolas Hulewsky (28:37.884)\r\nMm-hmm.\r\n\r\n\r\nMinh Nguyen (28:48.376)\r\nTake your framework, way that you would, define a framework if you don't have one already, but take your framework and encode that into a chatbot. So I would say like go into.\r\n\r\n\r\nNikolas Hulewsky (28:55.826)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (28:59.728)\r\nOr I could take 10 episodes that I really liked and like clean the data, get rid of the timestamps, get rid of like ums, ahs, get it down to a point where I can fit it into a context window and then just say like, help me codify my deal analysis.\r\n\r\n\r\nMinh Nguyen (29:02.392)\r\nhere.\r\n\r\n\r\nMinh Nguyen (29:06.926)\r\nMm-hmm. Yeah.\r\n\r\n\r\nMinh Nguyen (29:15.854)\r\nYeah. So that's actually what I did for my friend that I'm trying to build like a chat bot for. I took like five of his YouTube videos. I threw it in chat. JVT. I threw the transcript in there's like these free services that like YouTube to transcript. I threw it in and then I was like, okay, tell me all the best practices and tips that I need to follow when trying to choose a new SEO website to build. And then I spit out like pretty much like everything you said, it was like 20 to 30 things.\r\n\r\n\r\nNikolas Hulewsky (29:22.226)\r\nMinh Nguyen (29:44.686)\r\nI then encoded those 20 to 30 things into questions and criteria to analyze. And then that's how I made the chatbot. yeah, so you could apply that same thinking. Give an AI your audio files. Say, what are the most important things to analyze? And how do you analyze it? What are the criteria to make something good or not good and needs to be improved? See where it spits out and then codify that into the app. Yeah.\r\n\r\n\r\nNikolas Hulewsky (30:13.522)\r\nThat really interesting. would be really, really interesting. I love that. Dude, this was amazing. This was my last call of the week and definitely of the 30. This is the top three. This is the top three. Very good, very good. Appreciate you.\r\n\r\n\r\nMinh Nguyen (30:14.798)\r\nYeah. Yeah, that'd awesome. Yeah.\r\n\r\n\r\nYeah, dude. Okay.\r\n\r\n\r\nMinh Nguyen (30:27.202)\r\nDude, I'm glad, I'm glad man. Yeah, I mean, yeah, if you ever have any other questions, like let me know, I'm happy to help. But yeah, man, I think.",
  "metadata": {
    "duration": "",
    "date": "2025-05-06",
    "platform_source": "Google Drive"
  }
}