{
  "episode_number": "16",
  "episode_title": "Can 5k a Month Make You a Viral Sensation with Matthew Brown",
  "guest_name": "Matthew Brown",
  "business_name": "Co-Writing Agency",
  "transcript": "﻿Matthew,  thank you for making time. We had a bit of a snafu getting the right link in, but you persevered through it much appreciated.\r\n\r\n\r\nGod, we made it. I've been following you on Twitter for a while, and I honestly didn't know who you were.  Well, maybe a month or two ago when Chris was like, You know, Matthew Brown is right? Like, no. Yeah, he's a ghostwriter. Really? Like, yeah. Yeah. He's anyway. So he gave me the whole background. I think my first question to you is how the freak did you get into ghostwriting? \r\n\r\n\r\nYeah, it's a good question. I actually started a  mortgage business when I was in college. Same thing. Did you start a mortgage business in college? No, no, no. I said ghostwriting and mortgage business. Same thing. Oh, yeah, yeah, yeah, yeah. Very similar. So I ran it for two years and this is when COVID is when I started it, but  interest rates went up.\r\n\r\n\r\nThe specific business model I had with the mortgage business wasn't great. So I was looking  for a way to pay for it.  And I'd been on Twitter the entire time. I'd seen some accounts grow. I'd gone viral a couple of times myself and I've always liked writing. So I actually started writing for another ghostwriter there.\r\n\r\n\r\nThis is back in 20, early 2022. You started ghostwriting for a ghostwriter? Yeah. Like he needed a freelance writer to help him out. Got it. Okay. Yeah. Yeah. Okay. So I was writing for four or five clients, uh, his for a little while. And then leverage that and my past experience, but land my own clients. So June, 2022 is when I.\r\n\r\n\r\nI took on my first client and then. She kind of ramped it up from there  when you went viral. What did you go viral for? This was back when you could write a thread about anything and you'd go viral.  I think the first one was  like a productivity hack that I liked. I've always kind of been into being efficient.\r\n\r\n\r\nSo yeah, I wrote that. I remember I wrote it. I spent maybe four or five hours writing this thread and then I published it. And after 15, 20, 30 minutes, like nothing had really happened. Then I had one large account and commented on it and just got it spinning. And then over the next 12 hours, do you remember who it was?\r\n\r\n\r\nYeah, I saw Hillblom. Okay. Yeah.  That'll add some fuel to the fire. And then,  yeah. And at the time he had maybe a hundred thousand followers, so he didn't have anywhere close to the million he has now. Yeah. But. Anyway, I went through a football game that night. There were 50,000 people in the stadium.\r\n\r\n\r\nAnd I just remember thinking, wow, 20, 20 times the amount of people in the stadium saw my fleet today. And it broke my brain a little bit and  made me realize, wow, if you could just write online, you can get a lot of eyeballs. Have you ever seen that meme of the guy standing in the corner at a party  and he has like a solo cup in his hand? \r\n\r\n\r\nThat was you. I was like, They don't know I'm a big deal on Twitter.  It's so good.  It's so good.  Have you ever gone viral for something funny? For something funny, like a meme? Yeah, a meme, or a joke, or like a troll. Yeah, some replies I think I've gone semi viral. And then I can think of one account that I've written for someone who just did a crazy engagement, and we had  a couple of kinds of funny things go viral.\r\n\r\n\r\nThat's gotta be a weird feeling, like I wrote that, but I can't really tell anybody that I wrote that. You know what I mean?  Yeah. Yeah. And for the most part, like I'm not inventing. So I actually rebranded from a ghostwriting agency to, I call it a co writing agency. Okay. And the thought behind that is  a lot of people don't feel like it's genuine.\r\n\r\n\r\nIf you hire a ghostwriter to write for you, cause you're publishing in your own personal name, it's a personal brand. Sure, sure. And so I want to lean away from that. Like I want everyone to feel very genuine. And so. I try to scale the person and their idea instead of just inventing random things. And so all of the writing, I say, it's yours, you own all of it.\r\n\r\n\r\nLike it's coming from you, their ideas in your head or your past writing. And  anyway, that's what it looks like. The reason I ask is because I've gone viral a couple of times for jokes. Like I wrote a tweet once, it was totally a troll tweet. And I was like,  at the end of the year, I was like each year, I like to give everybody a bonus, but I like to give my wife a 50, 000 bonus. \r\n\r\n\r\nThat she can spend on whatever she wants and she doesn't have to run it by me. And it was like, just like this stupid post. And I like getting a bunch of engagement and I've had to intentionally not do that because I realized it attracts the type of people that I don't necessarily want following me, but it's, it's tempting because I love trolling.\r\n\r\n\r\nIt's very fun. Anyways, you got into ghostwriting, you've now rebranded it to co writing. Tell me how that business works. So you get paid, what, by the hour, by piece of content, by impressions, like, how do you make money? A monthly recurring fee.  I  essentially will  create content on a weekly basis. Then monthly reports, we like to try to iterate and adjust based on what's working, what's not, but essentially a client will pay me like right now I charged like between five and seven and a half thousand dollars per month to write on X and LinkedIn.\r\n\r\n\r\nFor a client, how does it work? Do they just give you a ton of content and say like, all right, I want to write about these types of topics, do the first draft and I'll give you feedback or what, what does the  creation process look like? So there's two types of clients. One has content and the other doesn't.\r\n\r\n\r\nSo if a client already has content, then we'll meet on a biweekly basis. And the, there'll basically be an interview and I serve as a proxy for the audience and try to figure out what would the audience find interesting. I asked those questions and then I try and transmit that into the content. That's to get press content.\r\n\r\n\r\nAnd then obviously if they have past content, I'll, I could do like a 80 20 twist where I just 80 percent of the content is the same, but we'll have a different angle, we'll change parts of it. So a lot of it's repurposed and then some of it new. And then for the people who don't have content elsewhere.\r\n\r\n\r\nWe'll have a weekly call because all of the content has to come from their brain. You post at least two pieces of content every hour, 24 hours a day, seven days a week. Is that per client or is that like across all of your clients? That's across the clients. When I first started, I had, I took my first client, I was like tripping with every post that would go out.\r\n\r\n\r\nI'm just like, Oh, please get some likes, please get some engagement. And you can imagine having few posts go out every hour, 24 hours a day. Now I'm a little bit, uh, less sensitive to that, but sometimes I still get a little paranoid and, and hope things are going well. What platforms are you writing for Twitter, LinkedIn, anything else?\r\n\r\n\r\nI've done Instagram. I've done email, but I'm mostly leaning into just Twitter and LinkedIn.  What's your content management system? Like, how do you keep track of everything?  So each client has their own notion page. And, um, basically all, uh, so I have a small team as well, but  I've found if I like. If I say, I'm going to have everyone's content due on Friday, then, and I've got 10 clients, I'll procrastinate until the last minute and it just makes my life miserable, and so, what I do is I just have deadlines for each client, so I'll have 2 clients on Monday, 2 clients on Tuesday, 2 clients on Wednesday, like, however I need to separate it.\r\n\r\n\r\nAnd then I'll send it to the clients. I'll give them two or three days to review it. Then we'll schedule it from there.  So you run a business, which is called an agency business. Typically agencies are built around somebody who has a specific or unique skillset,  but agency businesses have a ceiling with. \r\n\r\n\r\nUsually the owner founder, maybe they have one or one assistant or something like that. It sounds like you have a team that works for you.  How did you think about scaling yourself when essentially your intellectual prowess, whatever you want to call it, is the product that people are reaching out to you and paying you for?\r\n\r\n\r\nYeah. So right now I have one full time writer. I have one full time administrative assistant and I'll soon be hiring another full time writer and then an account manager. So  that's short term plans for the team. Yeah. So I think of ghostwriting as you're getting paid a dividend on your skill. And so whether it's my skill or whether it's my writer's field of the matter, as long as it's like, we have a very clear process that we follow for all of the content we produce and quality check.\r\n\r\n\r\nQuality checks as well. And so as long as I can, you're selling people's time. And so  as long as I can hire great people, we're in a, we're in a good spot. How do you do that? Are you, are these VAs or these stateside, do you have an office somewhere? You guys work together? Are they all remote? What does your team look like?\r\n\r\n\r\nSo admin assistant is Phillip, Phillip East base helps with scheduling, just whatever I need help with. Cool. For writers, I just get the biggest pool possible. So I went through, I posted on several different platforms, got 80 plus candidate and had them fill out  basically a tight form, including like posts that they've done.\r\n\r\n\r\nSo I filtered them down for about 20. And then I did group interviews where you could, you could have six people on at a time. And ask them questions live to get a fill. And then I did a paid trial. So it was like a pretty extensive, you did a group interview group interviews. Yeah. I don't want to do 20 interviews.\r\n\r\n\r\nSo I just did three group interviews. How the freak do you do a group interview with people that you need to assess their specific skills? That sounds like a nightmare. The question is, do you want to interview all 20 of them? Or do you want to have three interviews with six at a time? So. What I did was had six questions that I would ask them and I would just go randomly.\r\n\r\n\r\nI would just choose them randomly. They would answer the six questions, takes 45 minutes. Gives me like, it gives you a lot of answer. It tells you a lot about them. And then after that, the real skill base thing was a paid trial. So that was like the actual writing skill. And then I just choose whoever's best.\r\n\r\n\r\nI don't care where they're based. It's just,  it's a meritocracy or however you say that.  How do you assess job performance? Is it the number of likes? Is it the number of work products are produced? Is it the quality of the content? And if it's quality of the content, how do you do quality assurance? Like what, what does that, how do you judge the success of an employee?\r\n\r\n\r\nSo some of it's subjective, obviously quality of content, but so this is how I set up the payment structure basically to ensure quality for the rider is I said, I'm going to give you a bonus. Once. I don't have to, once we have two weeks, great, where I don't have to make any edits to the content. So it's my own subjective sense first.\r\n\r\n\r\nAnd then also I said, anybody who you continue writing for longer than six months, like I'll give you a recurring bonus on each of those clients.  So that's how they're incentivized. But now we have. An editing process, I have them go through. It's not super extensive, but it does the job. And then we get weekly stats.\r\n\r\n\r\nThat's something the admin assistant helps with on all of the clients. And I'm focused on lead gen for B2B service companies. So followers matter, impressions matter, but we're trying to drive lead. Okay. So what stat do you look at to assess whether or not you're driving leads? So  leads, like, I have calls on the call with the clients dms.\r\n\r\n\r\nYeah.  Something they got,  yeah, yeah, exactly. On a weekly or biweekly basis. I, I get the, the inside scoop on how everything's going as far as leads. Uh, some of them have, they just go direct to Calendly. Some will ask for dms, others will ask for emails before anything. So it's all measured a little bit differently.\r\n\r\n\r\nSo your ideal customer. Or client, they're not necessarily reaching out to you to grow. They're reaching out to you to maintain their social media, maybe as they're growing, but also to ensure that leads are being generated.  Is that fair? Or do they reach out to you for both? Do people reach out to you to say, Hey, I want to grow. \r\n\r\n\r\nThey do. And I've maybe taken five to 10 of those clients. And what happened is after I prefer focusing on lead, I'm better at it. And those clients have a better lifetime value.  Interesting. See, like another way to think of it as your marketing company  that happens to be using somebody else's persona or likeness as the distribution channel, but you're a marketing company.\r\n\r\n\r\n100 percent marketing agency, I sell a return on investment for me. That's an interesting way to, to shift the thinking in co writing and how they utilize each other. Just to give you an idea of what that could look like. I call, so I have a client who's in Facebook  ad agency owner, and he will, he has a really high lifetime value, 50, 60, a hundred thousand dollars per client.\r\n\r\n\r\nAnd so,  If he's able to land one client per month and he's paying me 5, 000 per month, you could do the math on that quite easily. Yeah,  it gets very lucrative. And so a lot of these clients that I'm working with have pretty high lifetime value. How do you get clients? What does that process look like? I would say a third of them have come through my own content that they've DM'd me on Twitter or LinkedIn and asked for help. \r\n\r\n\r\nA third have come through referrals, so existing clients or, and, or partnerships, people who, and up until recently, none of those have been formalized, they're just friends that refer me business. And then lastly, about a third has come through outreach where I'm just like prospecting, I'm DMing people, helping out where I can, I try to take a value first approach  and, and just see if it leads to anything.\r\n\r\n\r\nSo you don't have a sales team. That's like cold calling. You're not sending cold emails. You're not doing pay per click or SEO or any of that stuff. You're just  combing content, seeing people and potentially reaching out word of mouth, or they're responding to your content. Typically, what's the best platform for you, LinkedIn, Instagram, or Twitter?\r\n\r\n\r\nIt depends a little on the client, if they already have somewhat of a following on one of the platforms that like that will do better. But as a, like right now in May of 2024, it's easier to grow on LinkedIn, but surprisingly, most of my clients are still getting the majority of their leads from Twitter, even if they have as big of a LinkedIn account.\r\n\r\n\r\nYou started this three years ago, two years ago? Two years ago.  And you're still doing it and you're actually growing it. It sounds like you're going to hire another writer.  What does it look like as a business owner? Are you pulling in high six figures, mid six figures, low six figures, five figures, like what, what can it look like for somebody who scales up a co writing agency like you have? \r\n\r\n\r\nYeah. So it's definitely like most agencies, it's up and down customer concentration is really high, just the nature of the business that can be really fun. You can double your business really quickly, or you can get it cut in half pretty quickly. So I, I pay myself like a, just a flat salary every month.\r\n\r\n\r\nSo 10, 000 a month salary at the, at this moment. And then, and then I can choose whether I want to like reinvest, keep extra money in the business or take it out. So some months I've taken  many, like several tens of thousands of dollars and other month, I just take my salary and leave everything in the business.\r\n\r\n\r\nHow quickly did you get up to that 10, 000 number? So I think I started in yeah, June.  I was still, it was still a part time thing. I really started trying in September of 2022. And in October I was at 15 November. I was at 17 and at the time I had zero expenses. So I was just keeping all of it. You're saying 15, 000 a month in recurring revenue.\r\n\r\n\r\nSeptember, October of, of 2022. Yeah, it took honestly like  two or two or three months of trying to get to around there. Man. That's really fascinating. Do you have a exit strategy or plan? Is your plan to just continue to grow the agency or do you want to sell this agency at some point? Yeah. So I've spoken with some ghostwriters who have built bigger ghostwriting agencies than I have.\r\n\r\n\r\nAnd I've heard that the sweet spot is at the  one to 1. 5 million per year mark. And if you try to scale it beyond there, you don't really see it hit the bottom line. So, A lot of people recommend, or I've heard a few people recommend just keeping a boutique right there as profitable as possible. So my goal for term is to get there longer term.\r\n\r\n\r\nI don't know if I can, what it looks like to scale it to a 5 million or 10 million per year agency, but I would love to be working on something that compounds over time, so  I I'm not exactly sure in the meantime. Yeah. I want to build more to sensibility in the business and 1. 5 million per year mark.  All right.\r\n\r\n\r\nI got some rapid fire questions for you. Are you ready? Hit me.  What do you love about this business? I love that I get to talk with some of the most interesting founders and business owners in the world, and I get paid to do it. And I can basically just explore my curiosity as much as I want on the interviews.\r\n\r\n\r\nAsk any questions that you weren't so comfortable asking if you were just chatting.  That's a fascinating answer. I hadn't thought of that. That's one of the reasons why I like doing this podcast is because I can meet just cool people and have a conversation. Follow my curiosity. What do you hate about the business?\r\n\r\n\r\nI do not like that. The Twitter algorithm, the LinkedIn algorithm, they're constantly changing. Like I lean into that anyway. Like if it's changing for everyone, so might as well learn and be the expert on it, but it is pretty stressful. Also reputation is built over a lifetime and lost in a moment. And so  I, I get nervous whenever we tag people in our clients posts.\r\n\r\n\r\nAnd if we are using jargon, then I always want to double check that we're using it correctly. Cause that's the easiest way for it to look like you don't know what you're talking about. So just some little things like that don't want to make any of those types of mistakes.  If you had to start over on one platform and your goal was to Was to build an audience.\r\n\r\n\r\nYou could monetize which platform would you choose?  I would just go with X cause it's like, I, I think both of them worked fine X and LinkedIn, but I would go with X. Uh, cause I know it a little bit better. And I think that most people think you need a lot of followers to monetize, but I have friends who have 5, 000 followers or less who make over a million dollars a year from Twitter.\r\n\r\n\r\nWhat? Yeah. Pray tell. Yeah, I have like, I have one client who's, who has a seven figure run rate from Twitter who is sitting at like a 6, 000 follower mark. And then I have several friends who have a couple thousand followers who make either six figures or seven figures from Twitter. Okay. Give me like broad strokes.\r\n\r\n\r\nWhat does the profile look like? What kind of product or services are they selling? Like, how can, how do you turn 5, 000 followers into a million dollars a year?  I'd still get it. B to B. And very educational, so they're not focused on trying to go viral. It's very like helping a specific avatar solve problems, like case studies. \r\n\r\n\r\nThat's what it looks like. Are you saying their product is educational or are you saying their content educational and then that builds credibility with their customers? Content is educational and their product, if you leave a high ticket recurring service.  All right. Now this is going, this is turning, right?\r\n\r\n\r\nI have 11, 000 followers. What would be the best way for me to monetize Twitter?  Yeah. You know how to buy businesses and real estate. I don't know if you know how to do real estate. Do you do real estate as well with Chris? Yes. So that's like.  By far the highest leverage skill that you probably have, I think deal flow, which you're already like experimenting with because you do one bill and that could be a seven figure outcome for you.\r\n\r\n\r\nSo deal flow or raise money for deal flow. What do you mean? Yeah. Either one, like either deal flow, you're trying to invest in SMBs or if you're like,  You have some deals available, mobile home parks or otherwise, and you're, you go and raise some capital from your Twitter following, let's say hypothetically, there's somebody who has 11.\r\n\r\n\r\n3 thousand followers and they want to get to 50, 000 followers, not for the ego, but because they believe, and this is a hypothetical, this isn't a real person, hypothetically, they believe that the power of an audience and distribution is incredible,  what would be the best, fastest way to get there?  Yeah, I would say write what I like to call blockbuster content, which is if a regular post takes you 30 minutes, spend three hours or spend five hours, like writing just an excellent post, make sure that you're including media, either images or videos.\r\n\r\n\r\nAnd I would just do one, try to write one great post per day, like what Chris has been doing for the last,  like six months. Like he's done that, right. Gone there from 30 to a hundred really quickly. That's what's working right now. So that's what I would recommend. If you're, if you care about just expanding your reach as fast as possible. \r\n\r\n\r\nWould you be impressed with somebody who say had no followers in July of last year now has 11. 3 thousand followers? Would you I mean is that would you say that's impressive, please? Is that you? Yeah. Yeah. Yeah, that's awesome I mean, this is a reference. I'd have like seventy seven hundred followers I'm not chasing this hard if you are but yeah, bro But you're writing like if all of your time spent writing was just on your own content,  like it wouldn't even be close Yeah Okay, here are my last few questions.\r\n\r\n\r\nAre you currently using AI in your business? Yeah,  what keeps you up at night? I would say making the changing algorithm. Yeah, yeah, that I have a couple of clients who,  uh,  sometimes I'll take a new client who like a friend or something. And I'm just like really stressed out, like really want them to succeed.\r\n\r\n\r\nSo that's something that keeps me up at night and then more on AI. Like I'm not using it for, for a lot of the content we're producing, but I've found it to be useful for very light, very small, specific use cases. And I have a two hour blot in my calendar every week where I am dedicated to just trying to implement AI into my business.\r\n\r\n\r\nSo  that's awesome, man. That's awesome. It should be all right. So I ask this question every time  real estate guys are jealous of the SMB guys. Cause they're like, Oh man, you have a business that kicks off cash flows must be nice. And then the business guys are jealous of the real estate guys because they're like, you have an asset that actually backs up your business.\r\n\r\n\r\nIt must be nice to have just some like steady Eddie income.  Grass is always greener for you. What industry or business are you the most jealous of right now? Yeah, that's a good question. I think owning real estate does sound nice because I'm not sure how much equity value I can build in my current business, but, and this might be a later question that you step on me, but  I love the techno optimism, like idea.\r\n\r\n\r\nI don't know if you've seen like Mark Andreessen talk about that, the techno optimist manifesto, but I just love the idea of technology, like a, an optimistic approach, an optimistic view of technology and where the world is going. And I would love to have a, I would love to have a daily newsletter, a daily newsletter business on that subject.\r\n\r\n\r\nThat's like my dream business right now. A daily newsletter business on techno optimism. Yeah. There's one called weekly dose of optimism. It's a weekly newsletter by Paki McCormick, who is a big newsletter writer.  I would love something like that, but on a daily basis. Like meant for a broader audience morning brew style business.\r\n\r\n\r\nBut with that subject, what's stopping you from doing that? I would love to do that. I'd really hope that's in my, in my future, but right now I'm just trying to get the business to that one to 1. 5 million revenue mark. Once I'm there, I'll consider other options.  I applaud your level of focus. That's awesome.\r\n\r\n\r\nIt's easy to get distracted. And yes, you did preempt my question. What are you most obsessed with right now? It sounds like you're obsessed with  techno optimism, which is interesting, especially in a space like yours, ghostwriting. I think AI is going to be the most disruptive into the, in those types of creative fields.\r\n\r\n\r\nPersonally, I think it's actually going to be a huge tool, which will allow you to go from where you are to probably three times as big because it's just going to make you more efficient, take out a lot of the ideation process, but it's still going to be human to make sure that the content is good. So anyways, it's interesting to hear that you're a techno optimist, given that you were even in an industry that is probably going to be the most disrupted by AI. \r\n\r\n\r\nYeah. Yeah, for sure. I'm super into it right now. I've been reading books on physics and learning about things that awesome. Well, Matthew, this has been awesome. I think your humility and candor are very rare and appreciated. I think it's very admirable what you've done with this business and your ability to not only generate business, but fulfill it.\r\n\r\n\r\nYou're not out there marketing like crazy. You're getting a lot of inbound stuff. So I just think that's really cool. You should be proud of where you are in the process. And I hope 5 million mark. I think you will. Thanks, Nick. I appreciate it. It's fun following you on Twitter, reading your jokes and watching you grow. \r\n\r\n\r\nI'm glad somebody thinks that they're jokes. Sometimes people think I'm serious. So, all right. I'm going to check back in with you in a couple months. I want to see where you are on that 1. 5 run rate. Sounds good.  All right, man. We'll talk later. Okay.",
  "metadata": {
    "duration": "",
    "date": "2024-06-07",
    "platform_source": "Google Drive"
  }
}