{
  "episode_number": "243",
  "episode_title": "Agent Builder is Here! What Does it Do? with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:01.531)\r\nUnless you've been living under a rock like me, you've heard about open AI's newest creation, which is, which are, uh, agent builder. So I think what will be really important first is to set the context of what problem is open AI solving in creating agent builder. And then we want to walk through a demo of actually using agent builder, showing you where to go within agent builder.\r\n\r\n\r\nto build out your first agent. Liz has done that and Liz is an amazing teacher. So we're gonna go through step by step. And by the end of this conversation, you will have a very clear idea of what agent builder is, how you can utilize it in your business and how you can go and actually build your first agent. But before we get there, Liz, I'm gonna say my first question. Can you, can we briefly just give an overview? What is an agent and why is everybody talking about agents?\r\n\r\n\r\nElizabeth Knopf (00:54.04)\r\nSo an agent really consists of a few different core components. And usually when people talk about agents, oftentimes they get it confused with something called a workflow or an automation, which is basically that is saying step one in a process, then you go to step two, step three, step four, passing different tools. What an agent does, it allows autonomy for combining AI.\r\n\r\n\r\nto access something called tools, which are like software essentially, other software tools, have some kind of memory so it remembers what it's doing, and then be able to actually make decisions on what it's doing. So there's more inconsistency when it comes to agents. And sometimes I actually think they're overrated, but at the same time, there's a potential when you give it sort of enough context.\r\n\r\n\r\nor enough rules, and you really are able to iterate through giving it the proper instructions, and you have an understanding of what to expect, you can really see a lot of magic happen with agents.\r\n\r\n\r\nNikolas Hulewsky (01:55.855)\r\nYeah. I'll give, I'll give just one quick example. So here is what an agent, an agentic workflow might look like versus an automation. And automation would be, I am a plumbing company and I get a call after hours at requesting a quote. The call comes in, my phone screens it. And there's a clear rule that says, if it's during business hours, send it here. If it's after business hours, send it here. And then it sends it maybe to a voicemail, maybe to something else. And then that triggers.\r\n\r\n\r\nHey, if there's a new voicemail, go and check it and put it into this spreadsheet, right? It's very if-then. There's no context, there's no analysis, it's very static if-then. An agentic workflow might be if an after hours call comes in or a text comes in, send it to our AI agent and they will actually talk to the person on the other end and make decisions based on context. hi, can I help you? Yes, I'm looking for a quote. Okay.\r\n\r\n\r\nLet's talk about that quote. What are you looking for? So the agent on the other end is utilizing AI to actually process and reason through the question that's on the other end. It's not a static if then it's actually taking context in. And the problem is, that agents, what I just described there, it's hard to build. Like how does a business owner who knows nothing about technology, how do they go and build an agent? They don't, they have a hard enough time building a workflow. And supposedly with this OpenAI agent builder, it's making it easier.\r\n\r\n\r\nI mean, is that basically the idea is open eyes making it easier for us to build agents? Okay. All right. Can we, can we see the interface? Can you share your screen and just show it? Like walk us through. Where do we go? Do we just go to chat GPT and it's, it's a dropdown option or like how do exactly do we. Okay.\r\n\r\n\r\nElizabeth Knopf (03:25.228)\r\nYes, and I'll say that supposedly. We'll see by the end of this if it actually is.\r\n\r\n\r\nElizabeth Knopf (03:41.646)\r\nOkay, so It is in a special plot place. So if you've never sort of heard about\r\n\r\n\r\nElizabeth Knopf (03:55.766)\r\nOkay, if you've never heard about an API, which is basically hooking into the behind the scenes and having these systems sort of pass data back and forth, OpenAI has an API, which is where we are right now. It's called platform.openai.com slash playground.\r\n\r\n\r\nSo that's the URL that you're going to want to go to. I can't remember since I've had this for a while. I don't know if there's some setup involved, but basically you'll be able to add different projects and workspaces. And then you'll have on the left-hand side here, a bunch of different things you can build. in the past, if you've heard about assistance, which are basically like little chat bot tools that have specific files associated with them or even code and functions, this is where you could have built those. And those are slightly different than custom\r\n\r\n\r\nAgain, these would be hooking into other workflows or other tools and systems and software.\r\n\r\n\r\nNikolas Hulewsky (04:53.745)\r\nOkay, do I need any level of membership for that? Like is this just, is this access for free? Do I have to have it like the pro?\r\n\r\n\r\nElizabeth Knopf (05:01.204)\r\nSo this is all usage based. So that's like the good news of it.\r\n\r\n\r\nHaving gone through the pain of this make sure whenever you're using this stuff You know what model you're using because they cost different amounts of money and I have accidentally Ran through like a couple thousand rows of a spreadsheet to like do quick things using the latest model running up a ridiculous bill So just make sure you when you go through any of this, you know what model you're using So like for instance yesterday or actually in the last couple days, I've been using GPT-5 I've run\r\n\r\n\r\nup. Actually, this is, I would say, for 88 requests, $1.60, which actually, in my mind, is a bit expensive. So I could probably change the model I'm using to be more efficient with the cost.\r\n\r\n\r\nNikolas Hulewsky (05:52.018)\r\nCan you, and can you help people understand why OpenAI would go to a usage model here versus their like monthly subscription model on just ChatTPT?\r\n\r\n\r\nElizabeth Knopf (06:01.944)\r\nYep, okay, so for them and for most AI companies, there's a better correlation with usage. Back in the day with software, was great because you built code. didn't really...\r\n\r\n\r\nsort of suck more energy or cost associated with a company based on you build it, you use the code. Yeah, you have some infrastructure and hosting and other sort of costs associated with it. But for every sort of new login, it really didn't cost that much more to use it. With AI, it's totally different. Their cost basis is really expensive because they're consuming a ton of energy to basically use these massive amounts of data from their\r\n\r\n\r\nvector databases to make all these connections and give you the output you want. And so because it's really expensive, it makes a lot more sense from a company standpoint to associate it with the usage versus saying like for this flat fee, use that much because then people would be basically hitting the limits and they'd be losing a ton of money. So.\r\n\r\n\r\nNikolas Hulewsky (07:03.215)\r\nYeah, the only the only thing I would add to that is saying like if you go to chat GPT and you ask a question. It goes to the model and so think of like your question traveling through the air going through the model as an API call right? The API is lubricating the transportation network for your question. When you're building an agent, you're not just asking open AI question. You want that agent to go do something you want to look at your CRM or you want it to look at some website or you want it to look at your financial statements or.\r\n\r\n\r\nLike there's multiple places that it has to go. And so every place that it has to go required is lubricating those transportation systems, that API. And so because of that, you're, executing a lot of calls. Um, like just the nature of an agent is utilizing these API calls. So they are now charging us on a per call basis, as opposed to a monthly subscription, because if it was just, like you said, if it just a monthly subscription, you could blow past the average number of API calls. If you are, Hey, I've got 10,000.\r\n\r\n\r\nnews articles, I'd like you to analyze each one of them and tell me, you know, these things that's going to be a lot of back and forth that OpenAI is actually calling and then computing. So just as you're thinking about it, listener, think of the usage is just kind of the fee to pay for the toll road effectively of these APIs.\r\n\r\n\r\nElizabeth Knopf (08:24.046)\r\nExactly. And I like that the toll, the toll and the fee. One other just sort of nuance there that you were, you were highlighting, but I want to make explicit, it's also you're automating things. And so obviously when you're automating it, it can run a lot more like that, those 10,000 articles versus if you're sitting at the computer doing your chats, like you do with the normal chat GPT interface, your limitation is the time spent in the computer.\r\n\r\n\r\nNikolas Hulewsky (08:25.905)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (08:46.577)\r\nThat's a great point. Yeah.\r\n\r\n\r\nI've been working on a news aggregator, and every 30 minutes it goes and checks the RSS feed of where it's pulling from to see if there's any new updates, right? So yeah, you're every 30 minutes having an API call, that can add up really quickly. anyways, okay, so we're on platform.openai.com slash playground.\r\n\r\n\r\nElizabeth Knopf (09:05.73)\r\nYeah, for sure.\r\n\r\n\r\nElizabeth Knopf (09:09.87)\r\nYep, so then on the left-hand side you'll see the second under the chat you'll see Which by the way, if people don't know this is a place you can have a bunch of your create chat prompts in here Anyways, okay. So you have this little thing called agent builder Now if you're just getting started I would go to templates just to start\r\n\r\n\r\nNikolas Hulewsky (09:30.929)\r\nMmm.\r\n\r\n\r\nElizabeth Knopf (09:35.052)\r\nSo you sort of get your bearings. So why don't we open up a template and then go ahead.\r\n\r\n\r\nNikolas Hulewsky (09:38.555)\r\nWill you hold on? Hold on before you open up the template, will you just stay on that? it's cut. Well, I was going to just look at this. there are some kind of already prebuilt templates in here, data enrichment, planning helper, customer service, structured QA document. There are the things that I'm reading. I don't know what's on your screen at the moment, but these are all just like recommended. You could click into any one of these and start just playing around. I'm assuming these are all templates.\r\n\r\n\r\nElizabeth Knopf (09:42.626)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (09:57.71)\r\nYep, it's the same.\r\n\r\n\r\nElizabeth Knopf (10:04.534)\r\nYep, so I just clicked into one. this, yeah, this is a template. So this helps. This is your internal knowledge base. So it basically gives you the logic and you just have to hook it up. So the hooking up part is still a little bit challenging, but at least you have a sense of like.\r\n\r\n\r\nNikolas Hulewsky (10:15.971)\r\nElizabeth Knopf (10:20.222)\r\nOkay, rather than a blank slate, what do I do? What are all these things on the left? Like what do I do? You can start from somewhere. And these are very common cases. So data enrichment, obviously, we all have leads if you're in business. Customer service, very clear use case, knowledge, document. I mean, these are all pretty standard things.\r\n\r\n\r\nNikolas Hulewsky (10:27.812)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (10:37.361)\r\nMm-hmm.\r\n\r\n\r\nYou know what's really interesting to me is what this tells me is that these five, six things are probably the best use cases for AI right now. Data enrichment, planning help, customer service, structured data QA, document comparison, internal knowledge assistant, right? Like they wouldn't have those on there unless those were the most likely things for people to go and try and use. That's interesting. You can like reverse engineer that.\r\n\r\n\r\nElizabeth Knopf (10:44.141)\r\nHmm.\r\n\r\n\r\nElizabeth Knopf (10:52.492)\r\nYeah, absolutely.\r\n\r\n\r\nElizabeth Knopf (11:06.302)\r\nthousand percent.\r\n\r\n\r\nNikolas Hulewsky (11:08.803)\r\nand think about, how could I be using this in my organization? That's cool.\r\n\r\n\r\nElizabeth Knopf (11:11.99)\r\nExactly. So you can also now here's a business opportunity for anyone wants to say, Hey, which use case should I build to go help companies pick one of these and get started and, you know, finish the last mile.\r\n\r\n\r\nNikolas Hulewsky (11:23.921)\r\nOkay, so what are we building today?\r\n\r\n\r\nElizabeth Knopf (11:25.76)\r\nOkay, so I'm gonna show something that's outside of this scope because I think even though you have to hook up things still, we'll go through that full process so you can see from beginning to end. So what I went ahead and built.\r\n\r\n\r\nSo first up here you have workflows, drafts. So I have a ton of drafts. Workflows are when you actually publish it, which basically then makes it accessible for one of the other cool features that they have in here, which is embedding these workflows into apps and a UI. So we won't get into that into the minutiae today, but one of the big things that make Agent Builder\r\n\r\n\r\ninteresting is that they have an ecosystem where you actually can take it rather than it just for looking like this backend. And then you're like, okay, great. Where's the interface. Now you can actually hook it into an interface really easily within the open AI ecosystem, rather than having to go to a lovable or going to another third party.\r\n\r\n\r\nNikolas Hulewsky (12:26.001)\r\nAh, yes, the elusive wrapper. We have heard much about this elusive wrapper. Is it also kind of like, do you remember with GPTs where you could create and then publish GPTs for other people to use? Can you create this and publish it? Interesting.\r\n\r\n\r\nElizabeth Knopf (12:29.872)\r\nExactly. Exactly.\r\n\r\n\r\nElizabeth Knopf (12:38.094)\r\nYes, so they have this other other area So with the publishing I have to actually figure out like where that goes. I just know yeah, it's successful but There they have this other thing called a widget builder, which is widgets chatkit studio and they have it's it's basically these are all their pre-built little widgets that you can now connect to that\r\n\r\n\r\nNikolas Hulewsky (12:48.229)\r\nThat's fine. Yeah.\r\n\r\n\r\nNikolas Hulewsky (13:04.048)\r\nHmm.\r\n\r\n\r\nElizabeth Knopf (13:06.286)\r\nthat back end we just saw that you explode you can then connect and say hey when you click this it triggers you know something we had in there and you can basically create your own widget as well.\r\n\r\n\r\nNikolas Hulewsky (13:08.665)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (13:13.297)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (13:19.363)\r\nIt's kind of like Zapier where they have pre-built automations or workflows. This is so interesting. It's like this amalgamation of lovable replet, no cold code solutions, but also the automation tools like Zapier and N8n and Make. Lindy, interesting. Okay, wow.\r\n\r\n\r\nElizabeth Knopf (13:24.949)\r\nMm-hmm.\r\n\r\n\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (13:33.89)\r\nYup. Yup.\r\n\r\n\r\nElizabeth Knopf (13:43.362)\r\nYep, and I'm pretty sure they're gonna make all these accessible across the board so that people can basically utilize them. So, but I haven't dug into that, so I don't wanna...\r\n\r\n\r\nNikolas Hulewsky (13:52.251)\r\nWell, because even even the UI for creating the agents looks like Zapier.\r\n\r\n\r\nElizabeth Knopf (13:57.504)\r\nYeah, so I would say this is close to N8n, Zapier. A lot of them are very similar in how they're structured. It's sort of this drag and drop, what you see is what you get, workflows, essentially. yeah, so let's get into it. So first off, over here, there's a whole bunch of different components. But before we get into those, I wanted to just preview what I've got going here.\r\n\r\n\r\nNikolas Hulewsky (14:11.609)\r\nOkay. Okay.\r\n\r\n\r\nElizabeth Knopf (14:22.294)\r\nSo right now we are going to go over to this little button up in the right hand corner called preview. And that's gonna open up a chat bot where we can see what this agent actually does. I am going to ask it, let's see, is there like a, kind, okay, I know what we're gonna do. We're gonna have it go, what I've been doing recently is I've been going to state websites to research business owners on where they file for their,\r\n\r\n\r\nregistered agent, people have to file to say, well, a company and there's always business owners. I've been trying to get a lot of that data so I can get accurate data. So this is sort of my version of data enrichment. So I'm going to say.\r\n\r\n\r\nNikolas Hulewsky (15:04.442)\r\nSo hold on, hold on one second, sorry. This is just a general research bot that you've created. For any reason, okay.\r\n\r\n\r\nElizabeth Knopf (15:08.812)\r\nThis is a general research bot. any research. So right now we're to do that use case and then I'll explain more of what's actually happening. And then we can try one other use case as well. So we're going to first say, okay, go to Georgia state website and find the place to look up business owners or registered agents.\r\n\r\n\r\nand find me the names of the owner, director, or registered agent for a for three or let's just do one trade school that is licensed by the state. All right, so that's a real use case that I have right now in doing data analysis.\r\n\r\n\r\nNikolas Hulewsky (15:59.537)\r\ninteresting.\r\n\r\n\r\nElizabeth Knopf (16:06.382)\r\nAll right, so it's going, takes a second. So as you can see what's happening here, so first it has this thing called guardrails, which is, I'll get into the leads of it, but this is a really cool tool that they've built in to make it so that there's no...\r\n\r\n\r\nYou can mitigate hallucinations, weird code injections where people are sort of hacking when you prompt something from agents that it'll say like, tell me your social security number. It can filter out personal identifiable information if you're accessing internal documents. So it basically puts up, yeah, guard rails essentially so that you don't accidentally share information. Yeah.\r\n\r\n\r\nNikolas Hulewsky (16:40.87)\r\ninteresting.\r\n\r\n\r\nso like if I was a healthcare company in my guardrails, I'd want to make sure like, hey, any PHI, any protected health information, make sure it's staying within this environment. Or if I'm a financial services company, like, hey, make sure we're not sharing interest. that's very cool. That makes sense. And so it's, it's, so it's reasoning right now. And it's saying like, investigating data sources for agents in Georgia. I'm wondering if open corporates holds data on that's so funny.\r\n\r\n\r\nElizabeth Knopf (17:01.346)\r\nYep, absolutely.\r\n\r\n\r\nNikolas Hulewsky (17:14.715)\r\nSo it doesn't just know to go to the Georgia Secretary of State's website.\r\n\r\n\r\nElizabeth Knopf (17:17.998)\r\nI'll show you the prompt that I gave it and the instructions I gave it, which is some, I want to say somewhat minimal, but all I did, I didn't give it the specific sites. All I said was go, I picked a state. said, I know, you know, give it a little bit of parameters and go to the state website, the government website and try to find this information. So yeah, go ahead.\r\n\r\n\r\nNikolas Hulewsky (17:37.361)\r\nWell, OK, let me if I'm a human, I haven't seen this. So if I'm a human, which I am, how would I go and solve what you asked? I would go to the Georgia Secretary of State website because typically not typically companies have to file with the state. And so you can look up on any secretary of state in any state businesses. And typically it'll have there the registered agent when it was incorporated, the corporation type. So is it an LLC? Is it a C Corp, et cetera?\r\n\r\n\r\nElizabeth Knopf (17:48.878)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (18:05.865)\r\nSome will have officers, some will have articles of incorporation, which will have more documents on there, et cetera. But the thing that you asked it, which was interesting is you said, look for trades, one trade school in Georgia. So what you can't do on the secretary of state websites is search for specific business types. Now, if it's, if it has that in the business's name, you could search for it, right? So you could search trade school just to see if any business pops up, but then I'd have to go through and reason, okay, how do I go and find,\r\n\r\n\r\nthe list of trade schools, I'd probably go to Google or something and just get a list of a bunch of trade schools, pick one, and then I'd go back to the Georgia Secretary of State website and find that information that you asked for. That's kind how I would reason through it. So I'm curious to see how the agent reasons through it.\r\n\r\n\r\nElizabeth Knopf (18:47.81)\r\nYep. So that is correct. here, so this is a live demo. So of course, we had something that is going to be an issue with agents. when I first did this earlier, perfectly worked. This is decided to go, it did go to a bunch of the different sites, but then it wanted to know, to give me OpenCorporates. Now OpenCorporates is I know a paid tool where you have to get an API.\r\n\r\n\r\nGoing to these ones, however, would work. So it did not actually give me what I wanted. no, it did. Okay, one licensed trade school. Okay, so it gave me a bunch of extra stuff too. So I need to clean up my prompt a bit, but it did give me info. So Jordan Trade School, which is, that's actually the name of a trade school. As you can see, here's the address and all that, the business entity.\r\n\r\n\r\nNikolas Hulewsky (19:36.111)\r\nThere it is.\r\n\r\n\r\nNikolas Hulewsky (19:40.369)\r\nWow. Address.\r\n\r\n\r\nElizabeth Knopf (19:45.485)\r\nuh, registered agents and all that. So, okay. So it did work. just gave me a bunch of\r\n\r\n\r\nNikolas Hulewsky (19:48.817)\r\ndude, look at that. Hold on, look right above that. Where to look up the Georgia State website. Licensed trade school's directory. Apparently there's a directory of institutions that are licensed. See, I would have gone to like Google. It did it a different way. It was like, well, they got to be licensed by the state. I'm like, that's cool.\r\n\r\n\r\nElizabeth Knopf (20:06.37)\r\nYep. yep. So anyhow, so this worked. but let's maybe try a different use case real quick and, let's think, maybe there's something behind, why don't we do like bit, we could do stock prices. could do, let me think what other, let's. Okay. Yeah. Or we could do like sentiment on Twitter. Do you want to do sentiment on Twitter? Because you don't actually have a good public API. So we could see if it finds that.\r\n\r\n\r\nNikolas Hulewsky (20:26.213)\r\nyou can anything.\r\n\r\n\r\nElizabeth Knopf (20:35.32)\r\nfor something like on, okay, let's say, okay, what is the current sentiment of agent kit right now on Twitter on X, which X not Twitter. All right, so.\r\n\r\n\r\nNikolas Hulewsky (20:36.397)\r\nYeah. that's interesting. Yeah.\r\n\r\n\r\nNikolas Hulewsky (20:52.475)\r\ndare you.\r\n\r\n\r\nElizabeth Knopf (20:53.462)\r\nThere is no publicly available XAPI. You have to go and pay for it. And it's a lot of money. So we're going to see if it figure out as an alternative way to find out what people are saying on acts regarding agent kit.\r\n\r\n\r\nNikolas Hulewsky (21:07.151)\r\nThat's really interesting. One of the things I've been working on, mean, you know, the news site that I've been working on for skilled nursing is like a sentiment index. So there are many indexes that kind of measure sentiment in specific industries, and I want to create one for the skilled nursing space, but it's like, okay, how do I do that? I could go to LinkedIn and see all the posts, but LinkedIn doesn't have like the API access to LinkedIn is really difficult. okay, well, how do I work my way around that? Is there something else?\r\n\r\n\r\nElizabeth Knopf (21:16.621)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:35.973)\r\nThis could kind of help me work through potentially where to find the sentiment. Holy balls. That's awesome.\r\n\r\n\r\nElizabeth Knopf (21:40.084)\r\nExactly. Yeah. Yeah. Or hacks. I have another hack for you on that one. Probably. I cloud code would be a better problem solver there, but\r\n\r\n\r\nNikolas Hulewsky (21:48.507)\r\nThat's what I'm using. Yeah, I'm using cloud code, but.\r\n\r\n\r\nOkay, so it's creating the API documentation. You know what I didn't know? I'm sure people listening are like, duh, moron. Like, if you just know the API, now you can just build your own tool. Whereas in the past, if I knew the API, unless I was a coder, I couldn't build my own tool. And that is just like mind blowing to me. Like, don't need to go through somebody else to get.\r\n\r\n\r\nall the information from Google News, I can just pull it myself in my own format. I'm like, hello. It's incredible.\r\n\r\n\r\nElizabeth Knopf (22:22.766)\r\nExactly exactly and that's like a huge opportunity right now is like just building wrappers around API's go to appify go to any API and Put a better UI on it\r\n\r\n\r\nNikolas Hulewsky (22:33.936)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:38.065)\r\nI was talking to somebody yesterday on my podcast who sold an ad tech company for like 30, 40, $50 million. And it started in 2008. And what his ad tech company was, is it trained people on how to be digital marketers effectively. Because in 2008, if you remember, nobody knew how to be digital marketers. like, do I, do I get a Facebook page or like, do I optimize my Google profile, blah, blah. And basically his assertion was like the way it felt in 2008 about digital marketing is the way it feels today with AI.\r\n\r\n\r\nElizabeth Knopf (22:42.861)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (22:55.362)\r\nrate.\r\n\r\n\r\nNikolas Hulewsky (23:07.151)\r\nLike business owners know it's important, but they don't know what to do. And back in 2008, if you were just somebody young who had used Facebook before, cool, I'll use you and you'll figure it out. And he's saying today is like, if you just know how to use AI, they'll contract with you. And the same opportunity to start these agency businesses is today with AI automation, where it was digital marketing in 2008.\r\n\r\n\r\nElizabeth Knopf (23:16.482)\r\nRight.\r\n\r\n\r\nElizabeth Knopf (23:24.706)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (23:29.516)\r\nI mean, I've already seen now, you know, a ton of people just building agency businesses that have had huge exits. And now they're like, I have an agency now.\r\n\r\n\r\nI have an AI automation agency now and it's like, like it's, and it's not that crowded because if you go and talk to small medium sized business owners, everybody's just busy doing their stuff. again, I have a lot more time for the average person to be spending on this. And, if you have a job, if you're doing other things, like it's hard to allocate the time to like get in the weeds and figure out what's what. So.\r\n\r\n\r\nNikolas Hulewsky (23:39.909)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (23:59.793)\r\nkeep telling Liz that she needs to spin up an AI automation agency and she keeps telling me no. So if you're listening to this, please reach out to her and tell her to do it. Cause she actually knows what she's talking about. Every time we get on here, she's like, Oh, you're to think this is stupid. Cause it's kind of like old. And then she'll show it to me. I'm like, what? How long has this been here? So funny. Anyway, sorry. What's the output?\r\n\r\n\r\nElizabeth Knopf (24:06.03)\r\nyou\r\n\r\n\r\nElizabeth Knopf (24:19.488)\r\nOkay, let's see. Okay, back to it. All right. So basically what we have here is it did look up something called RSS hub. So it actually went through this concept of an RSS feed, which is collecting from a third party, the XAI data, and it used that API to then get a sentiment. So it collected text snippets under 500 words, posted it, gave it scores, aggregated it.\r\n\r\n\r\nNikolas Hulewsky (24:47.526)\r\nWow.\r\n\r\n\r\nElizabeth Knopf (24:48.887)\r\nAnd let's see.\r\n\r\n\r\nNikolas Hulewsky (24:51.791)\r\nWow, and it's showing the weighting of the scores. Like, yep, this is how I'm going to score it.\r\n\r\n\r\nfreak.\r\n\r\n\r\nElizabeth Knopf (24:59.072)\r\nOkay, so let's see where is the answer though. So I need to clean up my...\r\n\r\n\r\nNikolas Hulewsky (25:01.315)\r\nYou're okay. For those of you can't see she's like scrolling through a bunch of output. And can you can you just tell it? Don't give me the labor pains. Just give me the baby. Like what? Can you just give me the answer here?\r\n\r\n\r\nElizabeth Knopf (25:11.84)\r\nYeah, so I needed I need to clean up the Prompting a bit and I can't if I reprompt it right now. It'll go back start from the beginning Yeah, that's the important thing\r\n\r\n\r\nNikolas Hulewsky (25:17.51)\r\nMm-hmm.\r\n\r\n\r\nBut you could you could copy this output and just go to like Claude or chat GPT and say, hey, what's the current sentiment based on this? Do you understand?\r\n\r\n\r\nElizabeth Knopf (25:27.618)\r\ndo this. Absolutely could do that. Absolutely could do that. anyways, okay, so you can sort of see though that like also with agents, the outcomes are not as consistent as if you were doing like very specific step by step methods. So let me just get a little bit under the hood unless you had any of their questions on the on sort of output here, we could give another example if you want it. Okay.\r\n\r\n\r\nNikolas Hulewsky (25:51.223)\r\nNo. I mean, I want to know what the number is, but no, don't have any questions. Don't worry about it.\r\n\r\n\r\nElizabeth Knopf (25:55.02)\r\nYeah, I'm sort of bummed about that too, but maybe we can try later for you sometime. so, oops.\r\n\r\n\r\nOkay, so let me quickly just run through what all the stuff on the side is and then what I built here. So an agent again are these little nodes here that are like this purplish blue that basically will go out and do the action. You have the end node notes so that you can know, remember what you're building. File search, which is you don't totally need these separately. This is more automation type stuff, but file search essentially will go and get\r\n\r\n\r\nfiles from the vector storage or any sort of documents you upload. Guardrails, we sort of explained earlier, which is over here on the left. You can see you put in your input. Yep.\r\n\r\n\r\nNikolas Hulewsky (26:50.417)\r\nCan you just show me, can you just click on start? let's just like, yeah, I go start. Like what am I doing?\r\n\r\n\r\nElizabeth Knopf (26:54.444)\r\nYeah, you want to go one by one rather than over here? Okay. Okay. So start, always gives you a start button.\r\n\r\n\r\nNikolas Hulewsky (27:03.483)\r\nSo you knew you wanted a research bot. So you already knew that that's what you wanted to do. And so you went come here and you go to start. What's the first thing you do after clicking start?\r\n\r\n\r\nElizabeth Knopf (27:05.954)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (27:12.502)\r\nOkay, so when you click start, it's gonna basically give you this little box here. This is where you configure things. And actually, yeah. So then you're gonna add, you don't need to add any variables or anything, but if you wanted to, because hypothetically you could.\r\n\r\n\r\nloop through this whole thing and where you might need to say like plus one for every loop or there might be things you need to add in here such as like text or numbers or if yes or no bullion or objects or lists where it sort of starts with that information. That's just like the beginning point.\r\n\r\n\r\nNikolas Hulewsky (27:48.699)\r\nNow, you're treating me like I'm a fifth grader. Just like go to kindergarten. I'm like Michael Scott in that episode where he just keeps telling, asking you to say, so in this first start, what did you put in here? So is that this input is tech? You put nothing. Okay.\r\n\r\n\r\nElizabeth Knopf (27:52.034)\r\nOkay. Okay.\r\n\r\n\r\nElizabeth Knopf (28:02.434)\r\nI did not put anything in here. I did not put anything in here. It automatically has input text, is essentially my, oops, my prompt that I had just put in when I said, go research all of this. That is what input as text is. That's what's basically the variable from the user being put in here.\r\n\r\n\r\nNikolas Hulewsky (28:21.201)\r\nOkay. So to set this up though, like what's step one? You create start. Okay.\r\n\r\n\r\nElizabeth Knopf (28:27.154)\r\nOkay, so when you create, it gives you start and it gives you a node. So as you can see here, there's nothing in here. You don't really need to put anything. This is just saying what are the variables? What are the things that are going to go through here? Yeah. I didn't actually, I did this later and this is more for demo purposes than actual like real functionality.\r\n\r\n\r\nNikolas Hulewsky (28:35.845)\r\nGot it?\r\n\r\n\r\nNikolas Hulewsky (28:44.209)\r\nAnd so your first step was putting the guardrails in.\r\n\r\n\r\nElizabeth Knopf (28:55.438)\r\nbut this hypothetically will have more interesting things down the road. Cause in other tools, I consider this as like the trigger, like what starts the workflow, like what initiates it. Sometimes it can be in other tools, frequency every day. some other, like it gets information from a different app or tool right now. The only way to start things in their system is through that chat interface or.\r\n\r\n\r\nNikolas Hulewsky (29:23.375)\r\nwhich is that input is text. Okay, got it.\r\n\r\n\r\nElizabeth Knopf (29:25.31)\r\nExactly. So when you go back to the flip switch, which we can't do for some reason right now, but when you input as text, you do the prompt, that's what started it. Okay.\r\n\r\n\r\nNikolas Hulewsky (29:32.337)\r\nOkay. Okay. Okay.\r\n\r\n\r\nElizabeth Knopf (29:35.566)\r\nThen the guardrails, which again, this is just for the sake of demo. didn't really, like, I didn't really need this necessarily in this workflow, but this was just like, so you can show, okay, so someone doesn't try to jailbreak it. I didn't want any prompt injections or things, whoops, hallucinations, continue on error. This is helpful so that it just doesn't stop if you continue in middle. This is the personal identifiable info. So basically we sort of went over this stuff.\r\n\r\n\r\nNikolas Hulewsky (30:04.283)\r\nSo why are there two strings after guardrails?\r\n\r\n\r\nElizabeth Knopf (30:07.118)\r\nOkay, because this is if it passes these guardrails, so meaning there wasn't the PII, someone's not doing prompt injection, then continue forth. If someone is trying to do prompt injection, it's hallucinating really badly, there's PII, it goes to fail, and then you could have it go and do something else. So think of like, you have a situation, you have to escalate it, you know, it goes through a different path and a different process.\r\n\r\n\r\nNikolas Hulewsky (30:11.985)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (30:30.555)\r\nSure. And so did you tell that agent in that process what to do?\r\n\r\n\r\nElizabeth Knopf (30:36.142)\r\nI just said if it's like because I only really did it based on the jailbreaking I said what it explained the likelihood of the jailbreak and why it failed the guardrail So I haven't actually even tested it again. This was just for the sake of building something here. Yeah\r\n\r\n\r\nNikolas Hulewsky (30:47.633)\r\nThat's fine. That's fine. No, no, no, it's good. Okay, so the next step is the API research.\r\n\r\n\r\nElizabeth Knopf (30:53.464)\r\nSo this is just simple web research. So let me sort of break down what's here, because this is now we're talking agents, which again is that first core node up here.\r\n\r\n\r\nAnd I'm gonna give you a couple tips that so that you don't run into challenges that I know you'll have Let me go over here from starting from scratch. You're just gonna see this It's just gonna be sort of blank number one model So as I'm already running up like I haven't done I did 88 tasks I ran up already a $2 bill now that might not seem that much but like in the scheme of automation that is gonna get expensive so you probably want to select a different model and again, you can go and just if you don't know where the pricing is just Google or\r\n\r\n\r\nask chat GPT, give me the pricing on the API models. And then you can select which one you want. Usually the nanos are the cheapest. Next, what you want to understand so you can name your agent, rename it up there. Then you have the instructions. This is something to just keep in mind. This is super, super important. Instructions are not just this box. You must add a user box here.\r\n\r\n\r\nThe difference between these two, this is basically, it sort of even tells you, describe the model behavior, tone, tool, usage, response style. So this is sort of giving it the rules of how it's going to be, um, be used. So this is like in, in an output style that you want context of what its job is. You're a personal assistant that is doing writing for me, make sure to only use these websites, make sure your style is always very professional.\r\n\r\n\r\nand zingy or zany, whatever you want to do. And then the user message is again based on what the user is going to put in and any sort of additional context that the user probably will mess up because they're not going to have perfect prompts that you want to include in there.\r\n\r\n\r\nNikolas Hulewsky (32:49.679)\r\nSo, sorry, so the instructions are telling the agent how to act. The user is making sure that whoever's asking the question puts the right information in.\r\n\r\n\r\nElizabeth Knopf (32:54.956)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (33:01.582)\r\nSort of yeah, like basically you can say like even my examples. Let me just show\r\n\r\n\r\nSo like I told it what its job is. gave it, said, your job is to search the web for an open and free to use API to get the user basically the data it wants. Then for the user, said, you will then create short, concise documentation on how the API works and how to call it correctly. Use this input. Hypothetically, I could probably put some of this up in the instructions, but I think my point in the most important pieces\r\n\r\n\r\nis that make sure you just have this box like you add you don't just\r\n\r\n\r\nYou don't just have this because either leave it blank or don't add this little plus sign because your automation will completely fail. And they're really bad at giving you sort of the errors as to saying like, here was the problem in your workflow. Like I had to figure out that I had set this up correctly.\r\n\r\n\r\nNikolas Hulewsky (33:45.625)\r\njust leave it blank.\r\n\r\n\r\nNikolas Hulewsky (33:58.555)\r\nWell, so, so the user, I would have thought that was me, but it sounds like it's still instructions to the agent.\r\n\r\n\r\nElizabeth Knopf (34:06.574)\r\nIt's additional context behind the scenes for like assuming the prompt is something, like there's maybe some additional information you wanna give it. But again, like you could hypothetically put it up here. It's just like, yeah, yeah. You don't have to over overthink it too much right now. The other piece you wanna make sure is that you actually pass\r\n\r\n\r\nNikolas Hulewsky (34:21.233)\r\nOK. OK.\r\n\r\n\r\nNikolas Hulewsky (34:28.005)\r\nLiz, it's like my whole life.\r\n\r\n\r\nElizabeth Knopf (34:35.018)\r\nthe prompt from the user in here, which is this little like bluish in the curly brackets. And that's where you would add the context here. So you have little two boxes here. You have input as text, which is what the prompt was from the user. It will always say that. If you had added other variables in that start node, they'll show up here as well. And then the output from the guard rails is what's called safe text.\r\n\r\n\r\nNikolas Hulewsky (34:49.689)\r\nyeah.\r\n\r\n\r\nElizabeth Knopf (35:03.264)\r\nAnd that must go in here, otherwise it will not pass the information on.\r\n\r\n\r\nNikolas Hulewsky (35:09.137)\r\nWell, because it can't, it doesn't have it.\r\n\r\n\r\nElizabeth Knopf (35:11.31)\r\nCorrect, correct. So that's your way, that's a variable. And that's the variable that it's passing. Let's see, what else? Okay, a couple of other things to note on this, to include chat history. So this will show to the user. So if you want it to basically display to the user, you can have that show up there. actually, sorry, no, that was down here.\r\n\r\n\r\nNikolas Hulewsky (35:12.729)\r\nYeah, okay.\r\n\r\n\r\nElizabeth Knopf (35:36.066)\r\nThis is include chat history. This is helpful so that it has basically memory so it can recall things for the future if you need it, especially if you're like looping things or there's additional context. If it's sort of like one way through, you might not need this. Or again, if you're going to have, you know, some back and forth, not in that demo area, but you're having it in like a real live chat bot situation, can use this. And that's pretty cool because in other tools you actually have to configure what's called memory.\r\n\r\n\r\nThen reasoning left.\r\n\r\n\r\nNikolas Hulewsky (36:07.707)\r\nFocus.\r\n\r\n\r\nNo, no, no, keep going,\r\n\r\n\r\nElizabeth Knopf (36:12.482)\r\nReasoning effort, pretty straightforward, like how hard you want it to work. Output format. So there's reasons why you might want different outputs for it to pass information along for this demo, or making it easy and just doing text as you would. I won't get into the details of this. This helps to structure information and sort of break it apart.\r\n\r\n\r\nNikolas Hulewsky (36:19.045)\r\nMm.\r\n\r\n\r\nElizabeth Knopf (36:34.508)\r\nto then pass it along. And then for widgets, that's if you're using one of their other tools as well that has like one of the icons that we showed you earlier. Verbosity and summary, like this is pretty straightforward. I don't need to explain that. And then the other ones are, again, pretty straightforward as well. Okay.\r\n\r\n\r\nNikolas Hulewsky (36:55.569)\r\nOkay. And so the, does it do from here? It takes the research and then spits it to.\r\n\r\n\r\nElizabeth Knopf (37:00.672)\r\nSo then it has, yep, so this has researched an API, a free API that it can use that we don't have to go and log in and pay and set up. Then it creates that documentation and it outputs it for this guy to use. So then I say, this one's job is to use the below documented API to return an answer from the user's question. So I have to both use the initial input, which,\r\n\r\n\r\nif you see it, that you can see now here, the input string, this was from the initial, and then the output. Another thing to notice here, that initial data that was passed through from the guardrails is now missing from the reference here. If you, for some reason, wanted to include both the output here from the guardrails as well as this, you would have to save that information as what's down here.\r\n\r\n\r\nset state. So this is basically saying let's store that information in a variable that can be used later.\r\n\r\n\r\nNikolas Hulewsky (38:02.161)\r\nSo basically, the way that this flow works is here's the question, here's the guardrails. First, go and gather the information. That's the first agent that's going out using an API to take the information. And then the next agent takes the information and synthesizes it as an answer to the original question.\r\n\r\n\r\nElizabeth Knopf (38:21.388)\r\nYep. Exactly. Exactly. And actually does the like does action because it's an agent. It's going out and doing something. So it went to the API. It then from this one said, here, I'm going to learn this information and I'm going to do something. And the reason it's able to go and do something is they gave it access to what's the most important part of an agent, which is tools. So in an agent without tools, it's just the LLM.\r\n\r\n\r\nNikolas Hulewsky (38:46.33)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (38:51.342)\r\nThat's all it is. When you give it tools, it now can go and do things. So I won't go into the minutia of how the specifics are to set this up, just because I know I've been on this for a while. But essentially, these are sort the most important pieces of it, where you can access an MCP server, which is essentially...\r\n\r\n\r\na built-in tool here like accessing Google Drive, Google Calendar, Gmail, so on and so forth. Zapier, which is a bit of a hack that I have because this then gives you access to the rest of the MCPs and it's much easier to set up MCP tools in here. And all MCPs are just a simple way to configure access to other tools like your Zoom.\r\n\r\n\r\nNikolas Hulewsky (39:37.051)\r\nOK, so let me ask you this. Why would I ever use this over just going into like N8n or Lindy or Zapier?\r\n\r\n\r\nElizabeth Knopf (39:46.4)\r\nOkay, so i've used all of them. i'll give you my honest opinion and rating on this. Agent builder has potential it's not there yet So I would say if you've never built an agent still go check this out play around a little bit\r\n\r\n\r\nI have had a lot of frustration. was going in wanting to be excited about it, but I've used N8n and I think that's the most scalable, cost-effective, but it is a bit technical and a bit intimidating. Lindy is the easiest way to get started, I would say, but it can get expensive as well as I'd have the same criticisms of make.com. I would say it's a little bit harder than Lindy because Lindy has really done a good job of like building out a ton of templates that you would use in your business and just making it like plug and play and it just works.\r\n\r\n\r\nmake you deals you have to configure.\r\n\r\n\r\nNikolas Hulewsky (40:34.993)\r\nWell, and did we just pick a, mean, was this not an example that would necessarily highlight all the features? Because if I'm looking at this, it's like, if I was building in, like you're saying, Lindy or NIN or Zapier, okay, I would have a step where it goes and crawls. And then I would have a step where it does the analysis just through an API with OpenAI. Like, I just don't see what this is doing that those other tools can't do right now. Is it the MCP? Okay.\r\n\r\n\r\nElizabeth Knopf (40:45.902)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (41:01.859)\r\nThat is absolutely correct. No, no, no, no. MCP.\r\n\r\n\r\nAnd I would say out of all of them, Cloud Code is the best, but I do like using still N8n and Cloud Code. So we can talk about that at a different episode, but I don't think this is there yet. I don't think it's there that makes it so revolutionary. The potential and differentiation is on the UI component and being able to embed things in the UI that we didn't even get into, which is with widgets and the chat kit. And I think there's some potential there. But again, there's in this tool, if you've never built an agent,\r\n\r\n\r\nNikolas Hulewsky (41:25.435)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (41:36.832)\r\nIt's pretty, it's simple, it helps you just go from zero to one, do very simple things. But I will be totally frank here, because I'm not going to over-hype this. There's a lot of friction in actually getting the tools to work. And that's where the magic happens in agents. having been someone that's, again, spent a lot of hours on stuff, it was not easy for me to get the tools to be working as they should with the MCPs.\r\n\r\n\r\nNikolas Hulewsky (41:50.673)\r\nMm-mm.\r\n\r\n\r\nNikolas Hulewsky (42:01.915)\r\nSo could I use this and say like, hey, go look at my chat history on chat GPT or go look at this GPT that I created. Like, is there really good native integration with chat GPT or is it, is it, is it, no, is the answer no.\r\n\r\n\r\nElizabeth Knopf (42:20.834)\r\nnot with your no, no. if you've built out, if you have built up. Correct. If you've built out stuff inside of their API system, like, their assistance, then yes, if you built out.\r\n\r\n\r\nNikolas Hulewsky (42:24.976)\r\nOkay.\r\n\r\n\r\nNot any better than any of those other tools. Okay.\r\n\r\n\r\nElizabeth Knopf (42:41.346)\r\nthings on their API system, then yes. I have, and I could be wrong because again, it came out earlier this week and I'm still just doing the basics here. But from what I can tell or from what's obvious, those level of integration isn't there yet.\r\n\r\n\r\nthere's still a lot of friction in adding the tools, which I would say, like even just to get started and a better access is using Zapier as a way to then get access to more tools because they're native integrations that they're trying to do. There's just friction and just things aren't working. And then again, once maybe I start building out some of the widgets and the chat kit that they have that...\r\n\r\n\r\nthis little widget builder that could totally change and it might have a different tune. And that's where I think like that vision is there. I think the execution is not quite there yet.\r\n\r\n\r\nNikolas Hulewsky (43:38.061)\r\nYeah, it seems to me like the bottom line is their user base probably like doesn't use Zappi or Lindy or these other builders. And so it's kind of just introducing the idea that, Hey, you don't have to go off platform to build these agents. Why don't you start messing around in here? It's kind of my takeaway.\r\n\r\n\r\nElizabeth Knopf (43:57.646)\r\nAnd I you know, will say like the two features that I think are really great that they have done Not to totally, you know bash everything they built here Number one is their access to the file and vector storage where it's really easy to upload files and have that included in the workflow That's not actually easy and all the other Builders you do have to go and like get the file and then add it in Through like a call versus having it just like there's a file take it\r\n\r\n\r\nThen the second piece is the guardrails, I think is really helpful. Now how good they are, haven't done the tensing, but I would say those are two differentiators besides this UI element. But again, they're the type of people that they'll launch, break it, iterate. That's what they did with Codex.\r\n\r\n\r\nNikolas Hulewsky (44:33.115)\r\nThat's true.\r\n\r\n\r\nNikolas Hulewsky (44:40.262)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (44:44.558)\r\nThey've iterated a little bit on operator versus I would say like Claude is a lot more in anthropic or a lot more polished when they launch things. And then Gemini, they like build out all this awesome stuff and nobody knows about it. So.\r\n\r\n\r\nNikolas Hulewsky (44:56.123)\r\nWell, no, I think the UI is probably the best differentiator. It's way less intimidating than any of those other automation builders, in my opinion. It's just very simple, the way that it looks. All right, well, there you have it. Go explore, play around with this. We'd love to hear what you build or if you have any questions. I'm with you. This will be the worst iteration of this, so it's only going to get better from here. And you probably at least should be exposed to it and understand how it works.\r\n\r\n\r\nElizabeth Knopf (44:59.638)\r\nYeah,\r\n\r\n\r\nYeah. Yeah.\r\n\r\n\r\nElizabeth Knopf (45:25.314)\r\nExactly.\r\n\r\n\r\nNikolas Hulewsky (45:26.331)\r\nCool. All right. We'll talk later.",
  "metadata": {
    "duration": "",
    "date": "2025-10-13",
    "platform_source": "Google Drive"
  }
}