{
  "episode_number": "18",
  "episode_title": "Hitting $1.65M Revenue in the Digital Services Market with Joe Benson",
  "guest_name": "Joe Benson",
  "business_name": "Eversight",
  "transcript": "﻿If you're anything like me, you fantasize frequently about starting your own digital agency. I mean, what's not to love high margins, low startup costs, unlimited ability to scale today's episode. If you've ever fantasized about starting your own digital agency. And we walk through everything with Joe Benson, the co-founder of Eversight.\r\n\r\n\r\nI think you're really going to like this show. If you do, please leave a comment, subscribe, like share with a friend. But with that, let's just hop into the show. All right, Joe, thanks for joining us. I'm super excited to talk to you today. Quick and dirty one sentence.  What does your business do?  Yeah. So we build.\r\n\r\n\r\nConversion centric websites, but we have a little bit of a twist on it. We have a website as a service where you're not paying a big, hefty upfront fee to get a custom build built out. And then we of course do all the digital marketing services to help them drive traffic to your new fancy website. So traditionally this business.\r\n\r\n\r\nIs building websites for companies.  That's correct. Okay. But you've got a twist on it where  you said you did a website as a service. So you're not necessarily charging per website build out. You have a monthly recurring revenue model that you're charging customers. Yeah, so for the longest of times, we've been in business for over 20 years, but for the longest of times, like most agencies out there, we were per project quoting people.\r\n\r\n\r\nOh, it's going to be 10, 000 for this or 15, 000 for this or 8, 000 for this. We build them a site on a platform of their choice. And then they were left to go off into the sunset and DIY or pay per edit, that kind of thing. And about three years ago, we ran into a few clients that would build this fancy new website with us, and they're out of cash.\r\n\r\n\r\nRight? Yeah. And they didn't have, they didn't have money to drive people to their website. So it was really just a cash drain. And what should be something that's, you know, You know  bringing in a lot of new revenue for them So at the same time we were in the middle of of rebuilding I shouldn't say rebuilding finishing a new platform that we were building in house that just  made our process of building our websites Incredibly efficient without sacrificing flexibility or customization and that sort of thing.\r\n\r\n\r\nAnd so we decided to spin it into a Website as a service. It's 3. 99 a month Typically there are different size levels, but most 90 percent of our clients fall in that range. And that includes the custom build upfront and then unlimited edits and access to our team to make sure that you're happy and your website is up to date and in good shape indefinitely.\r\n\r\n\r\nUm, go ahead. I I'm an idiot. I don't know this space exceptionally well, from my understanding of this stuff,  you're almost describing SEO. As well as building a website and maybe they go hand in hand, but can you talk to me about  what's the difference between just building a website for somebody  and then what you're talking about, which is driving traffic.\r\n\r\n\r\nTo that website. Cause those sound like two different things to me, but you're, you are explaining it to me as if you're marrying your service together. Not exactly. So they are definitely two different things. Traditionally, you're going to pay for an SEO agency to build content for you to find external links coming in.\r\n\r\n\r\nTo make sure your meta tags and title tags and everything are built in certain ways that are going to make you rank higher in the search engines. That is something we offer, but that's a different level of service we offer with the website as a service. One way to think of it would be we're taking what was a transaction.\r\n\r\n\r\nPreviously where we build this, we give it to you. And most agencies just run away after that. And we're turning it into a relationship where we're talking to you on a monthly basis. Hey, smart, what promos are you running? What can we do to improve this? Or, Hey, we recommend you should change this to this because that'll improve people going down funnel a.\r\n\r\n\r\nYeah. Yeah. You have two types of businesses, right? Like you have the old school businesses that.  They built a website in 1999 and they haven't updated it since because things don't really change in their industry, right? Maybe they're building hydraulics for trains or something like that. But then you have young companies that are growing and scaling like the companies that I've had in the past.\r\n\r\n\r\nAnd we've got to update the website. Hey, we added a new person. We added a new service line. We added a new geography, and then we have to go to our. Whoever designer who created the website and, Hey, can you add this page? Oh, when you want to FAQ, can you add this? Those end up becoming one time project based charges.\r\n\r\n\r\nBut what you're saying is like the subscription model means I could go to you and say, Hey, I need this updated. And I've already paid for it because of the subscription. Exactly right. And not only that, the whole goal is to avoid the stale website that's been there for 10 years and hasn't been touched, right?\r\n\r\n\r\nIf you want to revamp in three years, that's included. We're going to recommend it in some cases, if some sort of new device comes out and you need to be responsive to fit whatever comes along, where are your extended, uh, website team, if you will. Uh, so we are regularly communicating with clients and making changes.\r\n\r\n\r\nAnd it's a lot of fun, actually had a lot of success. All right. I have a bunch of questions on the business side, but before I get into that, sure. How did you get into this? Are you a programmer? Are you a developer? Why did this appeal to you?  So I  basically took on programming as a hobby and graphic design as a kid.\r\n\r\n\r\nWhen I was 12, my dad maybe sit behind a guy. That was building a website to sell his business. And I watched him and he taught me how to change font colors. And I, way back in the day that you couldn't do much more than that, but I learned the very basics of HTML and you could do it right there on your computer.\r\n\r\n\r\nAnd I was hooked. And so for the longest, the time it was a hobby, I made my first book in high school with a teacher that had a dance studio that needed a website. And then my oldest brother is my business partner. He was graduating college. It was like. Let's go do this thing. So we started it as a side gig.\r\n\r\n\r\nAnd then after five years of myself being in college between computer science and graphic design, he got his master's and said, let's go full time on this thing. So we did. How old are you?  How old am I now? Once you guess how old I am. Well, I have it written in front of me, so I could, I could guess, but I'm trying to, I'm trying to lobby a little softball here.\r\n\r\n\r\nI'm 39, man. What year did you graduate high school? 2003.  Me too, man. Oh three. Shut up. Really? We'll be three. We'll be free in 2003 was our slogan. That's awesome. I had no idea, man. So you, that's interesting. So you came up,  we had an interesting upbringing. We like grew up half analog, half digital. You know what I mean?\r\n\r\n\r\nLike, yes. I know exactly what you mean. Where if, if we want, if we wanted to watch TV or our show, like, all right, TGIF guys, you remember TGIF, freaking Sabrina, the teenage Wi Witch, Boy Meets World. Remember those man? Absolutely. All of it. Like you had to get in front of the tv. I tried to explain this to my kids now because I'm, they're like  watching YouTube and they're like, what is this?\r\n\r\n\r\nLike, it's an ad . It's like, oh, it's so long. It's 15 seconds. I'm like, you have, oh my gosh. You have no idea. You have no idea. So right.  So you grew up like me, like being introduced to the internet. And at 12, you started  thinking about, Oh, Hey, I could actually do this. I could design the stuff. I find it interesting.\r\n\r\n\r\nWent to college, studied it, launched this business with your brother. And you've always done this. Like ever since then, the last 17 years, you've been doing this. Pretty much. Uh, in college, I did work at another agency while running our agency on the side, just to pick up a few extra bucks. I worked at a photography studio for a short stint.\r\n\r\n\r\nAnd high school, but beyond that, professionally, this is it.  Did you always know you wanted to be an entrepreneur?  I didn't always know that I wanted to be an entrepreneur, but my dad is, and he taught us to think that way. A lot of five brothers and a sister, and many of us are entrepreneurs or have been at some time.\r\n\r\n\r\nAnd so, yeah, I don't know. I just stumbled into it, but I, looking back, I don't think there would have been any other way.  Well, it's rad. I remember us talking and you have it. Written down in some of our, the questions that I asked you, but  the way you grew up was really interesting, right? You're one of five kids. \r\n\r\n\r\nI'm one of seven. One of seven kids. I'm one of nine. I have, I have five kids.  That's right. We, that's right. You have five boys. That's right. And I had five boys. That's now it's all coming back to me because we spoke, I don't know, several months ago, but you spent some time in New Zealand. You spent some time all over the place.\r\n\r\n\r\nHow do you think that impacted or affected  your outlook on business, on life, on what you do?  Oh man. So five years in New Zealand.  I'm very biased, but it was, it's a beautiful place. You got to say New Zealand.  New Zealand. Okay. New Zealand. There it is.  It's, it was probably  maybe the most impactful five years of my life through high school. \r\n\r\n\r\nGenuinely, it's just seeing a different culture, seeing a different way of life, meeting new people, so many things just went into learning how to build a new life at eight years old, again, meet new friends, put yourself out there. So many different things that really. Taught me so many things, man. The importance of family, when you move to a new country, nobody, your family, they are your family is life.\r\n\r\n\r\nYeah. Family is life. That's it. So in terms of business, yeah, I don't know that it taught me too much directly, maybe more indirectly and sort of this, it's okay to live on the edge a little bit and be uncomfortable and learn how to work through that. And because I was already used to some of that stuff, It wasn't too intimidating to take that on professionally.\r\n\r\n\r\nWe're going to get back to the show in one minute, but I just wanted to tell you about today's sponsor, which is, uh, me. Oh, it's me. I'm sponsoring the show. Yeah. Cause I'm doing this for free. Do me a favor, like, and subscribe right there, right at the bottom movie. Yep. It's right there. Yep. Awesome. So tell me about this business.\r\n\r\n\r\nIt's obviously evolved over the last 10 years. 17 plus whatever, however long you've been doing it when you launched it. Did you and your brother bootstrap the whole thing? Did you get a loan from your parents? How did you fund  completely bootstrapped? Yep. No loans. Dang, man. Okay.  Yeah, we just, again, we strung along in college and built up a little bit of a client base that way.\r\n\r\n\r\nAnd enough at that point, then when you're back down without inflation and kids.  A couple of grand a month was enough to get me back.  It's funny. I have this conversation, Shannon Jean on Twitter. I knew that I had a conversation with him and he was like, I just remember thinking if I can make 500 bucks a month,  I'm good.\r\n\r\n\r\nAnd Shannon's a little older than us. So 500 bucks a month back in the twenties, I think what was a good living wage, but love you, Shannon. But it's so interesting how, like you, you were talking about Nolan earlier.  It's so interesting how just time changes your perspective on things. Like I, I remember the first time my wife and I talked about money and I asked, how much money do you think we're going to need to make?\r\n\r\n\r\nShe said, Oh, at least a hundred thousand dollars a year. I'm one of nine kids. My parents didn't ever made more than 30, 000 a year combined.  And I just remember sitting there thinking. I am never going to make that much money. What am I going to do? Am I going to have to sell a kidney or anyways, but then you get down the road and you're like, you said, Oh man, I'm nowhere near done.\r\n\r\n\r\nI got to figure out what the next level is or what the next step is. So always an interesting perspective. What you and your brother worked together, which I think is really interesting. How big is your company at this point in terms of people? We've got,  I think it's 19 as the count now. Really?  Joe, that's the big company, man.\r\n\r\n\r\nCongratulations. Yeah. That's awesome. I appreciate, I appreciate that. Especially in the services space that you're doing, that's hard to manage that many people.  It's fun. It's been a, look, it's, we've been at it 20 years. I say, honestly, we've really been at it hard for the last three since Eversight kind of launched.\r\n\r\n\r\nWe've had some, some things that have changed that have really enabled us to move along quickly, but yeah, we're at 19 now and I don't see a stop in any time soon. I think we'll hire probably a few more this year. Give me a high level kind of top line, bottom line. If you don't want to say exactly what your revenues are, just give me like broad strokes, what margin expectations are for an industry like this. \r\n\r\n\r\nYeah, no. So I expect this year that we will clear  probably 1. 65 million. And when you say clear,  I don't mean, I don't mean cash  top line. Yeah, yeah, yeah, yeah, yeah.  Yes. And I expect this year, our margins will be a little lower than I expect them to be in the future. Honestly, I think that we'll probably be in the  maybe  20 high twenties, 30% Range kind of thing.\r\n\r\n\r\nSo do you have a lot of team members that are offshore? Because 19 people is a lot of people. 1. 82 million dollars in top line and you're still netting 20%. Those are healthy margins. We have four people that are offshore. Oh, okay. And then we have, we have two that are, are three that are part timers. The rest are across six different states. \r\n\r\n\r\nSo how do you go about acquiring customers? Like how are you finding people that are looking for your services?  That's a really good question because  interestingly, as good as we are at finding customers for every other industry under the sun, digital marketing is very competitive as you'd imagine.\r\n\r\n\r\nHowever, we're doing a good job at that. And it's hard. Sorry.  Sorry.  We did a differentiation earlier. So is the website development, you consider that digital marketing?  Yes. I would consider it for marketing. Yeah. We consider ourselves in that space. Yeah. So the reason is, and a lot of people just think, Oh, we need a website,  right?\r\n\r\n\r\nPeople don't understand how important a website is to your marketing funnel. You can send all of the best traffic in the world through SEO, PPC, and other things to your website. And if your website doesn't have the right messaging or the right funnels, you're wasting your money. Right?  Same thing with digital marketing.\r\n\r\n\r\nIf you have an incredible website and nobody's seeing it,  It's a useless operation. So they really are hand in hand. They are one in the same thing. And they are,  if I'm looking at metrics and I want to know about my marketing, what I would consider digital marketing, the pay per click SEO  metric that I'm going to be looking at is leads generated  the website.\r\n\r\n\r\nI don't know exactly what I, how I would term it, how I would judge my websites performance would be on conversions.  Right. Is that probably like a good way to think about it? It's like, all right, the S the SEO pay per click they drive the leads to my website, but my website itself is, should be built and engineered to convert the highest number of leads into customers.\r\n\r\n\r\nExactly. Right.  And a lot of people forget the second part. They don't realize how important  conversion rate is. It can be amazing. You can go from, I'll give you a perfect example. We have a client that, and I happen to be Privy to some of the revenue numbers just because I know them well Uh, but we had a client that had a website last year There was not an ever site, but we did their digital ad spend we did their pay per click  Right  this year.\r\n\r\n\r\nWe had the same ad spend same month over month, but we had an ever site launch So a better conversion minded website. They had double the leads and they paid half  per lead The only change was their website.  Does this conversion change per industry? Right. Or is it pretty much the same across  all industries?\r\n\r\n\r\nIt definitely changes for industry. And part of that is ticket size. How many competitors are there? They're going to be different things that affect it. How would you go about identifying what a good benchmark of conversion is? Let's say that I am a, well, yeah, I have a tree trimming business, right?  How would you go about saying, oh, your conversion is good or, oh, your conversion sucks? \r\n\r\n\r\nGreat question. So there are two ways to look at it. One is how is your conversion rate comparable to the rest of your market, right? And the only way that you're going to get that information is if you have other data. There are companies that will aggregate conversion data and will publish it.\r\n\r\n\r\nEspecially for your bigger industries and generic industries. And so when we have the data available, roofing, for instance, roofing and gutters, we have that information available. We can compare, I have a tweet about what we did in 2023 for our clients versus what the industry standard was. The other way is.\r\n\r\n\r\nReally to look at it from a cost of, of acquisition, what does it cost you to get a customer? And what's that customer worth to you? And you really, you just do your own math as a company at that point. It's like, heck yeah, if I'm generating 5X when I'm spending in revenue, it's worth it all day long. Does that make sense? \r\n\r\n\r\nYeah, no, it does make sense. I've just always been curious about how you benchmark that stuff, right? Because like you said, it's not always publicly available for you to go and look at.  It's not. And so you do have certain metrics that you can go by that Google will make available what other people are paying.\r\n\r\n\r\nWhen you don't have specific industry metrics, you can get an idea by looking. At adjacent industries and what they expect because it can vary pretty significantly. Walk me through that process. You get a new client. They are an industry you've never done before. Let's just say home health and hospice.\r\n\r\n\r\nThat's what I used to work in. I'm like, Hey, I want your help building a better webpage and funnel.  How would you go about walking through your process of identifying what is a, what is even a reasonable conversion number? What is it? What is a good metric for that industry?  Yeah. So we would typically just do some research to start.\r\n\r\n\r\nWhat does that mean? Find out Google, you go to Google and say, what is it? Honestly, it used to be Google. One of the faster ways now is chat GPT. So you can go to chat GPT and say, Hey, cause it'll cite sources, right? So you always click and go to the actual source that they're citing. And you can find a lot of good information there.\r\n\r\n\r\nAnd typically it honestly does a better job at finding stuff quickly than Google does. Even what question would I ask? Like, how would I even know the right question to ask? Would it be just what is conversion like in home health and hospice? Or do I need to say what is conversion from web flow? Yeah, I don't even know how to ask.\r\n\r\n\r\nSo what is the, it depends on what you're trying to metric, but let's say it's paid ads, right? Google search ads, you would search something or ask chat GPT. What is the average conversion rate for hospice home health and hospice care companies and paid ads?  And you just ask that question. In fact, we could almost do that live and we would probably get some decent results.\r\n\r\n\r\nWe do actually happen to be in that industry. I don't know the numbers off the top of my head, but we do have a client that has, they're in New Mexico and Louisiana and kickin butt. What are they, what services do they provide? Can you say or no? Yeah, hospice care. So they. Oh, okay. Yeah. I love hospice. And.\r\n\r\n\r\nThat industry sucks at  SEO and pay per click. It's just, they're just not good at it. It's wide open. Yeah. Okay. So how much does it cost you?  First of all, sorry.  I find the digital marketing stuff fascinating because I just don't know anything about it. And I've had a couple of conversations now. So thank you for letting me just pick your brain.\r\n\r\n\r\nCome on, man. Bring it for you. How do you, how much does it cost for you to acquire a customer? So  it's changed with Eversight and we're, we're three years in and it continues to change because we're trying so many different avenues. But what we have discovered is if we can acquire a customer between 500 bucks and a thousand bucks, it's a slam dunk for us.\r\n\r\n\r\nAnd where are you spending that 500 to a thousand dollars? Or is that LinkedIn? Is it in person networking and marketing? Is it Google? Like how do you spend? So it's outbound sales. So we call and email. We also, funny enough, on X has turned into a, a pretty considerable lead source I would assume. Yeah. I do a lot of website roasts.\r\n\r\n\r\nI don't know if you've seen them, but I'll, I have asked dude, they're genius. Send me their homepage. Appreciate that. So for people who don't know, this is one of my favorite things that you do  and Chris has done this in the past as well, where it's a website roast, right? Roast my website and people will send you their website and you'll give them feedback. \r\n\r\n\r\nAnd the thing that it does that I love number one is it shows your personality. So build some trust. They're like, Oh, Joe's a good guy. I like the way he thinks about this. It was funny. The way he said that, but then it also shows that you're smart. Like the advice and the feedback that you give people look at and they're, and they say, Oh, that makes sense.\r\n\r\n\r\nRight? So it's trust building, not only from the personality and the brand standpoint, but also from that knowledge and expertise standpoint, it's, it's literally, you know, Free marketing for you. So I mean, it provides value, right? I love that too. Cause it genuinely is making the web a better place and helping people out because quite frankly, not everybody can't afford to get a new website right now, right?\r\n\r\n\r\nBut  we give them some value. They make some changes. They see an improvement and they need a website in a few years for your customer acquisition costs, 502, 000. The channels that you're spending that on. I think I stepped on you. I know Twitter has become a good driver, but tell me again, what are the  Sources  funnels that your customers are coming from.\r\n\r\n\r\nSo outbound Twitter, and then we do SEO for ourselves. That's still a game that we're working on, but it's starting to show some results. We get a lot of referrals. What's your churn? Like how long are your customers staying with you? What's your lifetime value?  95% of our customers from the inception of ever site are still with us today.\r\n\r\n\r\nShe, okay. How many is that? So 95% could be nine of them, but yeah, we have about 115 that are active right now on ever site we built. That's amazing, man. We built over 500 sites before, but we only launched ever site three years ago, so we have 115. We plan to add. Wow. We're hoping to get to 1 75, maybe 200 by the end of the year. \r\n\r\n\r\nHow do the payments work? So I know it's monthly. Are they just paying on credit card? Do you invoice them? Is it? Are they paying in arrears? Are they paying up front?  So they're typically paying 3. just dings the credit card. We do have a couple that request to pay annually.  And we, of course, allow it, but no, typically it's just,  honestly, it's similar to a SAS and that was part of, from a business perspective, we wanted it to be that way.\r\n\r\n\r\nAnd so people are just used to that and it makes sense. Yeah. It just gets charged monthly.  All right. So. Uh, one of the ratios I've, I still don't understand  is LTV, not, it's not a ratio. It's a calculation because it's really just like the lifetime revenue. I don't know why they say lifetime value to me.\r\n\r\n\r\nLifetime value does not mean revenue to me. Lifetime value means like lifetime profit, but I'm looking at your CAC and let's just say it's a thousand dollars per customer. And I'm looking at your lifetime value and saying, it's.  What? Let's just take a guess. 15, 000.  Yeah. So exactly. Is that for me to be seen, but go ahead.\r\n\r\n\r\nLet's just say it's 15, 000. Is that ratio good? 15 to one.  I mean, I look at that and I say, Oh, that's great. But what is it? What is a good ratio of LTV to CAC? We're very happy with 15 to one though. I mean, we believe that our margins will end up getting over time to the 40, maybe 45 percent range. Take your business out of it.\r\n\r\n\r\nIf I was just a typical company.  And I wanted to know, all right, LTV to CAC, what's a good ratio? What would you tell me? I really think it, it depends on the specific company. But if I'm generalizing, I would say anywhere in the 6 to 7 X is probably a good spot to land. So if I'm at 3 to 1,  you're like, you got to tighten something up. \r\n\r\n\r\nYeah, I would think so. In this space, yes.  I got some rapid fire questions for you. Are you ready? Cool.  What do you love about this business? Personally? I love the team. We got an awesome team. It's a really fun culture. It's a fun business to, to build a culture around. And there's a lot of moving parts. It keeps things fresh.\r\n\r\n\r\nOkay. Take the team out of it, which I agree with the business model itself. What do you love about this industry? I love that it is a business that can be run remotely.  What do you hate about it? I hate that there are occasions where you can be fired even though you've done a very good job. And I guess that would be, that would apply to other industries, but it's particularly common. \r\n\r\n\r\nDigital marketing. Yeah, that's true. What scares you about AI in this business? Obviously there's always the thought, Oh, there's an AI that can just completely automate digital marketing top to bottom. If that ever were to come to pass, that would be a big challenge, but I don't see that being the case, at least not in the foreseeable future, not anytime soon.\r\n\r\n\r\nAnd so. I actually really love AI. AI is, is enabling us to get more efficient and to take some things that were mundane kind of tasks for our team and take it away from them and let them focus on, you know, better things. So. I love AI. It's a big part of where we're going. What keeps you up at night? Kids. \r\n\r\n\r\nPeople in real estate. I love this question. People in real estate look at businesses and think, I wish I had a business that was just producing cashflow for me that I could grow and scale. And then people in small business like us think I wish I was in real estate because that's so easy. I just have an asset and collect the check every month.\r\n\r\n\r\nWhat industry or what businesses are you the most jealous of right now?  SAS companies and it's probably has to do with my background, but the fact that you can scale as fast as you can market for the most part is an incredible superpower in my opinion. Yeah, that's a good one. All right. Last question.\r\n\r\n\r\nWhat are you obsessed with right now?  What am I obsessed with right now? I think if you were to ask my team that I would say AI actually funny enough, I really enjoy tinkering with it and finding ways to, to use it and make efficiencies.  Yeah. I love it, man. Well, if people want to find you, what's the best place?\r\n\r\n\r\nIs it Twitter? Is it online? Where should I point them? Yeah. Eversite. com is our agency. If you want to reach out to me, you can find me. On X. My handle is Joe Benson X J O E B E N S O N X.  Love it. Joe. This was awesome. Thanks, man.  Yeah, man. Really appreciate it, Nick.  Well, big thank you to Joe for joining us.\r\n\r\n\r\nIf you like this episode, like and subscribe, share it with a friend. If you want to find Joe, he's on twitter at Joe Benson. If you want to come and find more content like this, you can follow me at co founders Nick and look forward to seeing you guys next time.",
  "metadata": {
    "duration": "",
    "date": "2024-06-14",
    "platform_source": "Google Drive"
  }
}