{
  "episode_number": "134",
  "episode_title": "How to Escape the Corporate Grind and Bet on Yourself with Brian O'Connor",
  "guest_name": "Brian O'Connor",
  "business_name": "Fractional CMO, Staffing Company",
  "transcript": "﻿Brian O'Connor (00:00.663)\r\nLet's roll.\r\n\r\n\r\nNikolas Hulewsky (00:02.0)\r\nOkay, Brian, you're a prolific entrepreneur and you have kind of the target background of somebody who's listening to this podcast, which is either you sorry, take that back, which is you worked in the corporate world for a while and you had some amazing experience with JP Morgan Chase that led you to be able to hop out on your own. And since then, you've built a personal brand, you've done some coaching, you've sold some courses, but you've also\r\n\r\n\r\nBrian O'Connor (00:19.95)\r\nyou.\r\n\r\n\r\nNikolas Hulewsky (00:30.353)\r\nbuilt a fractional CMO company, helps what you thought was going to be small businesses market and position themselves. You're working with like billion dollar brands now. And on top of that, you started your own staffing company. So it's like, so you've really gone from, Hey, I'm W2. want to become an entrepreneur to I'm an entrepreneur living full time. You're in South America right now. You're like a digital nomad. It's amazing. Did I miss anything in the, in the like description?\r\n\r\n\r\nBrian O'Connor (00:58.422)\r\nNo, I think the only thing to clarify, wasn't at JP Morgan. I was a management consultant at Deloitte doing corporate strategy. All good. then before that, I was actually a banker. So I did a few years of finance boot camp, and then I did six years of traditional corporate strategy advising to corporate executives.\r\n\r\n\r\nNikolas Hulewsky (01:08.093)\r\nI'm sorry.\r\n\r\n\r\nNikolas Hulewsky (01:22.045)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:26.065)\r\nWhy did you leave? if you're six years in and you're working at those kind of companies, you can be making freaking great money. Why did you decide to become an entrepreneur?\r\n\r\n\r\nBrian O'Connor (01:30.126)\r\nPeace.\r\n\r\n\r\nBrian O'Connor (01:37.018)\r\nI think when I was like, when I was in my early mid twenties, it was about money, right? It was about prestige and money. It was the hunt, right? And so I wanted it to be investment banker, private equity. I wanted to be a consulting partner, like make millions a year and just like do that in the corporate world. Right. I hit a point where it stopped becoming about money for me and became more about like,\r\n\r\n\r\nbuilding experiences and just like kind of the love of business, I'd say. And there was this big like, I had this big project, if you want to give example, I had a project where I was managing 250 people, right? At like 25 years old, 26 years old, you know?\r\n\r\n\r\nNikolas Hulewsky (02:24.145)\r\nWhat was the project? were you doing? Like managing them? What does that mean?\r\n\r\n\r\nBrian O'Connor (02:26.574)\r\nYeah. Um, so in this case, this example, was, um, I don't know if you remember the paycheck protection program during COVID where they gave, um, ton of money to small businesses, right? Um, and so I was at one of the banks helping give all that money to small businesses, right? But it was a massive amount of money where like banks are just aren't set up to, uh, to deliver that much. And so they needed to bring us in to figure out like, how do we like,\r\n\r\n\r\nOperationally, how do we get that much money to small businesses? And so I had a team of 250 people, like going through and figuring out like how do we get that money to small businesses? Insane.\r\n\r\n\r\nNikolas Hulewsky (03:04.605)\r\nYeah, that was a crazy time in COVID because the PPP program was designed for these companies that are going to be shutting down and the government didn't really have a clean mechanism to distribute that money. And so they said, let's go through the SBA. There's already like a funding mechanism through the SBA and then all these banks that had SBA programs all of a sudden became the PPP lenders, right? So that was you. You were like working with those teams to get funds distributed really quickly. So it wasn't just a big team and a lot of funds. It was pretty stressful.\r\n\r\n\r\nBrian O'Connor (03:16.526)\r\nYeah\r\n\r\n\r\nBrian O'Connor (03:24.782)\r\nYes. That was me.\r\n\r\n\r\nBrian O'Connor (03:33.834)\r\nIt was, I didn't have weekends. Like every single night was till, man, it was like 8 a.m. to 11, 11 p.m. like every day.\r\n\r\n\r\nNikolas Hulewsky (03:42.949)\r\nWow. Do you know how much you help distribute?\r\n\r\n\r\nBrian O'Connor (03:47.502)\r\nWe were, yeah, we were top 10. I think we made top six, yeah. I don't remember the time. I remember it's on my head, I can look it up, but I'd be lying if I made it up right now.\r\n\r\n\r\nNikolas Hulewsky (03:48.653)\r\nIt's got to be billions,\r\n\r\n\r\njeez, dude.\r\n\r\n\r\nSo do you know the number? What was the number?\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (04:05.821)\r\nJeez. Okay, so you've seen hundreds of businesses, not just in the corporate world, but after you left, became this fractional CMO. Fractional executives are kind of a big buzzword right now. And I know there's stuff in between, right? Leaving and the fractional CMO. But how did that come about? Why'd you go fractional?\r\n\r\n\r\nBrian O'Connor (04:23.298)\r\nYeah.\r\n\r\n\r\nBrian O'Connor (04:28.334)\r\nSo, well, actually to finish the first question, which was like, from that project, why go at all? Why leave the corporate world at all? I was at a point where after that project, that project was going to hell. And I got pulled off of a strategy project I was on, which was basically helping a bank figure out if they should launch a new investment bank in Brazil.\r\n\r\n\r\nNikolas Hulewsky (04:41.872)\r\nMm-hmm.\r\n\r\n\r\nBrian O'Connor (04:59.122)\r\nAnd they, they were like, Hey, we need a strategist to come on and like figure out how to make this a reality. And it was a point where they didn't have, and we didn't have anyone on the bench who could do that. And so the partner at the end of the project, the partner turned and said to me, was like, do you single-handedly save this project? And they gave me it. And then he handed me a gift card. Right. And so I remember sitting there being like, the amount of value I've created for a gift card is insane.\r\n\r\n\r\nI need to take a bet on myself and get a percent of the value I create. And so I became obsessed.\r\n\r\n\r\nNikolas Hulewsky (05:35.815)\r\nWhat do you think? was the value of the project?\r\n\r\n\r\nBrian O'Connor (05:39.214)\r\nIt was that number that I remember that I would have. Yeah, I guess that would be billions in dollars distributed, but to the consulting firm, was probably 100 mil, I'd say.\r\n\r\n\r\nNikolas Hulewsky (05:41.297)\r\nOkay, billions. It was a billions.\r\n\r\n\r\nNikolas Hulewsky (05:49.255)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (05:55.653)\r\nand you save that project. Okay. Hey, thanks for saving us 100 million. Here's a Starbucks gift card. Don't spend it all in one sitting. Buy yourself a nice smoke of frap or whatever.\r\n\r\n\r\nBrian O'Connor (05:57.486)\r\nfor a gift card.\r\n\r\n\r\nBrian O'Connor (06:04.125)\r\nYeah, exactly.\r\n\r\n\r\nExactly. So in that moment, I mean, I a few moments, it was like, it wasn't just like one moment. But in that moment, I was like, okay, I can really create some value. But I need to take a bet on myself and capture some of that value. Right. And that wasn't the moment I left that like started the question and started the challenge. And then I had a moment a few months later that had me leave to start like advising and that kind of stuff.\r\n\r\n\r\nNikolas Hulewsky (06:36.509)\r\nWhy CMO? Because it doesn't sound like you were doing marketing at the consulting firm you're at. I you're helping distribute PPP funds. You're looking at starting an investment bank in South America. CMO doesn't make sense to me from that,\r\n\r\n\r\nBrian O'Connor (06:47.15)\r\nYou\r\n\r\n\r\nBrian O'Connor (06:51.168)\r\nYeah, yeah. So, I was part of the growth strategy team. and so growth strategy is marketing plus positioning that kind of stuff. If you're familiar with like, for like Michael Porter is five forces, that kind of stuff. I was in Porter's group. And so what we did was figure out like,\r\n\r\n\r\nNikolas Hulewsky (07:01.52)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (07:05.296)\r\nYeah, five horses.\r\n\r\n\r\nNikolas Hulewsky (07:10.705)\r\nWhat does that mean? I'm sorry. I don't know what that means. You're important. Like you were in, you know, Michael Porter.\r\n\r\n\r\nBrian O'Connor (07:15.776)\r\nNo, I don't. So Michael Porter started a growth strategy firm, right? On like, how do we, so the kind of stuff that we do, and then I was part of that firm, basically. didn't meet Michael, I wish. But so what we did was growth strategy. And so what's growth strategy? It's like, what markets do we enter? What products do we launch? What customers do we target?\r\n\r\n\r\nNikolas Hulewsky (07:27.025)\r\ngot it. Okay.\r\n\r\n\r\nBrian O'Connor (07:42.242)\r\nLike how do we basically, how do we generate more revenue for a company, which includes marketing, right? So to give you an example of a project, I went to a Dino bank in Mexico. And in, Mexico, we had to figure out how to generate 300 million in new revenue for the bank. Right. and so what we did was we looked across all their business lines and had workshops with each business line on how do we, like come up with new product ideas, right? Look for areas to,\r\n\r\n\r\ncame up with bunch of new product ideas, prioritized the product ideas, launched them, and then tracked the launch and execution of those ideas to generate 300 million for the bank. And so that was Mexico.\r\n\r\n\r\nNikolas Hulewsky (08:15.069)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (08:22.303)\r\ninteresting. And that was in Mexico.\r\n\r\n\r\nAnd for people who are listening, you go through the five forces? Anybody who's gone to business school has heard this where they're like, Porter's five forces. And if you don't have it, I have them up just in case you were like, you're like, crap, how exactly do I say this? We'll edit this part. he's very famous. Every business school teaches the Porter's five forces because it's a way of looking at markets.\r\n\r\n\r\nBrian O'Connor (08:39.374)\r\nI\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (08:54.589)\r\nYou're trying to understand the dynamics of a specific industry and Porter's Five Forces are essentially a really good framework for you to take and then use as a lens to view that market.\r\n\r\n\r\nBrian O'Connor (09:06.41)\r\nYeah. And actually, so what's interesting is, so we used, we used, there's this one framework we used in every growth strategy project, right? And then within the framework, we plug in these other mini frameworks. we actually didn't use the five forces, right? Which is so interesting. So like the, yeah, there's a difference between academia and reality, right? And so like what we did, and I'm sure like there's other,\r\n\r\n\r\nNikolas Hulewsky (09:21.679)\r\nthat is interesting.\r\n\r\n\r\nBrian O'Connor (09:29.91)\r\nLike there's the seven powers is the five forces because all these like frameworks we can use. But the one framework that we use in every, corporate strategy project where I use today with my CMO clients is called the choice cascade. Right. And so, yeah, I'm obsessed. I love the choice cascade. the book, if you're, if, if you want to deep dive in it, there's this book called playing to win, which is one of my favorite books on strategy. All it does is explain how the choice cascade like works in reality.\r\n\r\n\r\nNikolas Hulewsky (09:42.813)\r\nOoh, go on.\r\n\r\n\r\nBrian O'Connor (09:58.7)\r\nRight. and they use like proctor and gamble as an example, fascinating book. anyway, so the choice cascade, what it is, is anytime you're trying to launch a new product, you're trying to enter a new market, penetrate a market more. But the biggest thing is you're trying to create a competitive mode, right? If you're like, if you're like, playing in a red ocean, let's say, and you're trying to, make sure you. Yes. Okay. So, there's another frame.\r\n\r\n\r\nNikolas Hulewsky (10:21.029)\r\nI'm so sorry. What is a red ocean?\r\n\r\n\r\nYou keep dropping these words and I'm like, man, I thought I was an idiot before this podcast. And now I'm like, geez Louise, 85 IQ. I've heard of a blue ocean. A blue ocean strategy is like just a ton of, it's a massive market, a ton of opportunity that you're launching into, right? Okay.\r\n\r\n\r\nBrian O'Connor (10:30.049)\r\nNo.\r\n\r\n\r\nYes.\r\n\r\n\r\nBrian O'Connor (10:43.99)\r\nYes, it's the same. It's the exact same framework. So if you think of that blue ocean, which is a, I believe it's BCG, it's a framework that basically says, Hey, it's a framework that my opinion, it's a book that could have been an email in my opinion. And that email subject header is just playing in places. Other competitors aren't. That's really it. Right. A blue ocean is just a fancy word for, a market where there's not a lot of competition. Right. and the reason it's called blue ocean.\r\n\r\n\r\nNikolas Hulewsky (10:56.445)\r\nYou\r\n\r\n\r\nBrian O'Connor (11:14.016)\r\nis there's the opposite of that, which is a red ocean. And imagine a red ocean is a bunch of sharks just biting each other. There's blood everywhere in the water, right? The sharks are your competition. so when there's a ton of, exactly, a ton of sharks just biting each other, there's blood everywhere, that makes a red ocean, right? And so the blue ocean is the absence of blood.\r\n\r\n\r\nNikolas Hulewsky (11:21.021)\r\nas our highly competitive markets.\r\n\r\n\r\nNikolas Hulewsky (11:35.653)\r\nOkay, all right, okay, so now I'm up to speed. The choice cascade.\r\n\r\n\r\nBrian O'Connor (11:38.894)\r\nI mean, yes. Okay. So the choice cascade, this is what we do. Basically. I pulled this out anytime someone's like, I need to create a competitive advantage. need to launch it into a new market, which means either a new customer group, a new product, a new country, a new geography, et cetera. Um, and so what that is is it's five buckets, right? Um, one, the first thing you do is you say, what's your goal or what's your aspiration?\r\n\r\n\r\nWhat's your goal for the business? Why? Because a strategic choice that you make for your business only makes sense relative to your goal. Right? Which is why hot take SWOT analysis, strengths, weaknesses, opportunity, threats is like the most common thing to teach in business school is bullshit. Why? Why? Because it's only a strength relative to your goal. Right? So like, if you were to say,\r\n\r\n\r\nI don't know. We're really, I'm making this up. It's going to be a bad example, but we're really, really slow moving organization, right? But slow moving also means deliberate. And so if you're in insurance, that might make more sense because you every bet you make is a big bet. But if you're in a SaaS product, we have to constantly iterate and move fast. That's a, that's a weakness. And so like, um, every strategic choice that you make for your business only makes sense.\r\n\r\n\r\nwhether it's a strength or weakness relative to your goal, right? And so one rule of thumb that we have for is something a strategic choice is invert it. Take the opposite of that choice. And if it's stupid, then it's not a strategic choice. It's just a best practice. Here's an example. So if I were to say to you, are...\r\n\r\n\r\nOur competitive advantage is that we love our customers. We have the best customer service. The opposite of that is we have the worst customer service. So is that an advantage or is that a best practice? Should we just take everything, should we just like, it should just be industry standard to treat your customers well. And so you have to like, you get that?\r\n\r\n\r\nNikolas Hulewsky (13:55.633)\r\nOkay. So like another example of that would be, hey, our organization is really deliberate. Okay. All right. Versus our organization moves really fast. Like on its face, that isn't necessarily a good thing. I mean, yes, most of the time you're like, yeah, we want to move fast, right? But if you're dealing with, if you're in the FDA, you probably don't want to move exceptionally fast to get stuff there because you've got a bunch of testing criteria, et cetera. So it's\r\n\r\n\r\nBrian O'Connor (14:01.868)\r\nYeah, versus what?\r\n\r\n\r\nNikolas Hulewsky (14:25.457)\r\nAll right. So your goal when you're talking about your competitive advantage and your, is that your goal and your competitive advantage kind of one in the same? No. Yeah.\r\n\r\n\r\nBrian O'Connor (14:34.294)\r\nNo. So, let me just high level go through the five buckets. So what you do is you first, you identify your goal one, right? That's your aspiration. who do you want to be when you grow up? Right? What's your revenue goals? strategic goals. Like, where do you want to play? Where do want to win? I'm sorry. What are your strategic goals and who do want to be? Two, what markets do want to play? Where do you want to play? Right? So that's what customers do you want to target? What industries you want to be in? What products do you want to launch?\r\n\r\n\r\nWhat countries, geographies do want to be in, et cetera? Three, how will you win? Right? And the important part, one tip, you do not do your where to play choice and your how to win choice separately. They have to be combined. Right? Because every time you say, will play in the, I don't know, computer mouse market, right?\r\n\r\n\r\nThere's no point in doing that without a winning play. And so you have to say, we will play in the computer mouse market. We will win by distribution or whatever. Right?\r\n\r\n\r\nNikolas Hulewsky (15:43.163)\r\nOkay, so is that number three? Where will you play and how will you win? That's like the third question.\r\n\r\n\r\nBrian O'Connor (15:49.39)\r\nCorrect. Correct. Yep. They are two different buckets, but they have to be treated together, right? Each where to play choice has to have a competitive advantage. So one aspiration, two, where will you play? Three, how will you win? Four, what capabilities do you need to build or buy to make your strategic choice a reality? Right. And then five, what management systems do have to put in place to ensure that the strategy continues?\r\n\r\n\r\nIt doesn't like die after you're like six months of implementation.\r\n\r\n\r\nNikolas Hulewsky (16:22.973)\r\nSo I'm a chimp. So I'm going to try to repeat this back to you. Here's what I have. Here are my notes. Who do you want to be? That's bucket number one, right? Like aspirationally, where do you want to be? Number two, where do you want to play? So who's your target? Who's your ICP? Who's your customer? What markets are you trying to play in?\r\n\r\n\r\nBrian O'Connor (16:27.96)\r\nDo it, yeah.\r\n\r\n\r\nBrian O'Connor (16:32.696)\r\nYeah. Yes.\r\n\r\n\r\nNikolas Hulewsky (16:47.069)\r\nWhere will you win? Where will you play? And then the third one, how will you win? So what's your competitive advantage in that space? In order to achieve those things, what capabilities will you need to either buy or build to make it a reality? And then the last one, what management choices or what, I guess, systems we need to implement in order to realize that goal? I guess the last one's really interesting. I haven't thought about that. What management choices?\r\n\r\n\r\nBrian O'Connor (16:54.36)\r\nYep. Correct. Yep.\r\n\r\n\r\nBrian O'Connor (17:03.884)\r\nYeah, or JP.\r\n\r\n\r\nNikolas Hulewsky (17:16.859)\r\nwill you manage like talk more about that last one.\r\n\r\n\r\nBrian O'Connor (17:19.874)\r\nYeah. So I'll tell you the theory and then the reality, right? The theory is, with all of these buckets, by the way, we identify strategy as different than best practices. So if it's a best practice, we don't write it down, we just assume it is what it is, and that's just table stakes that's not strategy, right? So for example, a management system.\r\n\r\n\r\nNikolas Hulewsky (17:37.469)\r\nHmm.\r\n\r\n\r\nBrian O'Connor (17:43.534)\r\nWe have to have EOS in place, Entrepreneurial Operating System, right? Making stuff up. We have to have meetings every week to talk about this thing, right? That's a best practice. You can argue it's a best practice, but like, are things that we just table stakes. We're not going to talk about that in our strategy, right? But as an example, here's an example, Four Seasons. Four Seasons at the hotel, right? They go, they say, hey, are going to, our product is our people.\r\n\r\n\r\nNikolas Hulewsky (17:59.933)\r\nBrian O'Connor (18:14.126)\r\nnot the hotel itself, right? We're going to win by having an incredible, like having a client experience, a luxury client experience, right? And so what are the management systems you need to have in place to make the luxury client experience a reality? Well, one example of it is that you give each employee $1,000 spend a month or whatever it is to be able to spend on\r\n\r\n\r\non at their own discretion, right? And like the KPIs you put into place that track client satisfaction are going to be different than if you emphasize something else, right?\r\n\r\n\r\nNikolas Hulewsky (18:43.485)\r\ntheir own discretion.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:56.805)\r\nInteresting. Yeah. Yeah. So that makes sense now, right? Because I was thinking, what's the management system you're to have in place? It's like, okay, do we have to put EOS or you have to put whatever they use in scaling up or, but that's table stakes. You should be doing that anyways. What? Yeah.\r\n\r\n\r\nBrian O'Connor (19:09.121)\r\nNo. Yeah, that's...\r\n\r\n\r\nCorrect. Yeah. Yeah, yeah. If it's table stakes, that's not part of the strategy. That's just table stakes, right? That's just good best practice. If it's above and beyond table stakes, then it's a strategic choice.\r\n\r\n\r\nNikolas Hulewsky (19:32.199)\r\nWhat's the book called again?\r\n\r\n\r\nBrian O'Connor (19:33.838)\r\nPlaying to win. Firebook, highly recommend. Yeah, and it's an easy read too.\r\n\r\n\r\nNikolas Hulewsky (19:35.069)\r\nPlaying to when? Okay, I'm gonna have, as I'm listening to that,\r\n\r\n\r\nI didn't worry about these questions until years into my journey as a leader, manager, entrepreneur. Because for me in the beginning, was like that question, well, who do you want to be? It sounds so pie in the sky. It's like, I don't have time to waste on that. I got to close this customer. I got to hire this person. got to whatever, make the widget. And it feels like you're wasting time. However,\r\n\r\n\r\nI've come to realize like, if you don't know where you're going, right? If you don't know what your goals are, then you are wasting your time. Like you're just running around like a chicken with your head cut off. And so finding these things early on is really important.\r\n\r\n\r\nBrian O'Connor (20:29.804)\r\nYeah. And it also, it depends on the size of your business too, and what your goals are, which ironically we're talking about identifying goals. cause like, usually I get the call at the CMO business. I get the call three million ish, really five. because like what happens is below one mil, like you're still kind of just like finding out.\r\n\r\n\r\nthe systems and the strategy and stuff doesn't come into place until it comes into place earlier, it doesn't become mission critical until usually I get the call around three, three to five is probably the low end of where we get the call. Cause like, if you think about what strategy is from this perspective, it's sitting there and like big brightening the thing, like thinking about like your chest piece and wearing a play stuff, right?\r\n\r\n\r\nwhen you're still just kind of like constantly iterating and getting feedback loops at the speed of like a few hours or a day, like your strategy is going to change all the time. And so I think it's a function of sustainability. Once the business becomes more sustainable and predictable, it's not fully sustainable, sustainable, predictable, but like as it becomes more predictable than like when you're still trying to find product market fit, you can then start to like make more choices. But then the other thing is the bigger the risk, the bigger the investment.\r\n\r\n\r\nLike we're doing like three months strategy projects, but because we're going to put hundreds of millions of dollars on the line, right? And like when there's like multiple business units, like the ripple effects are insane. And so it's basically the bigger the bet, the more, the more thought you put into it. makes sense. First is just doing and finding out.\r\n\r\n\r\nNikolas Hulewsky (22:14.845)\r\nWell, think, yeah, what I've always thought was interesting is you kind of think before you get into it that it's this clean process. Okay, I think of the idea and then I have my positioning statement and we have our team and we do these meetings and whatever. But the truth is you can't make decisions without data and you can't get data without doing. But we're afraid to do until we feel like we're totally prepared.\r\n\r\n\r\nBrian O'Connor (22:24.44)\r\nYeah.\r\n\r\n\r\nBrian O'Connor (22:39.618)\r\nYes, yes, yes.\r\n\r\n\r\nNikolas Hulewsky (22:45.595)\r\nIt's kind of this, oxymoron's not the right word, but this paradox, right, that many people fall into, and that's where they get like too nervous to actually make a move. But you actually find your product market fit in the process of doing it. And I'd say this a lot too. If you're under a million or two million, depending on what your business is, and depending on where your margins are, is kind of my number. EOS doesn't matter, right? Like pulling in your leadership team, who's your leadership team when you're under a million?\r\n\r\n\r\nBrian O'Connor (23:09.048)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (23:14.555)\r\nlike your assistant or like, you know, your warehouse manager, that's not really your leadership team. Like the point of these exercises is to get everybody on board because as you grow, it gets harder and harder to maintain that core message and philosophy. And so you need to get everybody on the same page, right? So you really don't get to those conversations beforehand, sub a million, even sub 2 million, again, depending on the business, like you're saying, you're just data gathering, like, okay, what's working, what's not working.\r\n\r\n\r\nHow do you balance that though, when you're under a million? I don't have an answer for that, but you still need to be worrying about these things. However, it shouldn't cause you to be paralyzed, right?\r\n\r\n\r\nBrian O'Connor (23:53.186)\r\nYeah, and we say worry about these things. It's the strategic choices and where you're going.\r\n\r\n\r\nNikolas Hulewsky (23:57.179)\r\nYeah, like sitting down and I think it's important for you, let's say before you even launch a business. Where do I want to be? What market do I want to play in? How will I win? All those are really good questions to answer.\r\n\r\n\r\nHowever, you don't just do that once before you start the business and then it's like, and then I became a billion dollar company. It might change when you get to 50,000 a month. It may change when you get to a hundred thousand dollars a month. It's going to change again when you get to 500 and a hundred thousand. Like there are different questions that sort of pop up at those points that you didn't even understand when you were getting the business started. How do, how do, so as a CMO, right? Like how have you seen, what's the best way to balance\r\n\r\n\r\nthe need to continually revisit these questions. You also just need to get data so you can understand where your product market fit is.\r\n\r\n\r\nBrian O'Connor (24:44.514)\r\nThen.\r\n\r\n\r\nBrian O'Connor (24:51.084)\r\nYeah, no, that makes sense. So with, let's use that example of like when we were launching those business units in Mexico, right? Those products. We came up with like 40 to 60 different like products and like process optimizations and all that kind of stuff, right? But you're not going to test all of them, right? And so like what you're saying is like, how much research and thought should I put into before I make a business decision? It's basically what I'm hearing you say.\r\n\r\n\r\nNikolas Hulewsky (25:21.115)\r\nBasically, yeah, yeah, it's great.\r\n\r\n\r\nBrian O'Connor (25:21.304)\r\nRight. And so there's a, there's a spectrum, right. And we, literally draw the spectrum out on every product where it's like the, can be super confident, but it takes forever to get that level of confidence. Right. And you can have be fully confident before you lost product. Right. and so like there's a confidence level versus speed. Right. And so what we did was we would do, if we were to say, I don't know,\r\n\r\n\r\nLike we had one product that was big bet and another was a small bet. The big bet we would say, okay, we're going to go out and have customer interviews and we're going to like do a market sizing, right? And we're to do the full cascade where we come up with competitive advantages and maybe we get all the executives that we bring in experts and do expert interviews, right? And that takes a month, right? For a month, we're just sitting there, maybe more, month and a half.\r\n\r\n\r\nwhere we're just sitting there thinking. All we're trying to do is find the spots we hadn't thought about. What mistakes can we avoid? What landmines can we avoid? We sit there for a month and a half and think about it because it's a big bet. But there's other bets that aren't that big. And we're like, look, we want to put all our resources in a big one. Let's just put this in the market and test it. And so I think the spectrum, there's a speed confidence spectrum.\r\n\r\n\r\nthat like depending on how big the bed is to you, can like kind of find your way in the spectrum.\r\n\r\n\r\nNikolas Hulewsky (26:49.725)\r\nAs you're talking, I'll say it and I want to get your feedback. I wonder if it's when you're sub a million dollars, let me take that back. When you're doing a couple million dollars a year and you've got a management team, you're paid to think. That's your job, right? You're a thinker, you're a problem solver. Sub a million, you're not only paid to think, like you're also the one who's doing the work.\r\n\r\n\r\nSo gets really hard. I think if you're optimizing for speed in particular, sub a million, and then as the bets become bigger and you've got a management team, right? Like then you're optimizing maybe for confidence. I'm not saying you're ever on one side of the spectrum or the other. Is probably the maturation of a normal company, right? Is it like, that's how they typically operate.\r\n\r\n\r\nBrian O'Connor (27:18.157)\r\nMm-hmm.\r\n\r\n\r\nBrian O'Connor (27:31.79)\r\nNo.\r\n\r\n\r\nBrian O'Connor (27:38.654)\r\nYeah, yeah. When you're small, you need to optimize for the fastest feedback which is possible, right? But I think that's a false dichotomy where people say like, yo, you have to just do and it's like, you can't think. Like, I don't know, I think at night sometimes, you know, like I'm in the shower thinking like, hell, am I doing the right advantage?\r\n\r\n\r\nNikolas Hulewsky (27:54.983)\r\nWell, let's, okay, let's ask this. So you have your CMO business and then recently you've also launched a staffing company and staffing companies are, we think in our own little bubble of Twitter that like, everybody has a staffing company, but everybody doesn't have a staffing company. Like overseas talent is not a saturated market at this point. How did you think about launching that? Were you like sitting there?\r\n\r\n\r\nBrian O'Connor (27:59.096)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (28:24.931)\r\noverthinking it and getting the plan together or were you like, all right, speed to close. Let's just hop on this and start getting the feedback loop because this is essentially in practice what we've just been talking about. What did it look like for you?\r\n\r\n\r\nBrian O'Connor (28:37.868)\r\nYeah. So it's interesting because like, it's kind of a bit of both, right? So the, backstory is, I had my CMO business first. Right. And I was putting, I was building marketing strategies and marketing plans, everything we were just talking about now, right. for small businesses. Right. And so the business would go, Hey, that's great. but like, who's going to run it? Who's going to make it a reality. Right. And so.\r\n\r\n\r\nJust to clarify, a system, when I say the word system, what I mean is three parts. People, processes, and tech, right? So at the time, my business was processes and tech. I was heavily focused on processes, like some tech, but people just wasn't as much of thing, right? I was like, yeah, I got some friends doing this, like they can do it for you, right? I knew in the back of my head that the future stay I want to get to, which is like, I want to have the three legs of a system. Like I need to have that capability.\r\n\r\n\r\nNikolas Hulewsky (29:26.151)\r\nYeah. Yeah.\r\n\r\n\r\nBrian O'Connor (29:36.43)\r\nUm, and at the time I had a friend, uh, I met at Neil Patel's mastermind. Um, and he, he texted me he was like, Hey, I'm building this thing, which was the people side. And it fit perfectly into the business. And I was like, okay, don't need to build it myself or build it with a friend. Um, and so decided to go in with him. Um, and, and so it just made sense.\r\n\r\n\r\nNikolas Hulewsky (29:56.125)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (30:02.077)\r\nSo it was a natural outgrowth from the CMO, like you said. If they didn't have the systems to implement the recommendations you were making, and systems being people, processes, and tech, then you could be giving them recommendations till you're blue in the face. They may not see the results.\r\n\r\n\r\nBrian O'Connor (30:06.03)\r\nCorrect. Correct.\r\n\r\n\r\nBrian O'Connor (30:19.246)\r\nCorrect. Correct, correct, correct. Exactly, exactly.\r\n\r\n\r\nNikolas Hulewsky (30:22.641)\r\nSo when did you launch the staffing company?\r\n\r\n\r\nBrian O'Connor (30:26.705)\r\nLaunches was, I don't know how to define launch because we started probably like June, I would say last year. Like we kind of like soft launched at Jamfed. Yeah, go ahead.\r\n\r\n\r\nNikolas Hulewsky (30:35.239)\r\nDid you do this process where you're like, all right, let's sit down. Who do we want to be? Where do we want to play? How will we win? Did you do this?\r\n\r\n\r\nBrian O'Connor (30:45.006)\r\nNo. So here's what happened. actually, yeah, well, kind of now I've done it so much that it's like always in my head. Like I can't like, I can't turn that off, right? So if you tell me something, I immediately think is that a strategic choice? Like how does it plug in? Like it's just kind of on autopilot now. So it's always in my head, but here's the interesting thing. So this is the fascinating part. think so in, when I first started, even CMO business took so many iterations. Like I think when I, the biggest,\r\n\r\n\r\nNikolas Hulewsky (30:46.934)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (30:59.677)\r\nMm-hmm. Yeah, yeah, yeah.\r\n\r\n\r\nBrian O'Connor (31:13.336)\r\nbiggest surprise for me when I switched from corporate to entrepreneurship is how hard it was to find product market fit. Right? Like in my head, I was like, I've created so much value for businesses. I understand the full life cycle. Like this business is going to be easy. Right. Which I'm glad I thought that because I wouldn't have done it otherwise. Right.\r\n\r\n\r\nNikolas Hulewsky (31:28.583)\r\nYeah, yeah.\r\n\r\n\r\nBrian O'Connor (31:33.766)\r\nso, so yeah, I built an audience. had like 85,000 followers, right. And 14,000 people read small business owners reading my newsletter. Right. So was like, okay, I've got distribution. Like this is idiot proof at this point. Like I'm leaving and I'm just going to do this full time. Right. So I took the jump before I had like trash. Right.\r\n\r\n\r\nNikolas Hulewsky (31:52.977)\r\nHmm. The CMO jump?\r\n\r\n\r\nBrian O'Connor (31:56.886)\r\nYeah. So I'll tell you the full story. So before CMO, I probably, it depends on how you define a business in air quotes, but like, I probably failed seven or eight businesses, right? Yeah. And like, I define a business as like, I'm a launching ebook, ebook launch failed. All right. I'll try something else. Right. But so what happened was I, I was talking about all the stuff I was talking to you now, right. Strategy.\r\n\r\n\r\nNikolas Hulewsky (32:10.672)\r\nInteresting.\r\n\r\n\r\nBrian O'Connor (32:26.892)\r\nAnd then I went and tried to sell strategy to small businesses, right? But small businesses care more about execution and strategy. I don't think they realize how important strategy is because they're kind of fell on deaf ears. Right. And so what I ended up finding out fast forward a bunch of iterations, I ended up finding out that I need to get my foot in the door with taxics. And then once I have them, I can explain to them what the strategy stuff is. they go, interesting. Wait, that's important. I've never thought about this before.\r\n\r\n\r\nNikolas Hulewsky (32:38.343)\r\nThat's true.\r\n\r\n\r\nBrian O'Connor (32:56.738)\r\nRight? marketing tactics have gotten in the door. Marketing strategies will allow me to raise my prices and keep you there.\r\n\r\n\r\nNikolas Hulewsky (33:03.965)\r\nInteresting. And then as you've been going, you found, hey, like it doesn't even matter. I'm putting words in your mouth, but you tell me. It doesn't matter how good my recommendations are. It doesn't matter how good I am. If they don't have the people to actually implement these processes, they're not going to succeed. And that's why you've gone all in on this staffing company. Is that fair?\r\n\r\n\r\nBrian O'Connor (33:12.898)\r\nYeah, cool.\r\n\r\n\r\nBrian O'Connor (33:30.38)\r\nYep. Yep.\r\n\r\n\r\nNikolas Hulewsky (33:32.039)\r\nCan I get meta with you?\r\n\r\n\r\nIt's like Brian O'Connor was on his own product market fit journey.\r\n\r\n\r\nBrian O'Connor (33:39.766)\r\nI I was, it's crazy. It's hard. Yeah. And like, I think the biggest thing that I wasn't prepared for is that like strategy makes sense for big businesses. It doesn't make sense when you're finding product, market and fit, right? Product, market and fit is its own beast. like, was having like the difference between me and my co-founder is my co-founder was an entrepreneur through and through, right? He like,\r\n\r\n\r\nNikolas Hulewsky (33:42.013)\r\nBut seriously, right? Like it's, you're just trying to figure it out.\r\n\r\n\r\nBrian O'Connor (34:09.058)\r\nproduct market fit, sustained, right? Whereas I'm a strategist through and through, right? Like once you hit one to three, right? Then I take over and I'm like, this is my wheelhouse. And so I had this skill gap that I had to like overcome from when I left consulting. So now on how do you take a business from zero, right? To product market fit. and that was like, I didn't know how hard that skill gap would be. You know, I didn't know it was a skill gap.\r\n\r\n\r\nYou know, like, and it's just a different piece. I thought I had it. Yeah. Yeah. I was celebrating before I found cross finish line. Right. And.\r\n\r\n\r\nNikolas Hulewsky (34:39.739)\r\nYeah. Yeah, you thought you had it. You thought you had it in the bag.\r\n\r\n\r\nNikolas Hulewsky (34:50.115)\r\ncelebrate. That's a good analogy.\r\n\r\n\r\nBrian O'Connor (34:55.182)\r\nSo it's harder than I thought and like especially because like... Go ahead, sorry.\r\n\r\n\r\nNikolas Hulewsky (34:57.277)\r\nWhat?\r\n\r\n\r\nNo no, finish it up.\r\n\r\n\r\nBrian O'Connor (35:01.758)\r\nespecially because one of the things I focused on in consulting was so part of strategy is positioning, right? And so remember if you recall back to the choice cascade, right? Where are you going? What markets are you focused on? how will you win? Right. That's kind of your positioning and positioning to me is the intersection of three things, right? Who's your customer? What's their pain? And how do you solve that pain better than anyone? Right. And my belief.\r\n\r\n\r\nis that is a hunt for product market fit. Where it's like, all you do is pull on one of those three levers 100 times until it matches and you go, right? Change your target.\r\n\r\n\r\nNikolas Hulewsky (35:40.971)\r\nAnd then when you go, you go really hard.\r\n\r\n\r\nBrian O'Connor (35:44.45)\r\nYeah, then you like build systems and scale. That's the main thing. It's like pre when you need systems, like pre when you talk to me, it's you're adjusting, slightly tweaking. It's like you're slightly tweaking the customer, right? Then you're slightly tweaking the pain that you're focused on. And then you're slightly tweaking the solution that you do that, right? And then eventually it's like messaging, that positioning, all that kind of stuff, right? But once you can like...\r\n\r\n\r\nfind the right intersection of those three things and message it in a way that the customer sees and goes, holy shit, that makes sense, I need that. Then boom, you're off to the races. And it switches from a finding product market fit demand problem to do you have the systems to actually scale this thing problem.\r\n\r\n\r\nNikolas Hulewsky (36:25.693)\r\nThat's, I see a lot of entrepreneurs run into this problem. I'm wondering your opinion on this is they get to the point where they've iterated. They've pulled the levers enough where they've gotten product market fit, but they just can't stop tinkering. Like there comes a certain point where you get product market fit and you see, we're growing. And then you kind of stop tinkering with the offering. And you, like you said, you build systems around it. You throw gasoline on the fire so that you can really scale. But some owners, some bit, you know,\r\n\r\n\r\nentrepreneurs, they love the tinkering. So even when they've got something that's like, no, you've got a winning bid here, double down, put money into it. They're like, no, but I could make it better. No, our open rate is still not where it needs to be. our conversion rate is still not, we could still do this better, right? Like it's a really hard balance, but that's where I see a lot of entrepreneurs make a mistake. I'm wondering, do you see that ever?\r\n\r\n\r\nBrian O'Connor (37:16.962)\r\nYeah, I mean, I think that's just not prioritizing the right initiatives. like, what I mean by that is if you're tinkering with the open rates, when the real constraint on your business is like, we can't deliver that much, right? Like, let's say you have a, you found product market fit, not even flood, you have a hundred clients, we're just begging to, right? In this imaginary world, you have a hundred clients are just begging for your offer, right? At that point, the constraint in your business is no longer the...\r\n\r\n\r\nLike I think of the, there's two parts to the business, right? One is like the delivery engine, you know, there's the app, the, I'm sorry. When's the acquisition engine, you know, there's a delivery engine, right? If you're tinkering on your open rates, when the delivery engine is a constraint in your business, like you just haven't prioritized correctly. You know I mean? And so like,\r\n\r\n\r\nNikolas Hulewsky (37:52.71)\r\nengineer.\r\n\r\n\r\nNikolas Hulewsky (38:03.101)\r\nYeah, and it's because I mean that it's that old adage, right? Like when you're a hammer, everything looks like nail. And when your business gets to a spot where it's like, the delivery is the delivery piece of it isn't working. Well, it's like, I'm not good at that. I'm just going to continue to focus on the thing I'm good at, which is the customer acquisition. Lots of people kind of fall into that. Let me, I want to ask you this question. So you named three things that make a product market fit, which is who's your ideal customer? What's the problem you solve? How do you do it better than anybody else?\r\n\r\n\r\nBrian O'Connor (38:20.878)\r\nCorrect.\r\n\r\n\r\nNikolas Hulewsky (38:33.841)\r\nI'm wondering though, should there be a fourth where it's like, can you make money at this? Like that seems that feels to me like an important thing. Cause when do you know that you have product market fit? Do you know at a hundred thousand dollars a month? Yeah, I have customers and I'm solving a problem and I'm doing it better than other people, right? At this point. But maybe the market's not big enough to support a real business. that make sense what I'm asking? So like, how do you think about knowing\r\n\r\n\r\nBrian O'Connor (38:40.428)\r\nThe Mods-ish.\r\n\r\n\r\nNikolas Hulewsky (39:03.293)\r\nwhen you have product market fit versus when you're still figuring it out? Is there a framework you have for thinking about that?\r\n\r\n\r\nBrian O'Connor (39:12.133)\r\nWell, I would actually separate those few, right? Because I think positioning is one part of product market fit, right? I tend to focus on positioning just because I understand the world better. I think what you're referencing is business model, right? So if I define product market fit, everyone's got a different definition of product market fit. It's that elusive word. But I think of it as when your offer has just insane demand.\r\n\r\n\r\nRight. When there's just so much demand, can't fulfill it. Um, and so like, I think it, I separate the, how your offer is so good that you get so much demand from, you actually capture a percent of the value you create? Right. That's your business model. Like you can have crazy product market fit, but even a bad business model, it's a bad business. You still have product market fit though, but it's a, it's a bad business idea. Um,\r\n\r\n\r\nNikolas Hulewsky (40:03.545)\r\nOkay, so for you, the monetary piece of it doesn't really fit into how you define product market fit.\r\n\r\n\r\nBrian O'Connor (40:11.032)\r\nCorrect. Yeah, that's how I think about it. I mean, it's important. I'm not actually trying to avoid that because then you don't make any money. But I see it as a separate exercise.\r\n\r\n\r\nNikolas Hulewsky (40:21.479)\r\nFor you, it's like, okay, the monetization piece is figure-outable. What's not figure-outable is like, if you have something that people don't want, that's not figure-outable. It's like people don't want that. So you got to change something within your product.\r\n\r\n\r\nBrian O'Connor (40:36.334)\r\nCorrect. Yeah, and that's always changing. I'm changing my offer as we speak, right?\r\n\r\n\r\nNikolas Hulewsky (40:41.309)\r\nWhat do you mean? How are you changing it?\r\n\r\n\r\nBrian O'Connor (40:47.502)\r\nSo there's two parts that I'm thinking through. So I have two offers, right? So one is, compared to other talent agencies, like I'm ecstatic with how we structured ours, right? Like most talent agencies, if you're like, hey, I need a customer service rep, I need an account manager, I need a graphic designer, et cetera, they'll charge you, on average, 20 to 30 % of the total compensation, right? It's gonna be like, okay, for the search, right?\r\n\r\n\r\nbut the same time, incentives are weird because then I'm incentivized to find you the most expensive person on the best person. Right. and so we two options, two offers. One is flat fee, right? Instead of the percent of salary, we just charge a 4k search fee. Right. and the reason I'm sad about that is cause it's not just the search. Like we also do, that advisory, like the advisory stuff we were just talking about with like, Hey, are you making the right business decision? or like.\r\n\r\n\r\nWe help you design and advise you on the rules, right? And so you basically get consulting with this search because I'm a huge fan of like, uh, one thing that we want to do is have reoccurring revenue, right? Not where like basically like I placed one talent. You have such a good experience to come back for more. Um, I think like 90 to 95 % of our clients have one placement and they come back and they just keep buying more. had one today put in their 15th placement, right? Um,\r\n\r\n\r\nNikolas Hulewsky (42:11.933)\r\nDang, that's awesome, man.\r\n\r\n\r\nBrian O'Connor (42:13.366)\r\nYeah, so super happy about how about that from that perspective. So we have the flat search feed, but then we also have the volume play, right? And the volume play is basically like, hey, if you're going to do more than three hires in a year, we'll give you a package. It's basically a thousand dollars a month. And that gives you five credits to the place for the year. Right. What we're tinkering with now is\r\n\r\n\r\nNikolas Hulewsky (42:35.837)\r\nMm.\r\n\r\n\r\nBrian O'Connor (42:41.898)\r\nis it works and clients love it. But behind closed doors, I don't think it's the right pricing model. Yeah. And the reason I don't think it's the right pricing model is because what happened is if I were to give you, in my head, it's a membership, right? Where it's like you pay monthly. If I were to give you that membership option,\r\n\r\n\r\nmost of our clients use all five credits in like a month to two months. And so what that means is that all the value from that membership is generated in the first two months and then the whole rest of the year, you don't get value unless you buy another membership, which most people do. Most people are on like two, three, four memberships, right? And so because of there's a difference between payments and value, I...\r\n\r\n\r\nAnd I thought with the membership, actually think it's more of a financing.\r\n\r\n\r\nAnd I'm not getting paid for financing. So I'm just doing financing with a shitty bank.\r\n\r\n\r\nSo, what was it?\r\n\r\n\r\nNikolas Hulewsky (43:49.307)\r\nWell, I think what's interesting about what you've described though is that, because you talk about in the positioning, what do you do better than anybody else? That last piece, like the advisory piece of helping somebody understand what they need. Many business owners know they need something. Like I'm too busy, I'm doing too much work. But what is that position that they need? And how does it look? And what are their duties? And what are their responsibilities, right? Before you even put up the job posting, that's like\r\n\r\n\r\nBrian O'Connor (44:12.334)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (44:17.981)\r\nPutting it up on LinkedIn or putting it up on Indeed, that's not the hard part. It's crafting the job posting. It's being clear and specific about who's doing what, what the responsibilities and expectations are, et cetera. So I think your company offering that is really, I think that's a really cool value proposition.\r\n\r\n\r\nBrian O'Connor (44:34.038)\r\nYeah, because I look most recruiting firms will just like connect you and they're done. Right. I believe that if I can like give the talent the best likelihood of success, you'll grow and when you grow, you need more. And so I'm so incentivized to help you grow because you come back and get more. And so what we do is we've realized the mistakes where people make the most mistakes in terms of their systems, their hiring, et cetera. They shoot themselves in the foot and they don't grow. And then we don't get another\r\n\r\n\r\na recurring customer, right? And so what we do is we hop on a kickoff call. And as part of kickoff call, we go through the mistakes most people make, you know, when they're managing talent, when they're onboarding talent, they're hiring talent, that just gives them a lot of friction means their business slows the results on what they want. And they don't come back for more. And so I'm able to help them.\r\n\r\n\r\nNikolas Hulewsky (45:28.049)\r\nMan, the cool thing I like about this story is that obviously you're passionate about the question cascade. And we were able to walk through like a real example of how you did it in your own business, right? Like how did you think about positioning? How did you think about what you do better than anybody else? And you've actually launched, like you have a real business that you've launched this around that's doing well. It's freaking cool.\r\n\r\n\r\nBrian O'Connor (45:53.304)\r\nYeah, no, it's exciting. mean, definitely I think the advisory consulting, making sure you have a good business is definitely our advantage because of the background. And so like we want to embed that deeply in the business to make sure anyone works with us, like is more likely to have business that grows than like their talent is actually used in a way that gets the most out of everyone. They don't have to like get frustrated by lack of communication, lack of like not doing the right tasks and actually help the business grow.\r\n\r\n\r\nNikolas Hulewsky (46:20.669)\r\nCool. All right, I'm going to end it right here.",
  "metadata": {
    "duration": "",
    "date": "2025-03-17",
    "platform_source": "Google Drive"
  }
}