{
  "episode_number": "141",
  "episode_title": "AI SERIES: 1 - How to Prepare Your Business for the AI-Powered Future with Amanda Orson",
  "guest_name": "Amanda Orson",
  "business_name": "Galleon",
  "transcript": "﻿Nikolas Hulewsky (31:04.331)\r\nSeed strapping. Go on. I don't know that I've ever heard that.\r\n\r\n\r\nAmanda Orson (31:08.342)\r\nSo seed strapping is basically taking outside capital once. In our case, it's because we came with a team. That's why we took capital at all. We came with an embedded team that had all worked together at a different company for about three years beforehand. So that was a heavy payroll load for lack of better way to describe it. We needed to have outside capital to give us runway. Seed strapping is basically take outside capital to get your initial product off the ground and to get to revenue and then use rapid revenue reinvestment.\r\n\r\n\r\nNikolas Hulewsky (31:14.785)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (31:23.873)\r\nYeah.\r\n\r\n\r\nAmanda Orson (31:36.866)\r\nto accelerate your growth and preserve optionality and for the founders to preserve as much of the valuation as you possibly can.\r\n\r\n\r\nNikolas Hulewsky (31:42.263)\r\nequity. Okay, so that was the point of launching Navigator. now you can start generating revenue.\r\n\r\n\r\nAmanda Orson (31:50.446)\r\nYeah. I mean, between Navigator and the B2B directory, we should be very fine. I think this is probably something that if we had been a year later, we probably would not have had to raise capital at all because the difference between 2023 and today, 2023, we were still coding almost everything manually with complement. And now I would say something like 50 to 60 % of our code, maybe more than that, is completely AI generated. Yeah.\r\n\r\n\r\nNikolas Hulewsky (32:17.803)\r\nYeah, that's what I was going to ask is like, AI allowed you to run more lean?\r\n\r\n\r\nAmanda Orson (32:20.782)\r\nCorrect. Yeah, I don't anticipate ever needing to have more than, I don't know, Wildest Dreams 50 employees, but probably closer to 20.\r\n\r\n\r\nNikolas Hulewsky (32:33.247)\r\nWow, that's pretty awesome. Because a lot of these companies in the past, they needed the capital not not just to go acquire customers, right, but they had to pay for the infrastructure. And they were like, Okay, well, once we get to 100 million users, that's our break even. It's like, well, geez, Louise, you're burning cash operating and you're burning cash, acquiring customers, and then at 100 million, you're like figuring out the economics, but you're saying you could be cash flow positive. Now, are you cash flow positive now? Are you like, on your\r\n\r\n\r\nAmanda Orson (33:00.258)\r\nWe're right on the bubble. I would say right now there is a company being born or already exists, so it be the first single person unicorn, like billion dollar evaluation company. That's already happening. I'm confident of it. The amount of work that I can get done with operator, just ChatGPT's operator, which I know that you created great content for, is probably replacing two or three human beings. like, no, no, go ahead.\r\n\r\n\r\nNikolas Hulewsky (33:26.679)\r\nDo you, sorry. No, no, no, no, you go,\r\n\r\n\r\nAmanda Orson (33:30.294)\r\nI was going to say, play that out. That's today. Imagine how much more efficient and how much better and more robust that tool becomes in six months or a year. The rate of acceleration is crazy.\r\n\r\n\r\nNikolas Hulewsky (33:40.011)\r\nTell me what's your current revenue? MRR, is that how you're measuring it? Okay, 60K, that's fantastic. When did you launch Navigator?\r\n\r\n\r\nAmanda Orson (33:44.31)\r\nSo our 60, yeah, 60K.\r\n\r\n\r\nfour weeks ago.\r\n\r\n\r\nNikolas Hulewsky (33:52.855)\r\nWow, 60,000 in MRR in four weeks?\r\n\r\n\r\nAmanda Orson (33:56.29)\r\nYeah, B2B too. Like we have B2B on the other side of it.\r\n\r\n\r\nNikolas Hulewsky (33:59.712)\r\nWas it because of the relationships you already had? I mean, maybe I'm stupid. just feel like 60 grand MRR is a lot in four weeks.\r\n\r\n\r\nAmanda Orson (34:01.752)\r\nYeah. Yeah, I'm.\r\n\r\n\r\nAmanda Orson (34:07.47)\r\nSo we already had some business relationships, but also I'm not coming into this completely cold. Like I have to be honest that I'm at this point, I have a network, I kind of know who I'm going to call. I'm not figuring all of this out for the first time. So it's a bit of an unfair advantage, but if you have that, you can go really fast.\r\n\r\n\r\nNikolas Hulewsky (34:19.724)\r\nYou it.\r\n\r\n\r\nNikolas Hulewsky (34:24.699)\r\nYeah, I mean, that's, that's the whole game is find your unfair advantage and just hammer it home every single time. You know what mean? Okay, I want to talk to you about operator because I've used operator a ton. I don't use it a ton anymore. Because it's, for me, it's not practical yet. I have to sit. Let me set a little context for those who don't know. chat tbt has this thing called operator. It's the first iteration of what agents will become. And it's not just\r\n\r\n\r\nAmanda Orson (34:29.74)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (34:51.817)\r\nYou asking it a question and then it responding to you. It's you telling it to perform a task or function and then it going and executing on that. The problem with operator is like I have to keep the tab open. I have to be there. It moves slower than a human, so I haven't been using it. Are you actually using it for things?\r\n\r\n\r\nAmanda Orson (35:08.354)\r\nYeah, I'm using it to prove concept before I actually deploy automation against it. So yesterday or the day before, I was saying something like you should test everything manually before actually investing in building that out. So a good example of that is understanding, can you use operator to capture all of the details about a business category in a geography? It's a good example of that. And if operator can do it, then you can infer that a script can probably do it even better. So it's a really good.\r\n\r\n\r\nNikolas Hulewsky (35:11.937)\r\nWhat does that mean?\r\n\r\n\r\nAmanda Orson (35:38.126)\r\nLike back of the napkin is my best analogy, like back of the napkin way to figure out whether or not something is automatable and then develop a script and then actually automate it.\r\n\r\n\r\nNikolas Hulewsky (35:47.927)\r\nthat's okay. So it's like a proof of concept for you. That's a really cool. That's a very, very, very freaking interesting framework. Chris and I were talking about this yesterday, we record our podcasts on Thursdays. And I was saying, I feel like right now operator, or even the way people are talking about agents, they're just they're calling RPA agents, robotic process automation, where, where it's like, okay, you're just being very specific with telling it exactly where to go agents aren't really here yet. I'm not downplaying agents, I think agents are going be amazing.\r\n\r\n\r\nAmanda Orson (36:07.566)\r\nYeah, I would agree with that.\r\n\r\n\r\nNikolas Hulewsky (36:18.059)\r\nBut what you just described was, yeah, I'm using operator quickly to validate whether or not I could implement a remote process, you know, automation or robotic process automation. So that that makes total freaking sense to me. I'm using deep research a ton. That to me is an agent because I'm like, go out, hear the databases that I want you to scrape and look at for this question that I have. This is the format I want you to put it in. Once you're done, this is the table and this is the information I ultimately want you to derive. And then it gives me, you know, whatever.\r\n\r\n\r\n10 page report on on what I asked it. So like that to me is more of a more agentic than what operators doing but\r\n\r\n\r\nAmanda Orson (36:55.214)\r\nI agree. I would say the big, so deep research, no question has just eliminated a host of analyst roles everywhere. I, when I first added a bunch of marketing information, like analytics tools, analytics outputs into that and got the best like response I have ever gotten from any analyst at any company I have ever worked with or ever hired as an outside vendor.\r\n\r\n\r\nNikolas Hulewsky (37:04.065)\r\nMm-hmm.\r\n\r\n\r\nAmanda Orson (37:23.948)\r\nI was like, wow, analysts are screwed. They're just, there's no room for them anymore. So I would say, yeah, deep research. If you want to take really large, meaty data sets and understand like what the wheat from chaff is, or if you want to get some kind of insight that you might have missed is great. I'm still having a problem though with the white space. I still have to be very directive about what it is I'm looking for. And sometimes you don't know when you're looking at your own data, the\r\n\r\n\r\nNikolas Hulewsky (37:25.751)\r\nThat's insane.\r\n\r\n\r\nNikolas Hulewsky (37:49.401)\r\nyeah.\r\n\r\n\r\nAmanda Orson (37:53.57)\r\nbest insights are always the thing you were not expecting to find. That white space is still what I'm struggling with. I want to see AI kind of come in and offer up more and more overlooked insights or flag anomalies to me.\r\n\r\n\r\nNikolas Hulewsky (38:05.919)\r\nYeah, I was. So first of all, I love diving into this is not where I thought we were going to go with this conversation. But for people who are listening, I freaking love the framework of you using operator to validate whether or not you could automate something. I think that's genius, right? Because operators not there yet from an agent's perspective, but to validate whether or not you could actually run a script to automate something, whether it's, I want to generate leads, could I go and scrape this website and then put it into a database and then use that to, know, anyways, I think that's\r\n\r\n\r\npeople should take that away from this, if nothing else.\r\n\r\n\r\nAmanda Orson (38:36.972)\r\nand then figure out where it's blocked and figure out if you can unblock it. And all of the magic is on the other side of solving that problem.\r\n\r\n\r\nNikolas Hulewsky (38:39.583)\r\nYeah. Yeah, exactly. Deep research, I talk about this frequently now, I think of AI as you need to think, I think people need to think of AI as another employee. And, and many times we're like, AI is just going to figure it out. But that's not the case. Like think about when you hire an employee, you've got to onboard them, you got to train them, you've got to check in with them, you got to figure out whether or not they understand what they're supposed to be doing. It takes some time to get them up to speed. But\r\n\r\n\r\nThen you have this whole cost of payroll that's every single month. There's a significant amount of overhead, but you need to do the same thing with AI. You need to be training it and be very clear and specific with what your asks are. And so my prompts now are like very long. I try to add as much context context as possible because of what you're saying is I want it to give me the insights that I want. I don't want it to just, you know, give me some random insights. So I am trying a lot more to be very directive.\r\n\r\n\r\nand broad with the context I'm providing in the prompts.\r\n\r\n\r\nAmanda Orson (39:42.72)\r\nare using AI to help you create those prompts. Yeah. That's the cheat code right there.\r\n\r\n\r\nNikolas Hulewsky (39:46.187)\r\nI am actually. And I've started, I've started using, you use chat GBT, assuming.\r\n\r\n\r\nAmanda Orson (39:54.22)\r\nI use every, there is nothing that I don't use. But I use different ones for different purposes.\r\n\r\n\r\nNikolas Hulewsky (39:59.819)\r\nTell me. Okay, so tell me the different purposes.\r\n\r\n\r\nAmanda Orson (40:02.615)\r\nSo if I want to avoid emojis, no, I'm kidding. I think the deep.\r\n\r\n\r\nNikolas Hulewsky (40:05.815)\r\nThat's so true. What is it with the emojis on chat tbt man it's\r\n\r\n\r\nAmanda Orson (40:10.062)\r\nI don't know. I'm like, this is my space. What's happening?\r\n\r\n\r\nNikolas Hulewsky (40:15.455)\r\nI don't get who what engineer was like. Yeah, yeah, add more emojis. That's what we need in these answers. People will think that AGI has been achieved once we give up put emojis in these responses.\r\n\r\n\r\nAmanda Orson (40:25.174)\r\nIt's a good flag to figure out who's tweeting via chat GPT. I would say Claude is in my opinion, the better discernment tool outside of deep research, deep research. Like if I'm trying to do anything that requires the population of an artifact, like a database or a diagram or something like that, Claude is, is superior.\r\n\r\n\r\nNikolas Hulewsky (40:28.031)\r\nI know man, I know.\r\n\r\n\r\nNikolas Hulewsky (40:37.665)\r\nWhat do mean discernment?\r\n\r\n\r\nAmanda Orson (40:54.104)\r\nThe limitations on Claude and why I would go to chat GPT are basically two. One is that you hit your message limit really quickly. And then I often hit my day limit really quickly with Claude.\r\n\r\n\r\nNikolas Hulewsky (41:07.513)\r\nmy gosh, I've never hit. with Claude. Okay, I thought you were talking about chat GBT. was like, wow. my gosh.\r\n\r\n\r\nAmanda Orson (41:10.038)\r\nYeah, no, no, with Claude, I hit both of those two things really quickly. I find their projects though are much tighter and much better. So if you run projects in Claude, that's a much more native experience. ChatGPT is not there yet. Yeah, so I have ones for, like for example, just for traction and customer distribution, where I have populated over time and that update on a regular basis, the context for where we are, where we want to go.\r\n\r\n\r\nNikolas Hulewsky (41:20.299)\r\nI do. Can you tell me what a can you tell me what a project is in cloud?\r\n\r\n\r\nAmanda Orson (41:39.5)\r\nwhat the data points look like today, like this week or today from various marketing campaigns or marketing efforts that we have out in market. Who I think my customer avatar is, where that person is on the web, what the segmentation analysis says, that sort of thing. Like it's a running conversation against just these things. I had one where we were deep diving into product research. So I literally had read.ai on every single one of those interviews as I was trying to understand how to build this product out.\r\n\r\n\r\nNikolas Hulewsky (41:53.601)\r\ninteresting.\r\n\r\n\r\nAmanda Orson (42:06.306)\r\nthen took the transcripts from those interviews as .txt and then uploaded that into Claude as a project. And then as I'm going through and iterating and thinking about different features or the prioritization of different features, I'm literally just having Claude go backward and kind of re-look through all of the project or all the product interview notes and then assess whether or not that was something that came up. Like, there are so many use cases. No.\r\n\r\n\r\nNikolas Hulewsky (42:27.969)\r\nmight do you have a hard stop? I might turn this into two podcast episodes because I love Jesus awesome. So I went through a negotiation recently. And literally, I thought, you know what, I'm gonna help I'm gonna have jet chat GPT do my negotiation. And so like, all their responses I put into it. Before I put their responses in, I was like, this is the context, I just gave it everything I uploaded, like email chains, I gave it the contracts, like everything.\r\n\r\n\r\nAnd then I was like, here's their response. What should I say? And then I didn't just take it at face value. was like, I don't really like this. I like this. Like literally it's my assistant that I'm collaborating with, right? It totally. And that has been so valuable for me. I don't just take like the first response and be like, this is a dumb response. Like, no, there's okay. There's a little nugget here. What could we work? And so that chain that you're calling it a project, but that chain has been super valuable. Cause I just go back to it every time that there was an update in the conversations.\r\n\r\n\r\nAmanda Orson (43:05.09)\r\nYeah, it's my thought partner.\r\n\r\n\r\nAmanda Orson (43:25.976)\r\nSo that is, if you just took those individual things and populated them into a project, that's a way to tap it on a more permanent basis and then update parts of the context where if it's just one chat or just one chain in Claude, you will hit that message limit pretty quickly.\r\n\r\n\r\nNikolas Hulewsky (43:43.091)\r\nOK, so what's the difference between a project in Claude and like a GPT? In chat GPT so you can build custom GPTs in chat GPT and you give a context and you tell it this is how I want you to act. This is your specialty. These are the responses I want you to give etc. It sounds like it might be similar to what a project is in Claude or is it different?\r\n\r\n\r\nAmanda Orson (44:02.88)\r\nIt's, it is similar. I will say the quality of the responses I tend to get are better in Claude with the one exception. If I need it to tap real time information by crawling the web because Claude obviously does not do that. So that is a very good use case for chat GPT or honestly, even perplexity. So one of the things that I frequently do is if I know that I have to tap something that is live or has been updated more recently than whenever Anthropic last updated Claude April or something of last year.\r\n\r\n\r\nNikolas Hulewsky (44:14.967)\r\nMmmmm.\r\n\r\n\r\nAmanda Orson (44:31.722)\r\nThen I go and I actually grab the information from perplexity and then it will take the content of that and then pre-populate it back into some conversation that I'm having with Claude.\r\n\r\n\r\nNikolas Hulewsky (44:40.983)\r\nI've heard that there are tools now that allow you to aggregate those interfaces. So it's like, you can ask it a question and flip between the models. So it's like, you don't have to go to a different tab. I haven't used it though.\r\n\r\n\r\nAmanda Orson (44:51.586)\r\nhave. I saw that on Twitter earlier this week. That's really cool. I like it. I think that that's a good idea. And I think that at the end of the day, these become utilities. Like this is electricity today. And we're just in, know, Thomas Edison is lighting up New York City timeframe. We're not even close to where this becomes really ubiquitous and well used by everybody.\r\n\r\n\r\nNikolas Hulewsky (45:03.105)\r\nI agree.\r\n\r\n\r\nNikolas Hulewsky (45:15.199)\r\nWell, what I so anybody who's listening that is either early entrepreneur by yourself or you want to become an entrepreneur. To me, your thought partner becomes these LLMs. I'm not saying they're perfect. I'm not saying, you know, that they're the end all be all, but you don't have anybody else to bounce your ideas off of. I have somebody who I know that's like I'm trying to figure out product market fit. And they're using chat to be like, hey, what do you think of this? that's interesting insight. And they're just having somebody to bounce ideas off.\r\n\r\n\r\nAmanda Orson (45:25.87)\r\n100%.\r\n\r\n\r\nAmanda Orson (45:32.814)\r\nMmm.\r\n\r\n\r\nAmanda Orson (45:43.298)\r\nI'm going give you a cheat code. You can make almost anybody your thought partner. So one of my very favorite, I'm a nerd and I read a lot. And when I'm not reading, I'm probably listening to a podcast about books. One of my very favorite things is to take distillations of books or interviews or transcripts, and then populate that into a project. So I literally act as if.\r\n\r\n\r\nNikolas Hulewsky (45:44.799)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (45:57.819)\r\nI like where you're going with this.\r\n\r\n\r\nAmanda Orson (46:13.646)\r\nRandom entrepreneur, like imagine if you're Steve Jobs being able to talk to Edwin Land, who was his inspiration, that's the guy that invented Polaroid for anybody that isn't aware. Imagine using Edwin Land as your thought partner. That's basically what I'm doing in chat GP, or excuse me, in Claude projects right now is I have a few people that I've admired, the businesses that they've built over time. And I have mass transcripts, distillations, quotes, you name it.\r\n\r\n\r\nthat populate this project. And then when I'm stuck, I want to think about it like, you know, famous industrialist of the past has thought about this problem because it was truly greenfield for them then. Or I want to think about it like Steve Wozniak is my technical co-founder. If you don't have a founder, like a co-founder that you can actually have a thought partner with, not only can you use AI to thought partner with you with its broad knowledge, but you can also have very specific and refined knowledge by populating the context.\r\n\r\n\r\nNikolas Hulewsky (46:51.959)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (47:10.743)\r\nI freaking love that. my gosh, that is so good. How do you do it? Because the context window is only so large. When you say distillation, okay, walk me through it. Let's say Elon Musk. I love Elon Musk, whatever. Okay, how did you do it? How'd you do it?\r\n\r\n\r\nAmanda Orson (47:26.444)\r\nI have one of those. can tell you exactly how I do it. A lot of transcripts and then reduce it to its lowest, literally mechanically its lowest file size, lowest file type. So I call a lot of the information that isn't necessary, like isn't relevant to what I need it to do. I literally ran it through AI to say like remove all of the information, like the prologue, the introduction, all that stuff. I just want to hear the sound bites and that I have all the sound bites in a dot text file.\r\n\r\n\r\nNikolas Hulewsky (47:37.635)\r\nNikolas Hulewsky (47:41.655)\r\nHow? How did you do that?\r\n\r\n\r\nAmanda Orson (47:54.414)\r\non some topic that he has talked about. Call it his thought process on product market fit or his thought process on overcoming a setback, something like that. And then I will literally upload that as a .txt file because it's about as low as you can possibly go. And that's part of the project.\r\n\r\n\r\nNikolas Hulewsky (47:56.951)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (48:13.855)\r\nI think this part's really interesting because I love data. I freaking love data. But before you can get to, run an algorithm against this data and tell me what the variables are that actually affect the outcomes the most, you have to have the proper data set. So there's a lot of cleaning of the data before you even get to the place where you can perform the analysis because it's coming from different places or it's spelled differently or ones in a dot text file, ones in a CSV, ones in a Excel file, ones in Word and PDF or whatever. You've got to aggregate all of this data.\r\n\r\n\r\nto get it clean and then you can perform the analysis. And that's one thing that I've been using AI for is help me clean this data. Do you do the same? Yeah.\r\n\r\n\r\nAmanda Orson (48:50.252)\r\nYeah. Absolutely. Yes. Yep. I'll have, like OCR is a great application. Optical. What is the C? And it reads documents and yeah, takes the text out. So don't quote any of us on what OCR stands for, optical something, but don't upload PDFs. It's a really big file size, especially if it has images in it. Just grab the text. Like, so from a dab and normalization standpoint, one, you want to remove redundancy. That's a really easy thing that you can have AI do.\r\n\r\n\r\nNikolas Hulewsky (48:58.485)\r\nI don't know what it is, but it basically takes a PDF. Yep, it can read documents.\r\n\r\n\r\nAmanda Orson (49:19.054)\r\nTwo, you want to have the text. don't want to have all of the images and all of the other copyright data or nonsense. You just want the text. And then you want to take all of that data, make sure that it is in its lowest mechanical file size type, and capture as much as interests you. And I would say even it's important to think about things that you don't think are interesting today that might be interesting to you 10 steps ahead. Because a lot of the magic is in understanding the journey and\r\n\r\n\r\nA lot of people are not self-aware when they're in it, but they're reflective, like coming back into imagining that scenario.\r\n\r\n\r\nNikolas Hulewsky (49:54.389)\r\nWell, and people think that it's a waste of time. I mean, I feel this way where I'm like, gosh, I'm wasting time cleaning the data or I'm wasting time having chat GPT put it in a format that allows me to then put it into a custom GPT or a project and Claude. And it's hard sometimes to overcome that. But what you have to remember is there will be a moment in time where you're dealing with a problem. And I've had this already in the last year. And the problem is 10s of 1000s, hundreds of 1000s million, could be whatever the number is. And you get a specific insight because you prepared\r\n\r\n\r\nYou put all that information into the system. You ask a question and gives you an answer and you're like, wow, yeah, that was staring me in the face. Great answer and I can move forward. That will save you so much more time than the prep of putting things together, but people should spend some time and curate essentially these AIs to help them when they when they're in need of these answers.\r\n\r\n\r\nAmanda Orson (50:43.35)\r\nAbsolutely. And I would say we knew that even before we had AI as a tool. Like a good example from a marketing analytics standpoint is if you aren't really good about understanding how your application, whether it's web or a mobile application is tagged to fire events into your backward analytics tool. Say on iOS, have a capital case is how you tag your events. And on Android, somebody does it in lowercase. Well, then you end up with a data set that\r\n\r\n\r\nis broken and you can make completely bad business decisions with high confidence because you're only seeing 50 % of the data. So data veracity is really, really important. You want to make sure that you've actually done the homework upfront, not only because you'll get better insights, but you'll also save yourself from making terrible mistakes.\r\n\r\n\r\nNikolas Hulewsky (51:31.127)\r\nHow do you organize your data? Sorry, not your data. How do you organize Claude, ChatTPT? Because I have tons of chats, right? There's tons of conversations. I've started using the folders on ChatTPT to just get myself more organized. But do you have a system? How do you keep things straight?\r\n\r\n\r\nAmanda Orson (51:53.196)\r\nI would say for a chat GPT, and this is another advantage for people that haven't used both, chat GPT will understand more contextual relevance from you throughout all of your chats. Then Claude will, Claude is very like that chat specific or that project specific.\r\n\r\n\r\nNikolas Hulewsky (52:08.395)\r\nWhat and what what Amanda saying right there is like chat GPT will understand your preferences. It's like, I know Nick. Yeah, based on your question, this is kind of where I would give the response. Yeah.\r\n\r\n\r\nAmanda Orson (52:13.475)\r\nYes.\r\n\r\n\r\nAmanda Orson (52:19.214)\r\nCorrect. so, you know, chat GPT will know both that I wanted ideas for my niece's birthday and also that I was talking to it about Galleon for some very specific context where Claude can't see all of that. so I would say for Claude, I heavily use projects. really, really, really recommend them, especially if you are somebody that hoards a lot of data. Like it's just a game changer on chat GPT. I also have projects. I haven't found them to be as tight and self-referential because it does have the ability to.\r\n\r\n\r\nNikolas Hulewsky (52:27.511)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (52:40.65)\r\nHmm.\r\n\r\n\r\nAmanda Orson (52:48.974)\r\npull things from the web. And that's both a benefit and a hindrance depending on the context, because sometimes you don't want it to be inventive. And I say there's probably a 50 % overlap in those projects, but it's not 100%.\r\n\r\n\r\nNikolas Hulewsky (53:03.319)\r\nThat's a good point. Back to the chain that I have of this contract negotiation. I've had to re-upload the contract a few times just to remind it like, you know, these are the points of the contract. Because you get so far down it, it's just not able to keep, I don't know, that in its head, all that context in its head for that long of a period of time. So it sounds like you kind of use, well, this is my summary. Chat TVT is like the new Google, asking it questions, getting ideas.\r\n\r\n\r\nBut you're using cloud to work. It's like, all right, Claude, you're my thought partner and actually specific data sets, specific projects that I'm working on.\r\n\r\n\r\nAmanda Orson (53:40.932)\r\nyeah. Yeah. Like this morning I had, I've actually had a running conversation with Claude in a project and I had it spit me out like a sales forecast based on individual product type and also its implication for MRR over time. And it created a completely dynamic chart. Yeah. The artifacts on Claude are fantastic. The output that I sent to you via DM. So I walked Nick through.\r\n\r\n\r\nNikolas Hulewsky (54:03.649)\r\nfreaking\r\n\r\n\r\nAmanda Orson (54:09.932)\r\nmy own house sale. So we didn't even say this, but I sold my own house using Galleon. And that was part of my understanding of kind of where he was and why seller finance worked for me. And I preferred seller finance to renting because it's about the same yield in my particular market. And then I also don't have to deal with clearing snow and fixing toilets and all that stuff that comes with being a landlord, which I prefer. So the forecast that I sent to you was actually an artifact from Claude.\r\n\r\n\r\nI had literally prompted it and I was like, look, here are the deal terms. Here's the period. Here's the interest rate. Show me like the forecast for yield in a five, 10, you know, an amortization chart. And it populated it with one prompt.\r\n\r\n\r\nNikolas Hulewsky (54:52.151)\r\nWell, it's cool because it allows you to be helpful to people without like I would have taken you an hour or whatever, maybe not an hour, but to put all that information together just specifically for me. Instead, you go to it's still the same information. It's still as insightful. It's still thoughtful, but it takes a fraction of the time.\r\n\r\n\r\nAmanda Orson (54:58.744)\r\nYeah.\r\n\r\n\r\nAmanda Orson (55:08.11)\r\nCorrect? And this is my bull case for why I just don't think most of the things that we do in our lives are going to continue to involve manual processes that include humans. Like it just doesn't, it doesn't make any sense at all. The whole world is moving in this direction. We're just trying to make sure that we are the largest and have the best data and the best network on all sides of this transaction so that we are the kings of this new category being created.\r\n\r\n\r\nNikolas Hulewsky (55:35.639)\r\nOkay, so I like a couple of the frameworks that you gave me. One of the frameworks was using operator to validate whether or not you could automate something. I think that's genius. Another framework that I'm getting from you is using ChatGPT as a creative thought partner to think through problems, but using Claude as your workhorse to, yeah. Any other frameworks that you use with AI that you haven't talked about that you're obsessed with?\r\n\r\n\r\nAmanda Orson (55:55.372)\r\nYep, I would say that's true.\r\n\r\n\r\nAmanda Orson (56:05.752)\r\nconstantly using what I would call meta prompts. I'm constantly referring it to become self-referential and ask me where I might employ more artificial intelligence across my business.\r\n\r\n\r\nNikolas Hulewsky (56:18.921)\r\nOkay, keep going. Give me an example of that.\r\n\r\n\r\nAmanda Orson (56:23.412)\r\nSo a meta prompt is like here, like here's what I'm doing. Here's the background context. Now, if I wanted to use AI for 5 % more of these inefficient operations, how could I employ you to do that? And it's not normally the first, but normally as you like pull at that thread, second, third, fourth insights, the...\r\n\r\n\r\nNikolas Hulewsky (56:38.55)\r\nHmm\r\n\r\n\r\nAmanda Orson (56:47.062)\r\nartificial intelligence tools are self-aware of like their own inputs and capabilities and things that you might not even realize are opportunities with that. So constantly using and refreshing and using meta prompts to understand what other capabilities you might be able to pull out. Or if you have like a new area of the business that you're looking to expand is really helpful. I wouldn't say that I'm an AI expert, but I would say that I spend enough time that I spend enough time and I prompt AI about itself often enough that I stay at the pointy end of the spear.\r\n\r\n\r\nNikolas Hulewsky (57:16.311)\r\nOkay, I have three things. One is a recommendation. The other two are questions. So the first recommendation is have you, it's not great, but have you ever done, it's not speech to text, but ChatTPT has a voice UI that you can, I don't know what else to call it, but you can speak to it.\r\n\r\n\r\nAmanda Orson (57:35.874)\r\nYeah, I would say I spend probably six hours a day in AI tools and probably four of them are voice.\r\n\r\n\r\nNikolas Hulewsky (57:39.777)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (57:43.131)\r\nOne of things I love about voice and I do this with my son when we're driving places, maybe it's a know, an hour drive. I'll just put it on. And we'll ask it questions. And like my son's like what happened to the fall of Rome? It's like, that's a good question. What happened to the fall of Rome? And then it'll give an answer and be like, well, where were the Visigoths from? And then it'll give an answer and was like, well, how many of them were there? And it's like you have this PhD professor with you that that you're like learning this topic from in real time. I think that's just.\r\n\r\n\r\nAmanda Orson (58:12.302)\r\nThat's really cool. What a cool application.\r\n\r\n\r\nNikolas Hulewsky (58:13.547)\r\njust cool. Yeah, it's been awesome. And I'm trying to help him understand like this is the new Google, right? Like it's not. This is how you use it. Okay, the second one is I want to get your opinion on my analogy for AI. I think a lot of people think about AI as a better form of Google. But I think that's wrong. I think of Google as a librarian. You go to a librarian and you're like, I want to learn about the fall of Rome. What do they say? Go to this section.\r\n\r\n\r\npull these books, these are the authors, right? And then you go and you do the study. AI is every PhD professor in that topic that you can think of, that you can ask a question of, and it will give you the specific answer. So tell me about the fall of Rome. It's not go to these sections. It's, this is what happened with the fall of Rome. But also if you want to do deeper research, here are the sources. So one is the librarian, one is the professor. What do you think of that analogy? Okay. I felt very smart when I thought of it. And then,\r\n\r\n\r\nAmanda Orson (59:03.992)\r\nI think that's actually very appropriate. It's very spot on.\r\n\r\n\r\nNikolas Hulewsky (59:09.237)\r\nAnd then the last one is for people who are like, I'm a business owner, I don't know where to start with AI. What recommendations would you have for them?\r\n\r\n\r\nAmanda Orson (59:21.4)\r\nI would create a basic document about your business, give it high level overview. What's your revenue? What's your earn? What's your business model? If you have a forecast, give it a forecast. And what are your major processes? Like, how are you making your sausage? Whatever that is. And then I would literally take that document and I would go to choose both chat GPT and Claude. And I would say, hey.\r\n\r\n\r\nThis is my business. This is where I'm at. How would you improve this business using AI? And then just start down that rabbit hole.\r\n\r\n\r\nNikolas Hulewsky (59:58.773)\r\nand then start question and answer like it right in with it. I think that's great answer. I had someone ask me that recently and I said, if you've never used AI, just start using it. So number one, buy a subscription. could be chat, GPT, it could be clot. don't care who it is. Just buy a subscription, replace everything that's non geographic based question with chat, GPT, not Google. So if you're looking for hours of operation or specific restaurant or best food in this area, like\r\n\r\n\r\nSure. Keep going to Google, but any other question, start going to chat. GPT and then any contracts or any specialized knowledge that you feedback on more than a paragraph, just start uploading it and asking it for its feedback. So I, I love that answer. dude, Amanda, this was amazing. Thank you so much for taking an hour. It was longer than I was planning on. This was fantastic.\r\n\r\n\r\nAmanda Orson (01:00:50.892)\r\nYeah, I mean, this is something that we touched upon a lot of things that I'm very passionate about, but I think we're in not even anyone. I think we're like at the first at bat. And I think the future is really going to be kind of like a splitting of two populations, the people that will be 10x accelerated by AI or the people that will be disintermediated because somebody else has been 10x accelerated by AI. So it's your choice. Like where do you want to be?",
  "metadata": {
    "duration": "",
    "date": "2025-04-01",
    "platform_source": "Google Drive"
  }
}