{
  "episode_number": "237",
  "episode_title": "What the 'Big Beautiful Bill' Means for Your Business",
  "guest_name": "Trenton Hughes & Chris Munn",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:01.458)\r\nUh, me mic check camera check. Cool. We got a full docket today. We are going to cover the fed rate cuts. We're going to cover changes in the big, beautiful bill and what that means for entrepreneurs. We're to talk about the freaking Savannah bananas going on my first million. Uh, we're also going to talk about some AI stuff, the QSBS, but we're going to start today with an interesting question. Uh, I don't know about you guys. I spend approximately a hundred to $200 a month on\r\n\r\n\r\npremium AI services. So I've got a premium membership to chat tbt. I've got a premium membership to to perplexity to Claude. I have grok just because I have the premium membership to Twitter. And let me think and Gemini. my gosh, I have all of them. I don't know a piece of crap.\r\n\r\n\r\nTrenton (00:44.275)\r\nMm.\r\n\r\n\r\nTrenton (00:48.679)\r\nHmm. That's not even close to all of them. Yeah.\r\n\r\n\r\nNikolas Hulewsky (00:52.514)\r\nWell, all the big ones. Okay. I have all the, I have all the big models. And then on top of that, I have like different software products, but I use those for all different things. Am I, am I crazy? Like, do you guys do the same thing? How many do you have Trenton?\r\n\r\n\r\nTrenton (00:59.251)\r\nWhich one?\r\n\r\n\r\nTrenton (01:07.155)\r\nI think I have four if you count Grok I guess. I don't really use Grok but Claude used the most, ChatGPT second, V0 been using a bit lately, and then Grok I don't really use. But I guess that's $60 for me somewhere around there.\r\n\r\n\r\nNikolas Hulewsky (01:25.528)\r\nChris, what do you use?\r\n\r\n\r\nChris Munn (01:27.738)\r\nYou guys are wealthy. I just have chat GPT.\r\n\r\n\r\nNikolas Hulewsky (01:32.59)\r\nOkay, here's what it does the job for me. Here's what I use each of them for. Perplexity, deep research. Like if I'm looking for financial research, I should say, I think perplexity gets the best job on financial research. if I wanna research, so if a stock, right, hey, tell me what the company's performance has been over this period of time. If I wanna research an industry, like how fast is it growing? What's the total addressable market, et cetera.\r\n\r\n\r\nChris Munn (01:32.946)\r\nit does the job for me.\r\n\r\n\r\nChris Munn (01:48.084)\r\nlike give me like stocks.\r\n\r\n\r\nNikolas Hulewsky (02:02.124)\r\nresearch like a specific business model. Like, hey, tell me how e-commerce stores work. What are their net margins? How fast are they growing this year? Just like the, I feel like the quantitative stuff for perplexity for whatever reason is fantastic. And at least thus far, I don't, I don't see a ton of hallucination for it. Next, I use Grok for real time information. So for example, I mean, Charlie Kirk got shot and I went to Claude and I asked it a question and it was like,\r\n\r\n\r\nThat's an irresponsible question to ask. Charlie Kirk is alive and well. I wouldn't want you spreading misinformation. I was like, you're not up to date. So went to Grok, because I feel like Grok's kind of the most current. I also think it has a really good ability to be a thought partner. Chat TBT I use just because I've used it for a long time, so it knows me really well. And there's like this legacy built into it where it can.\r\n\r\n\r\naccess all of my conversations and all my chats. And then Claude, I feel like does the best job of organizing projects and writing. So I use Claude a lot for copy, basically. Yeah, I'm curious, what do you use yours for?\r\n\r\n\r\nChris Munn (03:05.268)\r\nOkay.\r\n\r\n\r\nTrenton (03:16.051)\r\nWell, one thing that I think is interesting, I was thinking about like, don't I use Grok? And, but what I'm hearing is a lot of people are starting to use Grok, especially on the coding side. And it changes really quickly of like which one becomes best and which one is worse. Cause they update so fast. I've heard lately that Grok is very good there, but Grok went off the rails like a month or two ago and was spewing out like Nazi stuff. And so yeah, did you guys not see that? It was, it, it,\r\n\r\n\r\nNikolas Hulewsky (03:29.737)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (03:38.146)\r\nDid it?\r\n\r\n\r\nChris Munn (03:41.582)\r\nI did see that. Yeah.\r\n\r\n\r\nNikolas Hulewsky (03:42.028)\r\nNo.\r\n\r\n\r\nTrenton (03:44.037)\r\nIt was bad. It was like, it was really bad. was a PR nightmare. think it like the next day, the CEO of Twitter or X quit. Who knows if it's related or not, where she resigned. But it'd be so easy for platforms like that to lose trust from users if you can't trust the outputs that it, like if it starts spewing out that kind of stuff, like, are you going to trust? So I don't trust it at this point. And it'll be hard for me to re, to retrust it for a while.\r\n\r\n\r\nNikolas Hulewsky (04:08.686)\r\nThat's interesting.\r\n\r\n\r\nTrenton (04:12.123)\r\nAlthough I'm hearing, like I said, that some people are using it for code and saying it's maybe the best at this current moment.\r\n\r\n\r\nNikolas Hulewsky (04:18.926)\r\nWhat happened with Gemini when, or maybe it was barred at that point when Google first launched it and then it was like, why is George Washington black? you're like, people were like, what, how, you know what I mean? Like they got all up in arms and then trying to think there was one other company who that happened with. The thing is like, if you use any of them, you know they all hallucinate. Like none of them are perfect.\r\n\r\n\r\nChris Munn (04:32.532)\r\nSo on Polymarket,\r\n\r\n\r\nTrenton (04:43.581)\r\nThey all hallucinate, but you would hope that they don't. True. But it's like the scale of the hallucinations. That one was a bad, they went viral. It was, it was, it was not a good look by any means.\r\n\r\n\r\nNikolas Hulewsky (04:55.763)\r\nNazi. I want to go look at this. That is nuts.\r\n\r\n\r\nChris Munn (05:01.96)\r\nwhich is like the prediction market or whatever where you can gamble. It's going to be determined by a chat bot. So I don't know the context in which the chat bot will use, but they have which company will have the best AI model by the end of September. One company is at 98 % likelihood that they'll have the best AI model at the end of September. Can you guys guess what it is? What's your guess?\r\n\r\n\r\nNikolas Hulewsky (05:03.98)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (05:26.89)\r\nOne company is.\r\n\r\n\r\nChris Munn (05:28.788)\r\nThey're 98 % likely. The likelihood is everybody else is just can contain. It is contained in that 2%. One company is 98 % likely to have the best.\r\n\r\n\r\nNikolas Hulewsky (05:39.2)\r\nIf I were to guess, Google. Be my guess. I don't know.\r\n\r\n\r\nTrenton (05:43.059)\r\nHmm. I still would have discussed chat GBT, but I I bet I'm wrong. What is it? Google, interesting.\r\n\r\n\r\nChris Munn (05:44.242)\r\nWhat about your turn?\r\n\r\n\r\nChris Munn (05:50.43)\r\nGo, go.\r\n\r\n\r\nNikolas Hulewsky (05:52.088)\r\nIt is Google.\r\n\r\n\r\nChris Munn (05:53.257)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (05:55.406)\r\nIt's surprising, but it's also not surprising. I mean, yeah.\r\n\r\n\r\nChris Munn (05:58.046)\r\nThey shouldn't be surprised. have to have the most data.\r\n\r\n\r\nTrenton (06:02.105)\r\nDo the- yeah, I guess.\r\n\r\n\r\nNikolas Hulewsky (06:02.456)\r\nThey do, it just took them a while to finally catch up to everybody else.\r\n\r\n\r\nChris Munn (06:06.408)\r\nYeah, yeah, but their data, I mean, can't imagine how much more data they have than everybody else. It's got to be insane.\r\n\r\n\r\nTrenton (06:15.197)\r\nBack to is this like a rich person thing or not? I don't know, man. Like the amount of time and money I can make and save based on this is pretty crazy. You're asking about like use cases. I write books and I've kind of like co-write now with AI sometimes and it's next level what it can do. And the amount of hours that I save on that alone is crazy, but like doing business financials, that saves me tons of time. It's way more accurate, probably dozens of hours.\r\n\r\n\r\nNikolas Hulewsky (06:15.392)\r\nYeah, did I?\r\n\r\n\r\nTrenton (06:43.761)\r\nresearch, dozens of hours. I feel like although I'm spending 60 or 80 bucks, like it does a massive ROI. I feel like it's underpriced still probably.\r\n\r\n\r\nNikolas Hulewsky (06:53.102)\r\nThere probably is some solution out there, but I would like it if I could just have it all in one chat window. You know what I mean? Like in the same way I can go to Chat TVT and choose the model. If I could just have a chat window and be like, all right, I wanna use perplexity and do some research. Or I wanna use quad to write copy. Or I wanna use grok to test my thinking on this. Because I don't like having a bunch of windows and I know it sounds so stupid, but they all have really good specific.\r\n\r\n\r\nChris Munn (07:04.996)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (07:22.334)\r\nuse cases and i think that's why we're starting to see now more and more have you heard people talk about SLMs not LLMs\r\n\r\n\r\nChris Munn (07:30.339)\r\nNo, it was SLM.\r\n\r\n\r\nNikolas Hulewsky (07:31.854)\r\nsmall language model. like chat GPT is this super large language model. Google has a bunch of SLMs where they're like, uh, X-ray specific or biomarker specific or English literature specific. So I, it would make sense to me that we start seeing more and more small language models, but kind of Chris, you got to your game, man. You got to get, you got to get another\r\n\r\n\r\nChris Munn (07:42.117)\r\nGotcha.\r\n\r\n\r\nChris Munn (07:48.9)\r\nYes.\r\n\r\n\r\nWell, I did have a conversation because I was in the market looking for pediatricians. And then I found out about this new concierge thing that all these doctors are doing. The scam of pay me $7,000 and you can text me whenever you want. Like, Hey, what's this bump? And I'm just like, guys, I don't know if you know, but like chat, GPT can tell me what, the bump is. So sorry, doctor, I'm not paying you. So I will be using it for that.\r\n\r\n\r\nNikolas Hulewsky (08:09.614)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (08:25.484)\r\nAnd well, and Google has so much data, it's actually getting really good on the diagnostics. It's crazy good, crazy good.\r\n\r\n\r\nChris Munn (08:27.954)\r\nYeah. Yeah. I can't, I have to imagine asking a good AI model would be better than asking just like a, no, a specific doctor, like a specialty doctor, I still think has a lot of value, but just like a general pediatrician, like, Hey, is this chickenpox? Like, I don't need to ask you that.\r\n\r\n\r\nTrenton (08:49.715)\r\nwonder how much doctors will use this themselves because obviously they're taking guesses and they get stuff wrong so often and if you can type in all the symptoms probably you'll at least get a probability ranking of what this could be. I don't know, I would trust probably the AI more than most doctors, crazy as that sounds.\r\n\r\n\r\nChris Munn (08:53.012)\r\nYeah.\r\n\r\n\r\nChris Munn (09:00.276)\r\nMm-hmm.\r\n\r\n\r\nChris Munn (09:06.462)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (09:12.91)\r\nWell, like anything, is, it's really a tool in the tool belt. So the way I see it is a doctor is gonna go and enter the symptoms and the AI is gonna spit out like here are seven different probability or possibilities and the doctor is gonna go filter through those with their information and context and say like, that makes sense or that doesn't make sense. I don't think it's necessarily gonna replace the doctors or make them lazier, but I do think it's gonna help them in the diagnostic process.\r\n\r\n\r\nChris Munn (09:37.844)\r\nYeah, it should help him.\r\n\r\n\r\nbut it also helped me.\r\n\r\n\r\nTrenton (09:43.155)\r\nIt's also probably like, know, WebMD, people could just look up their symptoms and they come into the doctors and they're like, hey, I have this. It's going to for sure make that even more. People are just like, ChatGPT said I have cancer. Can you look at this? I'm sure that they're getting a ton of that now where they're even more convinced of whatever they think they have from online sources.\r\n\r\n\r\nNikolas Hulewsky (09:43.776)\r\nshould help you.\r\n\r\n\r\nNikolas Hulewsky (10:03.758)\r\nHere's what I think is going to happen, like everything else, is AI is going to make everything way more efficient, which we need because there actually is a shortage of, and this is my background, right? Health care. There actually is a shortage of practitioners, providers. I mean, you try to go get in with a physician right now, it's like four months out that you're, maybe not four months, but depending on where you are, it's a long time to actually get in and get seen. So if you could, using AI, answer simple questions or make the physicians\r\n\r\n\r\n20 % more productive because they no longer have to type. They have it just recorded and transcribed automatically with AI, or they make the diagnostic process much better. So we're catching things earlier, screening for things that we know are going to be big problems down the road. actually doing preventative medicine so that we're not spending a lot of money when they actually develop something. We're addressing these things at the root cause. I do think AI is going to bring down the cost of pretty significantly. At least that's my hope, looking at the technology and looking at what we need in the space.\r\n\r\n\r\nTrenton (11:03.037)\r\nDo you think being from the space, do you think 20, 40, 50 years from now we'll go in and it will all just be AI, it'll scan us, it'll be able to tell us what we have, what we need.\r\n\r\n\r\nNikolas Hulewsky (11:03.437)\r\nI actually think it's a good thing.\r\n\r\n\r\nNikolas Hulewsky (11:16.302)\r\nI think it will be a, my personal opinion is that AI is going to do a really good job at the diagnostics at saying, this is the set of facts. Here is my analysis. what it's not going to do a good job of is the human component of like talking people through things, being a therapist, helping them understand what the best course of action is. Cause if somebody comes in with hypertension, let's say high blood pressure.\r\n\r\n\r\nwhat is the best course of treatment? I could put you on medication that will solve your problem, but as medication, really the best treatment option might be diet. might be exercise. How do I walk somebody through what they're, you know, what the best option is? I don't know that AI is going to do that stuff. So in my opinion, it's going to allow physicians to do the things that is more of the bedside manner as opposed to necessarily the like, meet my Merp, you have diabetes. You know what I mean? I think AI is going to help.\r\n\r\n\r\nmore long listings.\r\n\r\n\r\nTrenton (12:17.052)\r\nYeah, interesting.\r\n\r\n\r\nNikolas Hulewsky (12:19.244)\r\nmy opinion. All right, let's switch gears here to big topics. We have a big, beautiful bill or Fed rate cut. Chris, your choice.\r\n\r\n\r\nChris Munn (12:30.089)\r\nBig beautiful bill. Let's talk about it.\r\n\r\n\r\nNikolas Hulewsky (12:31.47)\r\nBig, the BBB. All right. We mentioned it last week. I wanted to talk about it in depth this week though, because in the big beautiful bill, there's a bunch of different changes. Economic opportunity zones got extended. QSBS changed. QBI was extended. It was only for a certain period of time and now it's been made permanent. We've got the accelerated depreciation. We've got the tips and taxes and overtime. Anyway, so there's a lot in there. And if I'm a small business owner, I'm looking at all this and I'm like,\r\n\r\n\r\nI don't even know where to start. Just tell me what, give me the TLDR. So the first thing I wanted to talk about is if you're listening to this and you're a small business owner and you are gonna make two, $300,000 this year or more, don't take a distribution. Go buy real estate. Like if you can afford it, obviously go, whatever, go talk to your CPA, blah, Go buy real estate because of the accelerated depreciation. What that is is if I go and buy a piece of real estate up to two and a half million dollars,\r\n\r\n\r\nI can have that purchase expensed in year one. It's not amortized over 30 years. It's accelerated into year one. So what does that look like? If I had otherwise made $500,000 in net income because I accelerated the depreciation of the purchase of that piece of real estate, I now made $0. I know I owe nothing in taxes. So I save a bunch of money this year on taxes. And if you are a small business and you're, you know, you're generating\r\n\r\n\r\ngood amount of cash and you want to save on taxes, I would find some real estate to invest in because it's almost like we have a president in the White House who is a real estate entrepreneur. I don't know any other way to explain it other than real estate is an amazing asset to invest in and this just makes it even more amazing.\r\n\r\n\r\nTrenton (14:20.947)\r\nWhat types of real estate would you look at if you're a small business owner? What would they potentially be interested in?\r\n\r\n\r\nNikolas Hulewsky (14:27.15)\r\nSo this is where I made the mistake after I sold a couple of my businesses, I put money in real estate because it's like, that's just what you do. You put money in real estate, it long-term wealth and it does. But there's a difference between passive and active income. Passive income are things like RV parks. They're things like storage units or storage facilities, things that you don't necessarily have an active business that you're running in there. Obviously, there's better definitions for this. I'm just saying this off the top of my head.\r\n\r\n\r\nChris Munn (14:51.508)\r\nSo, I'm to\r\n\r\n\r\nNikolas Hulewsky (14:56.206)\r\nBut active businesses would be businesses that have real estate attached to them. Car washes are upper. I would look for a car wash as a perfect example because that would act as active income. A gas station, a car wash. I'm trying to think of any any other business that requires the real estate piece in order to be a business. That's where I would look.\r\n\r\n\r\nTrenton (15:18.931)\r\nIf you're a small business owner though, and let's say you, like you said, made 500K and you have 300K to put in, what do you do if the gas station is $3 million, how do you go about?\r\n\r\n\r\nNikolas Hulewsky (15:30.322)\r\nso I actually would not go buy it myself. There are small business funds or people on Twitter. You can go find whoever that talk about this stuff that are always looking to do a deal. Nick Huber, for example, at the time he doesn't do it as much anymore. He was always raising money to go do these self storage deals. So I think there are a lot of funds out there that are always looking for LPs to throw money into their funds and\r\n\r\n\r\nThat's probably where I would start. would probably start by looking at somebody who's done it before, who's actually like purchased and ran, let's say a laundromat or a car wash or whatever one of these businesses and partner with them as opposed to doing it myself and learning on my own dime. Just because I think that the learning curve would be way too steep if I were to just do it myself. That was a good question. That was a really good question.\r\n\r\n\r\nTrenton (16:16.091)\r\nInteresting. Yeah.\r\n\r\n\r\nChris Munn (16:18.692)\r\nAnd so if let's have the 300 grand in\r\n\r\n\r\nI'm not gonna write off my 300 grand in year one. They sell in year three, what happens?\r\n\r\n\r\nNikolas Hulewsky (16:31.052)\r\nWell, there's two things. Number one, if you put 300 grand in, is that the price? Is that the value of the real estate?\r\n\r\n\r\nChris Munn (16:38.088)\r\nLet's assume, yes, real estate. Let's assume that the 300 grand is all going towards real estate. Yeah, let's assume that.\r\n\r\n\r\nNikolas Hulewsky (16:40.013)\r\nOkay, okay.\r\n\r\n\r\nWell, what I'm, what I'm saying is if you put 300 grand in it, but you bought a million dollars worth of real estate because you had to put 30 % down, you'd be able to take the million dollar deduction, not just 300,000 you put into it. If you sell in year three, then it's, I mean, this is a pretty common practice in accounting or in tax accounting. You would just have this thing called recapture where it's like, okay, if you resell it within that certain period of time,\r\n\r\n\r\nChris Munn (16:55.604)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (17:09.538)\r\nThey take what would have been the depreciation or amortization schedule, and then they apply it to that. basically, you now, against the gains that you've had, owe the rest of those taxes. So if in year one, you deducted the full million dollars, then in, and you sell in year three, you would effectively have to kind of like recapture the $900,000 that should have been depreciated over the rest of the 30 years of that useful life. So yes, you would pay it back.\r\n\r\n\r\nSo it's not meant to be like this get rich quick scheme of like a buy something, I flip it on and off to pay taxes because I'd appreciated it all in your one, but it is meant to incentivize you the business owner to make investments into your business. And it's not just real estate. It's any capex. It could be heavy machinery. It could be, you know, a, redesign of your warehouse or your, your shop, et cetera. It's, basically any capital investment in your business. Obviously talk to a CPA, but that's, that's the way it's currently written.\r\n\r\n\r\nTrenton (18:06.995)\r\nCurious to get you guys' take then, because this kind of feeds into this as well. Just thoughts on real estate, where it's going. You mentioned, Nick, you think it's always been a good investment. The rate cut just happened, which is going to play into this big time. Where does it go from here? It's obviously very high right now on the residential side. Commercial has been a question mark for a bit on where it's going. When COVID happened, everyone's like, this is the worst investment known to man. That changed, though, a little bit. Where do you guys think it's going?\r\n\r\n\r\nNikolas Hulewsky (18:39.63)\r\nChristoph?\r\n\r\n\r\nChris Munn (18:40.052)\r\nCan I say I don't know? No, I'll take a stance. I mean, obviously I don't know, but...\r\n\r\n\r\nNikolas Hulewsky (18:48.012)\r\nYou can say you know.\r\n\r\n\r\nChris Munn (18:54.994)\r\nIt's hard to say because you would have thought that when the rates went up, the prices would have come down and they did not really do that. Now you're starting to see some places where prices are coming down a little bit, but now that rates are getting cut back, or cut, you know, now that rates are getting cut, like will the prices go up and\r\n\r\n\r\nIt's hard to say, but I have to imagine that there's a ton of activity waiting to happen for people who have been on the sidelines because either they have a low rate and they don't want to move because they're going to go into a high rate or people who aren't in a mortgage at all who are waiting to get into a mortgage, but they can't because the rates are so high. So I would think that there would be a ton of activity and usually demand increases prices, high demand, but\r\n\r\n\r\nthe prices didn't really decrease with low demand. So it's hard to say.\r\n\r\n\r\nNikolas Hulewsky (19:56.654)\r\nThe residential market is weird because we've had obviously all time high asset asset values for, for homes. But at the same time, if you look at a lot of the data, we've actually seen not, all time lows, but we've had less inventory on the market than we did during the lows of COVID. So really what we're seeing is the lack of supply is maintaining these high prices. So what happens when that flips and all of sudden we have a\r\n\r\n\r\nof supply coming onto the market because they're like, rates dropped, cool, people will actually be buying. There are some theories out there that is like, actually, prices will come down because there will be a glut of supply that enters the market. And so you'll have way too many options that will actually force the price to come down. So on the residential side, I'm with you, Chris. I don't know what's going to happen. As a business owner, I have just gotten to the philosophy of it's always a good time to put my money into real estate because\r\n\r\n\r\nMy hold period is not two years. They ain't making any more land. I'm gonna hold that for a long time. so I like the real estate market. Even obviously some markets are more frothy than others, but that's in any macro environment. I don't know, what about you?\r\n\r\n\r\nTrenton (21:09.266)\r\nYeah.\r\n\r\n\r\nTrenton (21:16.467)\r\nthink that one thing that maybe is talked about some but isn't thought about enough is just how many investors buy, especially when rates go down. so I don't know, I don't think that prices go down. I don't see how that happens unless we have some sort of big economic crash. And even if they do, I think that investors will come up and look at this as an opportunity to just scoop up real estate like they could have in 08, 09. But once like I live in Southern California,\r\n\r\n\r\nNikolas Hulewsky (21:25.144)\r\nMm.\r\n\r\n\r\nTrenton (21:43.623)\r\nthere's a lot of international buyers here and owners who just buy the place, don't live in it, and they rent them out. And as long as that's allowed, I don't see how we see like a big dip in things. there's, it's crazy. It's actually like the city of Irvine, tons and tons of Chinese buyers have come in here and they bought up all the real estate and they rent it out. They don't live in it. A lot of them, they just rent it out. And lot of them own multiple houses and they're just, and then you know, bunch of private equity and other.\r\n\r\n\r\nChris Munn (21:53.292)\r\nOkay.\r\n\r\n\r\nTrenton (22:12.147)\r\nfirms that have bought up a bunch of like even apartment complexes obviously, mobile homes, trailer parks, that kind of stuff was getting bought up like crazy. So as long as these guys on the investment side and international side have access to come by here in the States, as many houses and properties as they want to, I don't think that we're gonna see any sort of price go down. don't think rates will adjust, but then I'll just make it cheaper for the people that have money to go buy more stuff.\r\n\r\n\r\nSo I think it's going to go nuts again.\r\n\r\n\r\nNikolas Hulewsky (22:44.728)\r\nReally, you think it'll go nuts. You don't think it'll stay the same. You think it would go nuts.\r\n\r\n\r\nTrenton (22:47.601)\r\nI think that rates will keep dropping and then you'll see mortgage rates hit four at some point or like high fours. And I think that everything will go nuts. I think prices will just keep going bananas. So that's my prediction. I think that investors see this as you just said, as the opportunity, anytime that rates go down or prices go down a little bit, it's just gonna keep jumping on it. Yeah, I don't know.\r\n\r\n\r\nNikolas Hulewsky (23:11.694)\r\nfor the short term, think. Prices go up.\r\n\r\n\r\nTrenton (23:14.675)\r\nI don't think we're gonna see anything dip. Yeah, I think that we'll see them go up.\r\n\r\n\r\nNikolas Hulewsky (23:19.928)\r\nMan. would you do, okay, are you doing anything different right now? Let's say that you think that, like how convicted are you in that thesis?\r\n\r\n\r\nTrenton (23:29.051)\r\nI mean, I'm saving cash to be able to buy stuff when the time's right. So I don't know. I already own some things. I know you do too. What's interesting about the three of us too, actually, we all own, I don't know, Christie, you own, Nick and I do, but we're also now both choosing to rent instead of buy at this current time. And what's interesting is the place that I'm renting, if I was to go buy this place new, probably a couple million dollar place, if I was to go mortgage it.\r\n\r\n\r\n$20,000 plus dollars a month and I can come in and rent that place right now for a fourth or a fifth of that cost. So that's also an interesting thing to think about is renting. Yeah, mobility and the price of it is actually a little bit lower right now on the rental side than if you were to go mortgage this stuff. The rates are just so high or at least in my opinion they are. I bought at 2.6 % my other place and I think you were the same Nick, right?\r\n\r\n\r\nNikolas Hulewsky (24:09.538)\r\nMobility.\r\n\r\n\r\nChris Munn (24:25.568)\r\nAny questions? Any questions?\r\n\r\n\r\nNikolas Hulewsky (24:27.886)\r\nYeah. Yeah. We're, I mean, it's hard to move when you've rates under 3%. You're like, what? Why would I move? I've got a home that's supposedly on paper worth a million dollars and my mortgage on it's $2,500. Like what? Why would I move? You know that like there's a lot of people around the country who are in that, in that position. So it's like, yeah, there's not a lot of people who are looking to move, I think.\r\n\r\n\r\nTrenton (24:30.151)\r\ncrazy.\r\n\r\n\r\nNikolas Hulewsky (24:59.956)\r\nSo anyways, that I do think though, for if you're an entrepreneur and you're in this for the long game, I would definitely look at whether it's capital expenditures to reinvest in your business, whether it's real estate to diversify your portfolio, whatever it is. It's the accelerated depreciation is a massive boon. It's not going away either, but this year it's happening. And if you already bought this year, it is retroactive to January 1st. So\r\n\r\n\r\nThat's the good news, but obviously go talk to a CPA if you want to look more into it. The other thing that I thought was really interesting from this bill is the tips and overtime. Do you guys know how it works?\r\n\r\n\r\nTrenton (25:40.173)\r\nvaguely.\r\n\r\n\r\nChris Munn (25:40.858)\r\nOther like putting restrictions on certain industries and certain incomes, right?\r\n\r\n\r\nNikolas Hulewsky (25:46.936)\r\nYeah. So basically it's like under a certain income level. it only applies to people and it's they're publishing it on October 2nd, but it will be only specific industries or job positions that will be able to, to use this deduction, but it's not actually no tips or excuse me, no tax. It's a deduction. So I know that like sounds like a weird nuance, but you are still going to be taxed on that. It's just at the end of the year.\r\n\r\n\r\nyou will be able to take a deduction when you file your taxes. And so theoretically, you'll get a rebate. And for most people, it'll be up to between $12,500 and $25,000, depending on your family situation. So it's interesting to me that it's being sold as just like, no taxes on overtime. But you're like, no, you're still being taxed. You just now have a deduction that you can take at the end of the year. But\r\n\r\n\r\nChris Munn (26:37.569)\r\nYeah, you gotta pay. Yeah.\r\n\r\n\r\nNikolas Hulewsky (26:44.45)\r\nthere are going to be new burdens that small businesses have to implement. I'd be curious to see kind of what other people are doing. I don't know. Are you guys doing anything in your businesses to look at this or is it more of like, nah, we'll deal with it when employees start asking you about it.\r\n\r\n\r\nChris Munn (26:59.814)\r\nI don't have any businesses where somebody would get tips. So I do have businesses where people could get overtime. So it's no tax on any overtime or it's a deduction on any overtime or just below a certain threshold, your income.\r\n\r\n\r\nNikolas Hulewsky (27:04.046)\r\nWhat about overtime?\r\n\r\n\r\nNikolas Hulewsky (27:16.846)\r\nIt's below a certain income threshold and I do think that there are qualifiers for the type of work on overtime. Let's go look.\r\n\r\n\r\nChris Munn (27:28.264)\r\nYeah, that would be interesting. I'm not, cause I could a white collar W2 person getting overtime. get it. Well, they may make too much to get a deduction. That's the point.\r\n\r\n\r\nTrenton (27:38.673)\r\nYeah, if so, there's going to be a lot of...\r\n\r\n\r\nNikolas Hulewsky (27:44.103)\r\nOkay, here it is. it is. Here's the deduction piece. Individuals who receive qualified overtime pay may deduct the overtime premium. That means the extra compensation. So it's the half and the time and a half against their taxes. Maximum deduction will be $12,500 per year. Only overtime reported on IRS relevant forms count and then the deduction phases out, but it's\r\n\r\n\r\nChris Munn (27:55.7)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (28:13.486)\r\n150,000 and below is single and then $300,000 or more is the joint eligibility requirement, which is actually pretty high. Yeah. That is pretty high. But, um, well, but that's the crazy part, right? It's like, okay, if I make $20 an hour and then I work 10 hours of overtime and I get time and a half. All right. So that's $300 that I made in overtime hours.\r\n\r\n\r\nChris Munn (28:21.236)\r\nThat's pretty high. Yeah, that's pretty high.\r\n\r\n\r\nNikolas Hulewsky (28:43.662)\r\nBut the tax deduction that you get is actually not the 300. It's the $100. Yeah, it's like, oh, it's the difference between what your normal wage would have been and what the overtime, which is that half piece. So it's really $100 that you would be able to deduct. And I believe it's actually just the taxable portion of that. So it'd be the 20 % of that $100. So it's going to be complicated. And that's going to be frustrating because you're to have employees who are like,\r\n\r\n\r\nChris Munn (28:47.642)\r\nNo. Whatever, 20 % of that. Yeah.\r\n\r\n\r\nChris Munn (29:08.499)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (29:13.696)\r\nOkay, well, I worked overtime, but I'd like my taxable deduction now. You're like, I don't even know what we're trying to do here.\r\n\r\n\r\nChris Munn (29:22.207)\r\nYeah, that seems very complicated for people who probably don't have an accountant. Right? Like these are are just people that are getting tips. probably use TurboTax or whatever, go to HNR block. So seems very complicated for it's not like QSBS where the people who are going to use that obviously have CPAs, but\r\n\r\n\r\nNikolas Hulewsky (29:29.838)\r\nYeah.\r\n\r\n\r\nChris Munn (29:47.42)\r\nthese people don't. there sounds like there will be some confusion.\r\n\r\n\r\nTrenton (29:51.027)\r\nIt sounds like the Trump administration is in cahoots here with big accounting. They're making themselves more valuable by the day. The last thing that they want, big accounts, big four and all those. I don't know. It's just like, this is, it is going to be complicated. I have heard of some business owners trying to look into whether they can make this a thing for themselves and for their employees. I don't know. I don't know what the loopholes are.\r\n\r\n\r\nNikolas Hulewsky (29:58.99)\r\nBig accounting. KPMG.\r\n\r\n\r\nTrenton (30:20.083)\r\nPart of me just wishes that this was all streamlined and you just put all of our information in a system and pump it out without needing CPAs and all this complicated tax matter. You just have a single percentage tax for everything. It would be a lot easier, I feel like. But as a business owner, if you're smart and you have the money to pay for an accountant, there's a lot that you can probably benefit from here. What I wonder is will an average employee benefit from this as much as they were hoping?\r\n\r\n\r\nThey basically said, great, it's gonna be great, no tax on tips and overtime, but then they made it super complicated for them to even go figure out how to go do it. It's not gonna be easy.\r\n\r\n\r\nNikolas Hulewsky (30:56.11)\r\nYeah, I think what's going to happen is the following. And that example that I just gave, $300, they paid $300 in overtime. Oh, cool, I can deduct $300 from my taxes. Well, that's going to be the first step is helping them understand that like, they're not getting more money in their paycheck. It's going to be a deduction later against their taxes. But then the second step is going to be, okay, well, it was $300 and I owed $900. So it should just be a net of $600.\r\n\r\n\r\nactually, actually, it's only on the piece that was the overtime piece. So the hundred of that 300. Okay, we'll deduct the through the 100 is like, actually, it's just the taxable portion of that hundred, which is $20. So, so you'll save $20. You know what I mean? And like, I think there will definitely be some like, wait, what?\r\n\r\n\r\nChris Munn (31:30.18)\r\nYeah. Yeah.\r\n\r\n\r\nTrenton (31:32.061)\r\nYeah.\r\n\r\n\r\nTrenton (31:38.675)\r\nSo you saved $30 this year.\r\n\r\n\r\nChris Munn (31:44.553)\r\nYeah.\r\n\r\n\r\nChris Munn (31:49.222)\r\nYeah, that's going to be so confusing. Like in your example, they're going to get a check. Their regular pay may be $2,000. Their overtime may be $300. And they're used to seeing a check of $1,600 based on that, right? And now they're going to see a check of $1,625.\r\n\r\n\r\nNikolas Hulewsky (32:08.082)\r\nIt's going to be so good. Well, I mean, so there's two things here. One is politics. It's like you got they got the headline. No, no taxes on overtime or tips. Right. And this happens all the time in any legislation. And then you dig into it you're like, I didn't really change that much because the truth is the federal government still needs the money. Like they need the money coming in to pay their bills. The second piece, though, I do think that there's an opportunity for business owners.\r\n\r\n\r\nChris Munn (32:08.564)\r\nThank you.\r\n\r\n\r\nTrenton (32:17.992)\r\nYeah.\r\n\r\n\r\nChris Munn (32:20.646)\r\nYep. Yep.\r\n\r\n\r\nChris Munn (32:30.599)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (32:35.032)\r\nwho take the time to understand this and educate their employees to use it as a differentiator of just like, hey, we'll help you with the reporting. You know what? When it comes time, you're gonna need this new tax form. We can help you with that. And I think, I do think if you make it easier for them, that becomes a selling point with your employees, or least helping them understand the benefits of it. I definitely think it helps more of the tips people.\r\n\r\n\r\nChris Munn (32:42.173)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (33:03.586)\r\nwho, you know, the servers, people in hospitality. But yeah, it'll be interesting.\r\n\r\n\r\nChris Munn (33:03.846)\r\nAgree.\r\n\r\n\r\nChris Munn (33:11.474)\r\nAnd it kind of, it kind of sucks for servers in a way because servers that the, whatever reason, I have no clue why we allow this, but the servers have like really low, they keep, they can get paid below minimum wage on their base pay. Right. And then the majority, yeah, I have no idea why they do that. And then the majority of their pay is made up of tips. So yeah, restaurants just don't have labor costs. I subsidize the labor costs when I go eat, which is.\r\n\r\n\r\nNikolas Hulewsky (33:26.968)\r\nweird.\r\n\r\n\r\nChris Munn (33:40.818)\r\nWhatever, Another short. but they, but they get, so if they're going to get the majority of their income through tips, let's say there's a waiter in Manhattan that's at a steakhouse and they get the majority of their, they're only going to get to deduct that 12,500, right? It's like that you don't get to deduct all your tips.\r\n\r\n\r\nNikolas Hulewsky (33:43.63)\r\nLet me, let me, yeah, go ahead.\r\n\r\n\r\nNikolas Hulewsky (34:03.938)\r\nNo. No. You don't get to talk about this.\r\n\r\n\r\nChris Munn (34:04.692)\r\nSo I would imagine a server, I would imagine a server even who makes 30 grand or 40 grand won't be able to deduct all of their tips because there's gonna be more than $12,000 worth of tips.\r\n\r\n\r\nNikolas Hulewsky (34:21.501)\r\nWell, it's, it's, it's, I think it's $12,000 in their taxable obligation. So I think it will offset, like they could have an offset of up to $12,000 in there. I'm not, I'm not sure. Okay. Let me, let me ask you guys, let me ask you guys this question though. That's the thing. Yeah. That's super complicated. You guys have noticed when you go, obviously when you go to restaurants now and it's like, would you like to leave a tip?\r\n\r\n\r\nChris Munn (34:29.756)\r\nOkay, yes, so that's Yep. Yeah. Okay, sounds complicated.\r\n\r\n\r\nNikolas Hulewsky (34:48.43)\r\nWould you like it to be 2530 or 35 %? You're like, what, what happened to like 15 or 20? Back in the day, I would like pay cash. And then that would go in a little tip jar, and then the servers would share it. What do they do now? Do they like how do they get transparency into how much I tipped? Like, is it really going to the servers? There has to be an accountability mechanism or they just like, no, I bet the owner, the owner will tell us how much we got in tips today. We're all just going to split it equally. I don't\r\n\r\n\r\nTrenton (34:50.483)\r\nyou\r\n\r\n\r\nTrenton (35:08.957)\r\nSo.\r\n\r\n\r\nNikolas Hulewsky (35:17.262)\r\nThis is a very specific question. I just don't know how it works.\r\n\r\n\r\nTrenton (35:19.911)\r\nI don't know exactly. have people in my family and network that are either servers or like aestheticians and they get paid by tips. A lot of it. Yeah, they rely on the owner to tell them how much they get paid. And there's obviously been a lot of things that have happened where owners have got caught keeping some of those tips as well. yeah, that's definitely been a thing. And I'm sure that they try to do as much as they can. Some, you know, ones that are more shady, but...\r\n\r\n\r\nNikolas Hulewsky (35:40.674)\r\nReally?\r\n\r\n\r\nTrenton (35:49.543)\r\nBut yeah, from what I understand, a lot of it is based on that owner. If it's a smaller business, I'm guessing the bigger corporations probably have some sort of transparency that shows something. But a lot of the ones that are smaller businesses, they're just reliant on like the end of the month, the paycheck coming in and yeah.\r\n\r\n\r\nNikolas Hulewsky (36:02.872)\r\nseems so dumb. Like I would want, if Chris was a server of mine, I'd want Chris to know how much people tipped for Chris's tables.\r\n\r\n\r\nTrenton (36:11.559)\r\nWell, I mean, he'll see it right after he grabs the bill back. But at the end of the month, like adding them all up together might be a little harder to track. I'm sure that there's systems and things that do it, but yeah, a lot of the small businesses that do it, they just rely on that owner to tell them how much they made, which is crazy.\r\n\r\n\r\nChris Munn (36:17.956)\r\nYeah.\r\n\r\n\r\nChris Munn (36:29.155)\r\nLet's just get rid of tips.\r\n\r\n\r\nNikolas Hulewsky (36:29.646)\r\nOr let's make it so I can actually tip the server.\r\n\r\n\r\nChris Munn (36:35.188)\r\nLet's just get rid of tips. Why do we have tips? If my meal is $15 and I tip 20%, just make my meal $18.\r\n\r\n\r\nNikolas Hulewsky (36:49.07)\r\nYes.\r\n\r\n\r\nChris Munn (36:49.214)\r\nProblem solved.\r\n\r\n\r\nTrenton (36:50.611)\r\nSo in other cultures in Europe and in Japan and other places, a lot of them don't do tips. And like I go to a ramen place here and they follow that same way where it's very good, very good service, but they don't allow tips, which is actually kind of nice. And it says like, we charge us service charge for our people. Here's the extra. That's like totally fine with me. I had a Japanese roommate from Japan who came in and was super offended that I had to tell him that he had to tip at the end of, he's like, we don't tip. Like, what are you talking about? I'm not going to leave extra money for them.\r\n\r\n\r\nChris Munn (36:55.252)\r\nAnd that's it. No.\r\n\r\n\r\nNikolas Hulewsky (36:58.21)\r\nReally?\r\n\r\n\r\nChris Munn (36:59.646)\r\nUh-uh.\r\n\r\n\r\nChris Munn (37:09.138)\r\nYeah. Yep.\r\n\r\n\r\nTrenton (37:19.763)\r\nsuper offended by it. And then in Europe, I think they usually leave like a euro or two, crazy, not 20 % or more. And by the way, what do you guys do for fast? Okay, yeah, and I live in France as well, same thing. I probably tip like a euro. What do you guys do for fast casual? It's the same thing. You'll go to not necessarily Chipotle, but a Chipotle type. And on there, it'll say, do you want to tip 20 %? Right, as you finish that.\r\n\r\n\r\nChris Munn (37:25.765)\r\nYeah, I don't... Yeah.\r\n\r\n\r\nChris Munn (37:30.322)\r\nYeah, when I lived in France, I didn't tip.\r\n\r\n\r\nNikolas Hulewsky (37:33.73)\r\nYou didn't tip.\r\n\r\n\r\nChris Munn (37:39.412)\r\nYeah, I'm not tipping.\r\n\r\n\r\nChris Munn (37:48.404)\r\nNo tip. No tip. There was no service. I mean, am I going to get tip for this podcast? Should we send it out to followers and like, hey, 15, 20, 25? You don't get tip for doing your job. We shouldn't tip people for doing their job. Just make it part of the rate. I don't understand why we can't, why do we make it so complicated? Now we have this whole bill about tax on tips. Just fuck it. Hey, just.\r\n\r\n\r\nTrenton (37:50.867)\r\nWhat do do, Nick?\r\n\r\n\r\nNikolas Hulewsky (37:58.158)\r\nProbably not.\r\n\r\n\r\nChris Munn (38:17.821)\r\nlet me pay more upfront, do the service charge, do whatever you want. I don't want to tip anymore. I don't want to tip anybody.\r\n\r\n\r\nNikolas Hulewsky (38:26.098)\r\ndude, big tips. They're in the pocket of Trump. They're keeping tips around. Make America tip again.\r\n\r\n\r\nTrenton (38:28.763)\r\nYou\r\n\r\n\r\nChris Munn (38:30.932)\r\nYeah, it's a big tip. It's a big tip, Kinsbury. Yeah, here's my tip. Get rid of tips. That's the tip.\r\n\r\n\r\nTrenton (38:33.586)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (38:36.095)\r\nmy gosh.\r\n\r\n\r\nI'm with you, dude. Because if I was a business owner, I get the incentive for why now we've gone from 15 % tips to like average of 25 % tips just just prompting you because it's like, Oh, I could increase revenue by 10%. Yeah, yeah, I'll do that. Like, why would I not do that?\r\n\r\n\r\nTrenton (38:58.035)\r\nIt really is the kindness of the customers that are paying for subsidizing the business owner. Yeah, interesting.\r\n\r\n\r\nChris Munn (39:06.064)\r\nStop sit housing.\r\n\r\n\r\nNikolas Hulewsky (39:13.998)\r\nI think I think crumble should be required in their FDD to disclose how much of their revenue comes from the Delta between an average of 15 % tip and 25 % tip. That whole business might have been built on the generosity of people that was taken advantage of by 25 % tip. I'm just saying.\r\n\r\n\r\nChris Munn (39:14.162)\r\nNo, no tips.\r\n\r\n\r\nTrenton (39:22.236)\r\nMmm.\r\n\r\n\r\nChris Munn (39:30.571)\r\nSee, tipping that crumble is just diabolical.\r\n\r\n\r\nNikolas Hulewsky (39:36.95)\r\nWhat am I supposed to do? I run my card and it's like...\r\n\r\n\r\nChris Munn (39:37.588)\r\nThey don't even take my order. They don't even take my order. A machine takes it.\r\n\r\n\r\nThis like they just went in the back and got the cookie that like This is so ridiculous. We got to get rid of this now. We have a whole bill. Let's just get rid of it Let's get rid of tips\r\n\r\n\r\nNikolas Hulewsky (39:44.696)\r\nThat's true.\r\n\r\n\r\nTrenton (39:53.715)\r\nWhat's proposal then if you're president, Chris, how do we get rid of tips and make this a no tip country?\r\n\r\n\r\nChris Munn (40:01.778)\r\nYou just charge what you need to charge to pay your employees. If you need whatever my tips are, if that subsidizes your employees and that's what causes them to be, let's say in a month you collect a hundred grand and then you collect another 25 grand in tips. You need to reverse engineer your menu or whatever it is so that next month you collect 125 in revenue and I leave no tip. I don't want to leave a tip. I don't want.\r\n\r\n\r\nespecially at crumble that's just that's that's out of control\r\n\r\n\r\nNikolas Hulewsky (40:36.11)\r\nWell, here's what's great.\r\n\r\n\r\nChris Munn (40:37.453)\r\nI'm getting disgusted by this.\r\n\r\n\r\nNikolas Hulewsky (40:42.285)\r\nI love it. right. Let's, well, from tips, Trenton to, uh, kind of what you've seen this last week. I know you had a story you thought would be a fun, fun for us to talk about. What do you got?\r\n\r\n\r\nTrenton (40:56.595)\r\nOkay, we had an awesome guest speaker come in for Tribe, Darren McKee. He has tons and tons of followers on LinkedIn, if you guys know him, and talked a lot about social selling and just sales in general. And I think it's interesting. There's a trend that I'm seeing where obviously COVID happened. We all know what happened there. And now we have these virtual meetings that happen, virtual sales. So much of this stuff is not in person anymore. When you're in sales,\r\n\r\n\r\nin order to get sales, you have to pattern interrupt. You have to go an extra mile. And it's just so easy to get on calls and do demos and do talk and follow up virtually. And it's great that we can transact that way. But he was talking about how the companies and the people that are winning right now are getting on flights and they're going in person. Like if your contract size, I think he said is over 50K, you should be on a flight at this point. Like you shouldn't be messing around with.\r\n\r\n\r\nNikolas Hulewsky (41:47.342)\r\nHmm.\r\n\r\n\r\nTrenton (41:50.321)\r\nwith virtual selling anymore. Like you should be getting there and getting back in person, cause that will win you those deals. Those relationships will happen like that. I've seen a lot of this anecdotally lately with different business owners that are saying I'm traveling to my customers again and it's winning me those deals or it's helping me to stay with them longer. And just the value that I'm adding there in person is much, much bigger and better. And so I think there's two parts of this. The trend is the business travel in order to get sales and have customers and to make your customers happy.\r\n\r\n\r\nAnd then still like return to office. I'm hearing the teams that are doing it saying, Hey, we're way more productive than we were async virtual. And so it's obviously like something that we've all been talking about for the last five years. But I think that the smart companies and the smart salespeople and the smart leaders are just jumping on it. they're like, I'm going to go in person. I'm going to go sell in person. I'm going to go do that at this point, because that lands better deals, better relationships. And I'm seeing a lot of business owners crush based on doing it at this point. Like curious what you guys are into.\r\n\r\n\r\nNikolas Hulewsky (42:49.358)\r\nChris, you live in Southern California and your business is in Florida. Are you going to Florida more? The same? Less? No.\r\n\r\n\r\nChris Munn (42:54.198)\r\nYeah. No, no less, but I don't sell. So I have a salesperson, so I got less. I mean, the data, think June, sometime in June, they had the highest TSA.\r\n\r\n\r\nThey track how many people go through TSA a day. And June was the highest it's ever been. And for a while, like I don't think travel rebounded until 2023 from like the 2019 numbers, 2020, 2021, 2022 was down. So now 2023, 2024 right now they're seeing the highest numbers they've ever seen. For some reason I used to track this during COVID, cause I was just interested to see like,\r\n\r\n\r\nNikolas Hulewsky (43:19.758)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (43:41.646)\r\nYeah, yeah.\r\n\r\n\r\nChris Munn (43:41.844)\r\nHey, when are people going to travel again? Because I took flights during, I took a flight during COVID, I was the only person on the plane. 737, like 180 seats. I was the only person. But I do think that people are traveling again and the numbers prove that. So that doesn't shock me at all.\r\n\r\n\r\nNikolas Hulewsky (43:52.046)\r\nCheese.\r\n\r\n\r\nNikolas Hulewsky (44:02.216)\r\nI also, to your point, it's easier than ever to get in somebody's inbox. Like I could get their email, I could get their text, I could find them on social media and they'd like, we all go to our email or social media and it's like, I got DMS from people I've never heard of. I don't even look anymore because it's easy to get in there. So like you said, the pattern interruption, the ability to differentiate is like getting out, getting in person, building a real relationship face to face. That's where you're going to see deals actually close.\r\n\r\n\r\nChris Munn (44:30.816)\r\nOkay. So.\r\n\r\n\r\nTrenton (44:31.645)\r\nYeah, yeah. Some ideas that came out of that too, founders dinners or like your ICP, whoever your ideal customer profile is, pulling people together in a city and saying, hey, we're gonna go do a cool dinner here or there, or even hosting a private dinner at like an Airbnb with a private chef was an idea too. But things that get your customers to you and you meeting with them in person and spending actual real time. Because relationships as we know are what sales are built on. Pre-COVID, almost all big sales were done this way.\r\n\r\n\r\nAnd so I don't know, it'll be interesting to see what happens.\r\n\r\n\r\nNikolas Hulewsky (45:05.356)\r\nWell, it's happening,\r\n\r\n\r\nChris Munn (45:05.557)\r\nYeah. Yeah. I think we're in the post-COVID world. think everything that we thought was going to stay inside because of COVID hasn't, or has come back.\r\n\r\n\r\nTrenton (45:19.763)\r\nYeah.\r\n\r\n\r\nChris Munn (45:21.422)\r\nI mean, I go here, I go to the mall, there's people at the mall. So I think that people have gone back outside, which I think is great. I think it's great for the business and I think it's great for society in general. I don't think people are meant to be cooped up in the house. So go outside. It's fun. It's fun out there.\r\n\r\n\r\nTrenton (45:25.543)\r\nYeah.\r\n\r\n\r\nTrenton (45:43.279)\r\nIt's fun.\r\n\r\n\r\nNikolas Hulewsky (45:45.87)\r\nTouch grass, Chris says.\r\n\r\n\r\nChris Munn (45:47.792)\r\nYou know? Gotta do it every once in a while.\r\n\r\n\r\nNikolas Hulewsky (45:51.244)\r\nI it.\r\n\r\n\r\nChris Munn (45:52.052)\r\nSo yeah, go to that meeting in person. Flight prices are kind of crazy though. Let me just say. I tried to go to Atlanta and it was like $1,200 and I said...\r\n\r\n\r\nto go to Georgia. That feels high.\r\n\r\n\r\nNikolas Hulewsky (46:05.187)\r\nlearning.\r\n\r\n\r\nNikolas Hulewsky (46:08.706)\r\nJust you?\r\n\r\n\r\nChris Munn (46:10.196)\r\nOne ticket, get round to it. Something's going on with Delta. No, no, something's going on with Delta. Delta, I think all the airlines used to be in cahoots. I think they got fined for that, but on prices and they all used to be like within this band. And now Delta has just said, we're the premium airline and we're going to charge like it. so routes that only Delta serves, which are monopolies by the way. That's another story.\r\n\r\n\r\nTrenton (46:12.435)\r\nThat doesn't make sense.\r\n\r\n\r\nNikolas Hulewsky (46:12.878)\r\nDid you buy it like the hour before?\r\n\r\n\r\nChris Munn (46:40.062)\r\nThey're super high, super, super high. So it's a delta thing.\r\n\r\n\r\nNikolas Hulewsky (46:44.046)\r\nAll right. else? We good? I don't. All right. This has been great. I'll talk to you guys next week once the Fed lowers it another 25 basis points. We'll see where we are.\r\n\r\n\r\nTrenton (46:50.865)\r\nThat's it.\r\n\r\n\r\nChris Munn (46:53.032)\r\nGood.\r\n\r\n\r\nChris Munn (46:58.524)\r\nwe meant to ask, no, Curtis had a question. Why don't we do Curtis's question to close it out.\r\n\r\n\r\nNikolas Hulewsky (47:03.52)\r\nyeah, yeah, okay, yeah, yeah, sorry, Curtis question.\r\n\r\n\r\nTrenton (47:07.645)\r\nCurtis's question, was preferred sock height and preferred sock brand.\r\n\r\n\r\nNikolas Hulewsky (47:17.834)\r\noff to, hey Liz.\r\n\r\n\r\nNikolas Hulewsky (47:23.672)\r\nI have another podcast lighting up after this. Okay, preferred sock height and preferred sock brand. Chris, you go first.\r\n\r\n\r\nChris Munn (47:31.834)\r\nOkay, very much depends. If you're working out, doing anything like that, playing sports, it's the mid calf, the mid calf height from bombas. Bombas makes great socks. If you, if you are just casual going out, going, just running errands.\r\n\r\n\r\nNikolas Hulewsky (47:46.286)\r\nOkay.\r\n\r\n\r\nChris Munn (47:53.832)\r\nPlease wear no-show socks. Nobody wants to see your ankles. Or nobody wants to see the socks covering your ankles. Look side.\r\n\r\n\r\nNikolas Hulewsky (48:02.158)\r\nOkay, okay.\r\n\r\n\r\nTrenton (48:03.325)\r\nWhat's funny is I know that we've all been together. have a picture with Nick where he's definitely not wearing no-show socks. I think you're wearing like not quite knee-high, but they're definitely shin-high socks. And they're white. Shin-\r\n\r\n\r\nChris Munn (48:12.556)\r\nShin and Shin. OK, let's hear this. Shin high is terrible. OK, Kareem Abdul Jabbar, let's hear it.\r\n\r\n\r\nNikolas Hulewsky (48:13.102)\r\nAll right, all all right, all right. I got thoughts on this.\r\n\r\n\r\nI got thoughts on this. Okay, I got thoughts on this. I'm gonna, I'm just gonna say it. I look, I'm wearing my converse and my knee high socks. I don't really wear clothes unless somebody buys them for me. So all the socks that I have have been given to me as gifts. All right. And so some of them, I don't know, like the stance socks that like come up to my mid knee, I'm wearing them. I'm sorry. I'm not, I'm not going out buying myself new socks. And so yes, I look like a moron.\r\n\r\n\r\nTrenton (48:19.699)\r\nI'm sure I have.\r\n\r\n\r\nChris Munn (48:45.52)\r\nIs it because you spend all your money on AI?\r\n\r\n\r\nNikolas Hulewsky (48:49.272)\r\nYeah, that's because.\r\n\r\n\r\nTrenton (48:50.183)\r\nYeah.\r\n\r\n\r\nI can't, it's like, it's hard to see in here, but here is Nick with his high white socks. There you are, Chris in the background. Yep.\r\n\r\n\r\nChris Munn (49:00.969)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (49:04.814)\r\nDon't be jealous. Don't be jealous. Hey, look, it's like the 75 degree weather. It's warm enough where I don't need a sweatshirt, but I might get a little chilly, so let me wear longer socks. I think you guys understand.\r\n\r\n\r\nTrenton (49:16.659)\r\nI feel like, please tell me this was New Balance. Are you wearing New Balance? no, they were Adidas. I feel like you're embodying the dad ensemble of the high white socks. Do you own New Balance? White New Balance shoes?\r\n\r\n\r\nChris Munn (49:19.218)\r\ndon't, but...\r\n\r\n\r\nChris Munn (49:25.118)\r\ndata.\r\n\r\n\r\nNikolas Hulewsky (49:32.558)\r\nYou're welcome.\r\n\r\n\r\nI do not own New Balance. I wouldn't be against it. But again, if my wife bought them for me, I'd wear them. Because I don't buy clothes. Like this shirt right here. It's like, I was given to me because my nephew went on a mission. And so that's one of my favorite shirts. I just like to wear it. I don't know what to say. Chris needs to give me tips.\r\n\r\n\r\nTrenton (49:42.163)\r\nYeah.\r\n\r\n\r\nTrenton (49:53.459)\r\nThere go. There we go. I'm a no-show socks, the other below the ankle. I'm not a psycho, so.\r\n\r\n\r\nChris Munn (49:55.732)\r\nWhat about you, Trin? What are you where?\r\n\r\n\r\nChris Munn (50:04.272)\r\nYeah, no show sucks.\r\n\r\n\r\nNikolas Hulewsky (50:08.334)\r\nPsycho.\r\n\r\n\r\nChris Munn (50:11.186)\r\nNo show socks. Yeah, I agree. No show socks. Bambas makes good socks. They're expensive, but they're good. But I don't mind spending money on socks and underwear. Those are two things I don't mind spending good money on. Cause they're tight, they're fitted, and I want to be comfortable.\r\n\r\n\r\nNikolas Hulewsky (50:14.659)\r\nmy gosh, it's great.\r\n\r\n\r\nNikolas Hulewsky (50:18.912)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (50:29.836)\r\nI'm gonna say something right now and I wanna get your guys' opinion. I would rather wear underwear two days in a row than socks two days in a row. No chance? I can't wear, I cannot wear socks two days in a row. It just, what am I doing?\r\n\r\n\r\nChris Munn (50:40.868)\r\nNo chance. No chance.\r\n\r\n\r\nChris Munn (50:46.964)\r\nWhat are you doing? What? I would think if, okay, maybe if I did a ton of walking, but if I did a ton of walking, I need to change my underwear.\r\n\r\n\r\nNikolas Hulewsky (50:58.53)\r\nThat's a very good point. Apparently I have.\r\n\r\n\r\nTrenton (50:58.899)\r\nThat's true.\r\n\r\n\r\nChris Munn (51:00.948)\r\nSo let's say you had a bit less. Okay, let's say you had an active day and an inactive day. If you had an active day, do you feel the same way? Or is this just like more of an inactive day you feel like?\r\n\r\n\r\nNikolas Hulewsky (51:12.426)\r\nif I had an active day.\r\n\r\n\r\nYeah, if I had like a very active day, like I went to the gym, yeah, no, I'm not gonna wear my gym clothes two days in a row. But you know, maybe I have metatarsal hypohydrosis. Maybe I just sweat in my phalanges like crazy, I don't know. I just, my socks are gross. Anyways.\r\n\r\n\r\nChris Munn (51:18.409)\r\nYeah.\r\n\r\n\r\nOkay, okay, understood.\r\n\r\n\r\nChris Munn (51:30.546)\r\nI it. That makes sense. I get it. That's not too crazy. I can get with\r\n\r\n\r\nNikolas Hulewsky (51:37.102)\r\nWhat a way to end it. What a way to end it. I like that one. Thank you, Curtis. I think that was a good one.\r\n\r\n\r\nTrenton (51:39.271)\r\nas\r\n\r\n\r\nChris Munn (51:41.245)\r\nThanks Curtis. Yeah, thanks Curtis.\r\n\r\n\r\nTrenton (51:41.843)\r\nThank you, Chris.\r\n\r\n\r\nNikolas Hulewsky (51:45.358)\r\nYeah. All right. Stay on here for a second. Let's let this.",
  "metadata": {
    "duration": "",
    "date": "2025-09-29",
    "platform_source": "Google Drive"
  }
}