{
  "episode_number": "91",
  "episode_title": "3 Rollup Mistakes That Will Cost You Millions with Steve Wiesner",
  "guest_name": "Steve Wiesner",
  "business_name": "Watershed Associates",
  "transcript": "﻿Nik (00:01.509)\r\nAll right, Steve, welcome to Niconomics. So, good to you, my friend. Let's just dive into it. Tell the people who you are and what do you do to make money.\r\n\r\n\r\nSteve Wiesner (00:12.366)\r\nPerfect. Sounds good, Nick. Thank you very much for having me, man. I really appreciate it. Love your stuff. I really have enjoyed watching the podcast and I appreciate the opportunity to be here. So Steve Wiesner did about 20 years of investment banking and private equity before getting full time into entrepreneurship. And now I own a company called Watershed Associates, which is a leading negotiations training company. So that is how I make money and spend my most of my waking hours.\r\n\r\n\r\nNik (00:41.073)\r\nThat is awesome. When did you start that business?\r\n\r\n\r\nSteve Wiesner (00:44.686)\r\nSo I acquired Watershed actually two years ago exactly. It was August 29th of 2022. yeah, two fun years. It's been a blast and lots of great stuff that's been going on. I am a big advocate of smart acquisitions and it made a lot of sense for us to buy this business.\r\n\r\n\r\nNik (01:03.089)\r\nOkay, so I wanna go back a little bit. You've got a ton of experience. said investment banking. You're now in the, I shouldn't say ETA space, but you've bought a business. Walk us through your experience, kind of. When did you start in the industry and how did you kind of get to the point where you decided, all right, I'm actually gonna buy a business. I'm no longer gonna be on the necessarily investment side. I'm gonna jump in here.\r\n\r\n\r\nSteve Wiesner (01:12.866)\r\nYep.\r\n\r\n\r\nSteve Wiesner (01:26.349)\r\nYou\r\n\r\n\r\nSteve Wiesner (01:30.126)\r\nSo is this a Lex style eight hour podcast? Cause you're going to need that much.\r\n\r\n\r\nNik (01:32.931)\r\nIt's not. It's not. So I'm going to cut you off if you start rambling. Don't worry.\r\n\r\n\r\nSteve Wiesner (01:37.166)\r\nI could I could cry a river for a long long time. So born and raised in Canada, came to the US in 1993 went to B school in the States, wanted to go to Wall Street for reasons I won't bore you with right now, but always wanted to go to Wall Street. And that's what I did after I graduated from B school, and went to work for an amazing firm that no one today has probably really heard of called Donaldson, Lufkin and Jenrett. But at that time, it was a\r\n\r\n\r\ntremendously successful boutique firm that became much more than that. And what really made DLJ was that after Drexel Burnham blew up, which was the junk bond house, a lot of those Drexel bankers came over to DLJ and started a high yield group. so DLJ was an investment bank, correct, with a merchant banking operation as well. So we did private equity investing also, not the group I was involved in, but we did both.\r\n\r\n\r\nNik (02:21.425)\r\nSo is DLG an investment bank?\r\n\r\n\r\nNik (02:32.219)\r\nCan you just quickly describe what's the difference between an investment bank and the merchant side like you were talking about?\r\n\r\n\r\nSteve Wiesner (02:37.326)\r\nSure. Think about investment banking as being straight up advisory and that advisory work could be on high yield deals or on mergers and acquisitions or on IPOs, you name it, but you are operating in an advisory capacity. That is what investment banking is. Merchant banking, and I say that with a bit of a grin because that's a bit of a lost art, if that's the right term, merchant banking used to be investment banks who would also dabble on the principal side.\r\n\r\n\r\nNik (03:00.933)\r\nOkay.\r\n\r\n\r\nSteve Wiesner (03:05.046)\r\nAnd they would also make investments from a private equity perspective. You have to be mindful of conflicts, but we did merchant banking, we did both investment banking and private equity where we also invested in companies.\r\n\r\n\r\nNik (03:16.527)\r\nOkay, so you started on the advisory side with BLJ and like cut your teeth there, got some exposure. How long were you there?\r\n\r\n\r\nSteve Wiesner (03:19.022)\r\ncorrect.\r\n\r\n\r\nSteve Wiesner (03:23.202)\r\nYep. I was at DLJ and then we got acquired by Credit Suisse. So I was there for seven years between those two firms. And what was really interesting about DLJ is because we had such a great high yield bond franchise. What that meant was we were kind of one of the first to actually spend a bunch of time with this emerging group of money managers called private equity firms, because private equity firms needed to issue high yield debt to acquire the businesses, right? So\r\n\r\n\r\nvery early on, were dealing, mean, mid 90s, early 90s to mid 90s, we were dealing with these amazing private equity firms that literally at that point in time, we're just managing a handful of billions of dollars. So I remember putting a slide together back probably in 95, where there were only 1616 private equity firms in the world that managed more than a billion dollars. Yeah, think about that.\r\n\r\n\r\nNik (04:17.029)\r\nNo way!\r\n\r\n\r\nSteve Wiesner (04:20.278)\r\nAnd now it's a trillion dollar asset class, right? So very early on I was, I was calling on really big private equity firms because no one else called on them. No one else was paying attention to them frankly, back then, but DLJ did. So I had a very early look at what private equity looked like in those very early days.\r\n\r\n\r\nNik (04:22.469)\r\nYeah.\r\n\r\n\r\nNik (04:31.334)\r\nHmm.\r\n\r\n\r\nNik (04:37.169)\r\nSo on the investment banking side, what I didn't realize for a long time, and you can correct me if I'm wrong here, but investment banking is dealing with large companies, right? You're giving, you're working in an advisor capacity for, like these aren't $5 million SMBs. These are 50, 100 billion dollar companies. Can you talk a little bit about the private equity structure? Cause it's an interesting, I guess,\r\n\r\n\r\nstructure that you have exposure to.\r\n\r\n\r\nSteve Wiesner (05:11.79)\r\nWell, so one thing just to clarify as well is back in the early mid 90s, we were dealing with significantly smaller companies. Now, that doesn't mean SMBs, right? I mean, these are still companies that were doing 10 million of EBITDA to 25 million of EBITDA, but not every company was a multi billion dollar company by any stretch. And one of first\r\n\r\n\r\nNik (05:32.017)\r\nYeah, I ran those together. I met 50 million, 100 million, and then I got to billion. I didn't mean $50, $100 billion companies. just mean these are, like you're saying, much larger companies than the typical SMB.\r\n\r\n\r\nSteve Wiesner (05:42.694)\r\nMuch larger companies. Exactly. so in terms of the way private equity is structured, it's fairly straightforward. Frankly, these you get a few guys and gals who get together and they decide they're going to start a fund and they go out and they raise money from sometimes friends and family. But typically it's going to be institutional investors of one form or the other. So they'll go to Cornell and they'll go to family offices and they'll say, we want to raise a billion dollars. And those limited partners will commit capital to that fund.\r\n\r\n\r\nNow they don't just stroke a check and all the money goes directly to the fund. It's called. So when a private equity firm wants to do a deal, they will call capital from those LPs and those LPs are obligated to stroke a check to fund that transaction. And they'll do that. Let's say it's typically like a 10 year life basically on a private equity fund in general, sort of five to seven year investment period. For the most part, funds are going to acquire a business. They're going to hold it for, let's say, I'd say the average hold period now is probably around five years, maybe a little longer given what we've gone through the past couple of years.\r\n\r\n\r\nNik (06:16.411)\r\nYeah.\r\n\r\n\r\nSteve Wiesner (06:42.274)\r\nBut generally speaking, they want to hold for around five and hopefully sell it for a lot more than what they bought it for.\r\n\r\n\r\nNik (06:47.313)\r\nYeah, and most private equity, at least in my experience, are focused on leverage, right? mean, you take it from the first perspective, you're going and raising money from LPs. Those LPs want to see at least a 15%, let's just say. 15 % return annualized on their money. But then they also take that same money and are using it as a down payment and then leveraging debt on top of that down payment. And so you kind of have two debt classes, if you will. have the LPs, not really debt, but\r\n\r\n\r\nSteve Wiesner (07:08.12)\r\nCorrect.\r\n\r\n\r\nNik (07:16.305)\r\nthey get paid out first and then the debt that they're taking on to buy that business. And so there is just an inherent push for 20 % annualized returns, growth, buying good companies and making sure that you're making good investments, which I think private equity has earned sort of that reputation of being ruthless or coming in, cutting costs, et cetera. that's the structure. That's their incentive. They have to be very profitable in order to get the types of returns that are going to attract the money that allow them to purchase these businesses and grow.\r\n\r\n\r\nSteve Wiesner (07:45.518)\r\nThe reason you me smirk a little bit is it's so funny because when I used to run models way back in the day, we would be penciling out a 45 % IRR on these deals. And again, much larger deals, it just shows how inefficient the market was back then. And now you're right. I mean, there's a lot of a lot of downward pressure, which introduces interesting dynamics, by the way, I don't want to get too wonky, but between the debt and the equity, I mean, it was always interesting when you would see mes lenders, for instance, who\r\n\r\n\r\nwould be penciling a higher returns than equity, which weirdly would actually happen sometimes. So different people in the capital structure would have different assumptions upon the types of returns that they were looking for. But again, I don't want to get too much into the weeds. I think you're right though, they clearly leverage as part of what they generally speaking are doing. But I will tell you that, and maybe this is a zurp phenomenon, given the fact that there's multiples have gotten so stratospherically high.\r\n\r\n\r\nNik (08:24.497)\r\nYeah. Dance.\r\n\r\n\r\nSteve Wiesner (08:42.518)\r\nThis is one of the big disconnects that I do have about private equity these days with a lot of folks who are very anti -private equity. You are not going to earn a return unless you grow the business. Almost without exception. Growth is a critically important driver of return these days. You certainly can't bank upon excessive amounts of leverage in the environment that we find ourselves in today. Debt has gotten very, very costly, obviously. You certainly can't bank on multiple arbitrage. So that's one thing and this could\r\n\r\n\r\ndovetail into what we talked about with roll ups, where you buy a small business, you grow it three times, and then you're going to get a higher multiple on exit than what you purchased it for. Multiples are often are also driven by interest rates, meaning there's a negative correlation between interest rates and multiples. So if interest rates are going up, multiples are going down, generally speaking. And so that does take away\r\n\r\n\r\nsome of the ease with which you could assume you could buy something for five and sell it for seven or 10 or 12 at some point in the future. So with multiple arbitrage going away with leverage being harder to come by, the only way you're getting a return is by actually growing the business, which means you have to be investing. You got to be smart. And I think a lot of people still think about slash and burn. It really does not work that way anymore.\r\n\r\n\r\nNik (09:59.227)\r\nSo for you, as you were doing this, you're at DLJ, how long did you stay in the investment banking role and when did you transition out?\r\n\r\n\r\nSteve Wiesner (10:09.529)\r\nSo, DLJ was there for, like I said, about seven years. Then I became a, I'm gonna, I chuckle only because these are, it wasn't called this back in the day, but I became a fundless sponsor. So, I teamed up with a private equity firm and a family office. This was in 20, I'm trying think when that would have been, probably 2003 timeframe. And for a number of years was out there looking for deals with this family office, a wealthy family and with this private equity firm.\r\n\r\n\r\nSo I went to the buy side. from the sell side, which is investment banking to the buy side, which is fundless sponsor in that case, I went.\r\n\r\n\r\nNik (10:45.041)\r\nCan you kind of explain what a fundless sponsor is? we have listeners who are, they have no idea what that means. You're like, fundless sponsor, that's an oxymoron. How can you sponsor something if you have no funds?\r\n\r\n\r\nSteve Wiesner (10:53.792)\r\nIt is exactly. So basically I had no money and I was out there putting myself forward as if I had money because I did have money behind me, but I didn't have the money to stroke checks to buy a hundred million dollar business or whatever it may be. And so that's effectively what it was. It was somebody who was out there looking for deals, who didn't have a committed fund to actually execute that transaction. You find the deal and then you find the money.\r\n\r\n\r\nfor all intents and purposes. That's a very simplistic way of looking what upon the sponsor does.\r\n\r\n\r\nNik (11:25.339)\r\nYeah. And it's it's different than a searcher. I mean, we've had like the self funded searcher that's kind of come in. But typically a search fund model will be you go raise money and then there's committed I shouldn't even say committed capital. Basically, they have a first right of first refusal to invest in that deal. But a fundless sponsor is not I'm assuming you didn't actually raise money to pay for your living expenses while you're searching for that business or did you?\r\n\r\n\r\nSteve Wiesner (11:30.872)\r\nHmm, there's similarities.\r\n\r\n\r\nSteve Wiesner (11:55.01)\r\nNo, but I would get paid by the capital sources as well. So yeah, there were there I was I was covering my nut, so to speak, with with fees while I was searching. So there actually were some similarities in terms of the way that that model worked. And similarly, I had the latitude to be able to take a deal somewhere else if my my two partners decided that that wasn't something that was of interest to them. So I think that there is a comparison to a searcher.\r\n\r\n\r\nNik (12:21.649)\r\nInteresting.\r\n\r\n\r\nSteve Wiesner (12:22.126)\r\nBut I was focused on much larger deals, again, sort of 100 million to $500 million transactions is where my focus was.\r\n\r\n\r\nNik (12:30.043)\r\nSo again, great experience. What made you take the jump into just entrepreneurship? Because I'm assuming you didn't buy a hundred million dollar business and own a hundred percent of it. Why the switch?\r\n\r\n\r\nSteve Wiesner (12:39.096)\r\ncorrect.\r\n\r\n\r\nSteve Wiesner (12:43.118)\r\nSo then I went back and forth. mean, after that Fundless Sponsor gig was up, because I went a few years without getting a deal done, I went to the sales side again. So I went back into investment banking, worked with the middle market investment bank, working on smaller deals than DLJ did. So let's say typically 100 to $250 million deals. And then I went back, my final stop in finance was another private equity firm out of Seattle called Evergreen Pacific Partners, which is no longer around, but was at\r\n\r\n\r\npretty well known firm up in the Pacific Northwest. I always wanted to be an entrepreneur. And I think that that was reflected in many ways. And I was always fascinated with technology. So in 2012, I actually started a software business that I ran for a number of years, again, beyond the scope of today's conversation, but did not end up working out after many, many years of trying and\r\n\r\n\r\nBut that pivoted me into the training business, which is what took me ultimately to watershed and getting this deal done two years ago.\r\n\r\n\r\nNik (13:44.753)\r\nAnd so the training business that you have is focused, what's your target customer? Who are you helping in the negotiations?\r\n\r\n\r\nSteve Wiesner (13:52.59)\r\nGenerally speaking, Fortune 100 to 250 companies and 60 to 70 % of our business is procurement supply chain. So we spend a lot of time with procurement teams. But we do a lot. We work with legal teams, work with sales organizations, etc. We do work with private equity portfolio companies as well. But we tend to work with much larger global companies, which means it's also a very, for a small company, it's a very global business. So we've delivered in 40 countries on the ground. I spent a lot of time on airplanes, which is\r\n\r\n\r\nNik (13:59.825)\r\nI don't want to just.\r\n\r\n\r\nSteve Wiesner (14:22.03)\r\nfun, but it's also tough when you're as old as I am. I'm not 23 years old anymore.\r\n\r\n\r\nNik (14:23.192)\r\nHahaha\r\n\r\n\r\nNik (14:27.153)\r\nDude, you have amazing experience. SMB business owner, obviously, a failed venture, but you've also got investment banking and private equity. You're working with Fortune 100 companies. That's just a breadth of knowledge that, mean, frankly, most people don't get to, even over the course of their career. What is your favorite stage to play in? Is it the SMB?\r\n\r\n\r\nSteve Wiesner (14:30.062)\r\npretty cool. It really is.\r\n\r\n\r\nNik (14:55.245)\r\nIs it the, you know, the venture space? Do you like the PE corporate? Like where do you feel the most comfortable?\r\n\r\n\r\nSteve Wiesner (15:04.064)\r\nGreat question. And I've never been asked the question that way before. I loved all of them in different ways. I hated all of them in different ways. Right? All of them are very polar. mean, some days you love it, some days you hate it. But net net blessed with the experiences that I've had. But I am not just saying this because I have to it's true. Today's my favorite day.\r\n\r\n\r\nNik (15:15.865)\r\nYeah.\r\n\r\n\r\nSteve Wiesner (15:31.158)\r\nDoing what I'm doing right now is my favorite day. And I think everything I've done in the past has led me to a position where I can be successful doing what I'm doing right now. And I love the impact of being an SMB. love the feeling of the wins are just so high. The feelings of losses are so low. It's still a very binary, extreme up and down, as is the case with any SMB.\r\n\r\n\r\nIt's just an adventure. And from my perspective, that's what life is all about. And I've been very blessed to live an adventure. My career has been very cool.\r\n\r\n\r\nNik (16:08.241)\r\nSteve, I'm need you to be a little bit less emotionally mature for the rest of our conversation. This is not gonna play well. This is not gonna play well. I'm just kidding. One thing I'm excited to talk to you about because of your experience is the private equity space, in particular, this thing that gets thrown around, which are roll -ups. And there are a lot of people who own small businesses that know private equity exists. They've probably lost a deal.\r\n\r\n\r\nprivate equity and most of time it's probably private equity who want to do a roll -up type strategy. Will you give just a broad overview of what is the private equity roll -up strategy?\r\n\r\n\r\nSteve Wiesner (16:54.926)\r\nRoll ups, buy and build, add -ons, tuck -ins, there's all this terminology that gets thrown around for what's effectively the same thing, which is that a private equity firm goes and buys a platform. So let's say they spend $100 million on a home services business or half a billion dollars on a home services business. And then an important part of their thesis is to go out there and consolidate what is a very fragmented market. So\r\n\r\n\r\nthey buy a large business, they then go and buy a lot of smaller competitors that they will then as add -ons or quote unquote tuck -ins to their existing platform company. So the platform is the big one and the add -ons will be the ones that they sort of roll up so to speak as they progress in their thesis. They're still growing that core business. It's not as if all of the growth is expected to be generated through these add -on acquisitions, these smaller add -on acquisitions, but it's an important part of\r\n\r\n\r\nthe thesis. And private equity has been tremendously successful doing these add on acquisitions. It to say it's a legitimate strategy is a silly understatement. It is a core strategy of private equity. But it isn't without peril. And there's been plenty of very high profile roll ups that have ended up blowing up costing billions of dollars ultimately. So even for the big players, it is not without risk.\r\n\r\n\r\nNik (18:17.552)\r\nYes.\r\n\r\n\r\nNik (18:20.827)\r\nSo I'll add some, this is my own experience dealing with private equity. And from what I have seen, the multiple arbitrage is a very big component of the rollup strategy. And the way I would describe it is this, if I'm a small business owner or just an entrepreneur, watchpreneur, and I'm trying to buy a business and it does, let's call it a million dollars in EBITDA.\r\n\r\n\r\nAnd it's a little bit small for roll up, but for purposes of illustration, let's just say it's a million dollars in EBITDA and I'm competing against a private equity fund. I'm looking at that million dollars of EBITDA and saying, I can pay three to five times, maybe five times EBITDA, $5 million. That's just the range that those things trade in when you're dealing with a million dollars in EBITDA. The private equity fund though, is looking at that and saying, hmm, I'm not just looking at this one that doing a million dollars in EBITDA.\r\n\r\n\r\nI have a platform and I also have five other million dollar EBITDA businesses that when I package them together, I now get to $5 million of EBITDA. And the multiple range there is no longer three to five, it's call it six to eight. So if I can buy them at a lower multiple and sell them at a higher multiple, the Delta, the difference is that multiple arbitrage. So they're willing to pay potentially six times earnings.\r\n\r\n\r\nand outbid me the entrepreneur because it doesn't make sense for me to pay six times earnings, but for them, they can buy it at six times, roll it up together, and it's instantly accretive because now they're combined EBITDA is $6 million and they're trading at a higher multiple range. Is that, did I articulate it correctly? Okay.\r\n\r\n\r\nSteve Wiesner (20:01.614)\r\nbeautifully. I think that was very well put. But you've also, by intention or otherwise, introduced one of the problems that comes with roll ups is that there is a very strong argument to be made that it can sap purchase price discipline. Because people sit there and say, well, my platform is worth eight times. So you know what, this thing's really only worth four, but you know what, I'll pay five, because I'm still getting three turns of arbitrage. Right?\r\n\r\n\r\nNik (20:30.553)\r\nYep. Yep.\r\n\r\n\r\nSteve Wiesner (20:31.596)\r\nSo the good players in the market are still very disciplined about purchase price, even though they do have that arbitrage cushion behind them. But it doesn't sometimes for some people, it doesn't still some poor decision -making or flawed decision -making.\r\n\r\n\r\nNik (20:41.647)\r\nMm -hmm. Yeah.\r\n\r\n\r\nNik (20:46.991)\r\nWell, into your point, I've seen private equity funds that have gone out and had a thesis and they've said, okay, I'm to go and roll up X space and they overpay because they've got an over reliance on this multiple arbitrage. And then because they didn't execute operationally and now we're in a different rate environment, they're trying to divest these, but they can't even divest them for what they purchased them for at this point. Like they have to mark them down because\r\n\r\n\r\nSteve Wiesner (21:01.592)\r\nMm\r\n\r\n\r\nNik (21:16.091)\r\nThey didn't run them well. Multiples have changed. And their thesis was ultimately dependent upon the multiple arbitrage and not like you were saying, the organic growth or even the platform growth through the tuck -in acquisition. it can be a high risk, high reward situation when you're working in a ZERP environment and kind of throwing valuations out the window because, we'll just make up for it in arbitrage when we sell it upstream to one of these other companies that want to potentially go public.\r\n\r\n\r\nSteve Wiesner (21:21.794)\r\nfor the first.\r\n\r\n\r\nSteve Wiesner (21:43.246)\r\nYou also just mentioned something huge with regards to integration. And if you look at a lot of the public roll ups that blew up, you know, 20 years ago and some very high profile ones off and often under the cloud of accounting fraud, because you had the finance people trying to cover up the problem. And the fundamental problem with the model was in a public company context. I want to avoid getting too wonky here, but their stock is their currency, right? And\r\n\r\n\r\nI want to do this in a way that's that's I'm not getting too far down a rabbit hole but the point being if your entire business model is predicated upon successfully acquiring smaller companies and one company Integration goes sideways and it bogs down the corporate development team or the operations team etc And they can now the pipeline of deals slows down What that means is earnings will slow down\r\n\r\n\r\nbecause they now can't go and acquire another deal to keep the momentum of earnings growth going. And so what ended up happening with a lot of these big companies is something would clog up the pipe. They would miss earnings. The stock price would fall. The multiple would fall. So to your point, now the arbitrary, the multiple spread is starting to contract. Sellers now didn't want to take the paper, didn't want to take their shares, the stock, because the stock was going down. now they, another deal wouldn't happen. And\r\n\r\n\r\nNik (22:47.11)\r\nMm\r\n\r\n\r\nSteve Wiesner (23:11.97)\r\nthat's where you started this death spiral of a lot of the publicly traded roll ups. So it was a really fascinating time, but it just shows integration is really hard. And you have some very smart private equity people on Twitter, on X, who appropriately say like, you can do, it's not impossible. You can do really good integrations, but it's a lot harder than a lot of those folks.\r\n\r\n\r\nNik (23:16.433)\r\nInteresting.\r\n\r\n\r\nSteve Wiesner (23:38.086)\r\nA lot of those folks are very gifted at what they do, or they have benches of people who are very gifted at what they do. For a lot of people, integrating acquisitions is very difficult and fraught with peril, change management, people issues. It's just gonna be a lot harder to integrate than a lot of people realize.\r\n\r\n\r\nNik (23:46.662)\r\nvariables.\r\n\r\n\r\nNik (23:53.073)\r\nYeah, and to me, that's where I've seen a lot of private equity companies struggle is that operational piece because you sit there and on a spreadsheet, it's like, well, if can buy it for this and then sell it for this, there's multiple arbitrage. And all I have to do is eliminate 12%. And but when you get boots on the ground, it's hard to get a team to buy into a new owner. It's hard to get them to buy into a new vision. It's hard to get them convinced that, a private equity fund is actually has my best interest at heart. And they're not just going to come in and cut my benefits and like\r\n\r\n\r\nSo there is this people tax that you can't recognize in a spreadsheet. And you don't necessarily understand that until you've actually done a couple of these deals. And then you can build it into your models and be a little smarter. But I do want to talk about what you said earlier for a roll -up. yeah.\r\n\r\n\r\nSteve Wiesner (24:28.92)\r\nMm -hmm.\r\n\r\n\r\nSteve Wiesner (24:39.436)\r\nactually one thing before we move on though, because you just nailed your people tax comment was just so that was beautifully put. I just wanted to share one anecdote that I actually just you saying that triggered in my mind about the difficulty from a people perspective. And I think roll ups and very people intensive businesses are much harder than, you know, trans time with aerospace components, right? Or like brand scaffolding. Those are those in a way, are better roll ups than\r\n\r\n\r\nNik (25:01.541)\r\nRight, right.\r\n\r\n\r\nSteve Wiesner (25:08.302)\r\npeople had really people heavy businesses. And here's an example of why I was on a conference call very early on in my private equity days with a business owner of a very sizable industrial services business. And one of our operating executives who was going to basically come in and work alongside this company to the extent that we ended up doing this deal. And the guy that we were working with the operating executive had spent 20 years in the industry.\r\n\r\n\r\nget on the call, and this was the olden days of the conference call as opposed to Zoom, it would have been hysterical at the Zoom. I swear Nick, within 60 seconds, the owner of the business says, Jerry, you know, it's good to see you again. I haven't seen you guys since you screwed up the Acme deal.\r\n\r\n\r\nSteve Wiesner (25:57.134)\r\nBoom, the gloves dropped immediately. An hour long call was over in like 12 minutes. It was insane. And so this is the thing when we talk about roll ups and, yeah, we'll just put this home services company together. This one, if those people have been competing against each other for 20 years, do you think it's just so easy to snap, snap two fingers and say, Hey, we're all going to be friends and work under this common plot. There's a lot of politics, a lot of personality, a lot of things that go into this that can blow up your deals.\r\n\r\n\r\nNik (26:20.945)\r\nThere is.\r\n\r\n\r\nNik (26:25.029)\r\nIt's the same. It's the same way I feel whenever I talk to a searcher or anybody who's like, I want to buy a business. And then I'm going to hire an operator to run it. It's the same exact thing because do know how freaking hard it is to find a good operator? It's so freaking hard. I worked in healthcare. I managed multiple locations and I had to find administrators to run these locations. It is really, really hard to find talented people who care about the business as much as you do. And to think I'm just going to buy a business and find an operator.\r\n\r\n\r\nthat it just does not work that way. it's, and I don't even fault them. They just haven't had the experience yet. It's just an immature perspective on things. And I don't mean that in a negative way. They just haven't gained enough experience to understand, it's really hard to do the integration. I wonder if we could go back to just talking about the framework for a roll up. And you said it as well, tuck ins, roll ups, they all kind of have different names that mean the same thing. I do think there is one difference.\r\n\r\n\r\nbetween a private equity roll -up and a private, you know, hold co -building, you know, quote unquote. And to me, it's the expectation returns. Whereas if I own a company 100 % and I decide I wanna grow and I'm gonna go through acquisition, I don't need 20, 30 % IRR in order to justify deploying that capital. I may have a different strategy and I just wanna go and grow market share. so, you know.\r\n\r\n\r\nbottom line performance or cash to me isn't necessarily as important. Whereas on the private equity side, I do feel like there is much more of a push on, all right, we need to see returns within this time horizon very quickly. And I wonder, that the same, am I thinking about it correctly or is that not necessarily how private equity funds are thinking about it today versus 20 years ago?\r\n\r\n\r\nSteve Wiesner (28:16.046)\r\nthere's a lot of accountability with private equity funds. I would say to a certain extent that's been dialed up even more because when you're paying 12 times trailing for a business that now is challenged from a growth perspective because of economic headwinds or whatever it may be, the margin for error is kind of non -existent when you're paying sky high multiples for a business. And so\r\n\r\n\r\nfrom an operating perspective, I'm very sympathetic to a lot of operating executives who go the private equity route and they realize it ain't always a pleasant way to spend your day, especially once the winds start to blow, you know, the debt on the books is weighing on you. You got a board who's breathing down your neck to make sure that you're executing the way you're supposed to be executing. And by the way, you may have differences of opinion with that board in terms of what that growth plan really should be or which people should be.\r\n\r\n\r\nput in different seats. So the pressure is really intense on people operating underneath a private equity platform in my mind.\r\n\r\n\r\nNik (29:15.889)\r\nOkay. Let's talk about the thesis. You said one of the, think core thesises, thesisi? Thesai. I have no idea. Core thesis of private equity funds in the beginning where you're like fragmented markets, you're going and consolidating. I do think that's a core thesis of these rollups is finding a fragmented market and going in as a big player and kind of bringing smaller players together to give you some scale.\r\n\r\n\r\nHow would you define a fragmented market? Do you know what, like, what does that mean?\r\n\r\n\r\nSteve Wiesner (29:49.046)\r\nLots of little mom and pops is what they would say, right? Where you've got a large total addressable market, but a boatload of competitors there who are subscale, lacking resources to scale, be it financial or otherwise. That's the way I would look at a fragmented market. And yes, you absolutely need a fragmented market to do a roll up. But I would say it's kind of like the negotiations business. We always say in our workshops that everything's negotiable, but not everything should be negotiated.\r\n\r\n\r\nI think it's similar with a fragmented market. Some fragmented markets shouldn't be consolidated. Some are fragmented because they kind of need to be fragmented. And I think that is one of the challenges. look, training might, you could make an argument that the training business is one of those industries where it is tremendously fragmented and it probably will always be because rolling up key man, risky, individual, you know,\r\n\r\n\r\nNik (30:19.121)\r\nNo.\r\n\r\n\r\nSteve Wiesner (30:47.234)\r\nprofessional services firms is always very, very challenging because you kind of have to acquire them twice, right? So that's a good example of a market that is fragmented and probably should remain fragmented because going out there and putting on a whole bunch of debt to buy a whole bunch of little training businesses, it's kind of a scary proposition.\r\n\r\n\r\nNik (30:50.811)\r\nVery challenging. Yeah.\r\n\r\n\r\nNik (31:02.833)\r\nIs there a rule of thumb for fragmentation? it like, you know, only 20 % of the marker 20 % or less of the market is controlled by the top five biggest players or I just made that number up. I don't even know if that's in the ballpark. do you know if there's kind of a rule of Okay.\r\n\r\n\r\nSteve Wiesner (31:15.63)\r\nsounds good to me. Not that I'm aware of and I'm sure the Bain consultants will charge you four million bucks to figure out what that number should be for you. No slight to Bain consultants. yeah, I mean, that's good way of looking at it. You just want ample opportunity to be able to go out there and acquire businesses. So certainly fragmentation is one of the traits of a market that is ripe for a\r\n\r\n\r\nNik (31:40.069)\r\nWhat's another trait of a market that's right for roll -ups?\r\n\r\n\r\nSteve Wiesner (31:43.54)\r\nI feel that, and this is, was thinking a lot about brand scaffolding. So brand scaffolding was a company that DLJ actually owned at one point in time. And it was, think of it as being scaffolding for industrial, for oil and gas, for energy, for infrastructure, ultimately for commercial as well. But it was a very successful deal, not only for DLJ, but for like JP Morgan and First Reserve, Clayton Dubler and Rice. Like a lot of folks ended up making a lot of money off a brand.\r\n\r\n\r\nAnd for me, one of the reasons that brand was as successful as it was, was because you had client pressure to consolidate, meaning you had vendor consolidation efforts underway on the procurement teams of these Fortune 100 companies saying, I don't want to have to be dealing with a little mom and pop scaffolding company in 28 different markets. I want to deal with one or not necessarily one single sole source, but I want to be dealing with three or four as opposed to dealing with 28.\r\n\r\n\r\nAnd so the companies were demanding that, especially when it comes to global reach, we have manufacturing facilities in the Netherlands and Singapore and Long Beach. We want one vendor to be able to service all three of those locations. So in that case, if you're a platform company, you're looking at those different markets saying, who can I buy in those markets to tuck in under my umbrella, where we could go to that Fortune 100 client and say, mission accomplished, we can service you in all three of those markets.\r\n\r\n\r\nSo I think that end market dynamics can also be a really good catalyst to say we need to consolidate here.\r\n\r\n\r\nNik (33:22.041)\r\nEnd market dynamics. What about the end market? Just that you can easily enter an end market from a platform or I'm trying to like.\r\n\r\n\r\nSteve Wiesner (33:32.718)\r\nNo, just large customers who don't want to deal with mom and pops. There. That's the very clear way of saying it. Large customers who want to be dealing with a small group of suppliers as opposed to a huge group of tiny suppliers scattered around the country or around the world. So in that case, if you're one of the larger players, you're going to say, how do I get large enough that I'm one of the three or four vendors that that company wants to work with? So boom, I'm going to go out and I'm to do a bunch of that on acquisitions.\r\n\r\n\r\nNik (33:38.555)\r\nOkay.\r\n\r\n\r\nNik (34:01.773)\r\nWhat about, one thing I hear a lot about is recurring revenue or reoccurring revenue, right? Like not necessarily in the SaaS perspective of, we got monthly recurring revenue, businesses that have strong reoccurring revenue. that, again, that's something I hear about, but is that a fair tenant that they're looking for as well?\r\n\r\n\r\nSteve Wiesner (34:23.894)\r\nYeah, I think a lot of SaaS companies are realizing that, you know, ARR stands for ain't recurring revenue, right? There's a lot of that going on these days. But look, mean, recurring revenue, regardless of whether or not it's an add on or a platform, I that's a wonderful thing that you're going to pay through the nose for. If it's truly going to stand up in diligence, that that revenue is recurring. Obviously, reoccurring is also good, not as good, but\r\n\r\n\r\nIf you're looking at a market where you can go out and consolidate a number of different companies that do have a recurring revenue profile like that, then that's great. That adds to the thesis, certainly.\r\n\r\n\r\nNik (35:00.977)\r\nOkay, those are three good ones. Anything else that you would add to that list? Anything else that you're like, here's a really good follow\r\n\r\n\r\nSteve Wiesner (35:07.67)\r\nLook, I think for me, it's not necessarily about the market. It's about the playbook. And this is what petrifies me when I see people who haven't even closed their first deal yet talking about doing roll ups. There's the people who have done an amazing job at rolling up markets over the years. And again, I always keep going back to like Odyssey backed companies, but know, transdime is a great example in the aerospace and defense side.\r\n\r\n\r\nYou know, United Sites Supply, I think was another one that they had done, which was really good on like the porta potty business. They rolled up the porta potty business. And then they also did something on the scaffolding side. I think that they had such a tremendous playbook that was repeatable, that was battle tested. Everyone knew on day one of close exactly what had to be done and when it had to be done. And there were a few common denominators to those playbooks. Number one was pricing was always a big part of it.\r\n\r\n\r\nNik (35:52.998)\r\nHmm.\r\n\r\n\r\nSteve Wiesner (36:04.332)\r\nright? They would always want to buy businesses where the entrepreneur hadn't increased prices for eight years because they were afraid of jeopardizing the relationship with that, with that customer. And they would go in the day after that, they would close one of these add -on acquisitions and they would say, okay, we're, doubling the price of the product or whatever it may be. And not only did they not get pushback from the buyers at that point in time, often they would say,\r\n\r\n\r\nyou know, I was always wondering why Joe never increased our prices, right? The entrepreneurs negotiate against themselves all the time. And so a big part of their playbook was they would go in and immediately jack up prices and it would almost always stick. So, but having a playbook that will give you a very specific way to tackle the integration, to tackle pricing, to tackle deal announcements, to tackle marketing plans, et cetera.\r\n\r\n\r\nNik (36:36.048)\r\nYeah.\r\n\r\n\r\nSteve Wiesner (37:00.852)\r\nis a critical piece of doing a successful roll up. And so all these people who say, I'm going to go and roll up such and such an industry, they haven't even closed their first deal yet. You have no idea what your playbook is going to be for your first deal, let alone the deal after that, the deal after that and six deals after that. So all the good roll ups will have a bulletproof playbook that can be executed ultimately with their eyes closed.\r\n\r\n\r\nNik (37:21.691)\r\nthink what I'm hearing from you, and if my summary is incorrect, can correct me, is that...\r\n\r\n\r\nRoll -ups have to achieve scale. And if you don't have a playbook, you can call it whatever we want, but if you don't have a playbook to make sure one, the integration works, and then two, post -integration you're growing organically, then just acquiring companies is not the best way for you to approach being a roll -up. Like if your strategy is I'm just gonna acquire companies that's capital intensive, and you,\r\n\r\n\r\nyou aren't necessarily going to reach the potential that you could reach. Because you're focusing on potentially the wrong things, right? You're not necessarily building the core business, but like the things you mentioned pricing coming in and doubling pricing, that's organic integration. I mean, that's not that's not organic, but that's making sure that the pieces that you're purchasing actually fit together and work together post close. So I like that framework like it's less about the industry.\r\n\r\n\r\nIt's more about do you have a playbook where you you have a competitive advantage in the ability to grow organically and integrate those operations? Yeah. Yeah.\r\n\r\n\r\nSteve Wiesner (38:38.008)\r\nYep. And increase prices, ideally, right? That's a critical piece. Yes, I wholeheartedly agree. But but let me be very clear. There's a lot of people who do add ons, but don't actually really integrate. And I've seen that over the years countless, countless times where somebody goes out and buys three different businesses, but never really integrates them. And\r\n\r\n\r\nNik (38:59.803)\r\nAre they add -ons? they like actually the same business just in different geographies or?\r\n\r\n\r\nSteve Wiesner (39:03.436)\r\nNot a whole co exactly. It's not a whole co, but they just don't do the hard lifting of integrating. And, but they still expect to get the multiple arbitrage that you referred to earlier and smart buyers say, NFW, what are you talking about? Hey, congrats on getting these things signed up, but we're the ones who has to that ERP in place. And we're the ones who has to do the CRM and we have, we're the ones who have to streamline the head count and get the rationalize the fleets, whatever. there's\r\n\r\n\r\nThere's a bit of smoke and mirrors sometimes where people try to represent that they've integrated more than they actually have and the good buyers and diligence are going to sniff that out from a model.\r\n\r\n\r\nNik (39:40.603)\r\nYeah, I wondered why would they do that? I don't understand. Why would you buy multiple companies in the same space and not integrate?\r\n\r\n\r\nSteve Wiesner (39:46.574)\r\nNow, because you could say that, I Hibita from 2 million to 4 million, right? And you did kind of, but you haven't done again, the heavy lifting of integration. So it's, it's almost more up to your earlier point, a whole co -model, but it's all within the same industry. And often it's just by capability, right? People either aren't capable of doing the integration or smartly, they recognize how risky it is.\r\n\r\n\r\nNik (40:01.787)\r\nYeah, that's so weird.\r\n\r\n\r\nSteve Wiesner (40:11.414)\r\nSo they would rather not. They would rather leave it for another buyer who's done this with it can do this with their eyes closed, even if they have to leave some multiple on the table.\r\n\r\n\r\nNik (40:19.129)\r\nAll right, I have two rapid fire questions to wrap up. Are you ready?\r\n\r\n\r\nSteve Wiesner (40:24.834)\r\nGive it my shot. I'll give it my best.\r\n\r\n\r\nNik (40:25.883)\r\nBorn ready, born ready. My first question is, what are you obsessed with right now? If you have two hours in your day and you don't have family time scheduled or work scheduled, like what are you obsessed with?\r\n\r\n\r\nSteve Wiesner (40:39.116)\r\nA little boring for people who don't love the training business the way I do, but curriculum. We are doing a massive rework of our curriculum and it is, I I love product. Ultimately, when I was building software, was the same way. Our product is our curriculum and I'm obsessed with it and making it as great as it can possibly be. We measure it. We, we, we have a very data intensive focus on making changes. Yeah. I could geek out over that all day long. I do.\r\n\r\n\r\nNik (41:04.911)\r\nThat's awesome. What advice would you give to your pre -entrepreneurial self?\r\n\r\n\r\nSteve Wiesner (41:13.068)\r\nWell, there really is no pre entrepreneurial self and that I think this has been something that I've kind of, it's been with me as long as I can remember.\r\n\r\n\r\nNik (41:18.083)\r\nOkay, you're pre taking the leap to be entrepreneur self.\r\n\r\n\r\nSteve Wiesner (41:25.644)\r\nBe ready for the extremes. I think it's intellectually easy to hear the arguments for how extreme your life is going to be both positive and negative. Once you take the plunge, hearing about it, being advised about it, being told about it as one thing, living it as another, and you just have to be ready for it. Because the good days are amazing and the bad days are brutal. How would you be prepared? I don't necessarily know that you can prepare apart from just\r\n\r\n\r\nNik (41:45.147)\r\nHow would you be prepared for it?\r\n\r\n\r\nSteve Wiesner (41:55.112)\r\nstealing yourself mentally for the fact that again, a good day can be followed by a bad day. So don't let yourself get too high and don't let yourself get too low. You just got to try to correct. Exactly. You just have to moderate and you you've just got to try to be as even keeled as you can despite the insanity of entrepreneurship because it is insane. It's not for everybody.\r\n\r\n\r\nNik (42:04.985)\r\nAnd a bad day can be followed by an amazing day. Yeah.\r\n\r\n\r\nNik (42:19.141)\r\nYeah, I saw this Tom Hanks clip a while back. I can't even remember exactly what he said, but he was talking about like, hey, you feel like you're the worst today? You feel like you're at the lowest point you've ever been in your life? Guess what? Give it time. And then he's like, you feel like you're on top of the world? You're the smartest guy in the room? You're the most talented? Give it time. You know, you've got to figure out a way to moderate yourself. Otherwise, either you're going to give yourself a heart attack or\r\n\r\n\r\nYou know, drive yourself crazy just dealing with the roller coaster that is entrepreneurship. I agree. That's great advice.\r\n\r\n\r\nSteve Wiesner (42:54.602)\r\nAnd that's the way I would look at it. It's a great ride. It's a lot of fun. It's also hair raising and what little hair I have left is for that very reason. You lose it quick when you make this life.\r\n\r\n\r\nNik (43:05.969)\r\nWell, where's the best place for people to come connect with you?\r\n\r\n\r\nSteve Wiesner (43:11.31)\r\nTwitter's great, X is great. I'm very active on Twitter and probably the right place to find me if you'd like to.\r\n\r\n\r\nNik (43:17.425)\r\nCool, this has been awesome. I appreciate you coming on and I look forward to hearing from you in a year from now when we do deep dive on your business.\r\n\r\n\r\nSteve Wiesner (43:23.798)\r\nLikewise, Nick, really appreciate the opportunity, man. Thank you very much. You too.\r\n\r\n\r\nNik (43:26.011)\r\nYeah. All right. Have a good one.",
  "metadata": {
    "duration": "",
    "date": "2024-12-02",
    "platform_source": "Google Drive"
  }
}