{
  "episode_number": "152",
  "episode_title": "Claude vs. ChatGPT: A Real-World AI Showdown with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:03.887)\r\nAll right, Liz, another slow week in AI. Another just, nothing happened, nothing's going on. Dude, it's like every week something new and crazy happens. Like this week, Grok was already releasing some image editing software. So anybody who's tried to edit an image within ChatDBT or Grok or anywhere, they can't do it. They're like, it's against my protocols. It won't let them do it. Or if you've ever tried to generate an image.\r\n\r\n\r\nLiz (00:09.933)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (00:30.437)\r\nand be like, Hey, I want to add this to my slide deck. The words are spelled wrong and it looks weird and there's weird characters. Well, Grok first came out with their edited imaging and then open AI came out and it's phenomenal.\r\n\r\n\r\nLiz (00:42.68)\r\nYes. Yes.\r\n\r\n\r\nNikolas Hulewsky (00:44.496)\r\nLook\r\n\r\n\r\nLiz (00:46.166)\r\nI mean, this just, so there were, there were sort of like wonky ways that you could get to this outcome, but you had to like be in the weeds and figuring that out, use five different tools. And it's just so easy. It's just so seamless. Like this is a whole new era. And I think people are just realizing like, this is a step function in, in the development. It's just because of how easy it is and how it's built in now to chat GBT, which obviously has massive distribution.\r\n\r\n\r\nNikolas Hulewsky (01:16.785)\r\nSo what did you think when you saw it drop?\r\n\r\n\r\nLiz (01:20.394)\r\nso I was at first I was like, okay. Like there's other tools that have been able to do this. So they're just again, now taking killing startups. And then I started playing with it and I sort of, then it clicked as to how impactful this is because every time chat, GBT rolls things out, like, again, they have such mind share in this space that they're just dominating in that respect. Cause I know people who are like, I'm only going to use chat GBT. So it's like, even if things pop up on Claude and they're better.\r\n\r\n\r\nlike you don't have that switching and people using multiple models. So I think that's huge. And then that sort of was interesting because it also overshadowed Google, which you would think has the best distribution, but really they're crappy at marketing. It's like they're horrible at marketing. It's bizarre. I mean, I sort of get it because, you know, they haven't had to be good at marketing just because of their monopoly. And so it's like these smaller, well, I guess OpenAI isn't really that small anymore, but like,\r\n\r\n\r\nNikolas Hulewsky (01:49.829)\r\nMm-hmm, true.\r\n\r\n\r\nNikolas Hulewsky (02:04.785)\r\nIt's weird. It's weird.\r\n\r\n\r\nLiz (02:18.23)\r\nrelatively speaking, and they're just, they're crushing it. or yeah. Go for it. Yes, of course.\r\n\r\n\r\nNikolas Hulewsky (02:21.585)\r\nCan I show you an example real quick? Okay, so one of the things, it's kind of niche, but whatever. I post a lot. I post a lot to social media. And one of the things that I consistently have a hard time with is how do I get my, call it Twitter posts to look like a LinkedIn post? So I posted this a while ago. I thought,\r\n\r\n\r\nLiz (02:40.92)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (02:49.805)\r\nGreenland for sale, it sounds wild, right? Like it was a fun post. I had fun doing it. And then it had a lot of views. And then I, each subsequent post on the thread was like, Hey, this is how the math works out. And basically what I did is I took the square kilometers, what they sold for adjusted for inflation, what that would mean for Greenland's price per square kilometer today. And so like, this was the first one. This was another comp. I break it down, the buyer, the seller, the size, the price, whatever price per kilometer.\r\n\r\n\r\nGreenland at this price and then it shows you where it is. And I did this five times. And then at the very end of it, I said, my unsophisticated guess is $20 trillion. Like I was messing around and like I got a bunch of engagement, but I've been like thinking, what does this, how does, do I translate this to LinkedIn? And so I went yesterday and I, uploaded the thread and I said, I want you to make this a LinkedIn carousel, which is basically PDF forms.\r\n\r\n\r\nand I'm gonna show you the output. I did not change a thing. This is the first draft iteration of the output it gave me for this. right, so here's, this is it. This is the post, which is, let's see if I can say, click more. That's not gonna show me the full screen.\r\n\r\n\r\nLiz (04:06.798)\r\nmy gosh.\r\n\r\n\r\nthat is actually a really big pain point. like i know people have like tried to build little tools for this but none of them have been all that great. this is awesome.\r\n\r\n\r\nNikolas Hulewsky (04:18.178)\r\nNo, it is. So like if you remember that first one, it's like here, let's break it down. I didn't. There's no edit here. It did this. It generated the picture of Greenland. It generated how I'm calculating this. And then it goes to the next one. Here is the first one. This was the year. This is the buyer, the seller, the size. This is what Greenland would be at this price. And it did it for each one of those. I did have one hiccup because it forgot the Danish West Indies. And then when I asked it to do it again, it gave me this format, which is weird. But then it I did the whole thing.\r\n\r\n\r\nAnd it looks really good, right?\r\n\r\n\r\nLiz (04:47.65)\r\nYou're really good. Everything is an infographic now. Like we're going to be living in the land of infographics.\r\n\r\n\r\nNikolas Hulewsky (04:52.305)\r\nIt's insane. It's insane. My brother-in-law who loves to like start companies and like, I'm gonna create the logo for it. I showed him this last night and he was like, my gosh, I can create any logo I want. it, everything looks professional. It's phenomenal.\r\n\r\n\r\nLiz (05:11.382)\r\nAgreed. I mean, think the other big use case that you're just seeing explored online too is ads. Like that's the obvious, like being able to now scale your ad testing is going to be off the charts because literally I've been seeing people take ads and I took a whole bunch of old ads and I put modern products in and it even figured out like what the product messages should be. I can pull some up too right now. yeah, here.\r\n\r\n\r\nNikolas Hulewsky (05:34.321)\r\nNo way. Really.\r\n\r\n\r\nLiz (05:37.036)\r\nSo like I didn't put in any, like I was trying to see like how lazy on the prompting can I be? And you can be pretty lazy now. You don't need to put much in there for it to pop up here. Let me share my screen.\r\n\r\n\r\nNikolas Hulewsky (05:43.749)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (05:51.857)\r\nDo you think this was the biggest AI story last week or did I like step over something else?\r\n\r\n\r\nLiz (05:56.436)\r\nNo, think this was well, okay. So I think that this was definitely yeah, I think this probably was Because again, it's just the the level of impact that it has that again It's just is making it so simple and so like\r\n\r\n\r\nNikolas Hulewsky (06:00.212)\r\nWe'll get to the others. I was just curious.\r\n\r\n\r\nNikolas Hulewsky (06:11.707)\r\nWell, yeah, like I said, anybody who's ever tried to generate an image on chat, TBT, it's like the spelling's off or it looks funky or it's blurry or whatever. What I just showed you, that was version one. I didn't edit any of those. I didn't ask it to change anything. And it took a while to like get them to generate each one. It's not, it's not a quick generation of the photo, but I think about putting a slide deck together or a company wide presentation or a pitch deck or anything that you want to send out to your.\r\n\r\n\r\nyour team, your staff, any marketing material, any cold email outreach, all of a sudden it looks much more professional and it's done in a way that is conveying it in the way that you want it to be conveyed, right? Like you don't have to all of sudden become a copywriter or a digital designer to make it look good. Like Chat GPT is doing it for you.\r\n\r\n\r\nLiz (06:59.878)\r\n1000%. All right. Sorry. Okay. So basically, yeah. So pretty much like I, yeah, I, I had been wanting to actually do this for a while. Like I had thought it, and then I was like, oh, like the level of iteration for prompting and editing. just was like not.\r\n\r\n\r\nNikolas Hulewsky (07:02.417)\r\nOkay, we're here.\r\n\r\n\r\nI saw you this post. It was so good.\r\n\r\n\r\nNikolas Hulewsky (07:18.863)\r\nSo for people listening and watching, tell me what this is, walk me through what you did.\r\n\r\n\r\nLiz (07:21.762)\r\nOkay. So basically I took this old Bugles cover that was video killed the radio star. And I've been thinking in my head, AI is killing the SaaS star, like entertaining myself here. And so basically what I did was literally just put it into a chat GPT and asked it to basically rephrase that line and then add pros and replace glasses. And it did it.\r\n\r\n\r\nNikolas Hulewsky (07:34.609)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (07:49.937)\r\nDude, that's amazing. so you're looking, here, pull that picture back up. So you're looking at two people, a man and a woman, they have a yellow shirt on with a tie and they have the Apple Vision Pro on their face and it says GPT-40 killed the SaaS star. Why did you include the Vision Pro?\r\n\r\n\r\nLiz (08:06.766)\r\nI just was like, oh, because then the original one of the guys has glasses. So I was like, fun. So there wasn't much thought beyond that. Yeah. And then I just pulled up a whole bunch of like old ads, which of course it's more impactful for new ads, but literally. I found like playing and I just said, you know, choose something and it it's all in text. So basically it went from saying, um,\r\n\r\n\r\nNikolas Hulewsky (08:10.544)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (08:14.629)\r\nDude, that looks so good.\r\n\r\n\r\nNikolas Hulewsky (08:30.161)\r\nWow.\r\n\r\n\r\nLiz (08:31.028)\r\nknow, Tang has the taste we love and all the vitamin C we need. And then it changed it to Chat Chippy Tea has all the answers we love and all the knowledge we need. So it.\r\n\r\n\r\nNikolas Hulewsky (08:38.993)\r\nAnd it rewrote the whole copy on there too. Do the next one. This is I Love Lucy.\r\n\r\n\r\nLiz (08:41.368)\r\nAll of it, all of it. Yep, I Love Lucy with a bath soap. So here it is, Luxe toilet soap in a large bath size. then it now has, here it is. iPhone and. Yeah.\r\n\r\n\r\nNikolas Hulewsky (08:51.811)\r\nAnd then, and she's holding an iPhone. my gosh. It says bat size, but whatever. The prompt will get better. yeah, do Tony the tiger. What is this?\r\n\r\n\r\nLiz (09:01.87)\r\nSo then I took this one from, I don't even, it was, yeah, from Esso Gas. Yeah, it's Esso Gas, I guess. I don't know, they had a tiger at some point filling the tank of a police car. And it's like a really bad photo actually. And then it upgraded it and it included, and I had said, do this for a cyber truck. And it did, it was a cyber truck. It knew to change the gas to an EV. Like I didn't say that in my prompt. Slight, some couple of spelling things that didn't match, but you know, for the most part, this is like,\r\n\r\n\r\nNikolas Hulewsky (09:05.963)\r\nit's not Tony the Tiger.\r\n\r\n\r\nLiz (09:30.69)\r\nyou can fix that pretty easily. So it's impressive.\r\n\r\n\r\nNikolas Hulewsky (09:33.659)\r\nYeah. So I over the last couple of weeks, I've spoken to a bunch of entrepreneurs who are using AI in their business and the recurring theme of the use case for AI is sales and marketing. And so this is, in my mind, this is just a continuation of that theme, right? Like you would be using this for sales and marketing, good ad copy. Maybe you're rebranding. Maybe you have a campaign that you're sending out, but now it just, it can look fantastic. It's awesome.\r\n\r\n\r\nLiz (09:46.466)\r\nYes.\r\n\r\n\r\nLiz (10:00.462)\r\nAbsolutely, absolutely. Like this is super, super exciting.\r\n\r\n\r\nNikolas Hulewsky (10:04.81)\r\nOkay, so what else did OpenAI step over? Google, what happened?\r\n\r\n\r\nLiz (10:09.664)\r\nOkay. Okay. Well, first off, like last week, and I think it's been over a week, so this wasn't exactly in the last seven days, but Claude came out with their 3.7 and no one really talked about a ton of things happening. Like people have been thrilled with like coding really improved and it's been great, but there have been some features that have people haven't been talking about that I like stumbled upon and I was super pumped. And then we'll get into Gemini and what that also means. Cause,\r\n\r\n\r\nNikolas Hulewsky (10:36.849)\r\nOkay.\r\n\r\n\r\nLiz (10:39.392)\r\nOkay, so with Claude, so what I did for this week, I was like, okay, I need to figure out what's all the news. So I went into Grok, put it in, gave me a timeline. Then I said, okay, let's, you we got to spruce this off. It you know, this is good for me to know, but like, can do this. So I put it into Claude and I asked for it to visualize it because what I discovered, and let me pull this up. Exactly.\r\n\r\n\r\nNikolas Hulewsky (11:01.869)\r\nvisualize it. Like what does that mean? How do you like you uploaded an article and said to help me visualize this?\r\n\r\n\r\nLiz (11:07.944)\r\nexactly and let me pull up what happened hold on sorry now have too many\r\n\r\n\r\nNikolas Hulewsky (11:13.819)\r\nThere you go. The magic of editing.\r\n\r\n\r\nLiz (11:21.868)\r\nYeah, sorry, I have to bring these over to them.\r\n\r\n\r\nNikolas Hulewsky (11:23.973)\r\nWhere did you get this idea for visualizing from?\r\n\r\n\r\nLiz (11:26.208)\r\nI like visualizing everything. So I know you're a process guy. I know in your previous biz you've been in process. So process maps. Like if you've ever been at a company that you need to plan something out for what the process is going to look like, like you map it out and you drag and drop and that's it. I hate doing it. I hate doing it. Like I love that. But I hate doing it. So for me, it's like anytime I can replace any kind of visual or design thing, I am thrilled to do so. So let me share.\r\n\r\n\r\nNikolas Hulewsky (11:34.289)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (11:41.573)\r\nYeah, yeah.\r\n\r\n\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (12:00.751)\r\nI love the fact we can share the screen. It's so much better than just like hypothetically talking about this stuff.\r\n\r\n\r\nLiz (12:00.91)\r\nI know.\r\n\r\n\r\nLiz (12:08.184)\r\nShare.\r\n\r\n\r\nLiz (12:14.382)\r\nOkay, so I, literally all I said was turn the timeline into visualization. Again, crappy prompt, but it turned out to make this like beautiful thing. By day, it showed all the different things happening. So this is just like one of the examples. then I, okay. So I have to screenshot it. Unfortunately this, yeah.\r\n\r\n\r\nNikolas Hulewsky (12:33.039)\r\nSo hold on, on, wait, wait, wait, don't go away from it. Can you make it bigger?\r\n\r\n\r\nNikolas Hulewsky (12:39.503)\r\nOkay, that's fine, that's fine. we're looking at a line that's linear. So the top of it says AI timeline, AI news timeline. It's March 19th through the 25th. Walk me through, so there's a line and it has like little bullet points in the line, time points. What do each one of those say?\r\n\r\n\r\nLiz (12:55.726)\r\nYep. Yep. So each bullet point has the date and then under it are just colorful boxes of the new story. Yeah. So everything can be visualized now and you don't need to even like be creative with your prompting or be a prompt master engineer. Like literally you can be lazy and just say like visualize it and it'll figure out how to visualize it. Now of course if you want it specific, you can do that, but.\r\n\r\n\r\nNikolas Hulewsky (13:01.157)\r\nthe date. the news story. That is so freaking cool.\r\n\r\n\r\nNikolas Hulewsky (13:18.66)\r\nYeah.\r\n\r\n\r\nYeah. So, March, March 19th, we've got Minecraft AI benchmarks. We've got Google's notebook LM. March 21st, we've got meta revenue sharing deep seek chat bot. Yeah. I wonder if you could you build this into a dashboard and like send it out every day with links.\r\n\r\n\r\nLiz (13:38.52)\r\nTotally, absolutely. Yeah, hey, I'll build it afterwards and get live for exactly, yeah, actually, actually.\r\n\r\n\r\nNikolas Hulewsky (13:40.517)\r\nSo cool\r\n\r\n\r\nNewsletter!\r\n\r\n\r\nNikolas Hulewsky (13:47.983)\r\nSo how did you look at this and discern like, these were the biggest stories? Does that make sense what I'm saying?\r\n\r\n\r\nLiz (13:52.523)\r\nI didn't, I let AI do it for me. the...\r\n\r\n\r\nNikolas Hulewsky (13:55.237)\r\nWell, how do you but I'm what I'm saying is there's a lot of stories on here. How do you know which one of these is like the biggest story of the week?\r\n\r\n\r\nLiz (13:59.336)\r\nhow I assessed it. So, I I read through them and this is where I actually do use my brain versus AI. And the ones that I thought were interesting, I think are the ones that will have the most impact on the end user. And that's, you you sort of have to think through it. So like they don't actually even have on here Gemini nor on here is...\r\n\r\n\r\nOpen AI is released. So these were actually extra stories that didn't even include those. So, you know, do you have to have some iteration and tweaking on doing that process? But I think these are good, interesting sort of sub stories like Anthropics, Brave Search, like Claude, the big feature they were missing that everyone has done now was internet access that has just like made Claude. I have a huge Claude fan, so I will continue to push that one out there, but they have this and it's just like game changing again.\r\n\r\n\r\nNikolas Hulewsky (14:33.317)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (14:53.041)\r\nI spoke with this woman last week, Abby, and the episode will come out. It was an AI conversation. She's a writer. And she's like, I call Claude my boyfriend because he knows me better than my husband now.\r\n\r\n\r\nLiz (15:04.814)\r\nI actually told my husband the same thing too, that I'm spending more time with Claude than I am with him.\r\n\r\n\r\nSo cute.\r\n\r\n\r\nNikolas Hulewsky (15:13.275)\r\nThat honestly, that has been my conversation with her. She's a writer. and that has been the most probably cause I'm stupid, but the most impactful conversation that I've had. And she didn't share anything about automations. She didn't share anything about code. She's writing. She just said, this is how I'm using Claude. This is how I'm using projects. This is how I write the, the project prompt. This is the, these are the documents that I upload to it. It was so cool and clear.\r\n\r\n\r\nLiz (15:16.971)\r\nhuh.\r\n\r\n\r\nLiz (15:31.118)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (15:41.967)\r\nAnd for me, such an easy use case for anybody who wants to use these AI tools on how to do it. And Claude, the UI on Claude is much better than ChatGBT. Like ChatGBT, you can do those things. You can create projects, but for whatever reason, I just find the UI on Claude to be a lot better for organizing your life.\r\n\r\n\r\nLiz (15:52.536)\r\nThank\r\n\r\n\r\nLiz (15:59.692)\r\nNope. And it somehow, for some reason, like, I don't know what it is, but I just always liked the writing and the outputs. It just, it's different than chat.jpt, but I just think it's better for my purposes. It always seems to just have better outputs. And I agree in like the projects, like I now have, I think over a hundred projects going and you know, at some point you need to have an organization thing, an AI that'll organize it or whatever. But, until then, like, yeah, like creating projects and having your own little spaces has been great.\r\n\r\n\r\nNikolas Hulewsky (16:28.977)\r\nStay on the phone or stay on the line. Something just happened. I'm so excited. 30 seconds.\r\n\r\n\r\nLiz (16:33.216)\r\nOkay. Okay. Okay.\r\n\r\n\r\nNikolas Hulewsky (17:43.195)\r\nbaby just coming here?\r\n\r\n\r\nLiz (17:44.238)\r\nIt was amazing. It was amazing. was like brushing his knee. don't know. I loved it. Highlight of my day.\r\n\r\n\r\nNikolas Hulewsky (17:49.039)\r\nthere that part out hold on hold on my\r\n\r\n\r\nNikolas Hulewsky (17:59.153)\r\nCan you hear me? You can hear me, but I can't hear you.\r\n\r\n\r\nLiz (17:59.822)\r\nMm-hmm.\r\n\r\n\r\nLiz (18:06.849)\r\nsure my mic\r\n\r\n\r\nNikolas Hulewsky (18:13.293)\r\nOkay. Say something.\r\n\r\n\r\nLiz (18:15.982)\r\nHello, testing one, two, three.\r\n\r\n\r\nHello, can hear me? It said...\r\n\r\n\r\nNikolas Hulewsky (18:20.849)\r\nHello. Man, what is happening?\r\n\r\n\r\nNikolas Hulewsky (00:00.106)\r\nOkay, okay, okay. right, so I just got a notification that I got this. I ordered this this week.\r\n\r\n\r\nLiz (00:04.065)\r\nOkay, okay.\r\n\r\n\r\nLiz (00:08.953)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (00:11.96)\r\nDo you have any idea what it is?\r\n\r\n\r\nLiz (00:13.154)\r\nIs this the pendant?\r\n\r\n\r\nOkay, you have to let me know how it goes, because I have like, that's awesome. How much are they? I'm out of curiosity. Like a hundred bucks? Okay. Oh, 400. Okay.\r\n\r\n\r\nNikolas Hulewsky (00:19.97)\r\nYes, I'm so excited for it. It was supposed to come tomorrow, for whatever reason it came today.\r\n\r\n\r\nNikolas Hulewsky (00:29.614)\r\n400 bucks.\r\n\r\n\r\nNot cheap.\r\n\r\n\r\nLiz (00:34.361)\r\nYou have to let me know how this is. Can you, like next week, can we talk about this?\r\n\r\n\r\nNikolas Hulewsky (00:38.132)\r\nAbsolutely. I'm so excited for it. If people haven't seen this. my gosh, I'm so excited to test this out. If people haven't seen this before this little pendant that's wrapped at the moment. But this thing essentially will listen to your conversations 24 seven battery lasts for three days and it will upload them so that you can save them, store them and then access them. I don't know exactly how it works. That's why I want to play around with it.\r\n\r\n\r\nBut think about walking through the day and a thought hits you and you're like, hey, remind me to talk to my mom tomorrow at noon. And then you have an automatic reminder set up because this thing's listening all the time. It's kind of creepy. I get it. But at the same time, I'm so excited to try it out.\r\n\r\n\r\nLiz (01:23.895)\r\nI mean, this is where the world is headed. This is like people have been sort of wanting or trying different iterations of this for like over a decade. And it's like, this is now the time. Like AR, you know, it's this is the time.\r\n\r\n\r\nNikolas Hulewsky (01:34.252)\r\nYeah. Yeah. Well, I was talking, I've been talking to a friend about this and I think that the models are just going to continue to get better. Right now, if I want to ask the model a question and I don't have it trained on my own proprietary data, I have the context window, right? And you can have 120,000 tokens or you can have Google's million tokens, but there's a context window and they're going to get better. They're going to get wider. They can digest more data. It's going to happen. And so at that point,\r\n\r\n\r\nIf you have more data to give it, the model will become better. And so in my mind, I'm like, cool, I'll start recording these conversations. I'll just have a ton of data on me and then it can listen to it and understand what my preferences are, how I communicate, when I communicate, you when I get uncomfortable, what do I say? All of those things. So now it's like, I'm recording this and I've already like Chris, bought one of these and I've already seen him use it and like, actually this meeting, we said this and he goes and pulls the notes and it's sure enough, it's right there. And it just.\r\n\r\n\r\nI'm so freaking excited.\r\n\r\n\r\nLiz (02:33.623)\r\nNo, that is awesome. And that's great too, because now you don't have to be like sneaky and like, I've had to put my phone on with Otter running and you know, people may or may not know and it's like awkward or whatever, but this is, this is up. And I'm actually looking forward, because at some point they'll probably come out with video where you have that. And it'll probably be like glasses format. Because for me as a parent, and I know you are one too, that like capturing moments that you missed and you know, too late to pull out the phone. So for me, like I've been looking forward to like when that happened.\r\n\r\n\r\nNikolas Hulewsky (02:51.496)\r\nwow that went crazy.\r\n\r\n\r\nNikolas Hulewsky (03:01.806)\r\nMmm, that's a really I love that idea. I hadn't even thought of that like five years from now Tell me about that, you know, you have a memory of the way that you interacted with your child Like hey, tell me about that time. I told Royce he was bad at soccer and it's like this is the exact conversation that's gonna be so cool\r\n\r\n\r\nLiz (03:15.235)\r\nExactly.\r\n\r\n\r\nLiz (03:19.033)\r\nAnd the other thing is from a parenting perspective too, I'm always like, I shouldn't have said this or I should have said it better. But then I'm like, don't remember how I said it and whatever. So now that's another sort of sub-use case, obviously. A lot of business people obviously have kids, but I also think always about the parenting use case that they're\r\n\r\n\r\nNikolas Hulewsky (03:34.542)\r\nYeah, I'm a little worried about it because I'm sure my wife will be like, no, I said this, like it's going to be the ultimate authority on who actually said what. Oh my gosh. I'm a little nervous. I'm a little excited because I'm kind of hoping that I have been right most of the time, but I'm also nervous. It's just going to show me how faulty my memory is. Oh, this is going to be so cool.\r\n\r\n\r\nLiz (03:37.279)\r\nI'm sorry.\r\n\r\n\r\nLiz (03:43.961)\r\nWell, yeah.\r\n\r\n\r\nLiz (03:53.357)\r\nWell, the question is going to be who has access to the files. If your wife should go and figure that one out quickly.\r\n\r\n\r\nNikolas Hulewsky (03:57.102)\r\nYeah, yeah. So true.\r\n\r\n\r\nNikolas Hulewsky (04:05.71)\r\nDude, that is so freaking true. Anyway, so I am so excited for this. I'm gonna start wearing it. I'm going to the Holtco conference next week and so I'm gonna have it on the whole time. It's like, that's perfect. Cause I'm gonna be meeting people. I'm gonna be asking them questions. They're gonna be telling me stuff. It's like, do I remember who that it's gonna be perfect for, you met this person at this time. This is the company that they're with. This is what they said. you need to follow up on this item. Like, yeah, I'm beyond excited. I'm such a freaking nerd.\r\n\r\n\r\nLiz (04:14.905)\r\nIt's full.\r\n\r\n\r\nLiz (04:31.683)\r\nand find out if this has an API or if there's a way to connect this data. Cause if you're going to that conference, you're just going to have like content gold for basically like a year, if not more. And so what you can do is if you connect it with even what I'm going to show you today, that you can literally use sort of the, the make scenario we're going to build together and just tweak it and make it so it like creates content out of those conversations. Now, again, I don't know if it has an API, I bet it does.\r\n\r\n\r\nNikolas Hulewsky (04:42.46)\r\nthat's such a idea.\r\n\r\n\r\nLiz (05:00.867)\r\nBut yeah, otherwise like what's the point or like somebody to access the data. I mean, even if it's an audience.\r\n\r\n\r\nNikolas Hulewsky (05:01.006)\r\nI'm sure it does. It has to. What's the point? Well, it's 400 bucks and then you have to pay. There's a free version, which is like, I want to say it's like 50 hours a month. And then there's a $20 a month, which is a hundred hours. And then there's a $30 a month, which is unlimited. So like, there's no way that there's cloud storage and they don't have an API. Yeah, it has to be there. All right. I'm, I'm curious.\r\n\r\n\r\nLiz (05:14.393)\r\nLiz (05:20.078)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (05:29.614)\r\nSo last week we were talking and you like had this whole make automation and you're like, here's the really cool thing. And I'm over here like me caveman mean no understand. So this week he said you would actually show me how make works. And I'm really excited to see how it works. Cause I think there's a lot of use cases for people in their business and most people just don't know how to use it.\r\n\r\n\r\nLiz (05:47.385)\r\nSo before we, here, I'll hop over and while we're doing, while I'm hopping over to this, I think make, so there's a bunch of different tools out there that are similar to make. You probably have heard Zapier that's been around the longest. There's a consumer version called if this, then that, IFTTT. There's NAN, which I would say is a little bit more advanced because the UI is very intimidating. And then there's Lindy, Gumloop and like a\r\n\r\n\r\nNikolas Hulewsky (06:13.006)\r\nMm-hmm.\r\n\r\n\r\nLiz (06:16.793)\r\nA bunch of these are coming out. would say make.com. Exactly. would say make.com is going to be the best one as a, like the gateway drug, because it has like the nicest UI. It's very visual. There's definitely like if we're, could do a different session on comparing all of them and what's good. think Lindy is another really easy to use one. If you're getting started with this, but essentially they're all doing the same.\r\n\r\n\r\nNikolas Hulewsky (06:19.138)\r\nFlow-wise, I found this.\r\n\r\n\r\nLiz (06:43.223)\r\nAnd again, what they're doing is as Nick had mentioned last week, a really good analogy is that this is like the roads connecting different, you know, houses or whatever. So it's basically connecting your different software tools together. So you can take data from one system and pass it along to something else. And then it can do a bunch of things along the way. And so this, would say, gives people, I think the best, again, outcomes\r\n\r\n\r\nan impact for their business because again, in a business, yes, you have these one-off tools, but then it's copy and paste from one thing to the other, export from one tool to next. This allows you to avoid that and actually do a full workflow, complete a full task. And that's, you know, ultimately what it's about. Because if you're just single player, then you still need a human interacting. This can actually remove humans from a process. So before we even dive into building, I just sort of wanted to give people a little bit of a lay of the land here.\r\n\r\n\r\nSo again, this is make.com. When you get in here, you'll have an organization, different people you can add. And then this is sort of the important area. This is called Scenarios. So that's just basically what they're saying is the flow we're gonna build out.\r\n\r\n\r\nNikolas Hulewsky (07:56.674)\r\nOkay, so each automation or flow is called a scenario. Okay.\r\n\r\n\r\nLiz (07:59.417)\r\nExactly. if you're doing, so I'll go back. have like a gazillion going on right now, but like, you know, this is for doing Slack Q &A. This is a scenario. Fine tuning writing with YouTube script.\r\n\r\n\r\nNikolas Hulewsky (08:13.774)\r\nStay on this. on. So this scenario I'm looking at, see ChatGPT, I see what are the other softwares you have?\r\n\r\n\r\nLiz (08:20.909)\r\nSo I have something called the webhook, which we'll get into. That's another just, it's not like an API, but it's just a way you can catch data. So you can send data from basically like the web. can shoot off, say, I want to send this information. And this is the webhook is basically I'm catching the information. And then we have this thing called dumpling AI, which is basically just you'll run into little hiccups in terms of data manipulation. So they have a bunch of little tools.\r\n\r\n\r\nthat you can use to solve those without having to figure it out or figure out do code. And then we have a bunch of chat GBT. And then we have a little tool that's built into make.com that helps you change the data into this format that I sort of alluded to last week called JSON, which again, you don't need to know what that is. Like don't be afraid of it. Technically it's code, but like it's copy and pasting. So if you know how to copy and pull, you'll be able to do this.\r\n\r\n\r\nNikolas Hulewsky (09:13.1)\r\nYeah, so like an example from this workflow would be, hey, I wanna, I'm just making something up. I wanna learn how to fix a light bulb in my house. I go to YouTube and I'm like, this is a long video. I actually wanna look at the transcript so that I can run it through ChatGPT and have ChatGPT like tell me step by step. Okay, well, first you have to download the transcript. How do I do that? Okay, there's a tool for that. I go to that website. I copy and paste the LinkedIn. okay, cool. And then it spits out an output.\r\n\r\n\r\nLiz (09:25.913)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (09:39.694)\r\nAnd then I take that text file and then I take it to ChatGPT and I say, here's a text file, ChatGPT, write a step-by-step process for me with a summary. And then it gives me the step-by-step process with a summary. Okay, save that to a Word document. And then it saves to a Word document. Humans had to do all of those things, but this is automated each one of those steps essentially.\r\n\r\n\r\nLiz (09:57.081)\r\nExactly, Yeah. All right. So the other thing is like the best starting point is all of these tools have these things called templates. So they want you to use the tool and they want to make it easy for you. So there's a lot of things where like you don't even, you still need to hook it up to your data and your specific systems, but they give you a really great way as a starting point. So most of these templates like out of the box, like\r\n\r\n\r\nNikolas Hulewsky (10:11.374)\r\nHmm.\r\n\r\n\r\nLiz (10:24.373)\r\nThey'll be useful, but like you'll always have to tweak things or whatever. Yeah. Yeah. So like you can sync your Facebook ad leads to Google Sheets. The first one, generate. it's a sheet, then a Google, then chat GPT, and then another sheet and it's generate GPT completions and then put it into sheets. So it's a basically say, I have data here, query the data and the sheets, put it into chat GPT for some questions.\r\n\r\n\r\nNikolas Hulewsky (10:28.342)\r\nName a couple of them. want to just... So this one's Facebook to Sheets?\r\n\r\n\r\nNikolas Hulewsky (10:35.52)\r\nOkay, what's the one? What's the first one? Sheets and\r\n\r\n\r\nNikolas Hulewsky (10:47.022)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (10:53.664)\r\nRight, right, What's the Gmail one?\r\n\r\n\r\nLiz (10:54.583)\r\nand then output it. this is great. This is also probably something we should build for people maybe in the next couple of weeks. Send a Gmail from the sheet. So you could have like a lit, you're doing mass emails. This is the way. No more mail managers. You don't need to use MailChimp. Like you can just use this as a way to trigger off sending a bunch of emails.\r\n\r\n\r\nNikolas Hulewsky (11:09.077)\r\nNikolas Hulewsky (11:14.498)\r\nYeah, so if I just wanted to like go and mess around with make, I'd come in here and be like, okay, cool. I have an email list. I'll try to build one of these things. Yeah, cool.\r\n\r\n\r\nLiz (11:22.775)\r\nYeah, yeah. And they make it really simple and just like getting you getting you started with all of this. Then there's again, I won't go through all of these things, but there's just other ways of like when you connect your systems, like they want to make sure it's secure, you'll have to reauthorize and verify. And then you can also manage like web hooks and things again for like security purposes.\r\n\r\n\r\nNikolas Hulewsky (11:28.558)\r\nCool.\r\n\r\n\r\nNikolas Hulewsky (11:44.002)\r\nSo like all of this looks and sounds scary, but when you get in there, you start just familiarizing yourself with how the flow works. Okay.\r\n\r\n\r\nLiz (11:52.473)\r\nAt the end of the day, would say just sit down, stick with it. There's plenty of information on YouTube. There's plenty of information out there. And the other little cool tool that I wanted to just throw out there that we should probably demo separately, but this actually goes to some of the Gemini Studio, Gemini Pro stuff. So they have this cool thing in, this is the ai-studio.google.com, and they have this little area called Stream Real Time.\r\n\r\n\r\nNikolas Hulewsky (12:11.79)\r\nMm.\r\n\r\n\r\nLiz (12:21.323)\r\nYou can literally have it screen shares with what you're doing. So if you get stuck on a make.com scenario and you don't know what to do, it can go in and provide feedback in real time. Yeah. Yeah. So we could, I mean, we could do it right now. I don't know, it takes a little bit of time and whatever. but basically what the point being is like, you have AI tutors, you have AI to support you when you get stuck.\r\n\r\n\r\nNikolas Hulewsky (12:34.286)\r\nShut up. No way.\r\n\r\n\r\nNikolas Hulewsky (12:40.59)\r\nNo, no, no. Let's do it right now.\r\n\r\n\r\nLiz (12:50.323)\r\nthe other thing that I've started doing too, again, because I've been, AI is making me lazy. and so what I'll do is I'll really go into Claude, I'll go into chat GPT or grok, whichever your preferred one that can access the internet and, or access search and ask it, say, I want to build this. Here's the outcome. I want to do it in make op.com. What sh how do I do that? And it'll give you step by step and provide the modules.\r\n\r\n\r\nAnd then you can literally also have it visualize those modules in a process map from Claude, like we just showed. So all of the steps can be taken care for you and you don't have to do a ton of thinking. And this is like within five minutes that you can do that. So, all right. So today we're going to sort of do a version of what I showed last week. we're not going to go into Fireflies just cause I think I want to show people they don't even need to buy another subscription because I hate buying new subscriptions and I'm trying to cancel as many as possible.\r\n\r\n\r\nNikolas Hulewsky (13:33.601)\r\nSo what are you building today?\r\n\r\n\r\nLiz (13:47.289)\r\nUh, exactly. So, um, so I'm going to show if you have Google meets, um, and you can do this with zoom too. Uh, but what Google meet does is like you record your video. So if you're recording it, it basically automatically saves a transcript to a folder. And so what we're going to do is look to the Google drive folder, and then we're going to pull the file from a meeting I've had, and then we're going to summarize that.\r\n\r\n\r\nNikolas Hulewsky (13:47.383)\r\nZBB.\r\n\r\n\r\nLiz (14:16.161)\r\nAnd then also parse that information if we have time to be able to map it to a Google Sheet. So the Google Sheet could literally be your CRM. It could be any of your tools you use for managing information. But the exciting thing again, that we had talked about last week is being able to both A, capture that transcript and then B, be able to actually do something meaningful with that transcript. And then the third piece is being able to then store that information in a way within any sort of existing\r\n\r\n\r\ncollaborative system.\r\n\r\n\r\nNikolas Hulewsky (14:47.022)\r\nonline, what we're doing, we're taking a meeting that's been recorded and generating a summary of that meeting so everyone gets it. Okay, let's see it.\r\n\r\n\r\nLiz (14:53.961)\r\nExactly. All right. So, okay. So what I've done here, there's a little plus sign here. So what I'm going to do is I'm going to do that plus sign and then it pulls up all of these different apps. And so what we're going to do is we know we want Google Drive. So I'm going to go Google Drive, start and we see Google Drive. It then has a bunch of little sub modules that it pulls up.\r\n\r\n\r\nthat includes watch files, watch folders, watch all files. So it basically allows you to do a bunch of different things. You can search, create something. So you can just go through and sort of see all the different things you're able to do with this. And this pretty much, they cover most of the actions or triggers that you want. So, and just to define also the trigger is what starts the workflow or starts the automation. And then you basically have the steps thereafter. So first we always start with trigger.\r\n\r\n\r\nSo the trigger is we're gonna watch files in a folder. All right, so then we have this little timer thing that I just wanted to note. So this allows you to do it based on different time intervals, or you can do it on demand for when you just wanna basically click the button to run and it'll run. So, exactly, so you can do it on a daily basis, set your time, whatever. Okay.\r\n\r\n\r\nNikolas Hulewsky (16:06.67)\r\nAll right, so when the trigger runs.\r\n\r\n\r\nLiz (16:13.357)\r\nSo then once we're in this little module, you're going to add a connection. This might be the scarier part, but once you've done it a couple of times, it's super easy. So there's something called an API again, which is connecting different tools. This is sort of how you do that. But oftentimes, makes it really easy for you. So if you're connected through the authorization, like when you sign in and Google and it says sign in, which we're seeing here, you can literally do that. And when you click this, it'll pop up.\r\n\r\n\r\nand you just sign in as if you're using that on any other tool and it'll connect it. Sometimes you have to actually copy and paste an API key, which again is sort of like the password, but again, you're literally going.\r\n\r\n\r\nNikolas Hulewsky (16:53.422)\r\nBut if you're using the AI as the tutor, like it'll tell you where to get this stuff from. But in this instance, okay, we can just sign into Google.\r\n\r\n\r\nLiz (16:58.265)\r\nin\r\n\r\n\r\nExactly. And so I already have this set up, so I won't recreate a new one. Selected my connection. We're going to say watch files by when it's created time. You can do it when it's modified. That I'm going to do, you can select my drive, shared drive. I'm going to do shared drive on this one. And we're going to just go to the meeting recordings folder and we'll do all of them. You can watch specific type of files. So you can.\r\n\r\n\r\nbasically filter around that. And then I'm right now, there's this thing called limit. This is actually super important, especially when you're testing things, because if you do all of them, this will go and like get all of the recordings and that'll actually eat away at what these things called operations are, which is part of their pricing. So it's basically every time you run, there's like this little number that pops up and that's considered an operation. And so you have pricing tiers that allow you to run certain amounts. So when you're testing things, just make sure you're always putting in a limit.\r\n\r\n\r\nlike one or two just to see a sample. So we'll do two for right now. Okay. And then it's from where do we start? Where are we going to start this? So you can do it from now going in the future. You could do it since a specified date. You can do all. So we're going to do probably in the last week, we'll just pull them up. Or again, you can choose manually. And you can change this too. Okay. So once we've now we're watching the folders, it's really good to actually test each of these modules once you've\r\n\r\n\r\ndone it just to make sure it's running properly. And so if you just right click, you'll then get this little thing that says run this module only. So we won't do this for every single one, but just to see. OK, so we saw that nothing was coming up, and that's probably because of when I did it based on. So we'll just choose a different start, and we'll do all, and then it'll run.\r\n\r\n\r\nNikolas Hulewsky (18:49.654)\r\nAnd so like if you were using Google lab or I can't remember what studio it would be screen sharing with you right now and like would have told you, hey, you forgot to select X, but nuts.\r\n\r\n\r\nLiz (19:00.089)\r\nYes. Okay. So this basically shows, okay, I have data. I can deep dive into this data. It's not really telling me much because it's showing me links to the file. So once it says I'm watching the file, it pulls the links to the file. So then you actually have to download the file. And you probably wouldn't have known that if you're just jumping in here. So again, that's why it's good to start off with either prompting one of the LLMs asking it for...\r\n\r\n\r\nhow you do it so you have a good starting point. Otherwise, you'll just figure out trial by error, or again, you can use the studio to help navigate. So we're gonna download the All right, and we're gonna pass then information from that first little module that says, okay, we want the different, we need the file ID here. And so we're gonna look for from the first one, where was the file ID? Because that's information we need to pass over.\r\n\r\n\r\nAnd sometimes you might not know what that is and sometimes you just have to do trial by error and again You will another way you can do things is once you test it you have these little things up here It looks like a little download icon and it says download the input and download the output so you can\r\n\r\n\r\nNikolas Hulewsky (20:14.094)\r\nSo again, we're trying to get the transcript that was recorded earlier in the day moved over to Chachi Buti to do the summary and then sent out to us. So right now it's like, go look for this file, download it. That's what we're doing. Okay.\r\n\r\n\r\nLiz (20:21.625)\r\nMm-hmm. Yep.\r\n\r\n\r\nLiz (20:32.588)\r\nMm-hmm. Yes. Yes. So if you run into errors, the other little method you can use is download input or download output. You copy and paste it, and you would put it into, one of the LLMs to help you when you run into issues. both. Yeah. Then the third method for besides just prompting, besides doing the input and output of the data.\r\n\r\n\r\nNikolas Hulewsky (20:50.017)\r\nthat's good to know. Okay.\r\n\r\n\r\nLiz (20:57.655)\r\nYou can also export the full Blueprint. This is called a Blueprint, this whole scenario. And so you can actually export it and then upload that file into Cloud or into ChatGBT and then ask for a better assessment. Exactly. All right. So we've watched it. We've now downloaded the file. So now we're going to run this whole scenario. And we're going to run this whole thing because if we just run this module separately, we need to actually put an input.\r\n\r\n\r\nNikolas Hulewsky (21:10.604)\r\nYeah, hey, tell me what I'm doing wrong. Cool.\r\n\r\n\r\nLiz (21:25.879)\r\nand I'm okay using up my operations for right now. So it just ran through, it got a file. And so this pulled a bunch of different files here. And now we see, so we see a one and then we see two. So this provided us two files because again, at the beginning we said we're limiting two files. And so now we have, again, this doesn't look like useful because we don't know what's really in here because of just, that's how the output is.\r\n\r\n\r\nAnd so if you didn't know what to do now, you would know, you would again go and ask chat GBT. But here we're gonna be grabbing, let's see, where is the data? Okay, so there's usually a little data thing. So I know we're gonna end up with an error, but I just wanted to show what that means and looks like. Because if you, the output, the data is like these basically binary, so numbers or I don't know if that was actually binary, but numbers.\r\n\r\n\r\nNikolas Hulewsky (22:21.622)\r\nI have a hard stop in five minutes. I don't know if we have enough time to do the rest. I'm so sorry.\r\n\r\n\r\nLiz (22:23.627)\r\nokay.\r\n\r\n\r\nThat's okay, and I'm talking too much. So let me just add real quick. Do you me to add real quick or do you want to pause it or I can? All right, I'll go quickly. Okay, so that dumpling AI tool we're gonna include here and that's because Let's see. What was it converts?\r\n\r\n\r\nNikolas Hulewsky (22:35.662)\r\nLet's add, let's try to like.\r\n\r\n\r\nLiz (22:52.363)\r\nOkay, so sometimes again, data manipulation is a thing. So let's see if we can do this real.\r\n\r\n\r\nOkay, so.\r\n\r\n\r\nNikolas Hulewsky (23:00.684)\r\nAnd so what are you trying to get right now? You're just trying to get the whole transcript or specific parts of the transcript?\r\n\r\n\r\nLiz (23:04.15)\r\nThe data... No, so I'm still getting the full transcript because the thing is with sometimes the tools when they give you the data, it's not in the format that the next tool can ingest. So this is basically converting it to a format that ChatGPT now will understand. And so right now we have another chat completion here.\r\n\r\n\r\nNikolas Hulewsky (23:18.008)\r\nK, guys.\r\n\r\n\r\nLiz (23:29.585)\r\nand we're gonna always select the model. I've spent a lot of money accidentally on things, so just make sure when you're choosing your model, you know how much it costs, and APIs cost more than when you're just paying your subscription fee. So, okay. So what I just did was in this dumpling AI, I converted it from doc to text.\r\n\r\n\r\nThen in chat GPT, I selected the model, the method. So there's a lot of different methods. You can do it by a chat completion, a message assistant, which again, we can do those a different day. And then I'm passing basically the formatted text from the Google file that has now been converted thanks to dumpling AI into a format that it can understand. So, and then we're going to do a prompt, which we'll just do a quick.\r\n\r\n\r\nprompt here just to see. Okay, so this is the text content and we're going to say, please summarize the key insights. And in a different one we could do just showing how you would actually format and structure it. But let's see what this looks like from just like a simple, simple thing and see if it comes. I don't know if we're going to hit any errors in which case. Okay. Yeah. So we hit an error here.\r\n\r\n\r\nUm, so maybe I need to put the met, ah, okay. Base file. Okay. So this is, there is a little bit of trickiness here. Um, think I need to convert this. Let's see if this works. And then if not, I need to do a little bit of reformatting this. Okay. So I'm going to use help from one of my previous ones to say, Okay. Yeah. Okay.\r\n\r\n\r\nNikolas Hulewsky (24:59.47)\r\nOkay, let's pause here because I need to be continued next time. We'll do it.\r\n\r\n\r\nLiz (25:05.975)\r\nYes. we'll, okay.",
  "metadata": {
    "duration": "",
    "date": "2025-04-16",
    "platform_source": "Google Drive"
  }
}